{
    "id":"Kaggle::techmap::613fb164648da75a09fe76c6::monsterasia_in::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The description contains language and phrases such as \"motley crew of single and married,\" and emphasizes traits like \"solid expertise in fixed income research, technology and partying,\" which can subtly favour male candidates. This can create a perception that the workplace culture is more oriented towards men, potentially discouraging female candidates from applying.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"partying. singing, to dancing, to playing music\" might discourage those from the a more conservative culture from apllying.",
    "verified":true,
    "synthetic":false,
    "text":" US$ 128.3 Trillion, that is the of the Global Bond Market. And if you are interested in exploring a career and becoming an expert in Fixed Income Analysis. If you are keen to focus on Structured Products like Asset Backed Securities, Residential Mortgage Backed Securities, Commercial Mortgage Backed Securities, CLO\/CDO. If you want to learn and work on these securities issued in US, EMEA and, then keep reading! Team I. Peritus  a motley crew of single and married, solid expertize in fixed income research, technology and partying. A lot of talent, from singing, to dancing, to playing music, to solving the rubik cube, to playing games, exploring places and food and enjoying team events to keep each other happy. We have learnt to stay and work together, while during Co. Vid times Working From Home became a normal, we established it as a new normal, looking to our teams returning to workplace about 2-3 days a week, when normalcy returns. Constant Chatter over Slack and Messaging. Sharing work insights, anecdotes, movies, books and gossips. Learning independently, sharing across teams and learning from others. Thats what a typical Team I. Peritus member is. I. Peritus, a leader in Fixed Income Research, is looking for sharp, ambitious and enthusiastic Analysts to join our Structured Finance Desk to work with clients in the US, Europe and India. With over 9000 ABS Bonds researched, issued globally, I. Peritus is a powerhouse in Fixed Income Research. Our weekly Fixed Income update, using data from PIXSTOX, our platform with 16, 000. Indian Bonds, is gaining immense popularity. Our research on AT1 Bonds, Stressed Issuers and other Fixed Income asset categories have been widely circulated. For the past 6. years we have also been working with Moodys Analytics supporting their desks in US and UK for AS. Our ABS research includes Residential Mortgage Backed Securities, Auto ABS, Commercial Mortgage Backed Securities, Receivables Backed Securities, Small & Medium Business Loans backed Securities and the newer Esoteric Bonds. I. Peritus has also been actively propagating Esoteric PTC structured in India. We have also been working with Merchant Bankers to support structuring and issuance of new Indian ABS, Municipal Bonds and Receivable Based Bonds. At I. Peritus we are proud of our Fixed Income competencies, and there are things we feel strongly about, which are.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613fb164648da75a09fe76c6::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"I-Peritus Solutions &amp; Services Private Limited\", \"position\": \"Junior Research Analyst - Fixed Income\", \"notes\": \"\", \"original\": \"<b>US$ 128.3 Trillion, that is the of the Global Bond Market. And if you are interested in exploring a career and becoming an expert in Fixed Income Analysis. If you are keen to focus on Structured Products like Asset Backed Securities, Residential Mortgage Backed Securities, Commercial Mortgage Backed Securities, CLO\/CDO. If you want to learn and work on these securities issued in US, EMEA and, then keep reading!\\r<\/b><br><div><br><\/div><div>Team IPeritus \\u2013 a motley crew of single and married, solid expertize in fixed income research, technology and partying. A lot of talent, from singing, to dancing, to playing music, to solving the rubik cube, to playing games, exploring places and food and enjoying team events to keep each other happy. We have learnt to stay and work together, while during CoVid times Working From Home became a normal, we established it as a new normal, looking to our teams returning to workplace about 2-3 days a week, when normalcy returns. Constant Chatter over Slack and Messaging. Sharing work insights, anecdotes, movies, books and gossips. Learning independently, sharing across teams and learning from others. That\\u2019s what a typical Team IPeritus member is.<br>IPeritus, a leader in Fixed Income Research, is looking for sharp, ambitious and enthusiastic Analysts to join our Structured Finance Desk to work with clients in the US, Europe and India.<br>With over 9000+ ABS Bonds researched, issued globally, IPeritus is a powerhouse in Fixed Income Research. Our weekly Fixed Income update, using data from PIXSTOX, our platform with 16,000+ Indian Bonds, is gaining immense popularity. Our research on AT1 Bonds, Stressed Issuers and other Fixed Income asset categories have been widely circulated. For the past 6+ years we have also been working with Moodys Analytics supporting their desks in US and UK for AS. Our ABS research includes Residential Mortgage Backed Securities, Auto ABS, Commercial Mortgage Backed Securities, Receivables Backed Securities, Small & Medium Business Loans backed Securities and the newer Esoteric Bonds. IPeritus has also been actively propagating Esoteric PTC structured in India. We have also been working with Merchant Bankers to support structuring and issuance of new Indian ABS, Municipal Bonds and Receivable Based Bonds.<br>At IPeritus we are proud of our Fixed Income competencies, and there are things we feel strongly about, which are<br>1.\\tUnderstanding the asset category, as Asset Backed Bond structures are based on the underlying asset category. Analysis of pools, structuring deals and analyzing bond performance require hard work from smart people, in understanding how economies and markets shape consumption, loan performance and how they fit into bond performance<br>2.\\tContinuous Learning because economies undergo changes, regulations get drafted and technology evolves, all changing the way loans are created, pooled and sold as bonds<br>3.\\tEmphasis on Communication, because we have to always interact with people, understanding the structures and conveying insights, simply and effectively<br>4.\\tTeam-work allows collaboration and the results are much better than star performers <\/div><div><br><\/div><div><b>We are looking for Junior Research Analyst to join the IPeritus Fixed Income Team. If you are interested to explore the position, click on https:\/\/bit.ly\/3Ef9saY (The job description on our website).<br><\/b><br>We have described the profile, the perks and the interview\/interaction process on our website.<br>So if the role interests you, send us your resume and let\\u2019s get started!<br><\/div>\"}"
}