{
    "id":"Kaggle::techmap::615c44f7b0aa23063325df1a::snagajob_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"POSITION SUMMARY: This position serves residents by providing information and services. Self-motivated. Outgoing. Detail oriented. Customer service and customer focused individual with excellent interpersonal, communication, and organizational skills including e-mailing, identifying and organizing resources to provide personal service expected by residents. POSITION RESPONSIBILITIES: Identifies and clarifies residents' needs and desires. Answers questions. Gives directions. and instructions. Develops inventories of services. Manages and screens messages. Helps residents establish accounts and schedules access for authorized vendors to provide services within units. Provides services requested by making arrangements and reservations for dining, tours, travel, entertainment, accommodations, rentals gifts, sporting events, transportation, meetings, secretarial services, couriers, communication and mail services, personal. appointments and services, medical services, and similar requests. Reminding residents of schedules. Providing support and assistance. Running errands. Personalizing services. Anticipates services required by ascertaining mood and style of residents, identifying options, developing itineraries. Organizes social events and event planning and arranges services. Improves services by obtaining and evaluating resident observations opinions, and criticisms. Maintains guest privacy and organization reputation by keeping information confidential. Updates job knowledge by participating in educational opportunities, maintaining personal networks. Enhances department and organizational reputation by accepting ownership for accomplishing new and different requests. Exploring opportunities to add value to job accomplishments. Follows safety procedures and maintains a safe work environment. Other duties as required. OPERATING SKILLS, KNOWLEDGE & ABILITIES: Education\/Training: High school diploma or equivalency preferred. Experience\/Knowledge: Five (5) or more years experience in the Hospitality Industry. Effective written and verbal communication skills. Computer literacy: Word, Excel spreadsheets, and e-mail. Multiple language fluency is desirable. Effective written and verbal communication skills. Strong customer service, communication and interpersonal skills required. Special Requirements: Ability to lift 30 – 50 lbs. Work in an upright standing position for long periods of time. Walk and climb stairs. Ability to detect auditory and\/or visual emergency alarms. Communicate, receive and exchange ideas and information by means of the spoken and written word. Ability to quickly and easily navigate the property\/building as required to meet the job functions. Ability to work extended hours and weekends based on project requirement. Ability to respond to emergencies in a timely manner.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615c44f7b0aa23063325df1a::snagajob_us\", \"source\": \"snagajob_us\", \"country\": \"US\", \"company\": \"Firstservice Residential\", \"position\": \"Lead Concierge\", \"notes\": \"\", \"original\": \"<div _ngcontent-sc255=\\\"\\\" class=\\\"job-description\\\">\\n <div _ngcontent-sc255=\\\"\\\">\\n  <div _ngcontent-sc255=\\\"\\\" class=\\\"ng-star-inserted\\\">\\n   POSITION SUMMARY:\\n   <br>\\n   <br>This position serves residents by providing information and services. Self-motivated; outgoing; detail oriented; customer service and customer focused individual with excellent interpersonal, communication, and organizational skills including e-mailing, identifying and organizing resources to provide personal service expected by residents.\\n   <br>\\n   <br>POSITION RESPONSIBILITIES:\\n   <br>\\n   <br>Identifies and clarifies residents' needs and desires; answers questions; gives directions\\n   <br>and instructions; develops inventories of services.\\n   <br>Manages and screens messages.\\n   <br>Helps residents establish accounts and schedules access for authorized vendors to provide services within units.\\n   <br>Provides services requested by making arrangements and reservations for dining, tours, travel, entertainment, accommodations, rentals gifts, sporting events, transportation, meetings, secretarial services, couriers, communication and mail services, personal\\n   <br>appointments and services, medical services, and similar requests; reminding residents of schedules; providing support and assistance; running errands; personalizing services.\\n   <br>Anticipates services required by ascertaining mood and style of residents, identifying options, developing itineraries.\\n   <br>Organizes social events and event planning and arranges services.\\n   <br>Improves services by obtaining and evaluating resident observations opinions, and criticisms.\\n   <br>Maintains guest privacy and organization reputation by keeping information confidential.\\n   <br>Updates job knowledge by participating in educational opportunities, maintaining personal networks.\\n   <br>Enhances department and organizational reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.\\n   <br>Follows safety procedures and maintains a safe work environment.\\n   <br>Other duties as required.\\n   <br>\\n   <br>OPERATING SKILLS, KNOWLEDGE &amp; ABILITIES:\\n   <br>Education\/Training:\\n   <br>High school diploma or equivalency preferred.\\n   <br>Completion of College level courses with concentration in Business or Hospitality is strongly desirable.\\n   <br>\\n   <br>Experience\/Knowledge:\\n   <br>Five (5) or more years experience in the Hospitality Industry.\\n   <br>Effective written and verbal communication skills.\\n   <br>Computer literacy: Word, Excel spreadsheets, and e-mail.\\n   <br>Multiple language fluency is desirable.\\n   <br>Effective written and verbal communication skills.\\n   <br>Strong customer service, communication and interpersonal skills required.\\n   <br>\\n   <br>Special Requirements:\\n   <br>Ability to lift 30 \\u2013 50 lbs.\\n   <br>Work in an upright standing position for long periods of time.\\n   <br>Walk and climb stairs.\\n   <br>Ability to detect auditory and\/or visual emergency alarms.\\n   <br>Communicate, receive and exchange ideas and information by means of the spoken and written word.\\n   <br>Ability to quickly and easily navigate the property\/building as required to meet the job functions.\\n   <br>Ability to work extended hours and weekends based on project requirement.\\n   <br>Ability to respond to emergencies in a timely manner. \\n   <br>\\n   <br>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\\n   <br>\\n   <br>DISCLAIMER: This is not an all-inclusive job description; therefore, management has the right to assign or reassign schedules, duties and responsibilities to this job at any time.\\n   <br>\\n   <br>\\n  <\/div>\\n <\/div>\\n<\/div>\"}"
}