{
    "id":"Kaggle::techmap::619311e0968e83069dfc3b23::simplyhired_ie::12",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Phrases \"Drives ownership mentality\", \"proven leader with strong coaching capabilities\" and \"Drive and develop winning culture\" have masculine leaning connotations.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Main purpose of the role: Deliver growth and profit targets in Ireland. Provide leadership and manage the Ireland sales team. Support the team with closing profitable deals, tenders and customer relationships. Provide a key input into product development and marketing tools to support the Irish market. Responsible for facilities and linking with H&S team to review country risk assessment. Business Responsibilities. Provide leadership and manage the ROI and NI based sales team comprised of Distributor, National, Regional and Territory Account Managers. Deliver growth and profit targets set for Ireland including Brands. Provide on the ground support for sales team members as they develop and grow their portfolios. Collaborate with Marketing to create a compelling value propositions that are. country specific including launch of new innovations. Meet with customers and end users to discuss evolving needs and identify new market opportunities and trends. Maintain key relationships with strategic customers in the country. Manage and hit margin target for Diversey. Deliver the company objectives around price increase. Support with tenders and business proposals. Cultural and Team Development. Drives ownership mentality across the team. Is a proven leader with strong coaching capabilities, focused on developing the team. Establishes and holds employees to clear standards of performance. Creates a sense of participation, engagement and mutual respect. Provides clear objectives and priorities across the team. Drives for diversity and inclusion. Drive and develop winning culture and sales momentum. improvement with the team. Customer Responsibilities. Operates with customer in mind. Encourages initiatives and innovation to drive customer satisfaction. Build strong multilevel customer relationships. Work closely with customers to ensure compliance across their estate to maximise efficiency and control. Identifies areas for growth within customer portfolios. Requirements: At least 5 years sales experience of coaching and managing sales teams successfully. b2b experience. Experience of renegotiating large contracts. Competency in calculations relating to margin, trading terms, and broader sales negotiation variables. Experience of building long term successful customer relationships at all levels. The ability to understand and implement programmes based on customer needs. Forward planning and organisational skills. Highly effective communicator both written and verbal, and at all levels of the organisation. Strong Financial awareness. Strong sales and negotiation skills. Proven leader. Job Types: Full-time, Permanent. Work remotely: Yes.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::619311e0968e83069dfc3b23::simplyhired_ie\", \"source\": \"simplyhired_ie\", \"country\": \"IE\", \"company\": \"Diversey Inc\", \"position\": \"Ireland Country Sales Manager\", \"notes\": \"\", \"original\": \"<p><b>Main purpose of the role: <\/b><\/p><ul><li>Deliver growth and profit targets in Ireland<\/li><\/ul><ul><li>Provide leadership and manage the Ireland sales team<\/li><\/ul><ul><li>Support the team with closing profitable deals, tenders and customer relationships<\/li><\/ul><ul><li>Provide a key input into product development and marketing tools to support the Irish market<\/li><\/ul><ul><li>Responsible for facilities and linking with H&amp;S team to review country risk assessment<\/li><\/ul><p><b>Business Responsibilities<\/b><\/p><ul><li>Provide leadership and manage the ROI and NI based sales team comprised of Distributor, National, Regional and Territory Account Managers.<\/li><\/ul><ul><li>Deliver growth and profit targets set for Ireland including Brands.<\/li><\/ul><ul><li>Provide on the ground support for sales team members as they develop and grow their portfolios.<\/li><\/ul><ul><li>Collaborate with Marketing to create a compelling value propositions that are<\/li><\/ul><ul><li>country specific including launch of new innovations<\/li><\/ul><ul><li>Meet with customers and end users to discuss evolving needs and identify new market opportunities and trends.<\/li><\/ul><ul><li>Maintain key relationships with strategic customers in the country.<\/li><\/ul><ul><li>Manage and hit margin target for Diversey.<\/li><\/ul><ul><li>Deliver the company objectives around price increase.<\/li><\/ul><ul><li>Support with tenders and business proposals.<\/li><\/ul><p><b>Cultural and Team Development<\/b><\/p><ul><li>Drives ownership mentality across the team.<\/li><\/ul><ul><li>Is a proven leader with strong coaching capabilities, focused on developing the team<\/li><\/ul><ul><li>Establishes and holds employees to clear standards of performance<\/li><\/ul><ul><li>Creates a sense of participation, engagement and mutual respect<\/li><\/ul><ul><li>Provides clear objectives and priorities across the team<\/li><\/ul><ul><li>Drives for diversity and inclusion<\/li><\/ul><ul><li>Drive and develop winning culture and sales momentum<\/li><\/ul><ul><li>Acts upon feedback from engagement surveys and develops a plan for<\/li><\/ul><ul><li>improvement with the team<\/li><\/ul><p><b>Customer Responsibilities<\/b><\/p><ul><li>Operates with customer in mind<\/li><\/ul><ul><li>Encourages initiatives and innovation to drive customer satisfaction<\/li><\/ul><ul><li>Build strong multilevel customer relationships<\/li><\/ul><ul><li>Work closely with customers to ensure compliance across their estate to maximise efficiency and control<\/li><\/ul><ul><li>Identifies areas for growth within customer portfolios<\/li><\/ul><p><b>Requirements: <\/b><\/p><ul><li>At least 5 years sales experience of coaching and managing sales teams successfully<\/li><\/ul><ul><li>b2b experience<\/li><\/ul><ul><li>Experience of renegotiating large contracts<\/li><\/ul><ul><li>Competency in calculations relating to margin, trading terms, and broader sales negotiation variables.<\/li><\/ul><ul><li>Experience of building long term successful customer relationships at all levels<\/li><\/ul><ul><li>The ability to understand and implement programmes based on customer needs<\/li><\/ul><ul><li>Forward planning and organisational skills<\/li><\/ul><ul><li>Highly effective communicator both written and verbal, and at all levels of the organisation<\/li><\/ul><ul><li>Strong Financial awareness<\/li><\/ul><ul><li>Strong sales and negotiation skills<\/li><\/ul><ul><li>Proven leader<\/li><\/ul><p>Job Types: Full-time, Permanent<\/p><p>Work remotely:<\/p><ul><li>Yes<\/li><\/ul>\"}"
}