{
    "id":"Kaggle::techmap::614448d1a5224e6280f6e545::careerbuilder_us::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Ecolab, the leading global developer of premium cleaning, sanitizing and maintenance products and services for the hospitality, institutional and industrial markets is seeking a Machine Operator Associate! The. Machine Operator Iposition is responsible for operating a variety of machines such as shear, presses, press brakes, spot welders, drill presses, grinders, buffers, and various hand machines to produce assemble. [Link available when viewing the job] to see our benefits. What’s in it For You: The opportunity to take on some of the world’s most meaningful challenges, helping customers achieve clean water, safe food, abundant energy, and healthy environments. The ability to make an impact and shape your career with a company that is passionate about growth. The support of an organization that believes it is vital to include and engage diverse people, perspectives, and ideas to achieve our best. What You Will Do: Work from blueprints, specifications, and verbal instructions. Ability to start and shutdown the machines daily. Operate the controls, levers, gauges, monitors and\/or gears of the machine. Verify all safety devices are functioning properly. Monitor the quality of parts to ensure that they meet specification. Report any damage or faults with the machine. Perform routine set-ups and operate assigned pieces of equipment. Perform routine grinding and polishing. Perform routine cutting and drilling with a band saw, metal muncher or chop saw, etc. When necessary, to meet company objectives, perform any assigned work for which qualified. Accurately account for quantity and time on computer and complete all necessary paperwork. Wear and use all safety equipment provided and follow all safety procedures. Provide own set of tools. Adhere to all plant procedures. Position Details: Location: Roscoe, IL. Work week and shift: M-Thu. 6am-4pm. Compensation package offered: $17. 50\/ hr. Minimum Qualifications: High School diploma or equivalent. Must have basic math ability. 3 months Ecolab metal shop experience or equivalent work experience in a metal or fabrication shop. Immigrations Sponsorship not available for this opportunity. Physical Demands: Must be able to stand upwards of 10 hours. Must be able to pass a drug screen and physical exam. Preferred Qualifications: Formal technical skills training. Ability to perform shop mathematical calculations. Mechanical aptitude and manual dexterity. Working knowledge of related measuring instruments.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614448d1a5224e6280f6e545::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Ecolab\", \"position\": \"Machine Operator\", \"notes\": \"\", \"original\": \"<p>Ecolab, the leading global developer of premium cleaning, sanitizing and maintenance products and services for the hospitality, institutional and industrial markets is seeking a\\u202fMachine Operator Associate!\\u00a0The <b>Machine Operator I <\/b>position is responsible for operating a variety of machines such as shear, presses, press brakes, spot welders, drill presses, grinders, buffers, and various hand machines to produce assemble.<\/p>\\r\\n<p>[Link available when viewing the job] to see our benefits.<\/p>\\r\\n<p><b>What\\u2019s in it For You:<\/b><\/p><ul><li>The opportunity to take on some of the world\\u2019s most meaningful challenges, helping customers achieve clean water, safe food, abundant energy, and healthy environments<\/li><li>The ability to make an impact and shape your career with a company that is passionate about growth<\/li><li>The support of an organization that believes it is vital to include and engage diverse people, perspectives, and ideas to achieve our best<\/li><\/ul>\\r\\n<p><b>What You Will Do: <\/b><\/p><ul><li>Work from blueprints, specifications, and verbal instructions<\/li><li>Ability to start and shutdown the machines daily<\/li><li>Operate the controls, levers, gauges, monitors and\/or gears of the machine<\/li><li>Verify all safety devices are functioning properly<\/li><li>Monitor the quality of parts to ensure that they meet specification<\/li><li>Report any damage or faults with the machine<\/li><li>Perform routine set-ups and operate assigned pieces of equipment.<\/li><li>Perform routine grinding and polishing<\/li><li>Perform routine cutting and drilling with a band saw, metal muncher or chop saw, etc.<\/li><li>To carry out day to day preventive maintenance on the machinery and oil, grease, clean and refill the machine<\/li><li>When necessary, to meet company objectives, perform any assigned work for which qualified.<\/li><li>Accurately account for quantity and time on computer and complete all necessary paperwork.<\/li><li>Wear and use all safety equipment provided and follow all safety procedures<\/li><li>Provide own set of tools<\/li><li>Adhere to all plant procedures<\/li><\/ul>\\r\\n<p><b>Position Details:<\/b><\/p><ul><li>Location: Roscoe, IL<\/li><li>Work week and shift: M-Thu; 6am-4pm<\/li><li>Compensation package offered: $17.50\/ hr \\u00a0<\/li><\/ul>\\r\\n<p><b>Minimum Qualifications: <\/b><\/p><ul><li>High School diploma or equivalent\\u00a0<\/li><li>Must have basic math ability\\u00a0<\/li><li>3 months Ecolab metal shop experience or equivalent work experience in a metal or fabrication shop<\/li><li>Immigrations Sponsorship not available for this opportunity<\/li><\/ul>\\r\\n<p><b>Physical Demands: <\/b><\/p><ul><li>Must be able to\\u00a0stand upwards of 10 hours\\u00a0<\/li><li>Must be able to pass a drug screen and physical exam\\u00a0<\/li><\/ul>\\r\\n<p><b>Preferred Qualifications: <\/b><\/p><ul><li>Formal technical skills training<\/li><li>Ability to perform shop mathematical calculations<\/li><li>Mechanical aptitude and manual dexterity<\/li><li>Working knowledge of related measuring instruments<\/li><li>Must be able to read blueprints and specifications<\/li><li>Ability to distinguish between various metals<\/li><li>Ability to read and speak English<\/li><li>Good communication and written skills<\/li><\/ul>\\r\\n<p><strong>Our Commitment to Diversity and Inclusion<\/strong><\/p><p>At Ecolab, we believe the best teams are diverse and inclusive, and we are on a journey to create a workplace where every associate can grow and achieve their best. We are committed to fair and equal treatment of associates and applicants. We recruit, hire, promote, transfer and provide opportunities for advancement on the basis of individual qualifications and job performance. In all matters affecting employment, compensation, benefits, working conditions, and opportunities for advancement, we will not discriminate against any associate or applicant for employment because of race, religion, color, creed, national origin, citizenship status, sex, sexual orientation, gender identity and expressions, genetic information, marital status, age, disability, or status as a covered veteran.<\/p><p>In addition, we are committed to furthering the principles of Equal Employment Opportunity (EEO) through Affirmative Action (AA). Our goal is to fully utilize minority, female, disabled and covered veteran individuals at all levels of the workforce. Ecolab is a place where you can grow your career, own your future and impact what matters.<\/p><p>We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles\\u2019 Fair Chance Initiative for Hiring Ordinance and the San Francisco Fair Chance Ordinance.<\/p>&nbsp;\"}"
}