{
    "id":"Kaggle::techmap::61385b114295347e35a06251::monster2_it::1",
    "label_age":true,
    "analysis_age":"The phrase \"iSense is a young, energetic and ambitious\" subtly implies a culture predominantly made up of young employees and a company culture that favours them.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 25 days of paid vacation leave  1\/2 extra day per quarters if you have remained fit and healthy (read: do not report sick). Travel allowance 19 cents \/ kilometer. E-learning portal with (almost) all IT training and education. 50 euros for medical expenses. Salary indicationMedior: 3000.4500 euro per month based on 40 hours a week Senior: 4500.6000 euro per month based on 40 hours a week About iSenseiSense is a young, energetic and ambitious specialist in IT employment services. i. Sense will help you find a job on different levels within organizations, such as operations, business consultancy, and (project)management. We want to help you find a job where you can be successful and above all happy. Working together with i. Sense will bring you:Personal guidance before, during and after your application process. Good understanding of your personal skills through various reports. Relevant preparation for your job interview. Always aware of your application process. Monthly personal contact with a Field Coach. LocatieBergen op Zoom. Op aanvraagPublicatiedatum24.06. 2021Publicatie eindigt24.06. 2022.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61385b114295347e35a06251::monster2_it\", \"source\": \"monster2_it\", \"country\": \"IT\", \"company\": \"iSense\", \"position\": \"PHP Developer @ Bergen op Zoom\", \"notes\": \"\", \"original\": \"2021-06-24iSensePHP Developer PHP Developer ISBO50267NieuwOrganisationFor our client in the South of the Netherlands we are looking for a PHP developer with several years of experience. The organization is the largest web shop in the Benelux in their industry, and aims to become the largest in Europe in the future. An ambitious goal that motivates the employees of the organization on a daily basis to get the best out of it. With hundreds of thousands of packages sent annually and millions of unique visitors per year, the company is the market leader in the Benelux. The attack on Europe has now been launched with branches in England, France, Germany, Italy, Spain and Sweden.Within this dynamic organization a number of core values are high on the list of priorities. Technical innovation, renewal and service orientation are just a few of these! You as a developer are therefore not bound by the current state of affairs, if new technologies are of added value for the organization, the management is always ready to implement them! In addition, a lot of attention is also paid to the employees. Think of fresh fruit at the office, fun staff parties and a game of ping pong during your break. Work hard, play hard!What will you do?Together with your Scrum team you will work on large and professional web applications and modules.You enjoy conducting code reviews and you get energy from sharing your knowledge. But at the same time you like to learn from others and you are a sporty sparring partner. With that same enthusiasm, you closely follow new developments in your field and regularly build a PoC to gain more knowledge. Your personal and innovative insights are also very much appreciated. For example, you contribute ideas about how the organization can professionalize its online activities. In addition, you can spend ten percent of your time on your own projects\/innovations.What are we looking for?You are an experienced PHP developer (minimum of 3 years);Experienced in working with a framework like Laravel or Symphony;You have knowledge of both relational databases and NoSQL databases;knowledge of writing unit tests;You are able to develop via the PSR code standards;A team player, but also able to work independently and being communicative;You are willing to learn the Dutch language.BenefitsHoliday pay 8,33% of gross annual salary;25 days of paid vacation leave + 1\/2 extra day per quarters if you have remained fit and healthy (read: do not report sick);Travel allowance 19 cents \/ kilometer;E-learning portal with (almost) all IT training and education;50 euros for medical expenses.Salary indicationMedior: 3000 - 4500 euro per month based on 40 hours a week Senior: 4500 - 6000 euro per month based on 40 hours a week About iSenseiSense is a young, energetic and ambitious specialist in IT employment services. iSense will help you find a job on different levels within organizations, such as operations, business consultancy, and (project)management. We want to help you find a job where you can be successful and above all happy. Working together with iSense will bring you:Personal guidance before, during and after your application process;Good understanding of your personal skills through various reports;Relevant preparation for your job interview;Always aware of your application process;Monthly personal contact with a Field Coach;LocatieBergen op ZoomOp aanvraagPublicatiedatum24.06.2021Publicatie eindigt24.06.2022\"}"
}