{
    "id":"Kaggle::techmap::614d1e4d7d6b0941fe67b50d::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The physical requirements mentioned in the job description, such as performing repairs, maintenance, and handling equipment, are essential functions necessary to effectively carry out the role's responsibilities and maintain a safe working environment, and therefore do not constitute disability bias.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" EDUCATION AND EXPERIENCE. High school graduate or equivalent. Strong Mechanical & Electrical background. Must have computer skills (Microsoft Office, CMMS, Excel, etc. ). Ability to interpret technical drawings, schematics and OEM manuals. Understand manufacturing processes and manufacturing equipment. Must be familiar with normal shop equipment such as drill press, band saw and portable power tools. Ability to read and interpret precision measuring devices. Must be capable of handling multiple tasks simultaneously. Must pass written and hands-on certification tests. 2-year Technical Degree desired. Job Requirements: Help troubleshoot and repair equipment. Help troubleshoot and repair equipment. Perform repairs on field equipment repairs. Providing high quality repair service on equipment. Perform repair and maintenance tasks. Recognize equipment that need repair. Obtain repair and maintenance instructions. Perform minor or routine maintenance or repair. Replace or repair worn parts. Locate and repair defective parts. Maintain and order repair parts. Diagnose and repair all refrigeration equipment. Provide electrical service and\/or repair to customer units. Perform building repair and maintenance activities. Dismantle equipment\/machines and make proper repair. Discuss repair, maintenance and applications of equipment. Maintain appropriate maintenance and repair logs. Handle routine repair and maintenance of plumbing and electrical systems. Troubleshoot and repair all capital equipment. Disassemble fire protection equipment to repair and maintain systems, and replace or repair defective parts.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d1e4d7d6b0941fe67b50d::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Hiresigma\", \"position\": \"Maintenance Technician\", \"notes\": \"\", \"original\": \"<p><strong> EDUCATION AND EXPERIENCE <\/strong><\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> High school graduate or equivalent<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Strong Mechanical &amp; Electrical background<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Must have computer skills (Microsoft Office, CMMS, Excel, etc.)<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Ability to interpret technical drawings, schematics and OEM manuals.<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Understand manufacturing processes and manufacturing equipment.<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Must be familiar with normal shop equipment such as drill press, band saw and portable power tools.<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Ability to read and interpret precision measuring devices.<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Must be capable of handling multiple tasks simultaneously.<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> Must pass written and hands-on certification tests.<\/p> <p> <span> <span> <span> <\/span> <\/span> <\/span> 2-year Technical Degree desired<\/p><br \/><br \/><b>Job Requirements:<\/b><br \/><ul><li>Help troubleshoot and repair equipment<\/li><li>Help troubleshoot and repair equipment<\/li><li>Perform repairs on field equipment repairs<\/li><li>Providing high quality repair service on equipment<\/li><li>Perform repair and maintenance tasks<\/li><li>Recognize equipment that need repair<\/li><li>Obtain repair and maintenance instructions<\/li><li>Perform minor or routine maintenance or repair<\/li><li>Replace or repair worn parts<\/li><li>Locate and repair defective parts<\/li><li>Maintain and order repair parts<\/li><li>Diagnose and repair all refrigeration equipment<\/li><li>Provide electrical service and\/or repair to customer units<\/li><li>Perform building repair and maintenance activities<\/li><li>Dismantle equipment\/machines and make proper repair<\/li><li>Discuss repair, maintenance and applications of equipment<\/li><li>Maintain appropriate maintenance and repair logs<\/li><li>Handle routine repair and maintenance of plumbing and electrical systems<\/li><li>Troubleshoot and repair all capital equipment<\/li><li>Disassemble fire protection equipment to repair and maintain systems, and replace or repair defective parts<\/li><\/ul><br \/>\"}"
}