{
    "id":"Kaggle::techmap::614490cc106c665c6bafe209::linkedin_ng::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Must be flexible and able to improvise to handle a variety of situations. Ability to effectively supervise, delegate, and train individuals and teams using participatory methodologies. Strong facilitation skills preferred. Ability to work with delicate personnel situations and maintain confidentiality. Ability to maintain close relationships and work with team members from a distance and with limited opportunity for personal interaction. Constant sitting and working at a computer for extended periods of time. Constant face-to-face, electronic, and telephone communication with colleagues and the general public. Willingness and ability to work outside of normal business hours. Ability and willingness to travel both domestically and internationally. Adequate physical condition necessary to travel to project sites in rural areas.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614490cc106c665c6bafe209::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"Heifer International\", \"position\": \"Director of Global Finance Operations - Nigeria\", \"notes\": \"\", \"original\": \"<strong>Description<br><br><\/strong>Heifer International is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability.<br><br><strong>FUNCTION:<br><br><\/strong>Accountable to provide strategic and analytical leadership in the development of a cohesive, financial management function within the Nigeria Regional Office. Developing and upgrading tools and practices to meet the increasing requirements of a highly competitive donor environment. Accountable for the adoption of methods and best practices in financial management and systems development, further strengthening stakeholder confidence in the Heifer Regional Office\\u2019s oversight management functions. Plays a significant role in strengthening core global systems by ensuring proper accounting and reporting of resources by maintaining systems of accountability, processing of accounting information, internal and external financial reporting, cash and bank account maintenance and other financial tasks as assigned in liaison with relevant Heifer departments. Accountable to enhance and protect Heifer\\u2019s organizational value by providing advice and insight in accordance with Heifer\\u2019s internal policies and procedures. The Director of Finance assesses internal controls over key operational and financial activities and reporting and compliance functions.<br><br><strong>ESSENTIAL CHARACTER TRAITS<\/strong>:<br><br>Financial Acumen; Manages complexity; Decision quality; Directs work; Plans and aligns; Optimizes work processes; Ensures accountability; Collaborates; Builds effective teams; Communicates effectively; Organizational savvy; Courage; Instills trust.<br><br><strong>Responsibilities &amp; Deliverables<\/strong><strong>B. May Performan other job related duties as assigned.<br><ul><li> Provide leadership for the Regional team in financial and accounting management (90%).<\/li><li>Perform analytical review of general ledger accounts and reconciling balance sheet accounts, including staff travel advance reconciliations and cash\/bank\/credit card reconciliations.<\/li><li>Ensure regulatory and organizational compliance of accounting transactions within the Regional program office and support global consolidation of financial statements.<\/li><li>Perform analytical review of general ledger accounts and reconciling balance sheet accounts, including staff travel advance reconciliations and cash\/bank\/credit card reconciliations.<\/li><li>Ensure all transactions in the accounting system reconcile to the general ledger and financial reports.<\/li><li>Approve all transactions in the accounting system; coordinate with team members to complete all accounting procedures to produce monthly financial statements in accordance with local GAAP or IFRS<\/li><li>Monitor and\/or prepare accurate and timely reporting, dashboards and other key management deliverables.<\/li><li>Oversee payroll registration including related deductions, benefits, taxes, and other payments to employees and statutory institutions, in accordance with existing government laws and regulations<\/li><li>Oversee registration and maintenance of fixed assets in the accounting system.<\/li><li>Oversee the staff expenditure and reimbursement process.<\/li><li>Ensure an efficient filing and retrieval system is in place for financial and accounting records to ensure completeness, accuracy, and compliance on a weekly basis that is in line with Nigeria laws, regulations, and local GAAP.<\/li><li>Partner with Headquarters in the periodic close, ensuring accurate and timely financial statements for global consolidation.<\/li><li>Facilitate requests related to independent external audits and other agreed-upon procedures providing financial information and follow-up<\/li><li>File and remit taxes and other financial obligations to Nigeria regulatory bodies. Ensure all financial records and statements are in line with Nigeria laws, regulations, and Nigeria GAAP<\/li><li>Guide implementation and institutionalization of Heifer\\u2019s enterprise resource planning (ERP) system, including capturing and sharing of best practices for cross-area replication and support complement ongoing documentation and implementation of industry-standard in accounts management and compliance<\/li><li>Provide Programs with input on key financial aspects of the Regional office.<\/li><li>Coordinate key processes for Regional Office budgeting and forecasting. Preparation and maintenance of accurate and timely periodic budget\/expense reporting, dashboards, and other key deliverables to senior management<br><br><\/li><\/ul>Minimum Requirement<br><\/strong><ul><li>Bachelor\\u2019s degree in Accounting, Management Accounting, Business Administration, or related field, plus ten (10) years of related experience or Master\\u2019s degree in Accounting, Management Accounting, Business Administration or related field, plus eight (8) years of related experience.<br><br><\/li><\/ul><strong>Preferred Requirements: <br><\/strong><ul><li>Experience in a donor-funded international development environment with compliance requirements of the U.S. government and institutional funders for international development, such USAID, EC, IFAD, DFID, mega-foundations and others.<br><br><\/li><\/ul><strong>Most Critical Proficiencies:<br><\/strong><ul><li>Knowledge of the U.S. non-profit and INGO business sector, including compliance requirements of the U.S. government and institutional funders for international development, such USAID, EU, DFID, mega-foundations and others.<\/li><li>Ability to navigate financial and non-financial data gathering and analytics; technically adept with ability to quickly learn and maximize usage of technology and software; strong user of Microsoft Office Suite with advanced skill in MS Excel.<\/li><li>Effective communicator and influencer with the ability to clearly convey complex financial issues in a clear format for non-finance professions, motivating continuous and collaborative improvement.<\/li><li>Proficient in generally accepted accounting and IFRS and practices.<\/li><li>Experience with accounting systems and systems conversions.<br><br><\/li><\/ul><strong>Essential Job Functions and Physical Demands:<br><\/strong><ul><li>Ability to work under pressure, perform multiple tasks and manage consistently competing priorities; comfortable in rapidly changing environment. Must be flexible and able to improvise to handle a variety of situations.<\/li><li>Ability to effectively supervise, delegate, and train individuals and teams using participatory methodologies. Strong facilitation skills preferred.<\/li><li>Ability to work with delicate personnel situations and maintain confidentiality.<\/li><li>Ability to maintain close relationships and work with team members from a distance and with limited opportunity for personal interaction.<\/li><li>Constant sitting and working at a computer for extended periods of time.<\/li><li>Constant face-to-face, electronic, and telephone communication with colleagues and the general public.<\/li><li>Willingness and ability to work outside of normal business hours.<\/li><li>Ability and willingness to travel both domestically and internationally.<\/li><li>Adequate physical condition necessary to travel to project sites in rural areas.<\/li><\/ul>\"}"
}