{
    "id":"Kaggle::techmap::6154402f36058364c1649f05::britishjobs_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Support Workers. 20-37 hours per week. Going to work should be something you approach with energy and enthusiasm each day, yet a lot of people are stuck in jobs that give them little or no satisfaction. And of course, plenty lost their livelihoods during the COVID pandemic and are now looking to start over again. Whatever your circumstance, if you want to feel more valued and to try something new and fulfilling, make the move to Southdown as a Support Worker. Join us and, as well as really good training opportunities and the chance to progress, well also provide a great benefits package. Whats more, as cliched as it sounds, no two days are the same. Theres also a lot of going out and about, exploring the local community, whether its a trip to the cinema or the shops, doctors or dentist or pursuing social activities like bowling etc. Theres always something going on to keep you motivated and busy. As a Support Worker, youll have lots of interactions with clients every day  covering the usual range of human activities and emotions. Some will be routine, some fun, some could be difficult. At Southdown you will acquire the skills to make the best of each situation. Youll also have every opportunity to progress your career, just like many of our staff already have. The real challenge for our Support Workers is to help our clients be fully involved in all aspects of their lives. This means supporting people with daily tasks such as cleaning, cooking and personal care  whatevers needed so they can live as normal a life as possible, despite their physical and learning disabilities. You will help our clients getting around (this could mean in their wheelchair) and you will need good observation skills to pick up on the little things, like a smile or a look because some of our clients cant use words to communicate. Seeing someone actively engaged in their life, making choices and having control, knowing you have had a key role to play to make this possible, is a fantastic feeling and makes the job a rewarding one. The wearing of face masks and Personal Protective Equipment (PPE) is mandatory in this role.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6154402f36058364c1649f05::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Southdown Housing Association\", \"position\": \"Support Workers\", \"notes\": \"\", \"original\": \"Support Workers<br><br>  * 20-37 hours per week<br><br>Going to work should be something you approach with energy and enthusiasm each day, yet a lot of people are stuck in jobs that give them little or no satisfaction. And of course, plenty lost their livelihoods during the COVID pandemic and are now looking to start over again. Whatever your circumstance, if you want to feel more valued and to try something new and fulfilling, make the move to Southdown as a Support Worker.<br><br>Join us and, as well as really good training opportunities and the chance to progress, we&rsquo;ll also provide a great benefits package. What&rsquo;s more, as clich&eacute;d as it sounds, no two days are the same. There&rsquo;s also a lot of going out and about, exploring the local community, whether it&rsquo;s a trip to the cinema or the shops, doctors or dentist or pursuing social activities like bowling etc. There&rsquo;s always something going on to keep you motivated and busy.<br><br>As a Support Worker, you&rsquo;ll have lots of interactions with clients every day &ndash; covering the usual range of human activities and emotions. Some will be routine, some fun, some could be difficult. At Southdown you will acquire the skills to make the best of each situation. You&rsquo;ll also have every opportunity to progress your career, just like many of our staff already have. The real challenge for our Support Workers is to help our clients be fully involved in all aspects of their lives. This means supporting people with daily tasks such as cleaning, cooking and personal care &ndash; whatever&rsquo;s needed so they can live as normal a life as possible, despite their physical and learning disabilities. You will help our clients getting around (this could mean in their wheelchair) and you will need good observation skills to pick up on the little things, like a smile or a look because some of our clients can&rsquo;t use words to communicate. Seeing someone actively engaged in their life, making choices and having control, knowing you have had a key role to play to make this possible, is a fantastic feeling and makes the job a rewarding one.<br><br>The wearing of face masks and Personal Protective Equipment (PPE) is mandatory in this role. In line with Government regulations, all staff working in a Southdown Registered Care Home have to be fully vaccinated against Covid 19 and all staff working in our supported living services are strongly advised to be vaccinated, and may have to be in future. All applicants will be asked about their vaccination status.<br><br>Closing date: 6 October 2021<br><br>Interview date: 14 October 2021<br><br>An Enhanced Check for Regulated Activity will be required for successful applicants &ndash; Southdown pay the cost. Southdown is a not-for-profit organisation that actively promotes diversity &amp; equality of opportunity. We welcome applicants from all sections of the community.<br>\"}"
}