{
    "id":"Kaggle::techmap::61418048a71ddb7305787ac4::seek_au::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" As part of the screening process, candidates will be required to complete a satisfactory National police Check, sign our Safeguarding Children and Young People policy and code of conduct, and where necessary complete a Working with Children Check. Join Plan International Australia and help create justice for children and equality for girls.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61418048a71ddb7305787ac4::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Plan\", \"position\": \"Associate Director Organisational Development and Culture\", \"notes\": \"\", \"original\": \"Do you have significant experience leading transformational cultural change across complex organisations?<br \/> \\u00a0\\u00a0<br \/> Do you have a track record of designing people strategies that foster positive, highly engaged, high performing and joyful workplaces?<br \/> \\u00a0\\u00a0<br \/> Are you passionate and committed to strengthening awareness, capability and compliance in gender equality, inclusion and child safeguarding in the workplace?<br \/> \\u00a0\\u00a0<br \/> We are looking for an Associate Director, Organisational Development and Culture to develop our Organisational Development strategy, manage human resource operations and contribute to making the world a more equal place for girls.<br \/> \\u00a0\\u00a0<br \/> Salary of $135,000-$145,000 plus super and generous salary packaging options.<br \/> \\u00a0\\u00a0<br \/> <strong>What you\\u2019ll be doing:<\/strong><br \/> <strong>\\u00a0<\/strong>\\u00a0<br \/> In this role, you will be:<br \/> <ul> <li>Designing and implementing an organisational development strategy, which fosters a positive, highly engaged, high performing and joyful workplace<\/li> <li>Ensuring performance management is aligned to organisational objectives<\/li> <li>Designing and implementing improvements in the end-to-end human resources polices, systems and frameworks<\/li> <li>Designing and implementing an organisational learning and development approach<\/li> <li>Overseeing organisational development risk management and compliance with a particular focus on staff safety and security, organisational culture and well-being<\/li> <li>Monitoring Award changes and marketplace remuneration and benefits to ensure the organisation maintains its target positioning as a great place to work<\/li> <li>Overseeing the development and implementation of the Diversity, Equity and Inclusion Strategy<\/li> <li>Leading the Organisational Development and Culture team<\/li> <\/ul> <strong>You'll have:<\/strong><br \/> \\u00a0\\u00a0\\u00a0<br \/> An ideal candidate for the role will have:<br \/> <ul> <li>A degree in Human Resources (or equivalent) and\/or relevant experience in senior organisational development\/ human resources leadership<\/li> <li>In-depth experience managing HR risk, compliance and regulation<\/li> <li>Significant experience in building principles based HR frameworks, policies and associated processes that are based on systems thinking, user experience and mission focused<\/li> <li>Experience of developing reporting and monitoring mechanisms to build transparency and drive operational excellence<\/li> <li>Experience in leading transformational change across complex organisations<\/li> <li>Ability to question and challenge the status quo and effectively introduce and gain acceptance for new approaches<\/li> <li>Ability to work using agile methodologies to create continuous improvements<\/li> <li>Ability to bring a strategic lens to the Organisational Development and Culture Team\\u2019s work so that it is able to progress key projects in a proactive way<\/li> <li>Ability to develop, establish and maintain effective working relationships with key stakeholders and build a network of influence that enables effective solutions<\/li> <li>Ability to work on multiple projects at once and to prioritise action and resources accordingly<\/li> <li>Alignment with PIA values and commitment to social impact, feminist leadership and sharing power<\/li> <\/ul> \\u00a0\\u00a0<br \/> <strong>About Plan International Australia<\/strong><br \/> Plan International is a global not-for-profit, working to change the world so that all children can live happy and healthy lives, and so girls in all their diversities can take their rightful place as equals.<br \/> For 80 years we\\u2019ve worked hand-in-hand with local communities, so babies can survive their first 1000 days, so children can learn in safe environments, so girls can strive for work outside the home, so young people can speak up for their rights. We know that girls are the most marginalised by poverty, and for too long have been held back from reaching their full potential. This is why we work with all children to solve poverty but especially girls.<br \/> We have a long history, but our approach is new. We\\u2019re secular, and we view the children, families and local communities we work with as our partners and our equals.<br \/> Possibility. Opportunity. Equality. Partnership. Love. Humanity. This is what we stand for.<br \/> Stand with us. Stand for equality.<br \/><br \/> <strong>How to apply<\/strong><br \/> To be considered for the role, applicants must attach both, an updated CV and a cover letter clearly stating how their skills and experience meet each of the selection criteria, which is listed on the Position Description, available from our website www.plan.org.au<br \/><br \/>For a confidential conversation about this role, please contact Lisa Tricarico on 0412 597 791.<br \/><br \/> Applications must arrive before 27th September 2021<br \/><br \/> <em>Plan International Australia is an equal opportunity employer and is committed to an inclusive workplace culture that embraces and celebrates diversity.\\u00a0 We welcome applications from all sectors of the community because we believe diverse opinions and experiences will enrich our team and best represent our beneficiaries and partners across the globe.\\u00a0\\u00a0 <\/em><br \/> <em>Plan International\\u00a0believes that in a world where children face so many threats of harm, it is our duty to ensure that we, as an organisation, do everything we can to keep children safe. This means that we have particular responsibilities to children that we come into contact with and we must not contribute in any way to harming or placing children at risk.\\u00a0<\/em><br \/> <em>As part of the screening process, candidates will be required to complete a satisfactory National police Check, sign our <\/em><em>Safeguarding Children and Young People policy and code of conduct<\/em><em>, and where necessary complete a Working with Children Check.<\/em><br \/> <em>\\u00a0<\/em>\\u00a0<br \/> <strong><em>Join Plan International Australia and help create justice for children and equality for girls.<\/em><\/strong><br \/> <em>\\u00a0<\/em>\"}"
}