{
    "id":"Kaggle::techmap::6154d8c1f8ebbc3cd2253db0::monster2_es::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The use of \"he\/she\" excludes non-binary individuals and those who do not identify strictly as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 3D Manufacturing Operations. Ops lead. Description -The HPBarcelona site is responsible for the Research and Product Development and Operations ofHP Metal 3DPrinters. We are lookingfor a Manufacturing Operations lead & Mechanical Product Engineer for our new 3D Metal powder processing product. The selected candidate will be part of the 3D Manufacturing Operations (3DMO) team located in Sant Cugat del Valles (Barcelona) reporting to a manager based in Singapore. He\/she will partner with GBU Operations, R&D and NPI Supply. Chaingroups to successfullyintroducenew3Dproducts into world-wideproduction. He\/she will be accountable of the end to end readiness of the program, leading the operations team & partnering teams at GBU Ops, 3DMO SGP, MPA, and DPA, to ensure an integrated program execution workflow. Business objectives to be achieved through this position:New products introduced meeting time to market, cost and quality goals. Intro demand fulfillment through supply chain and manufacturing stability and right capacity set up Service support organization ready to support product introduction at intro time. Product and operations stability goals achieved when product is moved from stabilization to current productKeyResponsibilities & Deliverables. Industrialization : Lead and establish manufacturing processes, quality systems, service processes, test, tools & IT infrastructure at Manufacturing Partner (MPa). Much will be new to this MPa. Team leadership : Lead a small team of operations engineers based in BCN. Active leadership, detecting needs, arising gaps and ensuring efficiency and right focus towards program objectives. Product\/Ops stabilization leadership: Work with GBU Operations team to define\/agree stabilization metrics and goals, identify key areas\/projects in Ops to achieve stability goals. Establish change management processes. Cost Management : Mange project budget & expenses. Understand the design and performance requirements for the products. Manage the testing, qualification, delivery & troubleshooting of your ME subsystems. EducationandExperienceBachelor\/Masters in Mechanical Engineering or related discipline. More than 5 years of experience in Operations, with at least 3 years of experience in some relevant Operations assignment (eg. NPI engineer, CA product lead, procurement engineer)Experience interacting with other functional teams (eg. R&D, planning, procurement)Having gone at least through one complete product development cycle. Skills andCompetenciesStrong Leadership: Build positive, supportive and collaborative relationships, fosters teamwork and mentor individuals. Inspire others, easily gaining buy-in and support. Customer centric: understands customer needs and use them as criteria to decide on his\/her area of responsibility.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6154d8c1f8ebbc3cd2253db0::monster2_es\", \"source\": \"monster2_es\", \"country\": \"ES\", \"company\": \"HP\", \"position\": \"D Manufacturing Operations - Ops lead\", \"notes\": \"\", \"original\": \"3D Manufacturing Operations - Ops lead<b>Description -<\/b>The HPBarcelona site is responsible for the Research and Product Development and Operations ofHP Metal 3DPrinters. We are lookingfor a Manufacturing Operations lead&nbsp; &amp; Mechanical Product&nbsp; Engineer for our new 3D Metal powder processing product.The selected candidate will be part of the 3D Manufacturing Operations (3DMO) team located in Sant Cugat del Vall\\u00e9s (Barcelona) reporting to a manager based in Singapore. He\/she will partner with GBU Operations, R&amp;D and NPI SupplyChaingroups to successfullyintroducenew3Dproducts into world-wideproduction. He\/she will be accountable of the end to end readiness of the program, leading the operations team &amp; partnering teams at GBU Ops, 3DMO SGP, MPA, and DPA, to ensure an integrated program execution workflow.Business objectives to be achieved through this position:New products introduced meeting time to market, cost and quality goalsIntro demand fulfillment through supply chain and manufacturing stability and right capacity set up&nbsp;Service support organization ready to support product introduction at intro timeProduct and operations stability goals achieved when product is moved from stabilization to current product<b>KeyResponsibilities &amp; Deliverables<\/b>Industrialization : Lead and establish manufacturing processes, quality systems, service processes, test, tools &amp; IT infrastructure at Manufacturing Partner (MPa). Much will be new to this MPa.Team leadership : Lead a small team of operations engineers based in BCN. Active leadership, detecting needs, arising gaps and ensuring efficiency and right focus towards program objectives. Product\/Ops stabilization leadership: Work with GBU Operations team to define\/agree stabilization metrics and goals, identify key areas\/projects in Ops to achieve stability goals. Establish change management processes. Cost Management : Mange project budget &amp; expenses. Understand the design and performance requirements for the products. Manage the testing, qualification, delivery &amp; troubleshooting of your ME subsystems.<b>EducationandExperience<\/b>Bachelor\/Masters in Mechanical Engineering or related disciplineMore than 5 years of experience in Operations, with at least 3 years of experience in some relevant Operations assignment (eg. NPI engineer, CA product lead, procurement engineer)Experience interacting with other functional teams (eg. R&amp;D, planning, procurement)Having gone at least through one complete product development cycle<b>Skills andCompetencies<\/b><b>Strong Leadership<\/b>: Build positive, supportive and collaborative relationships, fosters teamwork and mentor individuals. Inspire others, easily gaining buy-in and support.<b>Customer centric<\/b>: understands customer needs and use them as criteria to decide on his\/her area of responsibility. <b>Solid technical background<\/b>: Combination of&nbsp; technical&nbsp; knowledge in some areas (ME\/EW\/FW\/SW) and knowledge of some of main operations key processes (Supply Chain, Manufacturing, Planning, Distribution, Service)<b>Project Management skills<\/b>: Able to orchestrate structured plan to face challenges, deploy cross-organizational implementation plans, timely track progress, identify deviations and proactively take corrective actions.<b>Excellent communication skills<\/b>: ability to convey key message to different stakeholders (Ops, program, upper management), covering organization in geographically dispersed.<b>Network and influence<\/b>: develops a good network that allows him\/her to overcome issues, get faster alignment, combining the ability to influence in relevant decisions out of his\/her control.<b>Change management<\/b>: capacity to detect and adapt to changes in organizations, support and develop plans to make required changes towards higher efficiency.<b>Results and performance driven<\/b>: stretching goals and clear timelines set up, meticulous actions tracking and \\u201ccan do\\u201d attitude to overcome roadblocks.<b>Business sense<\/b>: Understanding of business needs beyond Operations functions, capacity to make recommendations taking into account broad business perspective.<b>Job -<\/b>Engineering<b>Schedule -<\/b>Full time<b>Shift -<\/b>No shift premium (Spain)<b>Travel -<\/b><b>Relocation -<\/b><b>EEO Tagline -&nbsp;<\/b>HP Inc.&nbsp;is EEO F\/M\/Protected Veteran\/ Individual with Disabilities.\"}"
}