{
    "id":"Kaggle::techmap::6157540394a53f7ddb82f757::linkedin_co::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement of \"12 credit hours of college-level Biblical Studies\" and the emphasis on \"spiritual maturity\" and aligning with specific religious beliefs and practices may disadvantage candidates from different religious backgrounds or those without formal religious education, limiting the pool to those with specific theological training.",
    "verified":true,
    "synthetic":false,
    "text":" Assess, manage, and report critical physical, emotional, or spiritual concerns of supervised staff. All other duties as assigned. Check out why people love serving with Samaritans Purse: Qualifications & Experience. Bachelors degree in International Affairs\/Development, Politics or similar field of study. Masters degree in a related field preferred. Minimum of 4 years professional experience required, or a combination of education and experience. Minimum of 2 years prior management and leadership experience strongly preferred. Prior financial management skills (preferred). Excellent communication skills, both verbal and written (in Spanish and English). Experience in cross-cultural team leadership. Able to communicate and interact well with people of different educational, linguistic, cultural and socio-economic backgrounds. Previous experience with WFP, IOM, and USAID funded programming preferred. Spiritual maturity. Able to keep the focus of work on the overall goal of sharing the gospel. Flexible and adaptable, able to work with a diverse team in a pressured environment. Experienced in cross-cultural team leadership. Extensive field humanitarian experience in a management role. Fluency in English & Spanish (required). 12 credit hours of college-level Biblical Studies (required). Job Location: Cucuta, Colombia. Type: Full-Time. Restrictions: Family Accompaniment. Language Requirement: Fluency in English& Spanish (required). Travel Expectations: Approximately 50 days (within Colombia and travel to IHQ). Benefits. Medical, prescription, dental & vision insurance. Flexible Spending Account (FSA). Long-term and Short-term disability insurance. Term Life Insurance. 401 (k) retirement savings plan. 10 paid holidays. 12 vacation days. 10 sick\/personal days. Annual Home Leave. Samaritan's Purse Mission Statement. Samaritan's Purse is a nondenominational evangelical Christian organization providing spiritual and physical aid to hurting people around the world. Since 1970, Samaritan's Purse has helped meet needs of people who are victims of war, poverty, natural disasters, disease, and famine with the purpose of sharing God's love through His Son, Jesus Christ. The organization serves the Church worldwide to promote the Gospel of the Lord Jesus Christ. Samaritan's Purse Statement Of Faith. We believe the Bible to be the inspired, the only infallible, authoritative Word of God. (1 Thessalonians 2:13.2 Timothy 3:15-17). We believe that there is one God, eternally existent in three persons: Father, Son, and Holy Spirit. (Matthew 28:19. John 10:30. Ephesians 4:4-6).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6157540394a53f7ddb82f757::linkedin_co\", \"source\": \"linkedin_co\", \"country\": \"CO\", \"company\": \"Samaritan's Purse\", \"position\": \"Deputy Country Director - Colombia\", \"notes\": \"\", \"original\": \"<strong><u>Job Description<br><br><\/u><\/strong><strong>Get Involved!<br><br><\/strong><strong><u>Overview<br><br><\/u><\/strong>Samaritan\\u2019s Purse is seeking a <strong>bilingual (Spanish\/English)<\/strong> leader to serve as our <strong>Deputy Country Director<\/strong> (DCD) in <strong>Cucuta, Colombia<\/strong>. The DCD will work to support and implement the concepts and strategies created and directed from the Country Director (CD). The DCD will provide general management of all programmatic and logistical operations in Colombia. In coordination with the CD, the DCD will engage in donor and government relations. We are looking for a leader who feels called to use their gifts and talents to support the work of SP Colombia and invest in the spiritual growth of our SP Colombia staff.<br><br><strong> A day in the life of a Deputy Country Director: <br><br><\/strong>At Samaritan\\u2019s Purse, the Gospel really is the center of all we do! We start each day with a time of devotions and spend time praying for each other, our staff and volunteers who serve around the globe.<br><br>In the role of <strong>Deputy Country Director,<\/strong> you will have the opportunity to:<br><ul><li> Maintain your personal relationship with Jesus Christ and be an effective witness for Him <\/li><li> Assist the CD to create, articulate and disseminate a clear vision and strategy for SP Colombia team <\/li><li> Provide leadership, management and strategy for all programmatic aspects of the SP Colombia country office, including possible future donor awards and internal funding <\/li><li> Work with the Program Development Officer, Finance Manager and Program Managers to ensure all grants, awards and internally funded programs are implemented according to SP\\u2019s, Donor\\u2019s and Colombian Government\\u2019s guidelines and regulations; promptly address any programmatic challenges <\/li><li> Supervise and provide accountability and direction as the SP Colombia office operates programs through partners and churches <\/li><li> Improve the systematization and standardization of grants management in accordance with the country level strategy; design, document and implement sector specific strategies, including creating best practice and evaluation guidelines <\/li><li> Monitor humanitarian crisis in Colombia and Venezuela, performing field assessments when necessary, and advise CD of response options; provide timely and relevant reports for CD <\/li><li> Ensure relationship with clusters and other coordination bodies are strong and the profile of SP in such forums is positive and influential <\/li><li> Act as Officer in Charge in the absence of the CD; host VIP trips including media personnel, government officials, dignitaries and IHQ visitors as needed <\/li><li> When needed, represent SP with journalists and media outlets <\/li><li> Be a spiritual leader for the IFS and National Staff; assess, manage, and report critical physical, emotional, or spiritual concerns of supervised staff <\/li><li> All other duties as assigned <br><\/li><\/ul>Check out why people love serving with Samaritan\\u2019s Purse:<br><br><strong><u>Qualifications &amp; Experience<br><\/u><\/strong><ul><li> Bachelor\\u2019s degree in International Affairs\/Development, Politics or similar field of study; Master\\u2019s degree in a related field preferred; Minimum of 4 years professional experience required, or a combination of education and experience <\/li><li> Minimum of 2 years prior management and leadership experience strongly preferred; prior financial management skills (preferred) <\/li><li> Excellent communication skills, both verbal and written (in Spanish and English) <\/li><li> Experience in cross-cultural team leadership; able to communicate and interact well with people of different educational, linguistic, cultural and socio-economic backgrounds <\/li><li> Previous experience with WFP, IOM, and USAID funded programming preferred <\/li><li> Spiritual maturity; Able to keep the focus of work on the overall goal of sharing the gospel <\/li><li> Flexible and adaptable, able to work with a diverse team in a pressured environment <\/li><li> Experienced in cross-cultural team leadership. <\/li><li> Extensive field humanitarian experience in a management role <\/li><li> Fluency in English &amp; Spanish (required) <\/li><li> 12 credit hours of college-level Biblical Studies (required) <br><\/li><\/ul><strong>Job Location:<\/strong> Cucuta, Colombia<br><br><strong>Type:<\/strong> Full-Time<br><br><strong>Restrictions:<\/strong> Family Accompaniment<br><br><strong>Language Requirement: <\/strong>Fluency in <strong>English<\/strong> <strong>&amp; Spanish (required) <br><br><\/strong><strong>Travel Expectations<\/strong>: Approximately 50 days (within Colombia and travel to IHQ)<br><br><strong><u>Benefits<br><\/u><\/strong><ul><li> Medical, prescription, dental &amp; vision insurance <\/li><li> Flexible Spending Account (FSA) <\/li><li> Long-term and Short-term disability insurance <\/li><li> Term Life Insurance <\/li><li> 401 (k) retirement savings plan <\/li><li> 10 paid holidays <\/li><li> 12 vacation days <\/li><li> 10 sick\/personal days <\/li><li> Annual Home Leave <br><\/li><\/ul><strong><u>Samaritan's Purse Mission Statement<br><br><\/u><\/strong>Samaritan's Purse is a nondenominational evangelical Christian organization providing spiritual and physical aid to hurting people around the world. Since 1970, Samaritan's Purse has helped meet needs of people who are victims of war, poverty, natural disasters, disease, and famine with the purpose of sharing God's love through His Son, Jesus Christ. The organization serves the Church worldwide to promote the Gospel of the Lord Jesus Christ.<br><br><strong><u>Samaritan's Purse Statement Of Faith<br><\/u><\/strong><ul><li> We believe the Bible to be the inspired, the only infallible, authoritative Word of God. (1 Thessalonians 2:13; 2 Timothy 3:15-17)<\/li><li> We believe that there is one God, eternally existent in three persons: Father, Son, and Holy Spirit. (Matthew 28:19; John 10:30; Ephesians 4:4-6)<\/li><li> We believe in the deity of the Lord Jesus Christ, in His virgin birth, in His sinless life, in His miracles, in His vicarious and atoning death through His shed blood on the cross, in His bodily resurrection, in His ascension to the right hand of the Father, and in His personal return in power and glory. (Matthew 1:23; John 1:1-4 and 1:29; Acts 1:11 and 2:22-24; Romans 8:34; 1 Corinthians 15:3-4; 2 Corinthians 5:21; Philippians 2:5-11; Hebrews 1:1-4 and 4:15)<\/li><li> We believe that all men everywhere are lost and face the judgment of God, that Jesus Christ is the only way of salvation, and that for the salvation of lost and sinful man, repentance of sin and faith in Jesus Christ results in regeneration by the Holy Spirit. (Luke 24:46-47; John 14:6; Acts 4:12; Romans 3:23; 2 Corinthians 5:10-11; Ephesians 1:7 and 2:8-9; Titus 3:4-7)<\/li><li> We believe in the present ministry of the Holy Spirit, whose indwelling enables the Christian to live a godly life. (John 3:5-8; Acts 1:8 and 4:31; Romans 8:9; 1 Corinthians 2:14; Galatians 5:16-18; Ephesians 6:12; Colossians 2:6-10)<\/li><li> We believe in the resurrection of both the saved and the lost; the saved unto the resurrection of eternal life and the lost unto the resurrection of damnation and eternal punishment. (1 Corinthians 15:51-57; Revelation 20:11-15)<\/li><li> We believe in the spiritual unity of believers in the Lord Jesus Christ and that all true believers are members of His body, the church. (1 Corinthians 12:12, 27; Ephesians 1:22-23)<\/li><li> We believe that the ministry of evangelism and discipleship is a responsibility of all followers of Jesus Christ. (Matthew 28:18-20; Acts 1:8; Romans 10:9-15; 1 Peter 3:15)<\/li><li> We believe God\\u2019s plan for human sexuality is to be expressed only within the context of marriage, that God created man and woman as unique biological persons made to complete each other. God instituted monogamous marriage between male and female as the foundation of the family and the basic structure of human society. For this reason, we believe that marriage is exclusively the union of one genetic male and one genetic female. (Genesis 2:24; Matthew 19:5-6; Mark 10:6-9; Romans 1:26-27; 1 Corinthians 6:9)<\/li><li> We believe that we must dedicate ourselves to prayer, to the service of our Lord, to His authority over our lives, and to the ministry of evangelism. (Matthew 9:35-38; 22:37-39, and 28:18-20; Acts 1:8; Romans 10:9-15 and 12:20-21; Galatians 6:10; Colossians 2:6-10; 1 Peter 3:15)<\/li><li> We believe that human life is sacred from conception to its natural end; and that we must have concern for the physical and spiritual needs of our fellowmen. (Psalm 139:13; Isaiah 49:1; Jeremiah 1:5; Matthew 22:37-39; Romans 12:20-21; Galatians 6:10)<\/li><\/ul>\"}"
}