{
    "id":"Kaggle::techmap::61444a5ca5224e6280f6f803::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The expectation to be \"an example of good health habits\" might introduce a bias towards individuals who are perceived as visibly healthy or fit. This can be discriminatory against those with chronic illnesses, disabilities, or conditions that do not affect their job performance but might not align with commonly held perceptions of \"good health habits.\"",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The expectation to be \"an example of good health habits\" might introduce a bias towards individuals who are perceived as visibly healthy or fit. This can be discriminatory against those with chronic illnesses, disabilities, or conditions that do not affect their job performance but might not align with commonly held perceptions of \"good health habits.\"",
    "verified":true,
    "synthetic":false,
    "text":"Overview. Provides basic respiratory therapy, diagnostics and monitoring to patients of all ages. Qualifications. Education and\/or Other Requirements. Successful completion of an AMA accredited respiratory therapy program. Current registration or eligibility for licensure with the State of Illinois for practice as a Respiratory Care Practitioner. RRT credential awarded by the NBRC. Current CPR card. Qualifications. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and\/or ability required. Must demonstrate competencies in assigned responsibilities. Must be able to communicate verbally and in writing. Environmental Factors. Job duties involve the potential for frequent exposure to blood and body fluids. Physical Demands. The physical demands described are representative of those that must be met by an employee to successfully perform the essential functions of this job. Must be able to walk, stand, stoop, kneel and assist in lifting patients. Able to assist patients and\/or adjust equipment at floor level. Able to reach, change and read IV's 5 feet from the floor unaided. Able to move quickly from place to place on occasion, including from floor to floor in emergency situations. Able to utilize fine motor control in hands for tasks such as medication preparation and administration. Able to hear to take blood pressure and to hear breath, heart and bowel sounds. Must possess visual acuity to meet visual demands in charting and operating equipment. Is expected to be an example of good health habits. Mental Demands. Must be able to work under stress and to adapt to changing conditions. Ability to adhere to strict confidentiality requirements. Note. Reasonable accommodations may be made to assist an otherwise qualified individual in the performance of the job. In order to meet the needs of the Company employees may be assigned other duties, in addition to or in lieu of those described above. Responsibilities. Performs assessment (chest auscultation, need for therapy, ABG results) on assigned patients as ordered by a physician. Demonstrates accurate assessment skills in relation to age of patient. Establishes priorities and plan of care based on assessment. Provides care according to respiratory standards of practice. Documents tolerance to treatments and patient variances. Revises plan of care to achieve optimal patient outcomes. Completes all annual educational requirements. Demonstrates competency in respiratory areas, including assessment, 02 administration, patient ventilators, treatment, medications, etc. Documents care. Completes CQI projects.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61444a5ca5224e6280f6f803::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Memorial Health\", \"position\": \"Registered Respiratory Therapist\", \"notes\": \"\", \"original\": \"<strong>Overview <\/strong><br \/> Provides basic respiratory therapy, diagnostics and monitoring to patients of all ages. <br \/><br \/><strong> Qualifications <\/strong><br \/> <strong>Education and\/or Other Requirements<\/strong> <br \/> <br \/> Successful completion of an AMA accredited respiratory therapy program. Current registration or eligibility for licensure with the State of Illinois for practice as a Respiratory Care Practitioner. RRT credential awarded by the NBRC. Current CPR card. <br \/> <br \/> <strong>Qualifications<\/strong> <br \/> <strong> <\/strong> <br \/> To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and\/or ability required. <br \/><ul><li> Must demonstrate competencies in assigned responsibilities. Must be able to communicate verbally and in writing. <\/li><\/ul> <strong>Environmental Factors<\/strong> <br \/> <br \/> Job duties involve the potential for frequent exposure to blood and body fluids. <br \/> <br \/> <strong>Physical Demands<\/strong> <br \/> <br \/> The physical demands described are representative of those that must be met by an employee to successfully perform the essential functions of this job. <br \/><ul><li> Must be able to walk, stand, stoop, kneel and assist in lifting patients; able to assist patients and\/or adjust equipment at floor level; able to reach, change and read IV's 5 feet from the floor unaided; able to move quickly from place to place on occasion, including from floor to floor in emergency situations; able to utilize fine motor control in hands for tasks such as medication preparation and administration; able to hear to take blood pressure and to hear breath, heart and bowel sounds. Must possess visual acuity to meet visual demands in charting and operating equipment. Is expected to be an example of good health habits. <\/li><\/ul> <strong>Mental Demands<\/strong> <br \/><ul><li> Must be able to work under stress and to adapt to changing conditions. <\/li><li> Ability to adhere to strict confidentiality requirements. <\/li><\/ul> <strong>Note<\/strong> <br \/> <br \/> Reasonable accommodations may be made to assist an otherwise qualified individual in the performance of the job. In order to meet the needs of the Company employees may be assigned other duties, in addition to or in lieu of those described above. <br \/><br \/><strong> Responsibilities <\/strong><br \/> <ul><li> Performs assessment (chest auscultation, need for therapy, ABG results) on assigned patients as ordered by a physician; demonstrates accurate assessment skills in relation to age of patient. <\/li><li> Establishes priorities and plan of care based on assessment. <\/li><li> Provides care according to respiratory standards of practice. <\/li><li> Documents tolerance to treatments and patient variances; revises plan of care to achieve optimal patient outcomes. <\/li><li> Completes all annual educational requirements; demonstrates competency in respiratory areas, including assessment, 02 administration, patient ventilators, treatment, medications, etc. <\/li><li> Documents care; completes CQI projects. <\/li><li> Participates in continuing education and development of department staff by providing inservices and acting as a resource to staff in a specific specialty area of respiratory care (i.e. ventilator management) <\/li><li> Performs other duties as assigned. <\/li><\/ul>&nbsp;\"}"
}