{
    "id":"Kaggle::techmap::614f30c8c7a97071e5dfefdd::linkedin_hk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Duties and Responsibilities. Inspect and report to the Maintenance Surveyor the quality of minor repair works carried out at various locations throughout the HKSAR. Preparation of quality audit reports and other documents. Required to stand-by at depots and attend to the Maintenance Surveyors instruction immediately. Working Hours: 45 hours net per week excluding meal breaks (from 8:00 a. m. to 6:00 p. m. Monday to Friday). The working hours may vary depending upon the operational needs of the Property Services group. May be required to undertake duties outside normal office hours as and when instructed by the Maintenance Surveyor. Qualification and Experience. Certificate in Building Studies from a Hong Kong Polytechnic \/ Polytechnic University or Hong Kong Institute of Vocational Education \/ Technical Institute, or equivalent. And one year of relevant post-qualification working experience. (Builders works). For application, please send full resume with expected salary to 43\/F, Hopewell Centre, 183 Queens Road East, Wanchai, Hong Kong or e-mail to: [email redacted, apply via Company website] (Attn: Ms. Au-Yeung). All data collected will be used for recruitment purpose only and will be destroyed after three months.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f30c8c7a97071e5dfefdd::linkedin_hk\", \"source\": \"linkedin_hk\", \"country\": \"HK\", \"company\": \"Build King Holdings Limited\", \"position\": \"Quality Control Assistant\", \"notes\": \"\", \"original\": \"<u>Duties and Responsibilities<br><\/u><ul><li> Inspect and report to the Maintenance Surveyor the quality of minor repair works carried out at various locations throughout the HKSAR.<\/li><li> Preparation of quality audit reports and other documents.<\/li><li> Required to stand-by at depots and attend to the Maintenance Surveyor\\u2019s instruction immediately.<\/li><li> Working Hours: 45 hours net per week excluding meal breaks (from 8:00 a.m. to 6:00 p.m. - Monday to Friday). The working hours may vary depending upon the operational needs of the Property Services group.<\/li><li> May be required to undertake duties outside normal office hours as and when instructed by the Maintenance Surveyor.<br><\/li><\/ul><u>Qualification and Experience<br><\/u><ul><li> Certificate in Building Studies from a Hong Kong Polytechnic \/ Polytechnic University or Hong Kong Institute of Vocational Education \/ Technical Institute, or equivalent; and one year of relevant post-qualification working experience. (Builder\\u2019s works)<br><\/li><\/ul>For application, please send full resume with expected salary to 43\/F, Hopewell Centre, 183 Queen\\u2019s Road East, Wanchai, Hong Kong or e-mail to: [email redacted, apply via Company website] (Attn: Ms. Au-Yeung)<br><br>All data collected will be used for recruitment purpose only and will be destroyed after three months.\"}"
}