{
    "id":"Kaggle::techmap::6134cbedc668ec50178f0fcd::linkedin_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The repeated use of \"strong\" in descriptions like \"strong mechanical aptitude\" and the 24\/7 working requirement, which automatically excludes those with caregiving responsibilities, could imply a male-oriented workplace and exclude potential candidates, especially women. This could unintentionally signal that the role is less accessible or welcoming to a diverse workforce.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"OBJECTIVE. Responsible for keeping machines, mechanical equipment in repair. Qualifications. High school diploma or general education degree (GED). Strong mechanical aptitude, with ability to use the tools related to the role. Customer service skills. communication skills, strong interpersonal and problem-solving skills. Organized with strong troubleshooting and problem-solving skills. Process oriented and highly motivated with a positive attitude. Ability to read and interpret written information including schematics. Ability to use and navigate through a computer and I-phone. Most vehicles require computers to diagnose repair requirements. Essential Duties & Responsibilities. Perform repair and preventative maintenance on all equipment in district, to include, but not limited to, cranes, trucks, commercial motor vehicles, hydraulic equipment, electronic equipment and other business line specific equipment. Inspecting Equipment, Structures. Inspecting equipment, structures, to identify the cause of mechanical errors or other problems and defects. Perform required repairs in an efficient timeframe to maintain equipment to original. normal operation, to help minimize downtime. Perform preventative maintenance on assigned fleet. Document work performed as required by company via paper and\/or electronically. Occasionally travel to customer location, as needed, to perform maintenance and\/or repair company assets. Perform other duties as assigned by supervisor. Keep work area clean and safe. WORK ENVIRONMENT. Regularly exposed to high, precarious places. Moving mechanical parts. Outside weather conditions. Be able to work in a 24hour 7day a week environment including any Holiday. Toxic or caustic chemicals and risk of radiation. The noise level in the wellsite environment is usually past 80 decibels. PHYSICAL DEMANDS. Frequently required to stand, walk, sit, use hands, fingers. Handle or feel and reach with hands and arms. Frequently required to climb, balance, stoop, kneel, crouch, and crawl. Regularly required to lift and\/or move up to 50 pounds. Occasionally required to assist in lifting and\/or moving 50 pounds or more. Manual dexterity necessary to complete assigned tasks. Show more Show less",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6134cbedc668ec50178f0fcd::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Nine Energy Service\", \"position\": \"Nine Energy Service hiring Mechanic Pleasanton, Texas, United States\", \"notes\": \"\", \"original\": \"<section class=\\\"show-more-less-html\\\" data-max-lines=\\\"5\\\"> \\n <div class=\\\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\\\"> <strong>OBJECTIVE<br><br><\/strong>Responsible for keeping machines, mechanical equipment in repair.\\n  <br>\\n  <br><strong><u>Qualifications<br><\/u><\/strong>\\n  <ul>\\n   <li>High school diploma or general education degree (GED) <\/li>\\n   <li>Strong mechanical aptitude, with ability to use the tools related to the role<\/li>\\n   <li>Customer service skills - communication skills, strong interpersonal and problem-solving skills<\/li>\\n   <li>Organized with strong troubleshooting and problem-solving skills<\/li>\\n   <li>Process oriented and highly motivated with a positive attitude<\/li>\\n   <li>Ability to read and interpret written information including schematics<\/li>\\n   <li>Ability to use and navigate through a computer and I-phone. Most vehicles require computers to diagnose repair requirements<br><\/li>\\n  <\/ul><strong><u>Essential Duties &amp; Responsibilities<br><\/u><\/strong>\\n  <ul>\\n   <li>Perform repair and preventative maintenance on all equipment in district, to include, but not limited to, cranes, trucks, commercial motor vehicles, hydraulic equipment, electronic equipment and other business line specific equipment<\/li>\\n   <li>Inspecting Equipment, Structures - Inspecting equipment, structures, to identify the cause of mechanical errors or other problems and defects<\/li>\\n   <li>Perform required repairs in an efficient timeframe to maintain equipment to original - normal operation, to help minimize downtime<\/li>\\n   <li>Perform preventative maintenance on assigned fleet<\/li>\\n   <li>Document work performed as required by company via paper and\/or electronically<\/li>\\n   <li>Occasionally travel to customer location, as needed, to perform maintenance and\/or repair company assets<\/li>\\n   <li>Perform other duties as assigned by supervisor<\/li>\\n   <li>Keep work area clean and safe<br><\/li>\\n  <\/ul><strong>WORK ENVIRONMENT<br><\/strong>\\n  <ul>\\n   <li>Regularly exposed to high, precarious places; moving mechanical parts; outside weather conditions<\/li>\\n   <li>Be able to work in a 24hour 7day a week environment including any Holiday<\/li>\\n   <li>Occasionally exposed to fumes or airborne particles; toxic or caustic chemicals and risk of radiation<\/li>\\n   <li>The noise level in the wellsite environment is usually past 80 decibels<br><\/li>\\n  <\/ul><strong>PHYSICAL DEMANDS<br><\/strong>\\n  <ul>\\n   <li>Frequently required to stand, walk, sit, use hands, fingers; handle or feel and reach with hands and arms<\/li>\\n   <li>Frequently required to climb, balance, stoop, kneel, crouch, and crawl<\/li>\\n   <li>Regularly required to lift and\/or move up to 50 pounds<\/li>\\n   <li>Occasionally required to assist in lifting and\/or moving 50 pounds or more<\/li>\\n   <li>Manual dexterity necessary to complete assigned tasks<\/li>\\n  <\/ul> \\n <\/div> <button class=\\\"show-more-less-html__button show-more-less-html__button--more\\\" data-tracking-control-name=\\\"public_jobs_show-more-html-btn\\\" aria-label=\\\"Show more, visually expands previously read content above this button\\\" aria-expanded=\\\"false\\\"> Show more \\n  <icon class=\\\"show-more-less-html__button-icon\\\" data-delayed-url=\\\"https:\/\/static-exp1.licdn.com\/sc\/h\/cyolgscd0imw2ldqppkrb84vo\\\"><\/icon> <\/button> <button class=\\\"show-more-less-html__button show-more-less-html__button--less\\\" data-tracking-control-name=\\\"public_jobs_show-less-html-btn\\\" aria-label=\\\"Show less\\\" aria-expanded=\\\"true\\\"> Show less \\n  <icon class=\\\"show-more-less-html__button-icon\\\" data-delayed-url=\\\"https:\/\/static-exp1.licdn.com\/sc\/h\/4chtt12k98xwnba1nimld2oyg\\\"><\/icon> <\/button> \\n<\/section>\"}"
}