{
    "id":"Kaggle::techmap::615059af93c0842553433cb5::linkedin_ng::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Description. We are looking to hire an Internal Auditor. This position will have the overall accountability to support the group internal auditor: -. Ensure the daily, monthly, quarterly and yearly accounts are maintained meticulously at the different units of the group. All related internal audit reports are sent as per target time. Requirements. HND\/ B. Sc. Graduate in Accounts. ICAN MEMBER ONLY with 4 years minimum experienceas an Internal Auditor. Sound internal audit skill with knowledge of accounts and finance. Accounting knowledge and skills. Internal audit skills. Knowledge of local laws say PAYE, NSITF, PENCOM, ITF and other relevant laws. Knowledge of sound MS office (excel, word). Analytical Skills. Presentation skills. Communication & Organizational skills. Negotiation skills. Strong Interpersonal Skills. Special conditions. The candidate must live in OTA and its environs. The candidate must be ready to work from Monday to Friday (as per normal office timings) plus at least half a day on Saturday as and when required. Benefits. Competitive Pay(Gross salary 150, 000 NGN- 170, 000 NGN per month or more based on experience and knowledge with other yearly benefits such as medical, bonus, gratuity and leave allowance upon completion of contract (one \/ two yearly Fixed term renewable contract). Avenues for professional development. Chance to work with an industry leader. Grow with the company. Work life balance. For any queries please contact excelmindsjobs. com.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615059af93c0842553433cb5::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"Excelminds Corporate Services\", \"position\": \"Internal Auditor (ICAN member only)\", \"notes\": \"\", \"original\": \"<p><strong>Job Description<\/strong><\/p><p>We are looking to hire an Internal Auditor. This position will have the overall accountability to support the group internal auditor: -<\/p><ul><li>Ensure the daily, monthly, quarterly and yearly accounts are maintained meticulously at the different units of the group.<\/li><li>All related internal audit reports are sent as per target time.<\/li><\/ul><p><\/p><p><strong>Requirements<\/strong><\/p><ul><li>HND\/ B.Sc. Graduate in <strong>Accounts.<\/strong><\/li><li><strong>ICAN MEMBER ONLY\\u2013 with 4 years minimum experience<\/strong> <strong>as an Internal Auditor.<\/strong><\/li><li><strong>Sound internal audit skill with knowledge of accounts and finance.<\/strong><\/li><li>Accounting knowledge and skills<\/li><li>Internal audit skills.<\/li><li><strong>Knowledge of local laws say PAYE, NSITF, PENCOM, ITF and other relevant laws.<\/strong><\/li><li>Knowledge of sound MS office (excel, word).<\/li><li>Analytical Skills<\/li><li>Presentation skills<\/li><li>Communication &amp; Organizational skills<\/li><li>Negotiation skills<\/li><li>Strong Interpersonal Skills<\/li><\/ul><p><br><\/p><p><strong>Special conditions<\/strong><\/p><p>&nbsp;<\/p><p><strong>The candidate must live in OTA and its environs.<\/strong><\/p><p><strong>The candidate must be ready to work from Monday to Friday (as per normal office timings) plus at least half a day on Saturday as and when required.<\/strong><\/p><p><br><\/p><p><strong>Benefits<\/strong><\/p><ul><li>Competitive Pay(<strong>Gross salary 150,000 NGN- 170,000 NGN per month or more based on experience and knowledge with other yearly benefits such as medical, bonus, gratuity and leave allowance upon completion of contract (one \/ two yearly Fixed term renewable contract<\/strong>).<\/li><li>Avenues for professional development.<\/li><li>Chance to work with an industry leader.<\/li><li>Grow with the company.<\/li><li>Work life balance.<\/li><\/ul><p>&nbsp;<\/p><p>For any queries please contact africavacancy@excelmindsjobs.com<\/p>\"}"
}