{
    "id":"Kaggle::techmap::6156f6d079d30d60d6165f4a::monster2_se::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job description. Do you want to be part of creating history in Swedish Space Industry? In 2023, we plan to launch satellites from Esrange outside Kiruna in the North of Sweden. Now there is a unique opportunity for you to be part of the preparation and operation of the new satellite launcher site and the new rocket motor test capabilities currently under construction. responsibilities. As an Operations Coordinator you will work in close collaboration with our customers and coordinate activities for rocket motor tests, such as planning of hot-fire tests and other hazardous tests conducted at the vertical test stands. The planning includes coordination with other activities at Esrange Space Center and cooperation with the range safety team. You will be the customer point of contact, and in addition to above, also be responsible of providing add-on services, create reports and basis for invoicing in scope of the customer contracts. You will work together with the team and other Operations Coordinators. qualifications. To enjoy the role as Operations Coordinator, you are a team player with good organizational skills and a genuine interest for space activities. You have good knowledge in English and appreciate taking an active role in the team. We believe you have a masters or bachelors degree in a technical field or equivalent experience. Any managerial experience is seen as a benefit. WE OFFER YOU  A unique opportunity to be part of the establishment of Swedens first orbital launch service. An exciting position in a market space with continuous change and big challenges  A workplace characterized by an open atmosphere and proud employees all over the world. Opportunity for personal development. An organized introduction program where you will learn more about our services, customers and SSC. We are professionals in space. Come and join us on our exciting journey into the future! LOCATION We offer a permanent position after 6-months trial period. Daytime 40h\/week. As part of Orbital Launch & Rocket Test Department you will take part in launching and test campaigns which are scheduled outside normal working hours. The position is stationed at our Esrange\/Kiruna. We require that you are an EU citizen and have a Swedish work permit. application. In this recruitment we cooperate with Randstad. Last application date: 2021-10-10. Please apply using your CV and personal letter, we evaluate all applications continuously.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156f6d079d30d60d6165f4a::monster2_se\", \"source\": \"monster2_se\", \"country\": \"SE\", \"company\": \"Randstad\", \"position\": \"Operations coordinator\", \"notes\": \"\", \"original\": \"job description.  Do you want to be part of creating history in Swedish Space Industry? In 2023, we plan to launch satellites from Esrange outside Kiruna in the North of Sweden. Now there is a unique opportunity for you to be part of the preparation and operation of the new satellite launcher site and the new rocket motor test capabilities currently under construction.  responsibilities.  As an Operations Coordinator you will work in close collaboration with our customers and coordinate activities for rocket motor tests, such as planning of hot-fire tests and other hazardous tests conducted at the vertical test stands. The planning includes coordination with other activities at Esrange Space Center and cooperation with the range safety team. You will be the customer point of contact, and in addition to above, also be responsible of providing add-on services, create reports and basis for invoicing in scope of the customer contracts. You will work together with the team and other Operations Coordinators.  qualifications.  To enjoy the role as Operations Coordinator, you are a team player with good organizational skills and a genuine interest for space activities. You have good knowledge in English and appreciate taking an active role in the team. We believe you have a master\\u2019s or bachelor\\u2019s degree in a technical field or equivalent experience. Any managerial experience is seen as a benefit.  WE OFFER YOU  \\u2022 A unique opportunity to be part of the establishment of Sweden\\u2019s first orbital launch service  \\u2022 An exciting position in a market space with continuous change and big challenges  \\u2022 A workplace characterized by an open atmosphere and proud employees all over the world  \\u2022 Opportunity for personal development  \\u2022 An organized introduction program where you will learn more about our services, customers and SSC  \\u2022 We are professionals in space; come and join us on our exciting journey into the future!  LOCATION  We offer a permanent position after 6-months trial period. Daytime 40h\/week. As part of Orbital Launch &amp; Rocket Test Department you will take part in launching and test campaigns which are scheduled outside normal working hours. The position is stationed at our Esrange\/Kiruna. We require that you are an EU citizen and have a Swedish work permit.  application.  In this recruitment we cooperate with Randstad. Last application date: 2021-10-10.  Please apply using your CV and personal letter, we evaluate all applications continuously. For more information about this position, please contact:  Carina Fors, Branch Manager Randstad  Phone: +4672-5403866. Email: carina.fors@randstad.seabout SSC Esrange Space Center. SSC is a leading global provider of advanced space services with more than fifty years of experience. Since our start pioneering scientific rocket launches in northen Sweden, we have grown into a renowned, full-service supplier of state-of-the-art space engineering, satellite and launch services to commercial and institutional customers worldwide. https:\/\/www.sscspace.com\"}"
}