{
    "id":"Kaggle::techmap::6132ba0f8fe60a2ddb355c9d::headhunter_kz::0",
    "label_age":true,
    "analysis_age":"\"be graduate of 2019-2020\" is explicit age bias",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  . ,  . What we do: Our well-balanced team of experts has the best practices in the field of financial management and treasury services. Qualification of our experts is confirmed by international certificates in the field of financial management, such as ACCA, CMA, CFA, PMP, CTP, PRM and others. Our KPMG Digital CFO Group has practical experience of the services that are aimed on improvement and implementation of best practices in the field of: Cost accounting and cost allocation. Financial risk management. Treasury management. Financial planning, budgeting and enterprise performance management. Responsibilities: Preparation of project management documentation and related presentations (weekly, bi-weekly, quarterly status reports, minutes of the meetings and test protocols),. Provision of communication, interaction with team (invitation, confirmation),. Analysis of risks, monitoring the implementation of deadlines and budgets,. Monitoring of quality control and achievement of project results,. Translation of required documentation,. Archiving and distributing related materials (collection of working materials including procedures and policies). Requirements: University degree (be graduate of 2019-2020) IT Major or Minor is plus. Fluent English and Kazakh. Strong analytical skills and logical thinking. Ability to work under tight deadlines and multitask. Excellent computer skills (MS Word, MS Excel, MS PowerPoint). Ability to work full-time. What we offer: Paid internship. Further employment, upon successful completion of the internship.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6132ba0f8fe60a2ddb355c9d::headhunter_kz\", \"source\": \"headhunter_kz\", \"country\": \"KZ\", \"company\": \"KPMG\", \"position\": \"Intern, Digital CFO\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u043d\\u0435 \\u0442\\u0440\\u0435\\u0431\\u0443\\u0435\\u0442\\u0441\\u044f<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u0421\\u0442\\u0430\\u0436\\u0438\\u0440\\u043e\\u0432\\u043a\\u0430<!-- -->, <span>\\u043f\\u043e\\u043b\\u043d\\u044b\\u0439 \\u0434\\u0435\\u043d\\u044c<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <p><strong>What we do:<\/strong><\/p> \\n  <p>Our well-balanced team of experts has the best practices in the field of financial management and treasury services. Qualification of our experts is confirmed by international certificates in the field of financial management, such as ACCA, CMA, CFA, PMP, CTP, PRM and others. Our <strong>KPMG Digital CFO Group<\/strong> has practical experience of the services that are aimed on improvement and implementation of best practices in the field of:<\/p> \\n  <ul> \\n   <li>Cost accounting and cost allocation;<\/li> \\n   <li>Financial risk management;<\/li> \\n   <li>Treasury management;<\/li> \\n   <li>Financial planning, budgeting and enterprise performance management.<\/li> \\n  <\/ul> \\n  <p> <\/p> \\n  <p><strong>Responsibilities<\/strong><strong>:<\/strong><\/p> \\n  <ul> \\n   <li>Preparation of project management documentation and related presentations (weekly, bi-weekly, quarterly status reports, minutes of the meetings and test protocols),<\/li> \\n   <li>Provision of communication, interaction with team (invitation, confirmation),<\/li> \\n   <li>Analysis of risks, monitoring the implementation of deadlines and budgets,<\/li> \\n   <li>Monitoring of quality control and achievement of project results,<\/li> \\n   <li>Translation of required documentation,<\/li> \\n   <li>Archiving and distributing related materials (collection of working materials including procedures and policies).<\/li> \\n  <\/ul> \\n  <p> <\/p> \\n  <p><strong>Requirements:<\/strong><\/p> \\n  <ul> \\n   <li>University degree (be graduate of 2019-2020) IT Major or Minor is plus;<\/li> \\n   <li>Fluent English and Kazakh;<\/li> \\n   <li>Strong analytical skills and logical thinking;<\/li> \\n   <li>Ability to work under tight deadlines and multitask;<\/li> \\n   <li>Excellent computer skills (MS Word, MS Excel, MS PowerPoint);<\/li> \\n   <li>Ability to work full-time.<\/li> \\n  <\/ul> \\n  <p> <\/p> \\n  <p><strong>What we offer:<\/strong><\/p> \\n  <ul> \\n   <li>Paid internship;<\/li> \\n   <li>Further employment, upon successful completion of the internship.<\/li> \\n  <\/ul>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\"}"
}