{
    "id":"Kaggle::techmap::6155bc30d198905e9e613fdc::monster_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Essential Functions \/ Key Responsibilities. Cleaning and servicing of aircraft interiors, including cabin, cockpit, galleys, and lavatories. Helps prepare the cabin for Customer boarding and departure, which can include cleaning of seats, seat pockets, floor, galleys, and lavatories. Checking, handling, assembling, removing, and installing passenger service cabin furnishings and supplies according to list specifications and cleaning must be highly detailed and specific to ensure all areas are completely free of dirt, debris, marks, fingerprints, etc. Performs other related duties as assigned within the appropriate skill and experience capabilities expected for this position. Basic Qualifications. Pre-requisites: Must be a local (in-state) resident. Ability to pass a pre-employment drug screen. Ability to pass up to a 10-year background check. Must be at least 18 years of age. Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986. Must complete SIDA training to obtain airport authority identification security. Experience: No prior experience necessary. Must be open minded and ready to work as part of a detail-oriented team. Knowledge, Skills & Abilities: Excellent customer service skills. Strong work ethic. Ability to work in a team oriented environment. Preferred Qualifications. Education: High School diploma or GED. Experience: 1. year of relevant experience. Knowledge, Skills & Abilities: Able to communicate information and instructions verbally and\/or via radio equipment. Able to communicate effectively in a professional manner. Working Conditions. Work Schedule: You will need to have flexibility to work a variety of shifts, including nights, weekends, holidays and overtime. We operate in a shift bid environment. Work Environment: Must be able to be alert to moving vehicles or aircraft and use radio equipment. Enjoy the outdoors on a daily basis (sun, rain, sleet or snow! ) May be exposed to a wide variety of weather conditions, jet and machinery noises, fumes, dirt and dust for extended periods. Physical Demands\/Requirements: Must be able to lift \/ carry \/ push \/ pull and move items of 70 pounds and\/or more on a regular basis and repetitively lift weights of 40 to 50 pounds on raised surfaces. Must be able to walk, climb, bend, kneel, crawl, and stoop on a frequent basis and for extended periods.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155bc30d198905e9e613fdc::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Unifi\", \"position\": \"FT\/PT Cabin Agent - 10.00\/Hr. *Flight Privileges Offered* DELTA\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p><strong>Essential Functions \/ Key Responsibilities<\/strong><\/p> <ul> <li>Cleaning and servicing of aircraft interiors, including cabin, cockpit, galleys, and lavatories.<\/li> <li>Helps prepare the cabin for Customer boarding and departure, which can include cleaning of seats, seat pockets, floor, galleys, and lavatories.<\/li> <li>Checking, handling, assembling, removing, and installing passenger service cabin furnishings and supplies according to list specifications and cleaning must be highly detailed and specific to ensure all areas are completely free of dirt, debris, marks, fingerprints, etc.<\/li> <li>Performs other related duties as assigned within the appropriate skill and experience capabilities expected for this position.<\/li> <\/ul> <p><strong>Basic Qualifications<\/strong><\/p> <p>Pre-requisites:<\/p> <ul> <li>Must be a local (in-state) resident.<\/li> <li>Ability to pass a pre-employment drug screen.<\/li> <li>Ability to pass up to a 10-year background check.<\/li> <li>Must be at least 18 years of age.<\/li> <li>Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986.<\/li> <li>Must complete SIDA training to obtain airport authority identification security.<\/li> <\/ul> <p>Experience:<\/p> <ul> <li>No prior experience necessary.&nbsp; Must be open minded and ready to work as part of a detail-oriented team.<\/li> <\/ul> <p>Knowledge, Skills &amp; Abilities:<\/p> <ul> <li>Excellent customer service skills.<\/li> <li>Strong work ethic.<\/li> <li>Ability to work in a team oriented environment.&nbsp;<\/li> <\/ul> <p><strong>Preferred Qualifications<\/strong><\/p> <p>Education:<\/p> <ul> <li>High School diploma or GED.<\/li> <\/ul> <p>Experience:<\/p> <ul> <li>1+ year of relevant experience.&nbsp;&nbsp;<\/li> <\/ul> <p>Knowledge, Skills &amp; Abilities:<\/p> <ul> <li>Able to communicate information and instructions verbally and\/or via radio equipment.<\/li> <li>Able to communicate effectively in a professional manner.<\/li> <\/ul> <p><strong>Working Conditions<\/strong><\/p> <p>Work Schedule:<\/p> <ul> <li>You will need to have flexibility to work a variety of shifts, including nights, weekends, holidays and overtime. We operate in a shift bid environment.<\/li> <\/ul> <p>Work Environment:<\/p> <ul> <li>Must be able to be alert to moving vehicles or aircraft and use radio equipment.<\/li> <li>Enjoy the outdoors on a daily basis (sun, rain, sleet or snow!)&nbsp; May be exposed to a wide variety of weather conditions, jet and machinery noises, fumes, dirt and dust for extended periods.<\/li> <\/ul> <p>Physical Demands\/Requirements:<\/p> <ul> <li>Must be able to lift \/ carry \/ push \/ pull and move items of 70 pounds and\/or more on a regular basis and repetitively lift weights of 40 to 50 pounds on raised surfaces.<\/li> <li>Must be able to walk, climb, bend, kneel, crawl, and stoop on a frequent basis and for extended periods.<\/li> <li>Must be able to work in cramped or high places.<\/li> <li>Must be able to carry heavy items up and down jet way stairs.<\/li> <\/ul> <p><strong>Legal&nbsp;<\/strong><\/p> <p>Unifi is an Equal Opportunity Employer.<\/p> Cleaning <a href=\\\"https:\/\/ars2.equest.com\/?response_id=1efe7f0094fa7df5b37edbb1e8b6a7ec\\\" rel=\\\"nofollow\\\"><\/a> <\/div>\"}"
}