{
    "id":"Kaggle::techmap::6150e76af0dcd22748a276c4::monsterasia_in::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Dear Candidate,. Greeting for the day! We are Hiring for the jobs for the position of Safety Manager \/ Safety Supervisor \/ Safety Officer \/ Fire & Safety Officer. Location. Pan India. Salary. 25 k to 35 k per month. Role: Fire Safety Officer. Safety Officers are responsible for planning, implementing and overseeing company's employee safety at work. Their main duty is to ensure that the company is in compliance and adheres to Occupational Health and Safety (OHS) guidelines. construction safety officer is responsible for making sure all the workers at a construction site are working safely and following all the correct safety procedures. They may have other duties as well, but the primary duty of construction officers is to keep things safe around the job site. Strong written and verbal communication skills. Critical thinking and problem solving skills. Observation skills (attention to detail). Tactfulness. Sense of responsibility. Physical ability to do the work. Job Description : -Lead and participate in the duties of the fire fighting and Islands rescue team. -Inspect, test and maintain fire and safety mobile detection and protection systems \/ equipment and life saving appliance. -Provide guidance and stretch effective supervision on Fire & Safety Technicians and Fire Watch Technicians and Emergency Response Intervention Team in all fire watch activities and ensure Compliance with the safety requirements during normal & critical activities. -Closely monitor performance of all critical life safety equipment & assume responsibility on necessary replenishment, refurbishment, Phasing out and introduction of new requirements & necessary budget controlling. -Effectively assume the role of a Fire Chief leading Fire Fighting & Rescue Emergency Response Team during drills, exercise and real emergencies including Oil Spills Mitigation's. HSE Officer responsible for complete safety of the site including training to employees on best health & safety practices. Report making and submission. Required to work on PAN India location. Good communication skills and presentable. For any clarifications or to clear about job, feel free to call at 6389621352. Priya - 6389621352. Mail id - [HIDDEN TEXT]. Bests Regards:.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6150e76af0dcd22748a276c4::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"New Profiles Recruitment\", \"position\": \"Safety Officer\", \"notes\": \"\", \"original\": \"<div><b>Dear Candidate,<\/b><\/div><b><div><b><font style=\\\"font-size: 26px;\\\"><br><\/font><\/b><\/div><font>Greeting for the day!\\r<\/font><br><\/b><div><b>We are Hiring for the jobs for the position of Safety Manager \/ Safety Supervisor \/ Safety Officer \/ Fire & Safety Officer.<\/b><div><b><br><\/b><\/div><div><b>Location - Pan India<br><\/b><div><b><br>Salary - 25 k to 35 k per month<br><\/b><\/div><div><b>Role: Fire Safety Officer<\/b><\/div><div><b><br><\/b><\/div><div><b>Safety Officers are responsible for planning, implementing and overseeing company's employee safety at work. Their main duty is to ensure that the company is in compliance and adheres to Occupational Health and Safety (OHS) guidelines<br>construction safety officer is responsible for making sure all the workers at a construction site are working safely and following all the correct safety procedures. They may have other duties as well, but the primary duty of construction officers is to keep things safe around the job site<br>Strong written and verbal communication skills.<br>Critical thinking and problem solving skills.<br>Observation skills (attention to detail)<br>Tactfulness.<br>Sense of responsibility.<br>Physical ability to do the work.<br>Job Description :<br>-Lead and participate in the duties of the fire fighting and Islands rescue team.<br>-Inspect, test and maintain fire and safety mobile detection and protection systems \/ equipment and life saving appliance.<br>-Provide guidance and stretch effective supervision on Fire & Safety Technicians and Fire Watch Technicians and Emergency Response Intervention Team in all fire watch activities and ensure Compliance with the safety requirements during normal & critical activities.<br>-Closely monitor performance of all critical life safety equipment & assume responsibility on necessary replenishment, refurbishment, Phasing out and introduction of new requirements & necessary budget controlling.<br>-Effectively assume the role of a Fire Chief leading Fire Fighting & Rescue Emergency Response Team during drills, exercise and real emergencies including Oil Spills Mitigation's.<\/b><div><b><br><\/b><\/div><div><b>HSE Officer responsible for complete safety of the site including training to employees on best health & safety practices. Report making and submission. Required to work on PAN India location. Good communication skills and presentable.<br><\/b><div><b><br><\/b><\/div><div><b><font style=\\\"font-size: 18px;\\\">For any clarifications or to clear about job, feel free to call at:- 6389621352<\/font><\/b><\/div><div><b><font style=\\\"font-size: 18px;\\\"><br>Priya - 6389621352<br>Mail id - [HIDDEN TEXT]\\r<\/font><br>Bests Regards:<\/b><br><\/div><\/div><\/div><\/div><\/div>\"}"
}