{
    "id":"Kaggle::techmap::61361fd0fe53b628bf78fb37::linkedin_be::1",
    "label_age":true,
    "analysis_age":"The requirement for \"10 years commercial or technical experience\" can introduce age bias by favouring older candidates who are more likely to have accumulated this level of experience, potentially disadvantaging younger but equally capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase \"Strong leadership skills with ability to influence external and internal stakeholders and get things done through others\" emphasises individualistic and dominant traits often associated with masculine-coded language.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years commercial or technical experience in CASE (Coatings, Adhesives and Sealants). Working knowledge of additives, surfactants and polymers used in the CASE markets. Strong leadership skills with ability to influence external and internal stakeholders and get things done through others. Strategic thinker but can also execute at a tactical level. Ability to manage projects in a complex multi-cultural matrix environment. Experience in managing large marketing and\/or technical projects internally and externally with customers. Financial and cost analysis skills. Strong computer skills. Ability to travel up to 50%. Skills. Coatings experience. Technical, marketing field experience. Experience in managing large marketing and technical projects. Strong communication, ability to create presentations communicate technical information. Ability to manage projects in a complex multi-cultural matrix environment. Additional Information. Previously worked at coating, paint and adhesive companies. Prior work at paint additive supplier(s).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61361fd0fe53b628bf78fb37::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"Solvay\", \"position\": \"Marketing Manager Coatings\", \"notes\": \"\", \"original\": \"<strong><u>Job Overview And Responsibilities<br><br><\/u><\/strong>To develop and deploy the short &amp; long term marketing and product line strategy for Novecare Coatings Markets, in order to support business growth and achieve the GBU financial targets.<br><br>COATINGS market is accelerating its development in Binder Solutions and Performance Solutions segments with a strong focus on waterborne architectural and industrial coatings and adhesives end segments.<br><br><strong><u>Key Responsibilities<br><\/u><\/strong><ul><li>Develop the vision and strategy aligned with global coatings Value Creation Plan (VCP)<\/li><li>Based on an in-depth market understanding, develop, manage and implement the Global\/Regional Market Strategic Plans, assessment of the needs, and actionable execution plans<\/li><li>Contribute to development of external growth strategy at global level and recommends acquisition and divestiture options as part of strategic portfolio management<\/li><li>Understand the End-Market Needs and Define &amp; Develop Value Proposition:<\/li><li>Collect and understand market data &amp; needs through direct interactions with customers, industry associations, market publications and pertinent conferences \/ trade shows.<\/li><li>Synthesize market data from multiple sources to form competitive intelligence and identify new opportunities by leveraging existing technology competencies and identify new technology development needs<\/li><li>Identify and prioritize new market segments and applications<\/li><li>From customer and market needs derive the value proposition of Solvay\\u2019s present and future product portfolio<\/li><li>Monitor market data to report business conditions, end segment performance, competitive intelligence on monthly and or as needed basis<\/li><li>Collaborate with GMD, R&amp;I and Business Development Managers to identify, select and recommend new projects including new products and applications.<\/li><li>Marcom: Product portfolio management, Solvay.com\/Product Finder project management, literature and content management, management of digital communication, webinars, technical papers on journals and trade shows<\/li><li>Deliver, Capture and Maintain Value:<\/li><li>For all identified growth projects, drive full Marketing Process 1) Market Assessment 2) Validation 3) Launch Plan 4) Go to Market<\/li><li>Manage and drive alignment between assets portfolio and strategy. Work with asset and product line managers for alignment on the product portfolio strategy.<\/li><li>Establish and manage global price management, margin management and guidance for assigned market(s) working closely with Strategic Pricing Manager<\/li><li>Establish communication strategy for own market(s) together with the communication team and business development managers.<\/li><li>Develop and maintain relations with key customers and distributors on marketing and strategy related fields<br><\/li><\/ul><strong><u>Education and Experience<br><br><\/u><\/strong><strong>Strong technical background with coatings emulsion polymerization, paint additives and surfactants + and minimum experience (5 years) in business marketing<br><\/strong><ul><li>BS in Chemistry or Chemical Engineering and MBA is a plus<\/li><li>&gt; 10 years commercial or technical experience in CASE (Coatings, Adhesives and Sealants)<\/li><li>Working knowledge of additives, surfactants and polymers used in the CASE markets<\/li><li>Strong leadership skills with ability to influence external and internal stakeholders and get things done through others<\/li><li>Strategic thinker but can also execute at a tactical level<\/li><li>Ability to manage projects in a complex multi-cultural matrix environment.<\/li><li>Experience in managing large marketing and\/or technical projects internally and externally with customers<\/li><li>Financial and cost analysis skills<\/li><li>Strong computer skills<\/li><li>Ability to travel up to 50%<br><\/li><\/ul><strong><u>Skills<br><\/u><\/strong><ul><li>Coatings experience<\/li><li>Technical, marketing field experience<\/li><li>Experience in managing large marketing and technical projects<\/li><li>Strong communication, ability to create presentations communicate technical information<\/li><li>Ability to manage projects in a complex multi-cultural matrix environment<br><\/li><\/ul><strong><u>Additional Information<br><br><\/u><\/strong>Previously worked at coating, paint and adhesive companies<br><br>Prior work at paint additive supplier(s)<br><br>\"}"
}