{
    "id":"Kaggle::techmap::61346d9dcfb4105da09960d2::britishjobs_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The use of terms such as \"aggressive timescale\" and \"strict attention to detail\" suggests a preference for traits often stereotypically associated with male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Project & Installations Manager. Mechanical Bias  Complex Automated Lifting Equipment. West Midlands with Travel. £40-48k. Expenses. Allowances. Pension. Project & Installations Manager with a mechanical bias sought for a leading Midlands based company to be responsible for the profitable delivery of all contracts and small works from post tender stage. You will ensure that contracts are completed on time, on budget, to a high standard and develop excellent relationships with clients. Project Manager Responsibilities. Coordinate internal resources and third parties\/vendors for the flawless execution of all Projects. Assist in the definition of Project Scope and objectives, involving all relevant stakeholders and ensuring technical feasibility. Manage changes to the Project Scope, Project Schedule, and Project costs using appropriate verification techniques. Measure Project performance using appropriate tools and techniques. Compile and submit monthly valuations, projected final accounts and actual final accounts. Organise directly employed labour ensuring maximum productivity. Oversee ordering materials and sub-contractors at best value. Ensure Health and Safety plans, Risk assessments, COSHH assessments and the Health and Safety file are created, enforced and filed upon completion. The ideal Mechanical Project & Installations Manager will have analytical and innovative capabilities, have a strong drive to rapidly absorb and develop skills in a wide range of engineering disciplines and lastly be able to motivate a small team to an aggressive timescale and with strict attention to detail. It is essential you are commerically savvy with experience of developing and working to budgets with customers. You will also be competent with MSProject and a background of either:. Marine industry. Structural steel. Heavy lifting equipment. Automated cranes. You will have solid background of working with complex mechanical handling systems. Any experience of the marine sector highly advantgeous. Any previous experience of mechanical design highly advantageous but not essential. Hours of work will be based on a normal five day working week of 37 hrs between 08:00 - 16:45 Monday to Thursday and 08:00 - 12:00 Friday. However due to operational requirements you will be required and must be prepared to work additional hours over and above these. Some travel will be required throughout the UK & overseas for client meetings alongside overseeing commissioning\/installation phase. This will be dockside only  offshore travel not required for this role. This role is based in the West Midlands and is commutable from within and around the following areas: Telford, Shrewsbury, Wolverhampton and Wellington.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61346d9dcfb4105da09960d2::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Automation Experts Ltd\", \"position\": \"Project & Installation Manager\", \"notes\": \"\", \"original\": \"Project &amp; Installations Manager<br><br>Mechanical Bias &ndash; Complex Automated Lifting Equipment<br><br>West Midlands with Travel<br><br>&pound;40-48k + Expenses + Allowances + Pension<br><br>Project &amp; Installations Manager with a mechanical bias sought for a leading Midlands based company to be responsible for the profitable delivery of all contracts and small works from post tender stage. You will ensure that contracts are completed on time, on budget, to a high standard and develop excellent relationships with clients.<br><br>Project Manager Responsibilities<br><br>  * Coordinate internal resources and third parties\/vendors for the flawless execution of all Projects<br><br>  * Assist in the definition of Project Scope and objectives, involving all relevant stakeholders and ensuring technical feasibility<br><br>  * Manage changes to the Project Scope, Project Schedule, and Project costs using appropriate verification techniques<br><br>  * Measure Project performance using appropriate tools and techniques<br><br>  * Compile and submit monthly valuations, projected final accounts and actual final accounts<br><br>  * Organise directly employed labour ensuring maximum productivity<br><br>  * Oversee ordering materials and sub-contractors at best value<br><br>  * Ensure Health and Safety plans, Risk assessments, COSHH assessments and the Health and Safety file are created, enforced and filed upon completion<br><br>The ideal Mechanical Project &amp; Installations Manager will have analytical and innovative capabilities, have a strong drive to rapidly absorb and develop skills in a wide range of engineering disciplines and lastly be able to motivate a small team to an aggressive timescale and with strict attention to detail.<br><br>It is essential you are commerically savvy with experience of developing and working to budgets with customers. You will also be competent with MSProject and a background of either:<br><br>  * Marine industry<br><br>  * Structural steel<br><br>  * Heavy lifting equipment<br><br>  * Automated cranes<br><br>You will have solid background of working with complex mechanical handling systems. Any experience of the marine sector highly advantgeous. Any previous experience of mechanical design highly advantageous but not essential.<br><br>Hours of work will be based on a normal five day working week of 37 hrs between 08:00 - 16:45 Monday to Thursday and 08:00 - 12:00 Friday. However due to operational requirements you will be required and must be prepared to work additional hours over and above these.<br><br>Some travel will be required throughout the UK &amp; overseas for client meetings alongside overseeing commissioning\/installation phase. This will be dockside only &ndash; offshore travel not required for this role.<br><br>This role is based in the West Midlands and is commutable from within and around the following areas: Telford, Shrewsbury, Wolverhampton and Wellington.<br><br>All respondents to this position must be eligible to live and work in the UK - Automation Experts are unable to assist with the award of Visas or UK Work Permits.<br>\"}"
}