{
    "id":"Kaggle::techmap::6143a3aa407fa83d0340cfd3::linkedin_ie::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The term \"free from any condition that would render him\/her unsuitable\" can introduce disability bias by excluding individuals with disabilities who can hold the appointment and perform the job with reasonable accommodations.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The term \"him\/her\" introduces sexuality bias by not including non-binary or gender non-conforming individuals, thereby assuming a binary understanding of gender.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 30 days per annum. 1.6 Health. The successful candidate must be free from any condition that would render him\/her unsuitable to hold the appointment and must be in a state of health as would indicate a reasonable prospect of ability to render regular and efficient service. To satisfy this requirement the successful candidate will be required to undergo a medical examination by the Occupational Health Nurse\/Physician. The candidate will be liable for the cost of the medical examination. 1.7 Duties. The duties of the appointment are as described in the attached Job Description. 1.8 Garda Clearance. Successful Garda Clearance will be required prior to being appointed to this post. 1.9 Recruitment Process. A list of candidates will be prepared by the Selection Board, from an examination of the applications and supporting documentation received, which will be based on the criteria set out in the required qualification and experience outlined above. A short list will be made and those identified on the shortlist will be invited to interview. There may be a need to hold a second round of interviews and, if this is the case, candidates will be notified. Following interview all candidates will be notified of the outcome by the HR Department. The successful candidate will be made an offer and, if that candidate accepts, the appointment will be made subject to the Garda Vetting Report. The HR Department will notify the successful candidate of the mandatory\/compulsory courses\/training which employees are obliged to attend. Mandatory training, for example, Manual Handling, Health and Safety Courses, etc., form part of the conditions of employment along with the organisations statutory obligation. 1.10 Travel. You may be required to travel to each of the Brothers of Charity Services Ireland West Region locations to carry out your duties and travel will be reimbursed at the rate determined by the Department of Health. 1.11 Note re Canvassing. Any attempt by candidates themselves or by any person(s) acting at their instigation, directly or indirectly by means of written communication or otherwise, to canvass or otherwise influence in the candidates favour any member of staff of Brothers of Charity Services, or person nominated to interview or examine applicants, will automatically disqualify the candidates for the position they are seeking. PART 2: JOB DESCRIPTION. Title: ICT Operations Manager. Permanent Full-Time. Location: Co Galway.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6143a3aa407fa83d0340cfd3::linkedin_ie\", \"source\": \"linkedin_ie\", \"country\": \"IE\", \"company\": \"Brothers of Charity Services Ireland\", \"position\": \"Permanent ICT Operations Manager - West Region\", \"notes\": \"\", \"original\": \"<strong><u>Brothers Of Charity Services Ireland<br><br><\/u><\/strong>PART 1: QUALIFICATIONS AND PARTICULARS OF EMPLOYMENT<br><br>POST OF PERMANENT FULL-TIME ICT OPERATIONS MANAGER<br><br>JOB REF: 163\/2021<br><br>The ICT Operations Manager in the BOCSI West region will be responsible for the day-to-day operation of computers and networks so people can use them to accomplish their tasks. The successful candidate must enjoy solving problems in a complex ICT infrastructure and will be proactive with broad technical knowledge and skills. This position will involve working with people whose knowledge about IT ranges from novice to expert. The job involves the line management of a small internal team of ICT Support Analysts. The role includes systems architecture diagnosis, the anticipation of problems, the evaluation of solutions, and the implementation of cost effective solutions.<br><br>The ICT Operations Manager will be responsible for ensuring that the current infrastructure is maintained and managed to a high operating standard on a daily basis. The role also includes administrative duties relating to the team and also procurement and vendor management. Liaising with the local senior management team will be critical to maintaining strong ICT - Business relationships.<br><br>Being able to prioritise the problems that arise is essential. The successful candidate must weigh each problem for its severity and complexity, and then resolve problems in the order that keeps the greatest number of people productive. The ICT Operations Manager\\u2019s ability to work with others, both technical and non-technical personnel, is key to this job. Change is constant, so the successful candidate will always be learning something new.<br><br><strong>1.1 Tenure of Post<br><br><\/strong>The post is permanent full time and pensionable.<br><br><strong><u>The Successful Candidate Must Have<br><br><\/u><\/strong><strong>1.2 Qualifications and Experience<br><br><\/strong><strong>Education<br><br><\/strong>A 3rd level IT or related qualification.<br><br>Microsoft Certified Professional certification in current systems is an advantage.<br><br>Other accreditations and relevant experience in Information Technology an advantage.<br><br>An ITIL qualification is desirable but not essential.<br><br><strong><u>Experience And Knowledge<br><br><\/u><\/strong>A minimum of 3 years\\u2019 post-grad experience in a similar role.<br><br>Experience in delivery of ICT services in a complex environment working closely with senior business managers.<br><br>Recent experience in a diverse networked environment is essential, ability to setup, configure and maintain WAN communication links over various technologies.<br><br>Experience with a wide range of hardware including servers, routers, firewalls, personal computers, laptops, printers and peripheral devices are essential.<br><br>Experience with a wide range of operating systems such as Windows Server 2012 R2, 2016, Windows 10 is essential.<br><br>Required experience managing and maintaining a virtual server environment including shared storage and networking.<br><br>Experience in the use of server application software such as Active Directory, Exchange, Microsoft SQL 2014\/2016 and Citrix XenApp is essential.<br><br>Knowledge of current and future trends in ICT operations.<br><br>Experience deploying, managing and troubleshooting phone systems and other telecommunications equipment such as PBXs and VoIP systems.<br><br>Experience in ICT Procurement including negotiating and contracting with vendors is desirable.<br><br>Demonstrate experience with standard business software applications including Microsoft Office productivity suites.<br><br>Experience with security appliances, filtering technologies and cloud security services would be an advantage.<br><br>Management\/Team lead experience of an ICT team is desirable.<br><br><strong><u>Other Skills<br><br><\/u><\/strong>Demonstrate strong dedication to customer service.<br><br>Consistently demonstrate professional, positive and approachable attitude and discretion.<br><br>Demonstrate good teamwork skills.<br><br>Ability to work with other technical and non-technical personnel.<br><br>Must own their own car and possess a full clean Irish manual driving licence, these are essential requirements of this post.<br><br>Creative problem solving and research and analysis skills.<br><br>Good verbal and written communication skills.<br><br>Organisational, prioritisation and time management skills.<br><br><strong>1.3 Remuneration<br><br><\/strong>Grade VI: \\u20ac 48,541 to \\u20ac59,321 per annum (An on-call allowance will also be provided as part of this role)<br><br>The reference salary applying to the grade ranges from a minimum of \\u20ac48,541 to a maximum of \\u20ac55,365 gross basic per annum. After three years on the maximum point, a Long Service Increment (LSI) applies bringing the annual salary to \\u20ac57,337 gross basic per annum. After a further three years another Long Service Increment applies, bringing the annual salary to the maximum of \\u20ac59,321 per annum.<br><br><strong>1.4 Working Hours<br><br><\/strong>The normal working hours are 37 hour working week based on a 5 day duty roster; however, flexible hours including weekends and evenings may be required from time to time. Starting and finishing times will be notified to, and agreed with, the appointee from time to time by the National Head of Cloud and Infrastructure Services. The successful candidate must be available for on call situations that may arise from time to time. These times may be outside \\u2018normal\\u2019 operational times and must be approved by your manager. An on-call allowance will be provided as part of this role.<br><br><strong>1.5 Annual Leave<br><br><\/strong>30 days per annum<br><br><strong>1.6 Health<br><br><\/strong>The successful candidate must be free from any condition that would render him\/her unsuitable to hold the appointment and must be in a state of health as would indicate a reasonable prospect of ability to render regular and efficient service. To satisfy this requirement the successful candidate will be required to undergo a medical examination by the Occupational Health Nurse\/Physician. The candidate will be liable for the cost of the medical examination.<br><br><strong>1.7 Duties<br><br><\/strong>The duties of the appointment are as described in the attached Job Description.<br><br><strong>1.8 Garda Clearance<br><br><\/strong>Successful Garda Clearance will be required prior to being appointed to this post.<br><br><strong>1.9 Recruitment Process<br><br><\/strong>A list of candidates will be prepared by the Selection Board, from an examination of the applications and supporting documentation received, which will be based on the criteria set out in the required qualification and experience outlined above. A short list will be made and those identified on the shortlist will be invited to interview. There may be a need to hold a second round of interviews and, if this is the case, candidates will be notified. Following interview all candidates will be notified of the outcome by the HR Department.<br><br>The successful candidate will be made an offer and, if that candidate accepts, the appointment will be made subject to the Garda Vetting Report.<br><br>The HR Department will notify the successful candidate of the mandatory\/compulsory courses\/training which employees are obliged to attend. Mandatory training, for example, Manual Handling, Health and Safety Courses, etc., form part of the conditions of employment along with the organisation\\u2019s statutory obligation.<br><br><strong>1.10 Travel<br><br><\/strong>You may be required to travel to each of the Brothers of Charity Services Ireland West Region locations to carry out your duties and travel will be reimbursed at the rate determined by the Department of Health.<br><br><strong>1.11 Note re Canvassing<br><br><\/strong>Any attempt by candidates themselves or by any person(s) acting at their instigation, directly or indirectly by means of written communication or otherwise, to canvass or otherwise influence in the candidate\\u2019s favour any member of staff of Brothers of Charity Services, or person nominated to interview or examine applicants, will automatically disqualify the candidates for the position they are seeking.<br><br><u><strong>PART 2: JOB DESCRIPTION<br><br><\/strong><\/u><strong>Title: ICT Operations Manager - Permanent Full-Time<br><br>Location: Co Galway<br><br>Responsible to and Reports to: National Head of Cloud and Infrastructure Services<br><br><\/strong>The Congregation of the Brothers of Charity is a religious voluntary organisation founded in 1807 by Canon Peter Triest to provide a Christian response to a variety of needs in society.<br><br>The Brothers of Charity Services Ireland (BOCSI) operates throughout four regions \\u2013 West (Roscommon, Galway), Midwest (Clare, Limerick), Southern (Cork, Kerry) and South East (Waterford, Tipperary) - with 4,500+ staff providing a wide range of services to over 8,000 individuals with intellectual disability. It has an annual budget of over \\u20ac220M.<br><br><strong>2.1 Ethos <br><br><\/strong>The core values of our Services have always been the dignity and humanity of each person. How these are expressed has evolved over time with our greater understanding of the rights of all people with a disability, with the changing hopes and expectations of the individuals and families with whom we work, and with the growing expertise of all associated with our services.<br><br><strong>2.2 Mission <br><br><\/strong>We aim to support each person with an intellectual disability associated with our Services to live the fully integrated holistic life to which each aspires as a family member, as a member of a local community and as a citizen of Ireland. We strive to provide such services and supports as will assist each in achieving these goals.<br><br><strong>2.3 Background<br><br><\/strong>BOCSI has consolidated its primary information technology infrastructure and business application systems (Finance, Human Resources and Persons Supported Systems) over the past 3 years. A national datacentre has been deployed and systems have been migrated from each region. In total, 4000 mailboxes have been migrated from legacy on premise systems to Office365. A national Citrix solution has been deployed and is utilised by 400 concurrent users daily.<br><br>Further, the key finance and HR systems have been migrated to SQL with further integration work required. Some legacy Microsoft Access based applications still remain which run the Client Support Systems.<br><br>Maintaining and managing the ICT Operations for the West Region is critical in aligning with the strategy and vision of National ICT.<br><br><strong><u>2.4 Responsibilities And Duties<br><br><\/u><\/strong>The person appointed should be flexible in their approach and should have the ability to work as a member of a team.<br><br>Reporting to the National Head of Cloud and Infrastructure Services, the key responsibilities for the ICT Operations Manager are:<br><br><strong>Problem Resolution<br><br><\/strong>Take responsibility for analysing and resolving operational and technical support requests as escalated.<br><br>Log all calls in the ICT Support desk incident management system, ensuring that incidents are assigned appropriately.<br><br>Provide Level 2 and Level 3 technical support to local ICT team to resolve issues for users of office applications, business systems and other productivity software.<br><br>Take ownership of user problems and follow up on behalf of the user if required.<br><br>Escalate problems as you see fit to enable the systems to continue operating.<br><br>Working in conjunction with the National Head of Cloud and Infrastructure Services to implement appropriate infrastructure and security measures.<br><br>Internal telephone systems management for both standard PABX and VOIP systems.<br><br>Managing the protection of business mobile devices including mobile phones, tablets and laptops.<br><br>Test and implement new technological solutions.<br><br>To arrange with external technical support where issues cannot be resolved internally.<br><br>Perform other related duties as assigned.<br><br><strong>Maintenance<br><br><\/strong>Installation of hardware and software upgrades and general maintenance for both end user and server backend systems.<br><br>Storage management to ensure that all applications have access to appropriate storage requirements.<br><br>Oversight of PC provisioning \\u2013 acquisition, configuration, provisioning using gold image, applications installation and configuration.<br><br>Perform other tasks such as anti-virus and backup implementations as appropriate to ensure data can be recovered quickly, if needed. This includes regular validation of back up data.<br><br><strong>Administration and Client Services<br><br><\/strong>Provide telephone, remote and one-to-one support to users where escalated.<br><br>Management of the West region ICT Team.<br><br>Implement the ITIL incident, problem, change and request management processes.<br><br>Schedule and prioritise issues.<br><br>Maintain and create documentation of hardware, software, and problem resolutions.<br><br>Management of the physical locations where the key equipment resides, including floor space, electricity, HVAC, UPS, etc.<br><br>Analyse users' needs and recommend solutions for future needs.<br><br>Track and manage hardware and software inventory and warranty information<br><br>Managing ICT Operations Budget \\u2013 the purchase of equipment, accessories, services, and office supplies as provided for within a predetermined budget. Authorising accounts payable for all hardware, software, and services employed by ICT Operations.<br><br>Communications with network users when a major incident occurs impacting on network services.<br><br>Working with Facilities department to ensure that current and future buildings ICT requirements are included.<br><br>Working with the National Head of Cloud and Infrastructure Services to integrate National ICT systems and to inform of changes that may affect the National ICT Service provision.<br><br><strong>2.5 Advocacy and Rights<br><br><\/strong>Promote and respect the human, legal and constitutional rights of each person supported by the Brothers of Charity Services, recognising their uniqueness and equality.<br><br><strong>2.6 Training and Development<br><br><\/strong>Attend mandatory and compulsory training courses and achieve the required standard.<br><br>Actively participate in Team Based Performance Management as required.<br><br><strong>2.7 Communication<br><br><\/strong>Attend and participate fully at staff meetings as required;<br><br>Promote open communication among staff and good levels of staff morale;<br><br>Cooperate, develop and maintain respectful communications and working relationships with;<br><br>Individuals who are supported by the Services, and their families;<br><br>All other staff involved in the Brothers of Charity Services;<br><br>Families, Visitors, Volunteers and other such personnel who visit the Services;<br><br>Operate effectively as a member of the ICT team in promoting the best interests of the Services.<br><br><strong>2.8 Health and Safety<br><br><\/strong>Be conscious of Health and Safety matters in the work place and in particular to comply with employees\\u2019 obligations as set out in the Safety, Health and Welfare at Work Act, 2005 and to ensure that the procedures set out in the Safety Statement are implemented at all times;<br><br>Carry out regular safety audits and fire drills;<br><br>Be conversant with existing fire regulations and emergency procedures and participate in the implementation of same;<br><br>Ensure equipment is properly operated and maintained;<br><br>Report accidents\/irregularities or other matters of safety concern to the Chief Executive or in his\/her absence or such person as the Employing Authority may designate;<br><br>Identify risk, assess and document appropriately.<br><br><strong>2.9 Confidentiality<br><br><\/strong>In the course of the employment the post holder may have access to, or hear information concerning the medical or personal affairs of people who are supported by the Services and\/or staff, or other health service business. Such records and information are strictly confidential and, unless acting on the instructions of an authorised officer, on no account must information concerning individuals who are supported by the Services, staff, or other health service business be divulged or discussed except in the performance of normal duty. In addition, records must never be left in such a manner that unauthorised persons can obtain access to them and must be kept in safe custody when no longer required.<br><br><strong>Informal enquiries to David Coffey at , National Head of CIS<br><br>Closing Date for receipt of completed Application Forms &amp; CV\\u2019s by<br><br>5pm on Thursday 30th September 2021.<br><br>Interviews will be held Monday 11th October 2021 \\u2013 via MS teams.<br><br>The Brothers of Charity Services Ireland is an equal opportunities employer<\/strong>\"}"
}