{
    "id":"Kaggle::techmap::61556e0cccec3f581dd23fc5::monster2_es::1",
    "label_age":true,
    "analysis_age":"\" A youthful and dynamic workplace\" will implicitly bias older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Now, our aims are to expand our reach, epitomise the value of a skills-based education and be a driver of industry standards the world over. To do that, we need the right people, at all levels, who really understand our 'Hard Work, Spirit and Soul' motto. Bring your A-game and we'll bring ours. A youthful and dynamic workplace, great atmosphere and conditions, as well as growth opportunities for those who make positive, constructive contributions to our development.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61556e0cccec3f581dd23fc5::monster2_es\", \"source\": \"monster2_es\", \"country\": \"ES\", \"company\": \"European Bartender School\", \"position\": \"Client & Administrative Coordinator\", \"notes\": \"\", \"original\": \"European Bartender School is looking for a Client &amp; Administrative Coordinator to join our International team!Please send your application in EnglishThe RoleAs Client &amp; Administrative Coordinator you will provide customer service support to our students, via phone, email and chat. You will work in close collaboration with our Sales Department, as well as Marketing.We are looking for a proactive and curious person, with exceptional attention to detail.&nbsp;&nbsp;Here\\u2019s what you\\u2019ll do:&nbsp;Assist our students via phone, email and chat, in regards to their questions, doubts and complaintsTake care of the relationship with our students and Franchises, assisting them on a life changing experienceStay up-to-date on our latest courses\/experiences and the campaignsCover any questions and doubts about the services\/experiences we provideOrganise your workflow, set yourself personal goals, schedule call-backsBe an ambassador for the EBS brand worldwide!Job requirements:Excellent communication skillsMinimum 1 year of Customer Service experience, B2B and B2C, in a similar working environmentFull working proficiency in English (C1) and at least in one other European language&nbsp;An understanding of EBS product or first-hand experience of an EBS courseExperience of Windows operating systems and CRM systems, including SalesforceStrong organisational and administrative skillsThe Offer:A competitive salary packagePaid travel all over the world&nbsp;A young, dynamic and international working environment, with 16+ different nationalitiesBe part of the small 5 person education team that control the education for the world\\u2019s largest bartending school, this is a rare opportunity to make a huge positive impact on the industryRelaxed office environment including chill-out area, terrace and in-office music systemPing-Pong table and PlayStation 4Gym and fitness centre discountsCasual dress codeFree weekly Spanish\/English classes for all levels*Company subsidised events and trips (in the past we\\u2019ve gone to Rome, Berlin, Mallorca, Ibiza &amp; Amsterdam)&nbsp;(*Temporarily on hold due to Covid-19 restrictions)About EBSEuropean Bartender School is the market leader in the bartending industry. Our mission is to educate exceptional bartenders from all over the world; making the world taste better, one cocktail at a time.&nbsp;With three global offices, more than 28 schools and a dedicated team of professionals, we have trained over 70,000 bartenders from across the globe over the last 22 years. A lot has happened in that time and we\\u2019ve grown and improved a lot. Now, our aims are to expand our reach, epitomise the value of a skills-based education and be a driver of industry standards the world over. To do that, we need the right people, at all levels, who really understand our&nbsp;'Hard Work, Spirit and Soul'&nbsp;motto.&nbsp;Bring your A-game and we'll bring ours; a youthful and dynamic workplace, great atmosphere and conditions, as well as growth opportunities for those who make positive, constructive contributions to our development.\"}"
}