{
    "id":"Kaggle::techmap::61448f7cce85b02e20997f32::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Greyhound Racing SA Limited (GRSA) is the controlling body which conducts, regulates and promotes greyhound racing throughout South Australia. Its primary role is to ensure the responsible and ethical management of the sport, the enforcement of local and national rules of racing and the effective conduct of racing operations. Our four TAB tracks play host to a racing schedule of more than 400 meetings each year. GRSA are seeking applications from enthusiastic individuals for the position of Cadet Steward. This is an entry level position with an opportunity for the successful candidate to join a dedicated team within a dynamic racing environment. Reporting to the Chief Steward, you will play a pivotal role in assisting with the integrity and policing of our industry. Key responsibilities of the role include: assist in the fair application of the GRSA Rules of Racing. assist with the control and conduct of race meetings. provide general administrative support. assist with the conduct of Stewards inquires. conduct or attend kennel inspections. ensuring licensed persons comply with GRSA Code of Practice. respond to enquiries from registered persons. To be considered for this role you will preferably have: A desire to be involved in the regulation of the greyhound racing industry in South Australia. A strong work ethic with the ability to work well under pressure. Good interpersonal skills. Good problem solving and analytical skills. Good oral and written communication skills. Sound computer skills including a working knowledge of Microsoft Office. The ability to understand and interpret the rules of racing. It should be noted that the role is required to undertake occasional intrastate travel and work outside of normal business hours. It is a requirement that any person applying for this role will undertake a criminal record check and hold a current South Australian drivers licence. To apply, please click the apply for this job button and upload your CV together with a cover letter addressing the above criteria by Friday 8th October. Please direct any enquiries to: grsa. com. au [link removed]. GRSA is an EEO employer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61448f7cce85b02e20997f32::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Greyhound Racing SA\", \"position\": \"Cadet Steward\", \"notes\": \"\", \"original\": \"<p>Greyhound Racing SA Limited (GRSA) is the controlling body which conducts, regulates and promotes greyhound racing throughout South Australia. Its primary role is to ensure the responsible and ethical management of the sport, the enforcement of local and national rules of racing and the effective conduct of racing operations.\\u00a0 Our four TAB tracks play host to a racing schedule of more than 400 meetings each year.<\/p><p>GRSA are seeking applications from enthusiastic individuals for the position of <strong>Cadet Steward<\/strong>.\\u00a0 This is an entry level position with an opportunity for the successful candidate to join a dedicated team within a dynamic racing environment.<\/p><p>Reporting to the Chief Steward, you will play a pivotal role in assisting with the integrity and policing of our industry.<\/p><p><strong>Key responsibilities of the role include:<\/strong><\/p><ul><li>assist in the fair application of the GRSA Rules of Racing\\u00a0<\/li><li>assist with the control and conduct of race meetings<\/li><li>provide general administrative support<\/li><li>assist with the conduct of Stewards inquires<\/li><li>conduct or attend kennel inspections<\/li><li>ensuring licensed persons comply with GRSA Code of Practice<\/li><li>respond to enquiries from registered persons<\/li><\/ul><p><strong>To be considered for this role you will preferably have:<\/strong><\/p><ul><li>A desire to be involved in the regulation of the greyhound racing industry in South Australia<\/li><li>A strong work ethic with the ability to work well under pressure<\/li><li>Good interpersonal skills<\/li><li>Good problem solving and analytical skills<\/li><li>Good oral and written communication skills<\/li><li>Sound computer skills including a working knowledge of Microsoft Office<\/li><li>The ability to understand and interpret the rules of racing<\/li><\/ul><p>It should be noted that the role is required to undertake occasional intrastate travel and work outside of normal business hours.<\/p><p><strong>It is a requirement that any person applying for this role will undertake a criminal record check and hold a current South Australian drivers licence.<\/strong><\/p><p>To apply, please click\\u00a0the <strong>apply for this job<\/strong> button and upload your CV together with a cover letter addressing the above criteria by Friday 8th October.\\u00a0 Please direct any enquiries to: recruitment@grsa.com.au [link removed]<\/p><p><em>GRSA is an EEO employer<\/em><\/p>\"}"
}