{
    "id":"Kaggle::techmap::6144e021cc73a903ffc0730a::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The physical requirements, such as standing, sitting, or walking for long periods of time, bending, stooping, squatting, twisting, pushing, and pulling, along with the lack of a statement about reasonable accommodation and justification for these requirements, might introduce disability bias.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Stand, sit or walk for long periods of time. Bend, stoop, squat, twist, push and pull. Handle or manage tools or equipment. Tolerate hot or cold warehouse environments. We engineer faster, smarter, leaner supply chains. GXO is a leading provider of cutting-edge supply chain solutions to the most successful companies in the world. We help our customers manage their goods most efficiently using our technology and services. Our greatest strength is our global team  energetic, innovative people of all experience levels and talents who make GXO a great place to work. We are proud to be an Equal Opportunity\/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran or other protected status. GXO adheres to CDC, OSHA and state and local requirements regarding COVID safety. All employees and visitors are expected to comply with GXO policies which are in place to safeguard our employees and customers. All applicants who receive a conditional offer of employment may be required to take and pass a pre-employment drug test. The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed. Review GXO's candidate privacy statement [Link available when viewing the job].",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144e021cc73a903ffc0730a::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"XPO Logistics, Inc.\", \"position\": \"Material Handler - 1st Shift\", \"notes\": \"\", \"original\": \"<p><b>Logistics at full potential.\\u00a0<\/b><\/p> \\r\\n <p>At GXO, we\\u2019re constantly looking for talented individuals at all levels, who can deliver the caliber of service our company requires. You know that a positive work environment creates happy employees, which boosts productivity and dedication. On our team, you\\u2019ll have the support to excel at work, and the resources to build a career you can be proud of.<\/p> \\r\\n <p>As part of its COVID-19 safety protocols, the client site for this role (or a client site to which this role must travel) has mandated that all employees, suppliers, and visitors be fully vaccinated. Therefore, it is required that any successful candidate for this position be fully-vaccinated by October 1, 2021. If you believe that you require an accommodation for a medical or religious reason, please contact [Email available when viewing the job]<\/p> \\r\\n <p>1st Shift, Monday - Friday, 8:00am - 5:00pm<\/p> \\r\\n <p>As a Material Handler, you will have an important role on our team, helping us provide sophisticated supply chain solutions to our customers. If you\\u2019re looking for an exciting opportunity with a company that\\u2019s clearly going places, join us at GXO. <\/p> \\r\\n <p><b>Pay, benefits and more. <\/b><\/p> <p>We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability and more. <\/p> \\r\\n <p><b>What you\\u2019ll do on a typical day: <\/b><\/p> <ul><li>Support operations by moving material and inventory throughout the facility <\/li> <li>Use hand trucks, conveyors, or other material handling equipment\\u00a0\\u00a0 <\/li> <li>Perform duties that may include packing, scanning, kitting, or counting products<\/li> <li>Verify orders, label products, and use a handheld scanner\\u00a0 <\/li> <li>Adhere to the 7S program and maintain a clean environment at all times\\u00a0 <\/li> <li>Work in a safe manner that protects you and your team members\\u00a0 <\/li> <\/ul><p><b>What you need to succeed at GXO:\\u00a0\\u00a0 <\/b><\/p> <p>At a minimum, you\\u2019ll need:\\u00a0 <\/p> <ul><li>Ability to read and interpret documents such as safety rules, operating instructions and procedural documents, basic math skills<\/li> <\/ul><p>It\\u2019d be great if you also have:\\u00a0 <\/p> <ul><li>High school diploma or equivalent<\/li> <li>1 year of experience in a warehouse environment\\u00a0\\u00a0 <\/li> <li>Availability to work a flexible schedule, with possible overtime when needed\\u00a0 <\/li> <li>Experience using a handheld scanner\\u00a0 <\/li> <li>Positive attitude and the ability to work on a team to achieve goals and objectives\\u00a0 <\/li> <\/ul><p>This job requires the ability to:<\/p> <ul><li>Lift objects of various shapes, sizes, and weights; lift up to 50 lbs.<\/li> <li>Stand, sit or walk for long periods of time<\/li> <li>Bend, stoop, squat, twist, push and pull<\/li> <li>Handle or manage tools or equipment <\/li> <li>Tolerate hot or cold warehouse environments<\/li> <\/ul><p><b>We engineer faster, smarter, leaner supply chains.<\/b><\/p> \\r\\n <p>GXO is a leading provider of cutting-edge supply chain solutions to the most successful companies in the world. We help our customers manage their goods most efficiently using our technology and services. Our greatest strength is our global team \\u2013 energetic, innovative people of all experience levels and talents who make GXO a great place to work.<\/p> \\r\\n <p>We are proud to be an Equal Opportunity\/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran or other protected status.<\/p> <p><br \/> GXO adheres to CDC, OSHA and state and local requirements regarding COVID safety. All employees and visitors are expected to comply with GXO policies which are in place to safeguard our employees and customers.<\/p> \\r\\n <p>All applicants who receive a conditional offer of employment may be required to take and pass a pre-employment drug test.<\/p> \\r\\n <p>The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed. Review GXO's candidate privacy statement [Link available when viewing the job]<\/p>&nbsp;\"}"
}