{
    "id":"Kaggle::techmap::6156883fd55fd263df7fcb00::monsterasia_in::2",
    "label_age":true,
    "analysis_age":"The term \"mature\" in the phrase \"You are mature and able to function independently with limited guidance\" signifies a level of responsibility and independence rather than implying a preference for older individuals, thus avoiding age bias.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase \"influence without authority\" can introduce masculine bias by favouring assertive and persuasive traits traditionally associated with male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 3) Once a go decision is made, the program manager will work to evolve a plan and timeline for execution. 4) The program manager will develop a roadmap and metrics to measure progress of the initiative they own. They will also own writing reports\/documents that detail the progress to leadership on a frequent basis. 5) They will liaise across functions to drive their project and help clear issues and bottlenecks. 6) They will work with technology teams to scope out and drive any tech changes that are needed. Above all, we expect program managers to be single threaded owners for their initiatives. This is a high ownership position where you directly control your destiny. Program Managers will be measured on the impact of their project. Depending on the project, clear financial or other impact goals will be set forth. It is the program manager's responsibility to ensure they drive the program towards achieving those goals. Internal job description. Loop competencies. Deep Dive, Ownership, Insist on High Standards, Customer Obsession. Basic qualifications. years of experience in program or project management. Experience defining program requirements and using data and metrics to determine improvements. years of experience working cross functionally with tech and non-tech teams. years of experience delivering cross functional projects. At least 8 years of experience in a top tier company driving programs or projects. If you have a MBA from a top tier institute (IIM A\/B\/C\/L, NITIE\/JBIMS\/ISB), 4. years of experience is a minimum. Supply Chain background preferable but not mandatory. We hire for core skills, not specializations. What are we really looking for? You should be very analytical and be able to justify your decisions and approaches with data. You should be able to deal with a high degree of ambiguity. You should be able to take a complex problem and break it down to smaller digestible chunks. You should be able to define a logical and step by step approach to achieving a lofty goal. You should be comfortable with processes and process design\/analysis. You should have the ability to influence without authority and do so by using data and facts. You should be able to deal with varied stakeholders and earn their trust. You are mature and able to function independently with limited guidance. You should have excellent written communication skills.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156883fd55fd263df7fcb00::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"Amazon\", \"position\": \"Sr. Program Manager\", \"notes\": \"\", \"original\": \"<br>DESCRIPTION<br>We are hiring Program Managers to run complex and cross functional projects for India 3P network. This role is a part of the centralized 3P carrier management at Amazon India. These projects will typically involve designing and building complex new processes, driving technology solutions, driving large cost reduction or efficiency improvement initiatives or launching exciting new supply chain models.<br>The incumbent will be own the following -<br>1) They will be responsible for working with finance, supply chain execution, transportation and other Amazon teams to identify pain points and scope out large high impact projects<br>2) They will be responsible for driving cost benefit analysis and go\/no-go decisions on various initiatives<br>3) Once a go decision is made, the program manager will work to evolve a plan and timeline for execution.<br>4) The program manager will develop a roadmap and metrics to measure progress of the initiative they own. They will also own writing reports\/documents that detail the progress to leadership on a frequent basis<br>5) They will liaise across functions to drive their project and help clear issues and bottlenecks.<br>6) They will work with technology teams to scope out and drive any tech changes that are needed<br>Above all, we expect program managers to be single threaded owners for their initiatives. This is a high ownership position where you directly control your destiny.<br>Program Managers will be measured on the impact of their project. Depending on the project, clear financial or other impact goals will be set forth. It is the program manager's responsibility to ensure they drive the program towards achieving those goals.<br>Internal job description<br>Loop competencies<br>Deep Dive, Ownership, Insist on High Standards, Customer Obsession<br>Basic qualifications<br>. 5+ years of experience in program or project management<br>. Experience defining program requirements and using data and metrics to determine improvements<br>. 5+ years of experience working cross functionally with tech and non-tech teams<br>. 5+ years of experience delivering cross functional projects<br>. At least 8 years of experience in a top tier company driving programs or projects.<br>. If you have a MBA from a top tier institute (IIM A\/B\/C\/L, NITIE\/JBIMS\/ISB), 4+ years of experience is a minimum<br>. Supply Chain background preferable but not mandatory. We hire for core skills, not specializations.<br>What are we really looking for?<br>. You should be very analytical and be able to justify your decisions and approaches with data<br>. You should be able to deal with a high degree of ambiguity<br>. You should be able to take a complex problem and break it down to smaller digestible chunks<br>. You should be able to define a logical and step by step approach to achieving a lofty goal<br>. You should be comfortable with processes and process design\/analysis<br>. You should have the ability to influence without authority and do so by using data and facts<br>. You should be able to deal with varied stakeholders and earn their trust.<br>. You are mature and able to function independently with limited guidance<br>. You should have excellent written communication skills - data oriented & brevity being key words in your style of writing<br>Preferred qualifications<br>. You should be very analytical and be able to justify your decisions and approaches with data<br>. You should be able to deal with a high degree of ambiguity<br>. You should be able to take a complex problem and break it down to smaller digestible chunks<br>. You should be able to define a logical and step by step approach to achieving a lofty goal<br>. You should be comfortable with processes and process design\/analysis<br>. You should have the ability to influence without authority and do so by using data and facts<br>. You should be able to deal with varied stakeholders and earn their trust.<br>. You are mature and able to function independently with limited guidance<br>BASIC QUALIFICATIONS<br>. 5+ years of experience in program or project management<br>. Experience defining program requirements and using data and metrics to determine improvements<br>. 5+ years of experience working cross functionally with tech and non-tech teams<br>. 5+ years of experience delivering cross functional projects<br>PREFERRED QUALIFICATIONS<br>We are hiring Program Managers to run complex and cross functional projects for India 3P network. This role is a part of the centralized 3P carrier management at Amazon India. These projects will typically involve designing and building complex new processes, driving technology solutions, driving large cost reduction or efficiency improvement initiatives or launching exciting new supply chain models.<br>The incumbent will be own the following -<br>1) They will be responsible for working with finance, supply chain execution, transportation and other Amazon teams to identify pain points and scope out large high impact projects<br>2) They will be responsible for driving cost benefit analysis and go\/no-go decisions on various initiatives<br>3) Once a go decision is made, the program manager will work to evolve a plan and timeline for execution.<br>4) The program manager will develop a roadmap and metrics to measure progress of the initiative they own. They will also own writing reports\/documents that detail the progress to leadership on a frequent basis<br>5) They will liaise across functions to drive their project and help clear issues and bottlenecks.<br>6) They will work with technology teams to scope out and drive any tech changes that are needed<br>Above all, we expect program managers to be single threaded owners for their initiatives. This is a high ownership position where you directly control your destiny.<br>Program Managers will be measured on the impact of their project. Depending on the project, clear financial or other impact goals will be set forth. It is the program manager's responsibility to ensure they drive the program towards achieving those goals.<br>Internal job description<br>Loop competencies<br>Deep Dive, Ownership, Insist on High Standards, Customer Obsession<br>Basic qualifications<br>. 5+ years of experience in program or project management<br>. Experience defining program requirements and using data and metrics to determine improvements<br>. 5+ years of experience working cross functionally with tech and non-tech teams<br>. 5+ years of experience delivering cross functional projects<br>. At least 8 years of experience in a top tier company driving programs or projects.<br>. If you have a MBA from a top tier institute (IIM A\/B\/C\/L, NITIE\/JBIMS\/ISB), 4+ years of experience is a minimum<br>. Supply Chain background preferable but not mandatory. We hire for core skills, not specializations.<br>What are we really looking for?<br>. You should be very analytical and be able to justify your decisions and approaches with data<br>. You should be able to deal with a high degree of ambiguity<br>. You should be able to take a complex problem and break it down to smaller digestible chunks<br>. You should be able to define a logical and step by step approach to achieving a lofty goal<br>. You should be comfortable with processes and process design\/analysis<br>. You should have the ability to influence without authority and do so by using data and facts<br>. You should be able to deal with varied stakeholders and earn their trust.<br>. You are mature and able to function independently with limited guidance<br>. You should have excellent written communication skills - data oriented & brevity being key words in your style of writing<br>Preferred qualifications<br>. You should be very analytical and be able to justify your decisions and approaches with data<br>. You should be able to deal with a high degree of ambiguity<br>. You should be able to take a complex problem and break it down to smaller digestible chunks<br>. You should be able to define a logical and step by step approach to achieving a lofty goal<br>. You should be comfortable with processes and process design\/analysis<br>. You should have the ability to influence without authority and do so by using data and facts<br>. You should be able to deal with varied stakeholders and earn their trust.<br>. You are mature and able to function independently with limited guidance<br>\"}"
}