{
    "id":"Kaggle::techmap::6156f436f148941e20a0f8df::aarp_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"As a part of our continued growth, LKQ is seeking a Drain Technician to join our team! You will be responsible for removing all fluids, lubricants and components as required in a safe and efficient. To excel in this position, you must be able to multitask, communicate well with others, and be very organized in tasks. The ideal candidate needs to be very goal orientated and willing to work at a very fast pace while maintaining the quality and accuracy set forth in the job expectations. If you like growth and working with happy, enthusiastic individuals, you'll enjoy a career with us! Essential Job Duties: Remove all fluids, lubricants and components as required in a safe and efficient manner, as well as prep car for setting on yard. Setting out cars as assigned and recording information on cars set accurately and in a timely manner. Appropriate paperwork filled out as required. Position works closely with lift operator to maximize processing. All containers of parts must be stored in secure area each night. When container full, operator must label and stretch wrap the container. Operator responsible for making sure container is securely stored at shift end. Other duties as assigned. High School graduate or GED equivalent desired. Prior knowledge of automobiles or mechanics preferred. Willingness to be trained and learn company's products and procedures. Basic math and reading skills to perform job tasks and complete necessary paperwork. Ability to follow oral and\/or written instruction. Must possess a safety conscious mindset as you will be working with many different substance While performing the duties of this job, the employee will be regularly exposed to moving mechanical parts. The job requires sitting for relatively long periods of time while driving. The employee should be able to tolerate high and low temperature levels, and occasional inclement driving conditions. The employee is occasionally exposed to extreme cold and extreme heat. The noise level in some work environments is moderately loud. This position requires frequent bending, climbing, moving, and lifting up to 50 pounds. Benefits: * Health\/Dental\/Vision Insurance. Paid Time Off * 401k with Generous Company Match. Company Paid Life Insurance and Long Term Disability. Short Term Disability. Employee Assistance Program. Tuition Reimbursement. Employee Discounts",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156f436f148941e20a0f8df::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"LKQ\", \"position\": \"Fluid Technician\", \"notes\": \"\", \"original\": \"As a part of our continued growth, LKQ is seeking a Drain Technician to join our team! You will be responsible for removing all fluids, lubricants and components as required in a safe and efficient. To excel in this position, you must be able to multitask, communicate well with others, and be very organized in tasks. The ideal candidate needs to be very goal orientated and willing to work at a very fast pace while maintaining the quality and accuracy set forth in the job expectations. If you like growth and working with happy, enthusiastic individuals, you'll enjoy a career with us! Essential Job Duties: * Remove all fluids, lubricants and components as required in a safe and efficient manner, as well as prep car for setting on yard * Setting out cars as assigned and recording information on cars set accurately and in a timely manner. * Appropriate paperwork filled out as required * Position works closely with lift operator to maximize processing * All containers of parts must be stored in secure area each night * When container full, operator must label and stretch wrap the container * Operator responsible for making sure container is securely stored at shift end * Other duties as assigned * High School graduate or GED equivalent desired. * Prior knowledge of automobiles or mechanics preferred * Willingness to be trained and learn company's products and procedures * Basic math and reading skills to perform job tasks and complete necessary paperwork * Ability to follow oral and\/or written instruction * Must possess a safety conscious mindset as you will be working with many different substance While performing the duties of this job, the employee will be regularly exposed to moving mechanical parts. The job requires sitting for relatively long periods of time while driving. The employee should be able to tolerate high and low temperature levels, and occasional inclement driving conditions. The employee is occasionally exposed to extreme cold and extreme heat. The noise level in some work environments is moderately loud. This position requires frequent bending, climbing, moving, and lifting up to 50 pounds. Benefits: * Health\/Dental\/Vision Insurance * Paid Time Off * 401k with Generous Company Match * Company Paid Life Insurance and Long Term Disability * Short Term Disability * Employee Assistance Program * Tuition Reimbursement * Employee Discounts\"}"
}