{
    "id":"Kaggle::techmap::6155c201d198905e9e61621e::monster_us::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Description. KEEPING YOUR ROADS SAFE SINCE 2015. Join our team and immediately become part of one of the leading traffic control and management companies in the PNW. Integrity Traffic is the fastest growing traffic control company, currently in five states and growing fast. Are you ready to make an impact on the lives of others and feel good about what you do? Join our growing Traffic Control team today! Job Summary: Lead Flagger must have a minimum of 961 hours working as a flagger. Flagging is all about safety. Safety for our crew, safety for our customers, and safety for the general public. Flagging is one of the most important jobs around, however it is not for everybody. You must be able to stand in one spot for hours at a time which requires plenty of stamina. At the same time, you must be alert and pay attention to your surroundings. You will perform a wide range of traffic control tasks to provide safety and support to our contractors on job sites or public\/private roadways. Starting Pay: Starting at up to $720\/week, up to $2880\/month. Hours: Monday thru Friday - 25-40 hours\/wk. Job locations in and around Walla Walla\/Hermiston\/Tri-cities areas Metro Area. Growth Structure in place so you know where you are in your advancement. Requirements. Job Duties\/Responsibilities: MUST have be able to set up barricades and traffic cones along active traffic roadways, lifting and moving 50-100Lbs unassisted. MUST be able to remove all signs, barricades and traffic cones upon completion of work, lifting and moving 50-100Lbs unassisted. Have ability use hand-held radios to communicate effectively to direct traffic. Requirements MUST HAVE Driver’s License to operate company vehicles. MUST HAVE valid flagger certification card with minimum of 961 hours worked. Understanding of Safety guidelines. GREAT PLACE FOR GROWTH AND ADVANCEMENT!.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155c201d198905e9e61621e::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Integrity Traffic - SEATTLE METRO\", \"position\": \"Eastern Washington Lead Flagger\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Description<\/p> <p><strong>KEEPING YOUR ROADS SAFE SINCE 2015<\/strong><\/p> <p>Join our team and immediately become part of one of the leading traffic control and management companies in the PNW. Integrity Traffic is the fastest growing traffic control company, currently in five states and growing fast. Are you ready to make an impact on the lives of others and feel good about what you do? Join our growing Traffic Control team today!<\/p> <p><br><\/p> <p><strong>Job Summary:<\/strong><\/p> <p>&nbsp;Lead Flagger must have a minimum of 961 hours working as a flagger. Flagging is all about safety. Safety for our crew, safety for our customers, and safety for the general public. Flagging is one of the most important jobs around, however it is not for everybody. You must be able to stand in one spot for hours at a time which requires plenty of stamina. At the same time, you must be alert and pay attention to your surroundings. You will perform a wide range of traffic control tasks to provide safety and support to our contractors on job sites or public\/private roadways.<\/p> <p><br><\/p> <p><strong>Starting Pay: <\/strong>Starting at &nbsp;up to $720\/week, up to $2880\/month&nbsp;<\/p> <p><strong>Hours:<\/strong> Monday thru Friday - 25-40 hours\/wk<\/p> <p><br><\/p> <p><em><strong>Job locations in and around Walla Walla\/Hermiston\/Tri-cities areas Metro Area<\/strong><\/em><\/p> <p><em><strong>Growth Structure in place so you know where you are in your advancement.<\/strong><\/em><\/p> <p>Requirements<\/p> <p><strong>Job Duties\/Responsibilities:<\/strong><\/p> <ul> <li>MUST have ability to use hand signals and direction signs to direct traffic around road constructions sites<\/li> <li>MUST have be able to set up barricades and traffic cones along active traffic roadways, lifting and moving 50-100Lbs unassisted<\/li> <li>MUST be able to remove all signs, barricades and traffic cones upon completion of work, lifting and moving 50-100Lbs unassisted<\/li> <li>Have ability use hand-held radios to communicate effectively to direct traffic<\/li> <\/ul> <h3><br><\/h3> <h3><strong>Requirements<\/strong><\/h3> <ul> <li>MUST HAVE Driver\\u2019s License to operate company vehicles<\/li> <li>MUST HAVE valid flagger certification card with minimum of 961 hours worked<\/li> <li>Understanding of Safety guidelines<\/li> <\/ul> <p><br><\/p> <p><strong>GREAT PLACE FOR GROWTH AND ADVANCEMENT!<\/strong><\/p> <\/div>\"}"
}