{
    "id":"Kaggle::techmap::615cea8aa8d97976286572c9::linkedin_cl::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Slight masculine-leaning implicit bias from terms such as \"stop at nothing\", \"cutting-edge\", \"strategic direction\"",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" What We Want. Self-directed imitators. People who take ownership of their work and need no prompting to drive productivity, change, and outcomes. Dedicated achievers. People who thrive in a fast-paced environment and will stop at nothing to ensure a project is complete and meets regulations and expectations. Curious learners. People who seek out cutting-edge research and information to expand and enhance their ability to be ready for whats next. Goal-oriented developers. Keeping the customer and requirements squarely in focus, people who deliver safe and robust solutions. Motivated product launchers. People who bring strategic direction and drive for execution to ensure products are developed and launched with precision. What you will do. Possess excellent level of product knowledge and proficiency while working under minimal supervision on complex projects. Wide latitude for independent judgment and management of work load. Promote the growth of Stryker by partnering with local sales, marketing & MPS team members actively identifying potential sales leads. Train and develop Stryker customers and employees to support MAKO business growth and market penetration. Launch new account across in Chile. Clinical support \/Account launch. Serve as a regional MAKO product expert to support local MAKO Product Specialists (MPS) and new account launch. Provide training, ongoing in-services, and customer education to new MAKO accounts. Serve as a MAKO clinical expert and provide product clinical support and guidance to customers. Train physicians and hospital personnel, including Theatre staff, radiology and central sterile processing on the use of the Mako System, accessories, disposables and implants per the Mako released surgical techniques and guides. Provide surgeons and Theatre staff with training and Clinical\/Technical support in the operation of the MAKO robotic arm, its SW applications, associated equipment and instruments to insure delivery of best clinical outcomes. Use proprietary software to prepare pre-operative CT scans for use in conjunction with the company's Robotic Arm, assists surgeon in preoperative robotic procedure surgical planning. Support local MPS in solving product problems at local accounts in an expeditious manner. Serve as a backup to support case coverage in the region. Support the development and execution of the sales plan as well as grow the utilization of the Mako system by customer training and education with an objective to increase procedure volume with current and potential surgeons.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615cea8aa8d97976286572c9::linkedin_cl\", \"source\": \"linkedin_cl\", \"country\": \"CL\", \"company\": \"Stryker\", \"position\": \"Product Specialist, MAKO\", \"notes\": \"\", \"original\": \"<strong><u>What We Want<br><\/u><\/strong><ul><li>Self-directed imitators. People who take ownership of their work and need no prompting to drive productivity, change, and outcomes.<\/li><li>Dedicated achievers. People who thrive in a fast-paced environment and will stop at nothing to ensure a project is complete and meets regulations and expectations.<\/li><li>Curious learners. People who seek out cutting-edge research and information to expand and enhance their ability to be ready for what\\u2019s next.<\/li><li>Goal-oriented developers. Keeping the customer and requirements squarely in focus, people who deliver safe and robust solutions.<\/li><li>Motivated product launchers. People who bring strategic direction and drive for execution to ensure products are developed and launched with precision.<br><\/li><\/ul><em><strong>What you will do<br><br><\/strong><\/em>Possess excellent level of product knowledge and proficiency while working under minimal supervision on complex projects.<br><ul><li>Wide latitude for independent judgment and management of work load.<\/li><li>Promote the growth of Stryker by partnering with local sales, marketing &amp; MPS team members actively identifying potential sales leads.<\/li><li>Train and develop Stryker customers and employees to support MAKO business growth and market penetration<\/li><li>Launch new account across in Chile.<br><\/li><\/ul><strong><u>Clinical support \/Account launch<br><br><\/u><\/strong>Serve as a regional MAKO product expert to support local MAKO Product Specialists (MPS) and new account launch. Provide training, ongoing in-services, and customer education to new MAKO accounts. Serve as a MAKO clinical expert and provide product clinical support and guidance to customers.<br><ul><li>Train physicians and hospital personnel, including Theatre staff, radiology and central sterile processing on the use of the Mako System, accessories, disposables and implants per the Mako released surgical techniques and guides<\/li><li>Provide surgeons and Theatre staff with training and Clinical\/Technical support in the operation of the MAKO robotic arm, its SW applications, associated equipment and instruments to insure delivery of best clinical outcomes.<\/li><li>Use proprietary software to prepare pre-operative CT scans for use in conjunction with the company's Robotic Arm, assists surgeon in preoperative robotic procedure surgical planning.<\/li><li>Support local MPS in solving product problems at local accounts in an expeditious manner.<\/li><li>Serve as a backup to support case coverage in the region.<\/li><li>Support the development and execution of the sales plan as well as grow the utilization of the Mako system by customer training and education with an objective to increase procedure volume with current and potential surgeons.<\/li><li>Actively sell the clinical benefits of the products, and build strong, positive relationships with key surgeons and Theatre staff at Stryker Asia accounts.<\/li><li>Mentor and certify new local MPS\\u2019s by delivering on job training and guidance following company\\u2019s policies.<br><\/li><\/ul><strong><u>Marketing\/ Clinical training and education<br><br><\/u><\/strong>Support the development and delivery of training and education programs for Stryker employees and regional customers on MAKO products. Partner with regional sales and marketing leaders in regional and local MAKO promotional efforts.<br><ul><li>Support MAKO Clinical Education and Training for Stryker Chile. Responsibilities may include MPS training, Surgeons and hospital staff and other Stryker colleagues<\/li><li>Faculty engagement, course agenda, development of course curriculum in coordination with US training, delivery of training.<\/li><li>Support development preparation and delivery of MAKO cadaveric courses and surgeon certifications<\/li><li>Collaborate with regional training teams in communications and negotiations with government and professional bodies to ensure the accreditation of courses as needed<\/li><li>Support the development of regional MAKO KOL\\u2019s and clinical experts<\/li><li>Communication and coordination with MAKO US clinical training team, to delivery current and accurate training programs.<\/li><li>Support regional sales and marketing efforts through the delivery of road-show product demonstrations and participation in local and regional marketing and clinical conferences. Provide potential customers with opportunity to experience product in use and explain its clinical value.<br><\/li><\/ul><em><strong>What you will need<br><\/strong><\/em><ul><li>Bachelor\\u2019s Degree in a related technical or clinical field of study, with a minimum of three years of experience in clinical field<\/li><li>Excellent control of English (Speak, Read, Write, Use of computer and MS Office tools)<\/li><li>Demonstrate ability to communicate with all levels of a medical department (Head of Dept., surgeons, nurses, surgical techs, central sterile processing techs, radiology)<\/li><li>Ability to work in a team oriented environment with excellent interpersonal and communication skills<\/li><li>Highly experienced in clinical and surgical support, comfortable in Operating Room environment and guidance of surgeons and clinical staff<\/li><li>Self-motivated, detail oriented and a proven history of ability to make independent decisions in a fast-paced, dynamic business environment<\/li><li>Able to develop and deliver training and education programs to Stryker peers.<\/li><li>Must maintain current credentials as required by MAKO clinical training department<\/li><li>Proven track record in clinical sales or marketing, preferably with orthopaedic device<\/li><li>Travel may vary 50% up to 80% depending on assignment with extended working hours.<\/li><\/ul>\"}"
}