{
    "id":"Kaggle::techmap::614f2492af2517474778cb60::linkedin_cn::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 6 years combined experience in at least four of the following technical areas: Telematics and IoT SW solutions including application framework, SDKs. Experience in an open-source application framework and middleware (e. g., Android \/ Legato \/ TAO \/ Macchina. io ) for embedded Linux to facilitate platform approaches to maximize the leverage, re-use, and life cycle management. Familiar with 2G\/3G\/4G\/5G cellular technologies (GSM\/WCDMA\/LTE\/5G NR). Familiar with UICC\/SIM\/USIM. Familiar with Pan EU e. Call and ERA-Glonass. Experience in GNSS and other Precision Positioning and Navigation Techniques like DR, RTK, PPP. Experience in Automotive related industrial solutions. e. g., CV2X\/DSRC\/CAN\/Adaptive AutoSAR\/SOMEIP\/AGL. Hands on experiences with wireless protocol analysis. e. g., locate issues with QXDM\/QCAT\/etc. Cryptography, secure coding, Linux Mandatory Access Control, secure boot, and ARM TrustZone. Hands-on experience on telematics module product security from design to deployment. Experience with SW update solutions UBI and Linux file systems. Knowledge about IDL and the code generation is a plus or familiar with the Lexer or parser. Work experience with Qualcomm Linux-enabled Telematics chipsets. years incrementally established customer facing skills and external partner collaboration skills. 5 years work experience in embedded software development in C and C. on ARM and\/or driver and BSP development on Linux. years of C experience. Linux development experiences including IPC\/RPC\/UDS\/Client-Server model and basic driver framework knowledge, familiar with Yocto build. Experience in multi-threads, signals, priorities, deadlocks, stacks, interrupt, memory management, scheduler, synchronization methods, etc. Strong debugging skills with experience on debugging with Lauterbach JTAG debugger, GDB, logging tools, call boxes, smart power supplies etc. Track record of resolving critical and challenging technical issues, preferably with NAD modules projects. English communication skills (written and verbal), working with teams across multiple time zones. Basic working knowledge of telematics module or IoT module HW designs and hands-on experience with development board to triage test setup, HW\/SW failure identification, and basic connectivity issues. Education Requirements. Required: Bachelor's, Computer Science, Computer Engineering, Electrical Engineering, or relevant field. Preferred: Master's, Computer Science, Computer Engineering, Electrical Engineering, or relevant field. Physical Requirements. Frequently transports between offices, buildings, and campuses up to  mile. Frequently transports and installs equipment up to 5 lbs. Performs required tasks at various heights (e. g., standing or sitting).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f2492af2517474778cb60::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"\\u9ad8\\u901a\", \"position\": \"TelAF support lead and TelAF services development\", \"notes\": \"\", \"original\": \"<strong><u>Company<br><br><\/u><\/strong>Qualcomm China<br><br><br><br><strong><strong>Job Area:<\/strong><\/strong>Engineering Group, Engineering Group &gt; Software Engineering<br><br><strong><u>General Summary<br><br><\/u><\/strong>Develops, creates, and modifies general computer applications software or specialized utility programs. Analyzes user needs and develops software solutions. Designs software or customizes software for client use with the aim of optimizing operational efficiency. May analyze and design databases within an application area, working individually or coordinating database development as part of a team. Modifies existing software to correct errors, allow it to adapt to new hardware, or to improve its performance. Analyzes user needs and software requirements to determine feasibility of design within time and cost constraints. Confers with systems analysts, engineers, programmers and others to design system and to obtain information on project limitations and capabilities, performance requirements and interfaces. Stores, retrieves, and manipulates data for analysis of system capabilities and requirements. Designs, develops, and modifies software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of design.<br><br><strong><u>The Responsibilities Of This Role Include<br><\/u><\/strong><ul><li> Working independently with little supervision.<\/li><li> Making decisions that are moderate in impact; errors may have financial impact or effect on projects, operations, or customer relationships; errors may require involvement beyond immediate work group to correct.<\/li><li> Using verbal and written communication skills to convey complex and\/or detailed information to multiple individuals\/audiences with differing knowledge levels. May require strong negotiation and influence, communication to large groups or high-level constituents.<\/li><li> Having a moderate amount of influence over key organizational decisions (e.g., is consulted by senior leadership to provide input on key decisions).<\/li><li> Completing tasks that do not have defined steps; simultaneous use of multiple mental abilities is generally required to determine the best approach; mistakes may result in significant rework.<\/li><li> Exercising substantial creativity to innovate new processes, procedures, or work products within guidelines or to achieve established objectives.<\/li><li> Using deductive and inductive problem solving; multiple approaches may be taken\/necessary to solve the problem; often information is missing or conflicting; advanced data analysis and interpretation skills are required.<\/li><li> Occasionally participates in strategic planning within own area affecting immediate operations.<br><br><\/li><\/ul><strong><u>The Responsibilities Of This Role Do Not Include<br><\/u><\/strong><ul><li> Financial accountability (e.g., does not involve budgeting responsibility).<br><br><\/li><\/ul>Principal Duties &amp; Responsibilities<br><ul><li> Gathers, integrates, and interprets information across modules or sub-blocks of code from a variety of sources in order to troubleshoot issues and find solutions.<\/li><li> Quickly resolves highly complex software issues and bugs.<\/li><li> Communicates with project lead to provide status and information about impending obstacles and suggests remediation.<\/li><li> Collaborates with others inside and outside of project team to accomplish project objectives.<\/li><li> Identifies gaps in design, effort, etc., and closes the gaps.<\/li><li> Suggests strategies for solving issues during technical meetings.<\/li><li> Unit tests own code and performs integration testing to verify the stability and functionality of a large feature.<\/li><li> Serves as a technical leader within area of focus.<\/li><li> Manages project priorities, deadlines, and deliverables for small projects.<\/li><li> Performs code reviews on project team's submitted solutions.<br><br><\/li><\/ul><strong><u>Job Overview<br><br><\/u><\/strong>Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.<br><br><strong><u>Some Of The Initial Key Responsibilities Include The Following<br><br><\/u><\/strong>This position requires hands-on system software design and problem-solving skills and will take on a primary role in supporting global 4G\/5G NAD module customers (Tier 1s and OEMs) to integrate Telematics Application Framework solution provided by Qualcomm. In addition, this position will be involved in planning\/designing of system software architecture and solutions for Linux-based telematics NAD module working with internal teams, Tier1s, OEMs and industry partners. This position will take on roles of \\u201cdevelopment engineer\\u201d and \\u201csupport engineering lead\\u201d as the technical solutions especially the Telematics Application Framework (TelAF) is adopted by NAD module customers and partners.<br><ul><li>Work closely with the internal development team and systems team to provide TelAF system architecture and integration support to NAD module customers including Tier 1s and OEMs.<\/li><li>Work with QC partners and customers to identify end customer needs, break down to requirements, align with internal plan, and track key program deliverables.<\/li><li>Develop TelAF services and APIs (e.g., Cellular communication, GNSS and location services, C-V2X, SIM and connectivity management, eCAll) to allow customers to develop Telematics applications and beyond.<\/li><li>Develop sample Telematics applications on top of TelAF<\/li><li>Work on assignments that require theoretical and practical knowledge in the areas of C\/C++ programming and interfacing with operating systems<br><br><\/li><\/ul><strong><u>Minimum Qualifications<br><br><\/u><\/strong>Bachelor's degree in Computer Engineering, Computer Science, Electrical Engineering, or related field.<br><br><strong><u>Preferred Qualifications<br><br><\/u><\/strong>6+ years\\u2019 combined experience in at least four of the following technical areas:<br><ul><li>Telematics and IoT SW solutions including application framework, SDKs. Experience in an open-source application framework and middleware (e.g., Android \/ Legato \/ TAO \/ Macchina.io ) for embedded Linux to facilitate platform approaches to maximize the leverage, re-use, and life cycle management.<\/li><li>Familiar with 2G\/3G\/4G\/5G cellular technologies (GSM\/WCDMA\/LTE\/5G NR)<\/li><li>Familiar with UICC\/SIM\/USIM<\/li><li>Familiar with Pan EU eCall and ERA-Glonass<\/li><li>Experience in GNSS and other Precision Positioning and Navigation Techniques like DR, RTK, PPP.<\/li><li>Experience in Automotive related industrial solutions. e.g., CV2X\/DSRC\/CAN\/Adaptive AutoSAR\/SOMEIP\/AGL<\/li><li>Hands on experiences with wireless protocol analysis. e.g., locate issues with QXDM\/QCAT\/etc. <\/li><li>Cryptography, secure coding, Linux Mandatory Access Control, secure boot, and ARM TrustZone. Hands-on experience on telematics module product security from design to deployment.<\/li><li>Experience with SW update solutions UBI and Linux file systems.<\/li><li>Knowledge about IDL and the code generation is a plus or familiar with the Lexer or parser.<\/li><li>Work experience with Qualcomm Linux-enabled Telematics chipsets.<br><br><\/li><\/ul>3+ years incrementally established customer facing skills and external partner collaboration skills<br><br>5+ years\\u2019 work experience in embedded software development in C and C++ on ARM and\/or driver and BSP development on Linux. 2+ years of C++ experience.<br><br>3+ Linux development experiences including IPC\/RPC\/UDS\/Client-Server model and basic driver framework knowledge, familiar with Yocto build. Experience in multi-threads, signals, priorities, deadlocks, stacks, interrupt, memory management, scheduler, synchronization methods, etc.<br><br>Strong debugging skills with experience on debugging with Lauterbach JTAG debugger, GDB, logging tools, call boxes, smart power supplies etc. Track record of resolving critical and challenging technical issues, preferably with NAD modules projects.<br><br>English communication skills (written and verbal), working with teams across multiple time zones<br><br>Basic working knowledge of telematics module or IoT module HW designs and hands-on experience with development board to triage test setup, HW\/SW failure identification, and basic connectivity issues.<br><br>Education Requirements<br><br>Required: Bachelor's, Computer Science, Computer Engineering, Electrical Engineering, or relevant field<br><br>Preferred: Master's, Computer Science, Computer Engineering, Electrical Engineering, or relevant field<br><br><strong><u>Physical Requirements<br><\/u><\/strong><ul><li> Frequently transports between offices, buildings, and campuses up to \\u00bd mile.<\/li><li> Frequently transports and installs equipment up to 5 lbs.<\/li><li> Performs required tasks at various heights (e.g., standing or sitting).<\/li><li> Monitors and utilizes computers and test equipment for more than 6 hours a day.<\/li><li> Continuous communication which includes the comprehension of information with colleagues, customers, and vendors both in person and remotely.<br><br><\/li><\/ul><strong><u>Education<br><br><\/u><\/strong><strong>Minimum Qualifications<br><br><\/strong>Bachelors - Computer Science, Bachelors - Engineering, Bachelors - Information Systems<br><br><strong><u>Work Experiences<br><br><\/u><\/strong>2+ years experience with Programming Language such as C, C++, Java, Python, etc., 5+ years of Software Engineering or related work experience<br><br><strong><u>Skills<br><br><\/u><\/strong><u>Certifications:<br><br><\/u><strong><u>Education<br><br><\/u><\/strong><strong>Preferred Qualifications<br><br><\/strong><strong><u>Work Experiences<br><br><\/u><\/strong>1+ years of work experience in a role requiring interaction with senior leadership (e.g., Director level and above). ,3+ years experience working in a large matrixed organization. ,3+ years experience with API. ,3+ years experience with Database Management Software. ,8+ years Software Engineering or related work experience.<br><br><strong><u>Skills<br><br><\/u><\/strong>Mathematical Methods, Object-Oriented Programming (OOP), Scientific Analysis, Software Development Lifecycle (SDLC), Software Solutions<br><br>All Qualcomm employees are expected to actively support diversity on their teams, and in the Company.<br><br><strong>Applicants<\/strong>: If you are an individual with a disability and need an accommodation during the application\/hiring process, please call Qualcomm\\u2019s toll-free number found here for assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. Qualcomm is an equal opportunity employer and supports workforce diversity.<br><br><strong>To all Staffing and Recruiting Agencies<\/strong>:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes\/applications.<br><br>If you would like more information about this role, please contact Qualcomm Careers .\"}"
}