{
    "id":"Kaggle::techmap::613d61064101556d51cf2ce4::linkedin_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Empower individuals to speak out for themselves, initiate ideas, and exercise choice about needed supports. Provide for normal developmental experiences by informing and encouraging individuals to participate in social and cultural activities in the community. Performs other job related projects and activities as requested or directed. Bachelors Degree in Human Services or a related field preferred. Have previous supervisory experience\/demonstrated ability with residential staff. Have background in Human Services with strong communication, negotiation and interpersonal skills (Minimum 3 years of relevant work). First Aid, CPR, Participation in Medication Administration Program, Fire Safety, and Human Rights Training. Individual is required to meet safe driver guidelines as established by employers insurance carrier. CRJ provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613d61064101556d51cf2ce4::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Community Resources For Justice (CRJ)\", \"position\": \"House Manager\", \"notes\": \"\", \"original\": \"At Community Resources for Justice we change lives and strengthen communities by advancing policy and delivering individualized services that promote safety, justice, and inclusion.<br><br>CRJ is a unique, 140 year old Boston-based nonprofit organization that provides direct care as well as research\/consulting services within the areas of the Mental Health and the Criminial Justice field. Our three divisions, Social Justice Services, Community Strategies, and the Crime and Justice Institute are recognized for their effectiveness and contributions to this important work.<br><br>Within Community Stategies (CS) we support men and women with intellectual and developmental disabilities. CS provides specialized services from Day Programs, Shared Living arrangements with providers as well as over 40 community-based group homes. As we aim on expanding our workforce as well as services to our clients we are hiring a <strong>House Manager<\/strong> to be responsible for the day-to-day operations of an individual program.<br><br>CRJ offers competetive pay and excellent benefits (Flexible scheduling, 401K with match, Tuition Reimbursement\/Remission, Paid Time off (Vacation\/Sick), Medical, Dental, Vision, FSA\/HRA, Employee Perks, and much more.)<br><br>The <strong>House Manager<\/strong> is responsible for the smooth day-to-day operations and administration of the program including running the program, submitting reports, directing staff, training, scheduling, etc. This is a hands-on supervisory position in which this House Manager will not only supervise the Direct Care Staff, but also actively provide support for the three residents including participating in medication administration and helping with any medical incidents that may occur.<br><br><strong>Duties\/Responsibilities<br><\/strong><ul><li>Provide for the staffing and operation of a specific residence, including hiring and scheduling staff, budgeting, shopping, cleaning etc. Insure individuals maintain a clean, safe and healthy home environment.<\/li><li>Implement all ISP objectives for Residential and CPS as well as ADL\\u2019s.<\/li><li>Facilitate communications between Service Coordinators, other Community Strategies staff, family members and other relevant parties.<\/li><li>Evaluate staff performance at least annually and provide on-going supervision to all staff.<\/li><li>Insure that complete and appropriate individual records are maintained in accordance with DHHS and Community Strategies regulations and policies.<\/li><li>Foster good relations with neighbors, local merchants and the community at large to promote a better living standard for individuals living with mental retardation.<\/li><li>Insure that personal, medical and nursing care, behavior plans, teaching programs and other services are delivered by program staff in an appropriate and consistent manner.<\/li><li>Empower individuals to speak out for themselves, initiate ideas, and exercise choice about needed supports. Provide for normal developmental experiences by informing and encouraging individuals to participate in social and cultural activities in the community.<\/li><li>Performs other job related projects and activities as requested or directed.<\/li><li>Bachelor\\u2019s Degree in Human Services or a related field preferred<\/li><li>Have previous supervisory experience\/demonstrated ability with residential staff. <\/li><li>Have background in Human Services with strong communication, negotiation and interpersonal skills (Minimum 3 years of relevant work)<\/li><li>First Aid, CPR, Participation in Medication Administration Program, Fire Safety, and Human Rights Training<\/li><li>Individual is required to meet safe driver guidelines as established by employer\\u2019s insurance carrier<br><\/li><\/ul><em>CRJ provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws.<\/em>\"}"
}