{
    "id":"Kaggle::techmap::6155b0d438cdb97c28e0e392::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"\"kind, caring\" is mentioned twice and this is feminine leaning language",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Permanent Full & Part Time Clinical Support Specialists. We are looking for two enthusiastic and proactive Health professionals (OTs, Physiotherapists, Social Workers and RNs) with knowledge and\/or experience in TBIs (traumatic brain injuries) and complex PTSD or similar relevant experience, preferably within the community. The higher than normal remuneration for this role reflects the complexities of the role and the clinical skills required to support the client to live a fun and meaningful life with her brain injury related challenges. Rates range from $44 - $66 per hour. Understanding of TBI and Complex PTSD and how this can affect a persons ability to function is essential to be able to help the client to compensate for the challenges following her injury. You will assist the client with all her activities of daily living in her own home. The client is mobile and active in her community. She regular participates in voluntary work and social activities. This is an exciting role for a Health professional who is looking to expand or diversify their profile by being part of a team providing 24-hour support and care to the client. The role is more practice based and practical, supporting a female who requires assistance with her daily tasks and activities, following a brain injury, with minimal administration requirements and no report writing! The successful candidate will have a kind and caring nature, remain calm under pressure, comfortable around dogs and enjoy working independently as well as part of a dynamic team. Become part of the fantastic support team that helps her to live as meaningful a life as possible following her injury. You must be willing to work up to 3 shifts a week and be flexible with additional shifts if required. Shifts are 12 hours shifts  1-hour handover, 7 days per week, with both weekend\/weekday and day. ight awake shifts available. The successful candidate must be willing to work weekends and public holidays if required. The successful candidate: Applicant must be a qualified Health Professional e. g. Social Worker, Occupational Therapist, Physiotherapist, Nurse and associated allied health professionals. A minimum of 3 years of experience in working with traumatic brain injury and trauma as a Health Professional is required. Community experience will be an advantage. A friendly, professional manner with good written and oral communication skills and a kind, caring and gentle approach is essential.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155b0d438cdb97c28e0e392::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"tlc4u2 Ltd\", \"position\": \"Social workers, RNs, OTs, Psychotherapists, Health Professionals TBI experience\", \"notes\": \"\", \"original\": \"<p><strong>Permanent Full &amp; Part Time Clinical Support Specialists<\/strong><\/p><p>We are looking for two enthusiastic and proactive Health professionals (OT\\u2019s, Physiotherapists, Social Workers and RN\\u2019s) with knowledge and\/or experience in TBI\\u2019s (traumatic brain injuries) and complex PTSD or similar relevant experience, preferably within the community.<\/p><p>The higher than normal remuneration for this role reflects the complexities of the role and the clinical skills required to support the client to live a fun and meaningful life with her brain injury related challenges. Rates range from $44 - $66 per hour.<\/p><p>Understanding of TBI and Complex PTSD and how this can affect a person\\u2019s ability to function is essential to be able to help the client to compensate for the challenges following her injury. You will assist the client with all her activities of daily living in her own home.<\/p><p>The client is mobile and active in her community. She regular participates in voluntary work and social activities.<\/p><p>This is\\u00a0an\\u00a0exciting role for a Health professional who is looking to expand or diversify their profile by being part of a team providing 24-hour support and care to the client. The role is more practice based and practical, supporting a female who requires assistance with her daily tasks and activities, following a brain injury, with minimal administration requirements and no report writing!<\/p><p>The successful candidate will have a kind and caring nature, remain calm under pressure, comfortable around dogs and enjoy working independently as well as part of a dynamic team. Become part of the fantastic support team that helps her to live as meaningful a life as possible following her injury.<\/p><p>You must be willing to work up to 3 shifts a week and be flexible with additional shifts if required. Shifts are 12 hours shifts + 1-hour handover, 7 days per week, with both weekend\/weekday and day\/night awake shifts available. The successful candidate must be willing to work weekends and public holidays if required.<\/p><p>The successful candidate:<\/p><ul><li>Applicant must be a qualified Health Professional\\u00a0 e.g. Social Worker, Occupational Therapist, Physiotherapist, Nurse and associated allied health professionals.<\/li><li>A minimum of 3 years of experience in working with traumatic brain injury and trauma as a Health Professional is required. Community experience will be an advantage.<\/li><li>A friendly, professional manner with good written and oral communication skills and a kind, caring and gentle approach is essential.<\/li><li>We require reliable people with excellent organisational skills who can manage time and routines well, who have initiative, excellent critical thinking and a common-sense approach to the role.<\/li><li>You must be able to work as part of a dynamic team and independently, with an ability to work in a complex and changing environment<\/li><li>A moderate level of fitness is required<\/li><li>You must be 25 years of age and above with a full clean driver licence, as you will be driving the client\\u2019s car.<\/li><li>You must have NZ residency or a valid NZ work visa<\/li><\/ul><p>Full training and a comprehensive induction and orientation package will be provided to the successful candidate.<\/p><p>To apply, please attach your CV and a cover letter outlining why you feel you would be suitable. As part of our recruitment process we also require a completed application form which will be emailed out to you upon receipt of your application. For further details regarding this position please email\\u00a0recruitment@tlc4u2.co.nz\\u00a0\\u00a0\\u00a0<\/p>\"}"
}