{
    "id":"Kaggle::techmap::61450e8a25ebeb318fa4929b::linkedin_be::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" CRM Technical Consultant (M\/F) Brussels. Are you a strong relationship builder with a first experience in the software industry? Do you have strong development skills and want to interact more with customers from a functional perspective? Then you are probably the right fit to become our CRM Technical Consultant in Brussels. You will be part of the company's project department under supervision of a Team Leader and will be in charge of carrying out consulting services. Your missions. Not a day is the same at Efficy. As a CRM Technical Consultant, you have an important role to play for our customers and within our project delivery team. Thanks to your technical skills, you will implement and configure our Efficy solution on your own for our smaller projects. You will also have the opportunity to be part of bigger projects teams under the responsibility of a Project Manager and working together with other consultants and\/or analysts and\/or developers. Your daily tasks will be diverse and look like these: Collect, identify and analyse the business requirements. Write detailed functional specifications. Advise the client in the expression of his needs. Programming and configuration based on functional analysis (including unit testing). Configuration of the application database & application database on clients servers. Support the customer during the testing phase. Write technical specifications\/documentation if needed. Assist to technical meetings with the client if required. Profile. As you are often in contact with our customers, you represent the company. Therefore, we expect the following minimum requirements: You have a bachelor or master degree in IT and\/or relevant experience. 3 years of experience in a similar position or as a senior developer. You are motivated and solution-oriented. Autonomous and responsible. Leadership and good communicator. Spirit of analysis and synthesis. Knowledge of CRM, accounting and business systems is an asset. Knowledge of Dutch and English is required. Expected technical knowledge. Back. and frontend webdevelopment. JavaScript\/Ajax\/JQuery. SQL. SOAP\/JSON\/Webservices. HTML\/CSS (Native and SaSS). Browser debugging, experience troubleshooting cross-browser compatibility issues. Server side debugging. What do we offer? Of course, you will be well rewarded for bridging the gap to make sure the project team can deliver the best projects for our customers.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61450e8a25ebeb318fa4929b::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"Efficy\", \"position\": \"CRM Technical Consultant\", \"notes\": \"\", \"original\": \"<p><strong>CRM Technical Consultant (M\/F) Brussels<\/strong><\/p><p><br><\/p><p>Are you a strong relationship builder with a first experience in the software industry? Do you have strong development skills and want to interact more with customers from a functional perspective?<\/p><p>Then you are probably the right fit to become our CRM Technical Consultant in Brussels. You will be part of the company's project department under supervision of a Team Leader and will be in charge of carrying out consulting services.<\/p><p><br><\/p><p><strong>Your missions<\/strong><\/p><p>Not a day is the same at Efficy. As a CRM Technical Consultant, you have an important role to play for our customers and within our project delivery team. Thanks to your technical skills, you will implement and configure our Efficy solution on your own for our smaller projects. You will also have the opportunity to be part of bigger projects teams under the responsibility of a Project Manager and working together with other consultants and\/or analysts and\/or developers.<\/p><p>Your daily tasks will be diverse and look like these:<\/p><ul><li>Collect, identify and analyse the business requirements.<\/li><li>Write detailed functional specifications.<\/li><li>Advise the client in the expression of his needs.<\/li><li>Programming and configuration based on functional analysis (including unit testing)<\/li><li>Configuration of the application database &amp; application database on client\\u2019s servers<\/li><li>Support the customer during the testing phase<\/li><li>Write technical specifications\/documentation if needed<\/li><li>Assist to technical meetings with the client if required<\/li><\/ul><p><br><\/p><p><strong>Profile<\/strong><\/p><p>As you are often in contact with our customers, you represent the company. Therefore, we expect the following minimum requirements:<\/p><ul><li>You have a bachelor or master degree in IT and\/or relevant experience<\/li><li>3 years of experience in a similar position or as a senior developer<\/li><li>You are motivated and solution-oriented.<\/li><li>Autonomous and responsible.<\/li><li>Leadership and good communicator.<\/li><li>Spirit of analysis and synthesis.<\/li><li>Knowledge of CRM, accounting and business systems is an asset<\/li><li>Knowledge of Dutch and English is required<\/li><\/ul><p><br><\/p><p><strong>Expected technical knowledge<\/strong><\/p><ul><li>Back- and frontend webdevelopment<\/li><li>JavaScript\/Ajax\/JQuery<\/li><li>SQL<\/li><li>SOAP\/JSON\/Webservices<\/li><li>HTML\/CSS (Native and SaSS)<\/li><li>Browser debugging, experience troubleshooting cross-browser compatibility issues<\/li><li>Server side debugging<\/li><\/ul><p><br><\/p><p><strong>What do we offer?<\/strong><\/p><p>Of course, you will be well rewarded for bridging the gap to make sure the project team can deliver the best projects for our customers. This starts as early as your first day, where you end up within a close and well-attuned team that are all <strong>passionate and motivated<\/strong> to deliver the best CRM to demanding and inspiring customers.<\/p><p>Our values '<strong>Openness<\/strong>', '<strong>Efficiency<\/strong>' and <strong>'We care' <\/strong>do not only apply to our customers, but of course also to our employees. You will therefore work in one of our spacious offices where relaxation areas, a weekly fruit basket and quality coffee are standard.<\/p><p>And it goes without saying that there is plenty of room for a healthy work-life balance. As we are a company in full growth, you are in control of your own future.&nbsp;<\/p><p>Last but not least, we offer fun... <strong>a lot of fun<\/strong>! Besides ending up in an office with a pool table, we organize game nights and themed meals, as well as <em>'End of Year Challenges'<\/em> and the now famous annual trip.<\/p><p>&nbsp;<\/p><p><strong>Who are we? <\/strong><\/p><p>Based in 15 countries the Efficy Group is a key player in the CRM (Customer Relationship Management) market. We have already attracted 13.500 customers. And we don't intend to stop there. Our ambition? To become the #EuropeanCRMChampion.<\/p><p>Joining the Efficy Group means taking part in an exciting and stimulating adventure.<\/p><p>Interested in joining us to build the future of our company ? Now, it\\u2019s up to you!<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>\"}"
}