{
    "id":"Kaggle::techmap::61460268346445385b1a8ae3::linkedin_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Able to lift, push and pull up to 50 pounds. Able to stand on your feet for up to 8 hours.\" lacks clarification about reasonable accommodations ",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Ensures communications are filtered to the team as directed by the Store Manager and Associate Manager  Ops. Acts to reduce LP and product returns\/damages. Alerts the Store Manager or Associate Manager  Ops to any concerns immediately. Assist with management of the schedule. Manages changes to posted schedules to maintain optimal schedules that provide the best customer service is provided. Reviews and approves Timekeeping records for the staff as needed. Assists in maintaining record keeping standards. Assists with merchandising updates and management of in-store inventory levels. Assists with visual displays and executes the floor set with precision and on time. Assists in maintaining the production space, where applicable. Ensure consistent standards of cleanliness, maintenance and organization. Provide feedback to the Store Manager to inform improvements that are needed. Qualifications. 3-5 years retail experience including some management, previous sales experience required. Excellent customer service, communication and organizational skills. Proven operation excellence. Passion for Makeup and cosmetic artistry experience preferred. Proficiency in Word, Excel, email and computer savvy. Demonstrated ability to independently solve moderate to complex problems. Demonstrates flexibility and initiative with minimal direction. Demonstrated ability to support business growth and exhibit professional behavior. Have and maintain flexible availability. Must have open flexibility to work during peak traffic times including evenings, weekends and holidays. Able to lift, push and pull up to 50 pounds. Able to stand on your feet for up to 8 hours. Must be able to perform essential functions (with or without an accommodation) without posing a \"direct threat\" to the health and safety to self or others. The Company reserves the right to alter, change, abolish and even combine jobs depending upon changing conditions. Morphe is committed to providing equal opportunities to all qualified individuals looking to join this dynamic organization. Should any individual require accommodation during the interview process, please inform the talent acquisition team. No recruitment agencies, please.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61460268346445385b1a8ae3::linkedin_ca\", \"source\": \"linkedin_ca\", \"country\": \"CA\", \"company\": \"Morphe\", \"position\": \"Assistant Store Manager - Square One Shopping Centre\", \"notes\": \"\", \"original\": \"The Assistant Store Manager assists in driving sales and operations through exceptional customer service; motivating high performance people, and driving profitable growth &amp; achievement of financial goals and KPI\\u2019s such as brand expression, engagement, retention, conversion, payroll, and inventory. The Assistant Manager is an integral part of the selling floor and backroom, focusing on the service provided to the Morphe babes visiting the store and also ensuring the store operations are being run smoothly and accurately to the Morphe standard.<br><br><strong>Sales<br><\/strong><ul><li>Responsible for driving sales to meet or exceed targets and assisting the Manager in meeting all store financial goals.<\/li><li>Executes and drives traffic for company driven promotions and launches to meet and exceed sales targets and deliver the best experience possible for customers.<\/li><li>Assist with local events ensuring a successful execution as directed by the Store Manager.<br><\/li><\/ul><strong>Service<br><\/strong><ul><li>Prioritize time in store on the selling floor; coaching and developing the team; and leading by example.<\/li><li>Positive representative of the Morphe brand.<\/li><li>Deliver the full Morphe customer service experience, catering to the customers\\u2019 needs in store and optimizing makeup stations and makeup studios, where applicable.<\/li><li>Consistently elevate their own artistry skills and the artistry skills of the team.<\/li><li>Develops knowledge of trends in industry to provide best service possible and share with the squad.<br><\/li><\/ul><strong>Leadership<br><\/strong><ul><li>Assists the Store Manager with people management in store, recruiting, training, counseling and developing top talent to grow within the organization. <\/li><li>Participate and advocate for all trainings, support all trainings and assist the Store Manager in ensuring they were delivered on brand and the desired artistry and service knowledge\/skills were built with every employee in store. Facilitate trainings for store team as assigned.<\/li><li>Responsible to support a productive and dynamic Morphe squad by connecting with employees, customers, and influencers. These must be strong relationships and connections founded on the common passion for makeup.<\/li><li>Confident and skillful coach and manager to the team. Comfortable navigating difficult conversation, with professionalism, poise and kindness; actively provide coaching and feedback to develop employees in their position and help them grow.<\/li><li>Creates an environment where clear and fair expectations are set and all employees are treated with respect.<\/li><li>Step in to fulfill responsibilities of Store Manager or Associate Manager \\u2013 Ops as needed.<br><\/li><\/ul><strong>Operations<br><\/strong><ul><li>Responsible for knowing, following and administering all company policies and procedures.<\/li><li>Ensures communications are filtered to the team as directed by the Store Manager and Associate Manager \\u2013 Ops.<\/li><li>Acts to reduce LP and product returns\/damages. Alerts the Store Manager or Associate Manager \\u2013 Ops to any concerns immediately.<\/li><li>Assist with management of the schedule. Manages changes to posted schedules to maintain optimal schedules that provide the best customer service is provided.<\/li><li>Reviews and approves Timekeeping records for the staff as needed. Assists in maintaining record keeping standards.<\/li><li>Assists with merchandising updates and management of in-store inventory levels. <\/li><li>Assists with visual displays and executes the floor set with precision and on time.<\/li><li>Assists in maintaining the production space, where applicable.<\/li><li>Ensure consistent standards of cleanliness, maintenance and organization.<\/li><li>Provide feedback to the Store Manager to inform improvements that are needed.<br><\/li><\/ul><strong>Qualifications<br><\/strong><ul><li>3-5 years retail experience including some management, previous sales experience required.<\/li><li>Excellent customer service, communication and organizational skills.<\/li><li>Proven operation excellence<\/li><li>Passion for Makeup and cosmetic artistry experience preferred<\/li><li>Proficiency in Word, Excel, email and computer savvy<\/li><li>Demonstrated ability to independently solve moderate to complex problems.<\/li><li>Demonstrates flexibility and initiative with minimal direction.<\/li><li>Demonstrated ability to support business growth and exhibit professional behavior. <\/li><li>Have and maintain flexible availability.<\/li><li>Must have open flexibility to work during peak traffic times including evenings, weekends and holidays. <\/li><li>Able to lift, push and pull up to 50 pounds.<\/li><li>Able to stand on your feet for up to 8 hours.<br><\/li><\/ul><em>Must be able to perform essential functions (with or without an accommodation) without posing a \\\"direct threat\\\" to the health and safety to self or others.<br><br><\/em><em>The Company reserves the right to alter, change, abolish and even combine jobs depending upon changing conditions.<br><br><\/em><em>Morphe is committed to providing equal opportunities to all qualified individuals looking to join this dynamic organization. Should any individual require accommodation during the interview process, please inform the talent acquisition team.<br><br><\/em><em>No recruitment agencies, please.<\/em>\"}"
}