{
    "id":"Kaggle::techmap::6152385940e456041c1507ad::monsterasia_in::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"About Standard Chartered. We are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East. To us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours. do the right thing, better together and never settle. as well as our brand promise, Here for good. We're committed to promoting equality in the workplace and creating an inclusive and flexible culture. one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base. The Role Responsibilities. Strategy. Model Delivery Platforms is part of Enterprise Risk Analytics (ERA), which itself is part of the broader Enterprise Risk Management organization within the Risk & Compliance Division. The function manages platforms that support Model Delivery and its governance. The function supports the business in the use of the platforms to manage their model portfolios and alignment to policy, standards and the model lifecycle. The Analyst, Model Delivery Platforms, will support the Head, Model Delivery Platforms and team colleagues in their role of helping manage and improve model delivery platforms to internal\/external stakeholders: Supporting model delivery platforms and its business users across all stages of the model risk lifecycle across all model families in the Group. Delivering and maintaining model delivery platform processes, support and engagement content. Business. Support the Head, Model Delivery Platforms and team colleagues in their role of supporting and improving model delivery platforms. Support, maintain and monitor model platforms including Group Analytics Model Explorer (GAME), Group Model Inventory (GMI), Model Analytics Platform (MAP) and more. Provide Business Analysis across model delivery platforms and solution approaches. Log, monitor and progress requests of the model delivery platforms. Provide timely and high-quality responses to internal\/external queries and requests. Perform BAU tasks across model delivery platforms to support model management in an efficient manner. Work on critical projects and ad-hoc model delivery requests as they arise. Liaise and follow up on model delivery platform deliverables with IT, Model Risk Policy & Governance, Model Development, Validation and Risk Managers for efficient and robust communication and implementation of model delivery initiatives. Document meeting minutes, findings, recommendations, issue summary, and report papers \/ templates as well as Power.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6152385940e456041c1507ad::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"Standard Chartered\", \"position\": \"Analyst, Model Delivery Platforms\", \"notes\": \"\", \"original\": \"<br><b>About Standard Chartered<\/b><br>We are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.<br>To us, good performance is about much more than turning a profit. It&#39s about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.<br>We&#39re committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.<br><b>The Role Responsibilities<\/b><br><b>Strategy<\/b><br>Model Delivery Platforms is part of Enterprise Risk Analytics (ERA), which itself is part of the broader Enterprise Risk Management organization within the Risk & Compliance Division. The function manages platforms that support Model Delivery and its governance. The function supports the business in the use of the platforms to manage their model portfolios and alignment to policy, standards and the model lifecycle.<br>The Analyst, Model Delivery Platforms, will support the Head, Model Delivery Platforms and team colleagues in their role of helping manage and improve model delivery platforms to internal\/external stakeholders:<ul><br><li>Supporting model delivery platforms and its business users across all stages of the model risk lifecycle across all model families in the Group.<\/li><br><li>Delivering and maintaining model delivery platform processes, support and engagement content.<\/li><br><li>Ongoing review, tracking, testing and monitoring of model delivery platform pipeline.<\/li><br><\/ul><br><b>Business<\/b><br><ul><br><li>Support the Head, Model Delivery Platforms and team colleagues in their role of supporting and improving model delivery platforms<\/li><br><li>Support, maintain and monitor model platforms including Group Analytics Model Explorer (GAME), Group Model Inventory (GMI), Model Analytics Platform (MAP) and more<\/li><br><li>Provide Business Analysis across model delivery platforms and solution approaches.<\/li><br><li>Log, monitor and progress requests of the model delivery platforms<\/li><br><li>Provide timely and high-quality responses to internal\/external queries and requests<\/li><br><li>Perform BAU tasks across model delivery platforms to support model management in an efficient manner<\/li><br><li>Work on critical projects and ad-hoc model delivery requests as they arise <\/li><br><li>Liaise and follow up on model delivery platform deliverables with IT, Model Risk Policy & Governance, Model Development, Validation and Risk Managers for efficient and robust communication and implementation of model delivery initiatives<\/li><br><li>Document meeting minutes, findings, recommendations, issue summary, and report papers \/ templates as well as PowerPoint slides with respect to model delivery platforms management related topics<\/li><br><li>Coordinate meetings, working group and approvals to meet business requirements<\/li><br><li>Be able to clearly explain issues identified along with the risk and causes to stakeholders, using language designed to be understood by non-experts<\/li><br><li>Comfortable with technical low code solution\/configuration development<\/li><br><li>Independent thinker with strong written and verbal communication skills<\/li><br><li>Carry out additional duties as assigned<\/li><br><\/ul><br><b>Processes<\/b><br><ul><br><li>Track and drive delivery of any action items relating to model delivery platforms as well as internal \/ external queries<\/li><br><li>Support business enablement across model delivery platforms - logging, liaising with relevant teams to ensure business value from model delivery platforms<\/li><br><li>Participate in relevant model platform activities and its user acceptance testing to ensure key features across model lifecycle are appropriately implemented not only within the direct system environment but also its relevant downstream environment<\/li><br><li>Ensure adherence to all internal and external regulations.<\/li><br><li>Embed Operational Risk monitoring as an integral part of the business process. <\/li><br><li>Accountable for helping establish and maintain frameworks to ensure Model Delivery Management processes are efficient, appropriate and compliant with all internal and external regulations.<\/li><br><\/ul><br><b>People and Talent <\/b><br><ul><br><li>Engage with IT, Model Risk Policy & Governance, Model Development, Validation, Risk Managers for efficient communication and implementation of model delivery platform deliverables, and facilitate issue resolution<\/li><br><li>Build a transparent and collaborative culture in which incentives are based on support of Model Delivery Platforms with specific performance metrics on the Bank&#39s values.<\/li><br><\/ul><br><b>Risk Management<\/b><br><ul><br><li>Assist with ongoing improvements of model delivery platforms<\/li><br><li>Assist with training and educating of the model delivery platforms and workflows <\/li><br><li>Monitor all model delivery risk issues. Where appropriate, direct remedial action and\/or ensure escalation to model delivery platforms<\/li><br><\/ul><br><b>Governance <\/b><br><ul><br><li>Assist to ensure governance requirements are met for risk models<\/li><br><li>Promote an environment where compliance with internal control functions and the external regulatory framework is a central priority of the business<\/li><br><\/ul><br><b>Regulatory & Business Conduct <\/b><ul><br><li>Display exemplary conduct and live by the Group&rsquos Values and Code of Conduct. <\/li><br><li>Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.<\/li><br><li>Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.<\/li><br><\/ul><br><b>Key Stakeholders<\/b><br>Information Technology, ERA, Model Families, Model Risk Policy & Governance, Model Development, Group Model Validation, Group Internal Auditing<br><b>QUALIFICATIONS:<\/b><ul><br><li>Degree or equivalent educated<\/li><br><li>Working experience in model management \/ delivery platforms within banks or financial services <\/li><br><li>Proven record across various model lifecycle steps<\/li><br><li>Broad knowledge of model risk management, processes and associated risks and control requirements<\/li><br><li>Understanding of regulatory guidance and requirements around model risk management<\/li><br><li>Expert with Jira, Confluence, Bitbucket<\/li><br><li>Advanced experience with collaboration software such as SharePoint<\/li><br><li>Experience working and participating in Project environments - Waterfall and Agile <\/li><br><li>Documentation of model delivery deliverables, issues and agree resolution plans<\/li><br><li>Preparation of the meeting slides, mins, and papers<\/li><br><li>Excel\/PowerPoint skills are essential<\/li><br><li>No-code\/development skills are essential<\/li><br><li>Ability to generate risk dashboard using data visualization tools i.e. Tableau<\/li><br><li>Engage senior stakeholders effectively and maintain productive working relationships <\/li><br><li>Expert in presenting difficult concepts in a clear and concise way<\/li><br><li>Analytical, problem solving skills<\/li><br><li>Focused and organised, with the ability to prioritise and deliver effectively<\/li><br><li>Ability to respond quickly in a fast-moving environment <\/li><br><li>A self-starter and proactive<\/li><br><li>A great communicator (and you know how to handle challenging situations)<\/li><br><li>Team oriented, while able to complete tasks independently <\/li><br><li>Self-motivated person with a high level of drive, dedication and desire to excel consistently<\/li><br><\/ul><br>Apply now to join the Bank for those with big career ambitions.<br>To view information on our benefits including our flexible working please visit our . We welcome conversations on flexible working.<br>\"}"
}