{
    "id":"Kaggle::techmap::614799c51b1795562e838c39::simplyhired_at::9",
    "label_age":true,
    "analysis_age":"\"Would you enjoy being part of a young, dedicated team?\" implies a preference for young candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Phrases \"You have a ‘SALES personality’.\", \"assertive and demonstrate good negotiating skills\", \"flexible and able to cope in challenging situations\" are masculine-leaning language.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"FERCAM Austria is an international logistics and transport company with 5 branch offices in Austria (Kundl, Brunn am Gebirge, Seeboden, St. Pölten, Salzburg) and 160 employees. With its extensive road transport network throughout Europe, FERCAM Austria satisfies the transport needs of its clients thanks to its long term experience with Full Truck Loads. To expand the powerful teams in our modern offices we are hiring: Transport Sales Manager (m\/f). Are you a proactive, organized individual seeking a challenging and rewarding opportunity in a fast-paced environment? Would you enjoy being part of a young, dedicated team? If YES, then this might be the perfect opportunity for you to start your international career! Tasks. Organize our daily international transports. Customer service. resolving customer issues\/complaints. Maintain a good relationship with our clients and suppliers. Individual responsibility and results-oriented work. Prepare, negotiate and confirm quotes. Acquisition of new customer and suppliers. Business trips to our partners in Europe. Requirements. You have a high school diploma \/ higher educational degree or experience in transports and logistics. You have business knowledge. You have a “SALES personality”. You find the right words in friendly, but sometimes also tough negotiations with customers. You establish trustful relations. You are fluent in English and have good knowledge of at least one further language (German and\/or Italian, French, Spanish, Eastern European Languages). You are assertive and demonstrate good negotiating skills. You are flexible and able to cope in challenging situations. Benefits. To work in a dynamic and successful international transport company with full entrepreneurial development opportunities. Trainings and other education opportunities. A crisis-proof, long-term job with top career opportunities. Free tea\/coffee and fruits. Meal vouchers, company events, …. Guaranteed profit sharing after 6 months. The average salary for a Transport Manager in 2020 was € 38. 000 to € 58. 500 gross \/ year. With experience: min. €2. 250,. gross depending on your qualifications. Immediate profit sharing. The average salary of a Transport Manager in 2020 was € 55. 000 to € 83. 500 gross \/ year). If you see a challenge in this position, apply directly via JOIN or our website. Please also make clear in case there is a specific branch \/ place that you would like to work in.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614799c51b1795562e838c39::simplyhired_at\", \"source\": \"simplyhired_at\", \"country\": \"AT\", \"company\": \"FERCAM Austria GmbH\", \"position\": \"Transport Sales Manager - in Tirol, Salzburg, Brunn a. Gebirge, St. P\\u00f6lten or K\\u00e4rnten\", \"notes\": \"\", \"original\": \"FERCAM Austria is an international logistics and transport company with 5 branch offices in Austria (Kundl, Brunn am Gebirge, Seeboden, St.P\\u00f6lten, Salzburg) and 160 employees.\\n<br \/>With its extensive road transport network throughout Europe, FERCAM Austria satisfies the transport needs of its clients thanks to its long term experience with Full Truck Loads.\\n<br \/><br \/>\\nTo expand the powerful teams in our modern offices we are hiring:\\n<br \/><br \/>\\nTransport Sales Manager (m\/f)\\n<br \/><br \/>\\nAre you a proactive, organized individual seeking a challenging and rewarding opportunity in a fast-paced environment? Would you enjoy being part of a young, dedicated team? If YES, then this might be the perfect opportunity for you to start your international career!\\n<br \/><br \/>\\nTasks\\n<br \/><br \/>\\n<ul><li>Organize our daily international transports<\/li><li>Customer service - resolving customer issues\/complaints<\/li><li>Maintain a good relationship with our clients and suppliers<\/li><li>Individual responsibility and results-oriented work<\/li><li>Prepare, negotiate and confirm quotes<\/li><li>Acquisition of new customer and suppliers<\/li><li>Business trips to our partners in Europe<\/li><\/ul>\\nRequirements\\n<br \/><br \/>\\n<ul><li>You have a high school diploma \/ higher educational degree or experience in transports and logistics<\/li><li>You have business knowledge<\/li><li>You have a \\u201cSALES personality\\u201d. You find the right words in friendly, but sometimes also tough negotiations with customers. You establish trustful relations.<\/li><li>You are fluent in English and have good knowledge of at least one further language (German and\/or Italian, French, Spanish, Eastern European Languages)<\/li><li>You are assertive and demonstrate good negotiating skills<\/li><li>You are flexible and able to cope in challenging situations<\/li><\/ul>\\nBenefits\\n<br \/><br \/>\\n<ul><li>To work in a dynamic and successful international transport company with full entrepreneurial development opportunities<\/li><li>Trainings and other education opportunities<\/li><li>A crisis-proof, long-term job with top career opportunities<\/li><li>Free tea\/coffee and fruits; meal vouchers, company events, \\u2026<\/li><li>Top earning opportunities (without experience \\u20ac 1.900,- gross; guaranteed profit sharing after 6 months; the average salary for a Transport Manager in 2020 was \\u20ac 38.000 to \\u20ac 58.500 gross \/ year; with experience: min. \\u20ac2.250,- gross depending on your qualifications; immediate profit sharing; the average salary of a Transport Manager in 2020 was \\u20ac 55.000 to \\u20ac 83.500 gross \/ year)<\/li><\/ul>\\nIf you see a challenge in this position, apply directly via JOIN or our website. Please also make clear in case there is a specific branch \/ place that you would like to work in.\\n<br \/><br \/>\\nWe are happy to help with the search for apartments.\"}"
}