{
    "id":"Kaggle::techmap::614f4230a2141e01bdd3bc6e::linkedin_id::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Phrases \"Seize the freedom\", \"empower you to take risks, experiment and explore\" are slightly masculine biased.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Experience on Cloud Technology, Software Architecture (Microservices, CI\/CD, DevOps), SaaS and API Integration technologies with Mule. Soft would be an asset. Knowledge of agile tools and techniques like: Kanban, Design Thinking, numerous Burndown techniques, numerous Retrospective formats would be an asset. Project management certification  Project Management Professional (PMP) is an advantage. Experience with service management frameworks (ITIL) and vendor management is an asset. Professional scrum certification (Product owner, Scale, Agile Leadership) a plus. WHAT WE OFFER. Our success depends on the men and women who come to work every single day with a sense of purpose and an appetite for progress. Join Sampoerna and you too can:. Seize the freedom to define your future and ours. Well empower you to take risks, experiment and explore. Be part of an inclusive, diverse culture, where everyones contribution is respected. Collaborate with some of the worlds best people and feel like you belong. Pursue your ambitions and develop your skills with a global business  our staggering size and scale provides endless opportunities to progress. Take pride in delivering our promise to society: to improve the lives of a billion smokers. Apply today and lets MakeHistory together.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f4230a2141e01bdd3bc6e::linkedin_id\", \"source\": \"linkedin_id\", \"country\": \"ID\", \"company\": \"PT HM Sampoerna Tbk.\", \"position\": \"Manager IT Commercial\", \"notes\": \"\", \"original\": \"<p>MAKE HISTORY WITH US!<\/p><p><br><\/p><p>We\\u2019ve chosen to do something incredible. We\\u2019re totally transforming our business and building our future on smoke-free products with the power to improve the lives of a billion smokers worldwide.&nbsp;<\/p><p><br><\/p><p>With huge change, comes huge opportunity. So, wherever you join us, you\\u2019ll enjoy the freedom to dream up and deliver better, brighter solutions and the space to move your career forward in endlessly different directions.<\/p><p><br><\/p><p>We are looking for a Manager IT Commercial who will be based in Jakarta.<\/p><p><br><\/p><p><br><\/p><p>HOW CAN YOU MAKE HISTORY WITH US?<\/p><p><br><\/p><p>\\u2022Define the roadmap for all IT Commercial services in scope<\/p><p>\\u2022Engage with senior partners to understand business requirements of your service<\/p><p>\\u2022Translate business requirements, corporate compliance and security guidelines into the roadmap, communicate new features to all partners<\/p><p>\\u2022Be responsible for the portfolio of IT Commercial services under your team responsibility to ensure functional and technical evolution of these solutions<\/p><p>\\u2022Coordinate end-to-end activation of a certain set of features, linked to a global program<\/p><p>\\u2022Lead change requests and issue resolution processes and the evolution of IT Commercial service management setup including communication to partners. Ensure SLA, measurement, metrics, and improvement cycles are in place<\/p><p>\\u2022Ensure service offering alignment with the Solution Design, Technology Roadmap, IT Guiding Principles and PMI practices<\/p><p>\\u2022Manage the total budget, license management process and vendor management activities associated with services in the scope, support activities by following financial guidelines and regular reporting<\/p><p>\\u2022Assess team maturity on periodic basis and mentor team members where needed<\/p><p>\\u2022Remove roadblocks, that the team is unable to resolve at their own level, to keep the delivery momentum<\/p><p>\\u2022Build an environment where people can trust each other and collaborate in most efficient way<\/p><p>\\u2022Lead all aspects of the communication plan, regularly reporting progress to partners<\/p><p><br><\/p><p><br><\/p><p>WHO ARE WE LOOKING FOR?<\/p><p><br><\/p><p>\\u2022Bachelor\\u2019s or master\\u2019s degree in Computer Science, Information Technology, Engineering or equivalent<\/p><p>\\u2022Good sense of accountability in driving results and decision-making<\/p><p>\\u2022Analytical thinking with curiosity to learn the analytics ecosystem<\/p><p>\\u2022Ability to adapt to a changing environment<\/p><p>\\u2022Superb communication and mentoring skills<\/p><p>\\u2022Experienced leader with demonstrated skills and knowledge of servant leadership, facilitation, situational awareness, conflict resolution, continual improvement, empowerment, and growing transparency<\/p><p>\\u2022Ability to articulate sophisticated cases into technical concepts for IT and into business concepts for business partners&nbsp;<\/p><p>\\u2022End to end Experience in large scale program and eye for business in eCommerce\/B2B\/B2C processes<\/p><p>\\u2022 Experience on Cloud Technology, Software Architecture (Microservices, CI\/CD, DevOps), SaaS and API Integration technologies with MuleSoft would be an asset<\/p><p>\\u2022Knowledge of agile tools and techniques like: Kanban, Design Thinking, numerous Burndown techniques, numerous Retrospective formats would be an asset<\/p><p>\\u2022Project management certification \\u2013 Project Management Professional (PMP) is an advantage<\/p><p>\\u2022Experience with service management frameworks (ITIL) and vendor management is an asset<\/p><p>\\u2022Professional scrum certification (Product owner, Scale, Agile Leadership) a plus<\/p><p><br><\/p><p><br><\/p><p>WHAT WE OFFER<\/p><p><br><\/p><p>Our success depends on the men and women who come to work every single day with a sense of purpose and an appetite for progress. Join Sampoerna and you too can:<\/p><p>\\u2022 Seize the freedom to define your future and ours. We\\u2019ll empower you to take risks, experiment and explore.<\/p><p>\\u2022 Be part of an inclusive, diverse culture, where everyone\\u2019s contribution is respected; collaborate with some of the world\\u2019s best people and feel like you belong.<\/p><p>\\u2022 Pursue your ambitions and develop your skills with a global business \\u2013 our staggering size and scale provides endless opportunities to progress.<\/p><p>\\u2022 Take pride in delivering our promise to society: to improve the lives of a billion smokers.<\/p><p><br><\/p><p>Apply today and let\\u2019s #MakeHistory together.<\/p>\"}"
}