{
    "id":"Kaggle::techmap::61486ac7634e904204124192::careerbuilder_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The use of the term \"his\/her\" can be seen as exclusionary by those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description. Surgical EVS Advent. Health Tampa. Location Address: 3100 East Fletcher Avenue Tampa, Florida 33613. Top Reasons to Work at Advent. Health Tampa. Florida Hospital Pepin Heart Institute, known across the country for its advances in cardiovascular disease prevention, diagnosis, treatment and research. Surgical Pioneers  the first in Tampa with the latest robotics in spine surgery. Building a brand new, six story surgical and patient care tower which will ensure state of the art medical and surgical car for generations to come. Awarded the Get With The Guidelines  Stroke GOLD Quality Achievement Award from the American Heart Association\/American Stroke Association and have been recognized as a recipient of their Target: Stroke Honor Roll for our expertise in stroke care. We have also received certification by The Joint Commission in collaboration with the American Stroke Association as a Primary Stroke Center. Work Hours\/Shift: Full Time Overnights 40 Hours Per Week. Must know how to Terminally Clean Surgery Suites. You Will Be Responsible For:. Performs all assigned tasks in a professional manner in order to reflect the highest integrity of the Environmental Services. Performs routine cleaning of patient rooms, nursing units, offices, clinical areas, lounges, rest rooms, corridors in a clean, neat and sanitary manner. Terminally clean the Surgical rooms. Completes work assignments in a timely manner. Manages the policies and procedures as related to specific units. Utilizes the appropriate chemicals and supplies according to procedure. Uses and maintains equipment properly. Maintains patient confidentiality. Always introduces self to patients, visitors and family. Reports safety hazards as appropriate. Transports dirty linens, trash and hazardous waste to appropriate disposal areas. Replenishes supplies as often as needed. Follows all infection control practices including handwashing techniques, standard precautions and isolation precautions. Participates in performance improvement activities. Ensures that the assigned areas are kept clean, safe, sanitary and disinfected. Actively participates in assigned meetings. Maintains set quality standards when performing job duties. Works evenings or night shift as assigned. Works weekends and Holidays as assigned. Ability to work on his\/her own with normal supervision. Observes safety precautions at all times. Capable of handling a floor buffer. Assists in departmental, hospital and community in-services\/education when assigned. Promotes teamwork within the Surgical Services Department and all other health care workers throughout the Hospital. Performs terminal cleaning of operating rooms as assigned. Attend mandatory monthly in-service training classes or Department meetings.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61486ac7634e904204124192::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"AdventHealth Tampa\", \"position\": \"Surgical EVS Overnights 10p-6:30a Tampa\", \"notes\": \"\", \"original\": \"<br \/>Description<br \/><p><strong>Surgical EVS AdventHealth Tampa<\/strong><\/p> <p><strong>Location Address:<\/strong>\\u00a03100 East Fletcher Avenue Tampa, Florida 33613<\/p> <p><strong>Top Reasons to Work at AdventHealth Tampa<\/strong><\/p> <ul> \\t<li>Florida Hospital Pepin Heart Institute, known across the country for its advances in cardiovascular disease prevention, diagnosis, treatment and research.<\/li> \\t<li>Surgical Pioneers \\u2013 the first in Tampa with the latest robotics in spine surgery <\/li> \\t<li>Building a brand new, six story surgical and patient care tower which will ensure state of the art medical and surgical car for generations to come<\/li> \\t<li>Awarded the Get With The Guidelines \\u2013 Stroke GOLD Quality Achievement Award from the American Heart Association\/American Stroke Association and have been recognized as a recipient of their Target: Stroke Honor Roll for our expertise in stroke care. We have also received certification by The Joint Commission in collaboration with the American Stroke Association as a Primary Stroke Center.<\/li> <\/ul> <p><strong>Work Hours\/Shift:<\/strong><\/p> <p>Full Time Overnights 40 Hours Per Week. Must know how to Terminally Clean Surgery Suites. <\/p> <p><strong>You Will Be Responsible For:<\/strong><\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Performs all assigned tasks in a professional manner in order to reflect the highest integrity of the Environmental Services.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Performs routine cleaning of patient rooms, nursing units, offices, clinical areas , lounges, rest rooms, corridors in a clean, neat and sanitary manner.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Terminally clean the Surgical rooms.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Completes work assignments in a timely manner.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Manages the policies and procedures as related to specific units.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Utilizes the appropriate chemicals and supplies according to procedure.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Uses and maintains equipment properly.<\/p> <p><\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Maintains patient confidentiality.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Always introduces self to patients, visitors and family.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Reports safety hazards as appropriate.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Transports dirty linens, trash and hazardous waste to appropriate disposal areas.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Replenishes supplies as often as needed.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Follows all infection control practices including handwashing techniques, standard precautions and isolation precautions.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Participates in performance improvement activities.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ensures that the assigned areas are kept clean, safe, sanitary and disinfected.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Actively participates in assigned meetings.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Maintains set quality standards when performing job duties.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Works evenings or night shift as assigned.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Works weekends and Holidays as assigned.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability to work on his\/her own with normal supervision.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Observes safety precautions at all times.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Capable of handling a floor buffer <\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Assists in departmental, hospital and community in-services\/education when assigned<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Promotes teamwork within the Surgical Services Department and all other health care workers throughout the Hospital.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Performs terminal cleaning of operating rooms as assigned<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Attend mandatory monthly in-service training classes or Department meetings.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Maintain age specific safety precautions.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Has knowledge of and understands current JCAHO Standards.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Upholds professional standards of performance and conduct.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Excellent customers service skills.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Updates and stays current with required computer training (Net learning) on an ongoing basis.<\/p> Qualifications<br \/><p><strong>What You Will Need:<\/strong><\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 No experience is required but is preferred.<\/p> <p>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Up to one year experience preferred.<\/p> <p><b>Education and Experience Preferred:<\/b><\/p> <p><b>\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 High school diploma or GED preferred.<\/b><\/p> <p><\/p> <p><strong>Job Summary:<\/strong><\/p> <p>Environmental Service specialist is the front-line representative of the Environmental Services Department.\\u00a0 They see every area of the facility daily and are responsible to keep all areas of the facility clean and neat.\\u00a0 They interact with patients daily and have the opportunity to provide support and well wishes to our guest.\\u00a0 Often patient satisfaction is measured on how pleasant the housekeeper was while cleaning their room. Their role is very important in maintaining cleanliness within the facility as well as keeping our patients satisfied and happy.<\/p> <br \/>This facility is an equal opportunity employer and complies with federal, state and local anti-discrimination laws, regulations and ordinances.&nbsp;\"}"
}