{
    "id":"Kaggle::techmap::61487d8e79d5c929a4be774a::linkedin_pk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The job posting does not include any physical requirements or limitations that would inherently exclude individuals with disabilities.",
    "label_masculine":true,
    "analysis_masculine":"- **Masculine:** The phrase \"roll up your sleeves attitude and entrepreneurial spirit\" may resonate more with male candidates, potentially discouraging female applicants.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"- **General:** The requirement for \"at least an undergraduate degree from a top tier university\" may disadvantage candidates from less prestigious educational backgrounds, potentially introducing socio-economic bias.",
    "verified":true,
    "synthetic":false,
    "text":" Overview. Bykea is a Pakistan based app offering motorbike transport, deliveries, commerce and payment matchmaking services on its marketplace platform. Over 4 million registered users drive utility from Bykea in Karachi, Lahore and Rawalpindi. We are looking for a Regional Manager Growth who will lead commercial efforts, Network Management (OTC, Franchise, BTL) for demand and Supply along with Partnerships within a geo-fence of a city and its surrounding neighborhoods. This individual drives the Operations strategy within our largest and highest potential cities, making commercial decisions to help us against our goal of winning neighborhoods. Regional Manager own the results of all Offline Marketplace. This candidate must be able to thrive in a fast-paced environment with a roll up your sleeves attitude and entrepreneurial spirit. This position will be tasked with these main objectives:. Driver and customer acquisition. Developing partnerships with corporates and SMEs. Network Development & Expansions (Franchise, Retail, BTL, Partnerships). Own performance of all sides of the market & channels (completed transactions on the platform). Build a customer acquisition engine to better target prospects, partnering with our BI team and external stakeholders. What you roughly look like as a professional:. Experience: 4. years of work experience across operations, sales, or business development in telecom \/ digital operations \/ tech startups. Experience with customer acquisition, partnerships and support processes, systems, and datasets. Experience working closely and communicating effectively with diverse set of stakeholders in an ever-changing, rapid growth environment. Team management experience required. Entrepreneurial Spirit: Experience in scaled up startups is a plus. Data Driven: Data driven decisions making & performance management. -Strong affinity for analytics. Education: At least an undergraduate degree from a top tier university. SQL knowledge strongly preferred, Excel is a must.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61487d8e79d5c929a4be774a::linkedin_pk\", \"source\": \"linkedin_pk\", \"country\": \"PK\", \"company\": \"Bykea\", \"position\": \"Regional Manager Growth\", \"notes\": \"\", \"original\": \"<p><strong>Overview<\/strong><\/p><p> Bykea is a Pakistan based app offering motorbike transport, deliveries, commerce and payment matchmaking services on its marketplace platform. Over 4 million registered users drive utility from Bykea in Karachi, Lahore and Rawalpindi.&nbsp;<\/p><p><br><\/p><p>We are looking for a Regional Manager Growth who will lead commercial efforts, Network Management (OTC, Franchise, BTL) for demand and Supply along with Partnerships within a geo-fence of a city and its surrounding neighborhoods.&nbsp;<\/p><p>This individual drives the Operations strategy within our largest and highest potential cities, making commercial decisions to help us against our goal of winning neighborhoods. Regional Manager own the results of all Offline Marketplace&nbsp;<\/p><p>This candidate must be able to thrive in a fast-paced environment with a \\u201croll up your sleeves\\u201d attitude and entrepreneurial spirit.&nbsp;<\/p><p><br><\/p><p>This position will be tasked with these main objectives:&nbsp;<\/p><p><br><\/p><ol><li>Driver and customer acquisition<\/li><li>Developing partnerships with corporates and SMEs<\/li><li>Network Development &amp; Expansions (Franchise, Retail, BTL, Partnerships)&nbsp;<\/li><li>Own performance of all sides of the market &amp; channels (completed transactions on the platform)<\/li><li>Build a customer acquisition engine to better target prospects, partnering with our BI team and external stakeholders&nbsp;<\/li><\/ol><p><strong>What you <em>roughly <\/em>look like as a professional:&nbsp;<\/strong><\/p><p><br><\/p><p><strong>Experience:<\/strong><\/p><ol><li>4+ years of work experience across operations, sales, or business development in telecom \/ digital operations \/ tech startups&nbsp;<\/li><li>Experience with customer acquisition, partnerships and support processes, systems, and datasets&nbsp;<\/li><li>Experience working closely and communicating effectively with diverse set of stakeholders in an ever-changing, rapid growth environment<\/li><\/ol><p>&nbsp;<\/p><p><strong>Team management experience required<\/strong>&nbsp;<\/p><p><br><\/p><p><strong>Entrepreneurial Spirit<\/strong>:&nbsp;Experience in scaled up startups is a plus.&nbsp;<\/p><p><br><\/p><p><strong>Data Driven:&nbsp;<\/strong>Data driven decisions making &amp; performance management&nbsp;<\/p><p> -Strong affinity for analytics.&nbsp;<\/p><p><br><\/p><p><strong>Education:&nbsp;<\/strong><\/p><ol><li>At least an undergraduate degree from a top tier university<\/li><li>SQL knowledge strongly preferred, Excel is a must<\/li><\/ol><p><\/p>\"}"
}