{
    "id":"Kaggle::techmap::613f425c583e7537a6f63b94::seek_nz::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Good old kiwi ingenuity, a great team culture and a relentless commitment to preserve New Zealand's natural beauty and resources, EnviroNZ ensure we produce the best possible outcomes for both our customers and the environment. We are looking for a customer focussed candidate to join our North Shore Transfer station team as Points Person\/Traffic Controller. This is a full-time & customer facing role, with 40. hours and includes rostered weekends. What you'll be doing. Working as part of a successful & close-knit team, you will be responsible for. Communicating clearly with all customers and directing all traffic on-site to ease traffic flow. Being mindful of hazards, and ensuring all employees & visitors are safe. Assisting customers on where to off load safely. General site maintenance which includes tidying up site & common areas. Growing your own career within a thriving organisation. Above all, our aim is to create a safe site for all visitors & customers, and continuing to provide great customer service. You will have: 2. years face-to-face customer service experience. Previous traffic control experience is preferred, however full training will be provided. A can-do attitude, physically fit and enjoy working outside. Have working knowledge and understanding of Health & Safety, and the importance of. Be Supportive and Respectful. If you wish to apply for this position please click apply now and complete the online application form and submit an updated copy of your CV. Safety and wellbeing are paramount to us, so our recruitment process involves a Ministry of Justice criminal background check, and a pre-employment medical including drug test. You must also be eligible to work in NZ (either as a New Zealand Citizen or Resident or have a valid working visa) to apply for this role.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613f425c583e7537a6f63b94::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"EnviroWaste Services Limited\", \"position\": \"Points Person\", \"notes\": \"\", \"original\": \"<p>Good old kiwi ingenuity, a great team culture and a relentless commitment to preserve New Zealand's natural beauty and resources, EnviroNZ ensure we produce the best possible outcomes for both our customers and the environment.<\/p><p>We are looking for a customer focussed candidate to join our North Shore Transfer station team as Points Person\/Traffic Controller. This is a full-time &amp; customer facing role, with 40+ hours and includes rostered weekends.<\/p><p><strong>What you'll be doing<\/strong><\/p><p>Working as part of a successful &amp; close-knit team, you will be responsible for <\/p><ul><li>Communicating clearly with all customers and directing all traffic on-site to ease traffic flow<\/li><li>Being mindful of hazards, and ensuring all employees &amp; visitors are safe<\/li><li>Assisting customers on where to off load safely<\/li><li>General site maintenance which includes tidying up site &amp; common areas<\/li><li>Growing your own career within a thriving organisation<\/li><li>Above all, our aim is to create a safe site for all visitors &amp; customers, and continuing to provide great customer service <\/li><\/ul><p><strong>You will have:<\/strong><\/p><ul><li>2+ years face-to-face customer service experience<\/li><li>Previous traffic control experience is preferred, however full training will be provided<\/li><li>A can-do attitude, physically fit and enjoy working outside<\/li><li>Have working knowledge and understanding of Health &amp; Safety, and the importance of<\/li><li>Be Supportive and Respectful<\/li><\/ul><p>If you wish to apply for this position please click apply now and complete the <strong>online application form<\/strong> and submit an updated copy of your CV. We look forward to receiving your application!<\/p><p>Safety and wellbeing are paramount to us, so our recruitment process involves a Ministry of Justice criminal background check, and a pre-employment medical including drug test. You must also be eligible to work in NZ (either as a New Zealand Citizen or Resident or have a valid working visa) to apply for this role.<\/p>\"}"
}