{
    "id":"Kaggle::techmap::61412d668be8df1fa24b7a2c::careerbuilder_us::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants. Summary. The Senior Software Engineer will be responsible for supporting and developing application software, providing constructive code feedback to improve technical abilities, and writing automated tests. Client Details. This client is an award winning company valued at over $70M. They focus on creating and maintaining innovative technologies that can drastically improve workplace productivity and culture. Description. -Develop application software, databases, and APIs. -Support the development, launch, and roll-out of products. -Work closely with our Products teams to forecast any user needs. -Provide code reviews and feedback to peers. -Involved in database design and application architecture. Profile. -5. years experience in full stack software engineering. -Strong background in full stack application software development. -Strong leadership ability. -Experience in all or some of the following: -. NET, Node. js, and Angular. -Cloud hosted applications. (Azure experience preferred). -Automated testing and development processes. -Database design. -Architectural design for highly soluble applications. Job Offer. -100% remote opportunity. -Competitive salary. -Comprehensive benefits package.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61412d668be8df1fa24b7a2c::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Michael Page\", \"position\": \"Senior Software Engineer- .NET, Node, Angular - 170k\", \"notes\": \"\", \"original\": \"<p><em>MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants.<\/em><\/p><p><strong>Summary<\/strong><\/p><p>The Senior Software Engineer will be responsible for supporting and developing application software, providing constructive code feedback to improve technical abilities, and writing automated tests.<\/p><p><strong>Client Details<\/strong><\/p><p>This client is an award winning company valued at over $70M. They focus on creating and maintaining innovative technologies that can drastically improve workplace productivity and culture.<\/p><br \/><br \/> <br \/><p><strong>Description<\/strong><\/p><p>-Develop application software, databases, and APIs.<br \/><br \/>-Support the development, launch, and roll-out of products.<br \/><br \/>-Work closely with our Products teams to forecast any user needs.<br \/><br \/>-Provide code reviews and feedback to peers.<br \/><br \/>-Involved in database design and application architecture.<\/p><p><strong>Profile<\/strong><\/p><p>-5+ years experience in full stack software engineering.<br \/><br \/>-Strong background in full stack application software development.<\/p><p><br \/>-Strong leadership ability.<br \/><br \/>-Experience in all or some of the following:<br \/><br \/>-.NET, Node.js, and Angular.<br \/><br \/>-Cloud hosted applications. (Azure experience preferred)<br \/><br \/>-Automated testing and development processes.<br \/><br \/>-Database design.<br \/><br \/>-Architectural design for highly soluble applications.<br \/><br \/><\/p><p><strong>Job Offer<\/strong><\/p><p>-100% remote opportunity.<br \/><br \/>-Competitive salary.<br \/><br \/>-Comprehensive benefits package.<\/p>&nbsp;\"}"
}