{
    "id":"Kaggle::techmap::61599ccf9c51287c30f49f87::monster_ca::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Must be able to perform manual labor for long periods of time and lift items in excess of 50lbs\" - lacks clarity and could discourage many who are capable of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description EQ3 is an innovative leader in furniture and accessory design, with stores in Canada and the United States, in addition to a growing online presence. We are looking for a Delivery Driver to join our growing warehouse team. This is a permanent full-time position in our Mont Royal Warehouse, located at 7900 Devonshire Road. This position doubles as a delivery driver and warehouse assistant. THE SKILLS YOU'LL NEED: Must have a Full G Drivers license. Must have a good knowledge of transportation routes and be familiar with Gatineau area. Must have experience working with navigation tools. 2 years experience driving the equivalent of a 5-ton vehicle (single axle box truck). Must have a clear Drivers Abstract and criminal record check. Ability to communicate effectively in English and French is preferred. Must be able to perform manual labor for long periods of time and lift items in excess of 50lbs. Able to work alone or in a team with a strong positive attitude. Able to work in a fast-paced work environment. MORE ABOUT THE ROLE: Delivery driver. Deliver EQ3 products to customers on time. Truck's daily Maintenance (sweeping, cleaningetc. ) Removing ALL garbage when assembly is required. Lock and secure the truck before leaving it for extended deliveries. Ensure all tools are brought back and accounted for. Warehouse assistant. Assist with loading\/unloading product into the delivery truck. Assist with the inventory accuracy and receiving procedures. Prepare customer orders for pickup or delivery. Assisting with loading of customer and delivery vehicles. Understand and adhere to company safety initiatives. WORK LIFE AT EQ3: Competitive compensation with a pay rate of $20.00 per hour and benefit packages. A company that supports work-life balance with paid time off and flexibility. Employee discount program for products, wellness plans, group banking and more. EQ3 Spirit Committee that promotes community engagement, rewards and recognition for all employees. Surround yourself with a community that supports professional growth and collaboration. Closing date: Open until position is filled. Submit your complete application by clicking on \"Apply to Position now. We thank all interested individuals, however only those selected for an interview will be contacted.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61599ccf9c51287c30f49f87::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"EQ3\", \"position\": \"Delivery Driver\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>EQ3 is an innovative leader in furniture and accessory design, with stores in Canada and the United States, in addition to a growing online presence. We are looking for a <strong>Delivery Driver<\/strong> to join our growing warehouse team. This is a <strong>permanent full-time<\/strong> position in our <strong>Mont Royal Warehouse<\/strong>, located at <strong>7900 Devonshire Road<\/strong>. This position doubles as a delivery driver and warehouse assistant. <\/p> <p><strong>THE SKILLS YOU'LL NEED:<\/strong><\/p> <ul> <li>Must have a Full G Driver\\u2019s license<\/li> <li>Must have a good knowledge of transportation routes and be familiar with Gatineau area<\/li> <li>Must have experience working with navigation tools<\/li> <li>2 years\\u2019 experience driving the equivalent of a 5-ton vehicle (single axle box truck)<\/li> <li>Must have a clear Driver\\u2019s Abstract and criminal record check<\/li> <li>Ability to communicate effectively in English and French is preferred<\/li> <li>Must be able to perform manual labor for long periods of time and lift items in excess of 50lbs.<\/li> <li>Able to work alone or in a team with a strong positive attitude<\/li> <li>Able to work in a fast-paced work environment<\/li> <\/ul> <p><strong>MORE ABOUT THE ROLE:<\/strong><\/p> <p>Delivery driver<\/p> <ul> <li>Deliver EQ3 products to customers on time.<\/li> <li>Truck's daily Maintenance (sweeping, cleaning\\u2026etc.)<\/li> <li>Removing ALL garbage when assembly is required<\/li> <li>Lock and secure the truck before leaving it for extended deliveries.<\/li> <li>Ensure all tools are brought back and accounted for<\/li> <\/ul> <p>Warehouse assistant<\/p> <ul> <li>Assist with loading\/unloading product into the delivery truck.<\/li> <li>Assist with the inventory accuracy and receiving procedures.<\/li> <li>Prepare customer orders for pickup or delivery; assisting with loading of customer and delivery vehicles.<\/li> <li>Understand and adhere to company safety initiatives.<\/li> <\/ul> <p><strong>WORK LIFE AT EQ3:<\/strong><\/p> <ul> <li>Competitive compensation with a pay rate of <strong>$20.00 per hour <\/strong>and benefit packages<\/li> <li>A company that supports work-life balance with paid time off and flexibility<\/li> <li>Employee discount program for products, wellness plans, group banking and more<\/li> <li>EQ3 Spirit Committee that promotes community engagement, rewards and recognition for all employees<\/li> <li>Surround yourself with a community that supports professional growth and collaboration<\/li> <\/ul> <p><strong>Closing date: Open until position is filled <\/strong><\/p> <p><strong>Submit your complete application by clicking on \\\"Apply to Position\\u2019\\u2019 now.<\/strong><\/p> <p><em>We thank all interested individuals, however only those selected for an interview will be contacted.<\/em><\/p> <\/div>\"}"
}