{
    "id":"Kaggle::techmap::614b31e5197ded0b6d1f6956::britishjobs_uk::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". Contract details for the Graduate \/ Teaching Assistant position: Location. South Manchester (Didsbury & Chorlton). Position. Graduate Teaching Assistants. Type of work - Classroom\/SEN Support\/1:1 or small group work. Start date. October 2021. Contract type - Long-Term. Duration \/ Likely Duration. Throughout academic year until July 2022. Full time\/part time. Full time. Minimum rate of pay - £70 per day. About the successful Graduate \/ Teaching Assistant: No experience needed as full training will be provided. You should hold a recent degree, ideally education related with a 2:1 or higher. You will be enthusiastic and ready to inspire young minds. You will be an excellent role model for young people. You will be pro-active and innovative with strategies to engage students and make learning fun. To be eligible the Graduate \/ Teaching Assistant must have\/be: Hold Right to Work in the UK. Hold an enhanced child barred list DBS certificate registered with the online update service or be willing to process a new application at a cost of £46. Provide two professional child related references. Safeguarding training within the past 12 months, Prospero Teaching offer a free online course. If you are interested in this role, please contact the Manchester office. Prospero Teaching is acting as an employment business\/education recruitment agency in relation to this vacancy. The successful candidate will be required to register with Prospero Teaching in order to fill this vacancy. Unfortunately, only shortlisted candidates will be contacted.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b31e5197ded0b6d1f6956::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Prospero Teaching\", \"position\": \"Graduate Teaching Assistants Needed- South Manchester\", \"notes\": \"\", \"original\": \"<br><br>Contract details for the Graduate \/ Teaching Assistant position: <br>Location - South Manchester (Didsbury &amp; Chorlton)<br>Position - Graduate Teaching Assistants<br>Type of work - Classroom\/SEN Support\/1:1 or small group work<br>Start date - October 2021<br>Contract type - Long-Term<br>Duration \/ Likely Duration - Throughout academic year until July 2022<br>Full time\/part time - Full time<br>Minimum rate of pay - &pound;70 per dayAbout the successful Graduate \/ Teaching Assistant: <br><br>No experience needed as full training will be provided.<br>You should hold a recent degree, ideally education related with a 2:1 or higher.<br>You will be enthusiastic and ready to inspire young minds.<br>You will be an excellent role model for young people.<br>You will be pro-active and innovative with strategies to engage students and make learning fun.To be eligible the Graduate \/ Teaching Assistant must have\/be: <br><br>Hold Right to Work in the UK.<br>Hold an enhanced child barred list DBS certificate registered with the online update service or be willing to process a new application at a cost of &pound;46.<br>Provide two professional child related references.<br>Safeguarding training within the past 12 months, Prospero Teaching offer a free online course. If you are interested in this role, please contact the Manchester office.<br><br>Prospero Teaching is acting as an employment business\/education recruitment agency in relation to this vacancy. The successful candidate will be required to register with Prospero Teaching in order to fill this vacancy.<br><br>Unfortunately, only shortlisted candidates will be contacted. <br><br>\"}"
}