{
    "id":"Kaggle::techmap::614dd8c1646bff678e48694a::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Our client, Good Shepherd New Zealand, is a member of a worldwide organisation concerned with creating a more emotionally, economically, and physically safe world for women. Its objective in New Zealand is to support better futures for women, girls and their whanau who are experiencing disadvantage. A significant area of focus is on supporting the development of financial inclusion and microfinance programmes for New Zealand families living on limited incomes. Believing it is the right of all to have access to fair and affordable credit, Good Shepherd NZ work with key stakeholders including community-based organisations, corporate partners (including two commercial banks providing loan capital) and government to achieve that goal. Domestic microfinance is becoming more recognised in New Zealand as a fair and safe alternative in the small credit market, and Good Shepherd NZ is currently in the process of expanding its microfinance programmes to meet the need that recognition creates. About the Role. This is a full-time role and Fixed Term Contract to 30 June 2022, where some flexible work\/life balance arrangement may be possible, within a wonderful caring team culture. Primary areas of responsibility for the Phone-Based Loan Worker -Microfinance are as follows: Providing Good Loans (NILS & StepUP) services to individuals & family, handling inquiries and conducting financial conversations with clients which add to their financial capabilities. Undertaking loan interviews with clients, including preparing detailed budgets with the clients which assess the clients ability to afford loan repayments. Processing loan applications, arranging signing of loan documentation, loan drawdowns and repayments. Supporting clients who have difficulties maintaining their repayments. Delivering services in an empathetic, appropriate and competent manner, ensuring every client is valued and respected. About You. To perform well in this role, applicants will have: Demonstrated experience in either microfinance, lending, financial mentoring and\/or social services. And, experience in a community services environment is helpful. The ability to work in a phone and email-based role (not seeing clients face to face), excellent phone manner and listening and questioning skills coupled with the ability to identify client needs and establish effective relationships. A strong aptitude for handling financial matters and a knowledge of money management. Demonstrated understanding of the needs of people on low income and knowledge of people struggling financially.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614dd8c1646bff678e48694a::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Momentum Consulting Group\", \"position\": \"Phone-Based Loan Worker - Microfinance\", \"notes\": \"\", \"original\": \"Our client, Good Shepherd New Zealand, is a member of a worldwide organisation concerned with creating a more emotionally, economically, and physically safe world for women. Its objective in New Zealand is to support better futures for women, girls and their whanau who are experiencing disadvantage.<br \/><br \/>A significant area of focus is on supporting the development of financial inclusion and microfinance programmes for New Zealand families living on limited incomes. Believing it is the right of all to have access to fair and affordable credit, Good Shepherd NZ work with key stakeholders including community-based organisations, corporate partners (including two commercial banks providing loan capital) and government to achieve that goal.<br \/><br \/>Domestic microfinance is becoming more recognised in New Zealand as a fair and safe alternative in the small credit market, and Good Shepherd NZ is currently in the process of expanding its microfinance programmes to meet the need that recognition creates.<br \/><br \/><strong>About the Role<br \/><\/strong><br \/>This is a full-time role and Fixed Term Contract to 30 June 2022, where some flexible work\/life balance arrangement\\u00a0may be possible, within a\\u00a0wonderful caring team culture.\\u00a0<br \/><br \/>Primary areas of responsibility for the Phone-Based Loan Worker -Microfinance are as follows:<br \/> <ul> <li>Providing Good Loans (NILS &amp; StepUP) services to individuals &amp; family, handling inquiries and conducting financial conversations with clients which add to their financial capabilities.<\/li> <li>Undertaking loan interviews with clients, including preparing detailed budgets with the clients which assess the client\\u2019s ability to afford loan repayments.<\/li> <li>Processing loan applications, arranging signing of loan documentation, loan drawdowns and repayments.<\/li> <li>Supporting clients who have difficulties maintaining their repayments.<\/li> <li>Delivering services in an empathetic, appropriate and competent manner, ensuring every client is valued and respected.<\/li> <\/ul> <strong>About You<\/strong><br \/><br \/>To perform well in this role, applicants will have:<br \/> <ul> <li>Demonstrated experience in either microfinance, lending, financial mentoring and\/or social services; and, experience in a community services environment is helpful.<\/li> <li>The ability to work in a phone and email-based role (not seeing clients face to face), excellent phone manner and listening and questioning skills coupled with the ability to identify client needs and establish effective relationships.<\/li> <li>A strong aptitude for handling financial matters and a knowledge of money management.<\/li> <li>Demonstrated understanding of the needs of people on low income and knowledge of people struggling financially.<\/li> <\/ul> \\u00a0\\u00a0<br \/>Most importantly, you will personally share a like-minded commitment to social justice values and have a great head for numbers, along with an empathetic personal style of communicating, and relish the role of delivering a supportive phone-based client service. Full training will be provided, so if you have a heart for working with the community, we look forward to hearing from you.<br \/><br \/>Apply now\\u00a0or for more information call\\u00a0<strong>Sharon Ward Duncan on 021 356 777<\/strong>.\\u00a0<br \/>\\u00a0<br \/>**CVs preferred in Word format. Search all our roles here: www.momentum.co.nz\/your-next-job<br \/><br \/><em>Under the provisions of the Privacy Act 1993, you have the right to access and request the correction of information held by us concerning you.\\u00a0 We will retain all information for future vacancies (permanent or contract).\\u00a0 Should you wish Momentum Consulting to delete this information from our database we shall require written notification to do so, subject to any legal obligations that require us to retain such information.<\/em>\"}"
}