{
    "id":"Kaggle::techmap::635294bbebc9152f799952c9::eures_ie::0",
    "label_age":true,
    "analysis_age":"The term \"ambitious\" may subtly favour younger candidates who are often perceived as being more driven and eager to advance quickly in their careers.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2 SCdP is needed at the g Hotel, Wellpark, Galway City, H91 V0HR, Ireland. The ideal candidate will be passionate about food and willing to work as a team in a fast-paced environment. Be trained and qualified to a professional level. Be passionate about food and presentation. Work as part of a close team & comply with all standards set by the Head Chef & management. Ensure that food preparation and presentation are of the highest quality, & are according to company standards. Be an ambitious person with a positive attitude. Be eager and passionate about the food industry with a focus on delivering and maintaining the highest standards of quality. Have 5 years of experience in a similar role. Be flexible as weekend work will be involved. Salary 34, 000 - 38, 000 euro\/ annually depend on experience.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::635294bbebc9152f799952c9::eures_ie\", \"source\": \"eures_ie\", \"country\": \"IE\", \"company\": \"We Have Chefs Limited\", \"position\": \"SCdP (The g Hotel)\", \"notes\": \"\", \"original\": \"2 SCdP&nbsp;&nbsp;is needed at the g Hotel, Wellpark, Galway City, H91 V0HR, Ireland<br><br>The ideal candidate will be passionate about food and willing to work as a team in a fast-paced environment.<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Be trained and qualified to a professional level<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Be passionate about food and presentation.<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Work as part of a close team &amp; comply with all standards set by the Head Chef &amp; management<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Ensure that food preparation and presentation are of the highest quality, &amp; are according to company standards<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Be an ambitious person with a positive attitude<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Be eager and passionate about the food industry with a focus on delivering and maintaining the highest standards of quality<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Have 5 years of experience in a similar role<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;Be flexible as weekend work will be involved<br>\\u2022&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Salary 34,000 - 38,000 euro\/ annually depend on experience\"}"
}