{
    "id":"Kaggle::techmap::61412c228be8df1fa24b6dd9::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":"Living in the United States for at least three of the last five years ensures sufficient information is available for the thorough background checks required for a \"Public Trust\" clearance.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1-2 years of experience as JIRA administrator with proven experience customizing JIRA projects with various schemes to meet complex customer and program project needs. Direct experience with the Atlassian product suite, with focus on JIRA and Confluence for project\/application administration. Dashboard creation and management. Experience in performing Atlassian installations, migrations and plug-in installation critical. Confidence in proposing new ideas, using analytical skills, presenting to key stakeholders and receiving feedback is important. Experience working on project initiatives and campaigns within an overall program and communications strategy is valuable. Ability to handle multiple projects simultaneously and work flexibly. Attention to detail, ability to self-manage, check own work and maintain quality. Ability to work within a team and independently, working methodically to meet deadlines. Strong written and verbal communication skills critical. Confidence in proposing new ideas, using analytical skills, presenting to key stakeholders, junior and senior staff. Ability to receive and act on feedback. Desire and willingness to train others. Must be able to work additional hours on occasion. Ability to travel locally required and at times regionally or nationally as requested. Ability to obtain a public trust clearance. All candidates supporting the CMS programs must have lived in the United States at least three (3) out of the last five (5) years prior in order to be considered. Preferred Qualifications. Ability to write custom Jira Query Language (JQL). Experience with the Administration of CXOne Cloud Platform. An understanding of effective branding, design and communications valuable. An understanding of 508 compliance helpful. Experience with human centered design (HCD) framework. External Referral Bonus: Eligible. External Referral Bonus $: 2000. Potential for Telework: No. Clearance Level Required: Public Trust. Travel: No. Scheduled Weekly Hours: 40. Shift: Day. Requisition Category: Professional. Job Family: Business Systems Analysis. Pay Range:.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61412c228be8df1fa24b6dd9::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Leidos\", \"position\": \"EndPoint Agile Application Administrator\", \"notes\": \"\", \"original\": \"<p><b>Description<\/b> <\/p> <p><\/p><br \/><br \/><b><b><u>Job Description:<\/u><\/b><\/b><br \/><br \/><p>The Government Health and Safety Solutions Operation has an opening or a EndPoint Agile Application Administrator to support a large healthcare contract.<\/p><p>Development and Engineering Lead with input from the Program Manager, Deputy Program Manager, Product Manager and several Project Managers, your responsibilities will include, but will not be limited to:<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Managing the overall integrated agile environment to meet the ECIS customer needs including, oversight, implementation and ongoing development of the Jira, Confluence and other related agile and software platforms;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Familiarity with the use of the Service Now (SNOW) platform.<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability and wiliness to learn administration of other Agile and Cloud platforms as required.<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Providing ongoing assessment, analysis and continuous improvement to the agile environment to elevate program effectiveness and efficiencies towards customer and contract goals;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Documenting systems, processes and decisions within the Jira and agile environment;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Hands on experience leading cleanup and refinement initiatives to increase system functionality and usability;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Performing application and system administration tasks, including backups and scheduled jobs, working directly or with other team members;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Maintaining and managing projects, boards, workflows, tasks\/issues, permissions and users including setting permissions and maintaining security for JIRA projects and Confluence spaces;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Developing, managing, facilitating and delivering training on Jira and related agile platforms to ECIS program staff, customer and others to continuously advance workflow sophistication, efficiencies and effectiveness;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Facilitate performance improvement planning, scrums, sprints etc. for multiple projects;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Testing new versions of the tools and plug-ins to ensure compatibility, rolling out across the program and teams as needed;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Advancing JIRA filters, reporting, dashboards, workflows and fields to be more user friendly and visually appealing, increasing innovation, use and legibility for project managers, customer and other stakeholders;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Seeking and demonstrating best practices, bringing innovation and advancements to the program and customer agile and communication environments;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ensuring documents meet editorial and government specifications and adhere to standards for quality, graphics, coverage, format and style.<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Overseeing multiple responsibilities within tight deadlines, remaining responsible and flexible to customer and team needs while setting priorities and managing expectations.<\/p><p><b>Basic Qualifications<\/b><\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Bachelor\\u2019s or higher degree in management information systems, computer science, software development or related discipline; 2 \\u2013 4 years of prior relevant experience or Masters with 2 years of prior relevant experience. Experience may be substituted in lieu of degree.<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 1-2 years of experience as JIRA administrator with proven experience customizing JIRA projects with various schemes to meet complex customer and program project needs;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Direct experience with the Atlassian product suite, with focus on JIRA and Confluence for project\/application administration;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Dashboard creation and management;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Experience in performing Atlassian installations, migrations and plug-in installation critical;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Confidence in proposing new ideas, using analytical skills, presenting to key stakeholders and receiving feedback is important;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Experience working on project initiatives and campaigns within an overall program and communications strategy is valuable.<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability to handle multiple projects simultaneously and work flexibly;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Attention to detail, ability to self-manage, check own work and maintain quality;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability to work within a team and independently, working methodically to meet deadlines;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Strong written and verbal communication skills critical;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Confidence in proposing new ideas, using analytical skills, presenting to key stakeholders, junior and senior staff;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability to receive and act on feedback;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Desire and willingness to train others;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Must be able to work additional hours on occasion;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability to travel locally required and at times regionally or nationally as requested;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability to obtain a public trust clearance.<\/p><p><\/p><p>All candidates supporting the CMS programs must have\\u00a0lived in the\\u00a0United States\\u00a0at\\u00a0least\\u00a0three\\u00a0(3)\\u00a0out of\\u00a0the\\u00a0last\\u00a0five\\u00a0(5)\\u00a0years\\u00a0prior in order to be considered.<\/p><p><b>\\u00a0<\/b><\/p><p><b>Preferred Qualifications<\/b><\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Ability to write custom Jira Query Language (JQL);<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Experience with the Administration of CXOne Cloud Platform.<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 An understanding of effective branding, design and communications valuable;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 An understanding of 508 compliance helpful;<\/p><p>\\r\\n\\u2022\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Experience with human centered design (HCD) framework.<\/p><p><\/p><br \/><br \/><b><u>External Referral Bonus:<\/u><\/b><br \/><br \/>Eligible<br \/><br \/><b><u><b>External Referral Bonus $:<\/b><\/u><\/b><br \/><br \/>2000<br \/><br \/><b><b><u>Potential for Telework:<\/u><\/b><\/b><br \/><br \/>No<p><\/p><br \/><br \/><b><b><u>Clearance Level Required:<\/u><\/b><\/b><br \/><br \/>Public Trust<p><\/p><br \/><br \/><b><b><u>Travel:<\/u><\/b><\/b><br \/><br \/>No<p><\/p><br \/><br \/><b><b><u>Scheduled Weekly Hours:<\/u><\/b><\/b><br \/><br \/>40<p><\/p><br \/><br \/><b><b><u>Shift:<\/u><\/b><\/b><br \/><br \/>Day<p><\/p><br \/><br \/><b><b><u>Requisition Category:<\/u><\/b><\/b><br \/><br \/>Professional<p><\/p><br \/><br \/><b><b><u>Job Family:<\/u><\/b><\/b><br \/><br \/>Business Systems Analysis<br \/><br \/><b><b><u>Pay Range:<\/u><\/b><\/b><br \/><br \/>&nbsp;\"}"
}