{
    "id":"Kaggle::techmap::615627ebc13b2206fc587420::dice_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job summary: Role: Desktop Support. Location: Scottsdale, AZ. Duration: Contract Role. Job Description: The contractor will be required to do desktop\/laptop deployments. Imaging and configuring hardware for deployment to users. Memory upgrades, etc. They should be able to lift computer equipment as needed (desktops, laptops, monitors). They should also be prepared to assist with the asset disposal process inventorying, documenting and moving hardware for disposal pickup if needed. They will also be required to support any reported issues during or after hardware deployment. Contract will go through Oct possible extension. Schedule 8:00am-5:00pm local time daily (should be flexible as normal schedule could change if needed). A. Certification and\/or MCP Certification preferable. location: Phoenix, Arizona. job type: Contract. salary: $23.26 per hour. work hours: 8am to 5pm. education: High School. responsibilities: Contractors will be required to do desktop\/laptop deployments. Imaging and configuring hardware for deployment to new users. They should be able to lift computer equipment as needed (desktops, laptops, monitors, printers). They should also be prepared to assist with the asset disposal process inventorying, documenting and moving hardware for disposal pickup. They will also be required to support any reported issues during or after hardware deployment. A. Certified and\/or Microsoft Certified. The essential functions of this role include: working in a smoke free environment. qualifications: Experience level: Experienced. Minimum 4 years of experience. Education: High School. skills: imaging. Desktop Support. Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615627ebc13b2206fc587420::dice_us\", \"source\": \"dice_us\", \"country\": \"US\", \"company\": \"Randstad Technologies\", \"position\": \"hands on desktop\", \"notes\": \"\", \"original\": \"job summary:<br \/><br \/><p><strong>Role: Desktop Support<\/strong><\/p><br \/><p><strong>Location: Scottsdale, AZ<\/strong><\/p><br \/><p><strong>Duration: Contract Role<\/strong><\/p><br \/><br \/><p>Job Description:<\/p><br \/><br \/><p>The contractor will be required to do desktop\/laptop deployments. Imaging and configuring hardware for deployment to users. Memory upgrades, etc. They should be able to lift computer equipment as needed (desktops, laptops, monitors). They should also be prepared to assist with the asset disposal process inventorying, documenting and moving hardware for disposal pickup if needed. They will also be required to support any reported issues during or after hardware deployment. Contract will go through Oct possible extension. Schedule 8:00am-5:00pm local time daily (should be flexible as normal schedule could change if needed). A+ Certification and\/or MCP Certification preferable&nbsp;<br \/><br \/>location: Phoenix, Arizona<br \/><br \/>job type: Contract<br \/><br \/>salary: $23 - 26 per hour<br \/><br \/>work hours: 8am to 5pm<br \/><br \/>education: High School<br \/><br \/>&nbsp;<br \/><br \/>responsibilities:<br \/><br \/><p>Contractors will be required to do desktop\/laptop deployments. Imaging and configuring hardware for deployment to new users. They should be able to lift computer equipment as needed (desktops, laptops, monitors, printers). They should also be prepared to assist with the asset disposal process inventorying, documenting and moving hardware for disposal pickup. They will also be required to support any reported issues during or after hardware deployment. A+ Certified and\/or Microsoft Certified<\/p><br \/><br \/><br \/><br \/><p>The essential functions of this role include:<\/p><ul><li>working in a smoke free environment<\/li><\/ul>&nbsp;<br \/><br \/>qualifications:<br \/><br \/><ul><br \/><li>Experience level: Experienced<\/li><li>Minimum 4 years of experience<\/li><li>Education: High School<\/li><\/ul>&nbsp;<br \/><br \/>skills: <ul><li>imaging<\/li><li>Desktop Support<\/li><\/ul><br \/><br \/><br \/><p>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<\/p>\"}"
}