{
    "id":"Kaggle::techmap::614b20f3439898511ecd08b0::seek_nz::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The requirement for \"strong empathy and patience with elderly residents\" might suggest a preference for candidates who conform to nurturing stereotypes, potentially introducing gender bias. An alternative phrasing could be \"demonstrated ability to engage positively with a diverse range of individuals,\" which focuses on skills rather than inherent traits, inviting a wider pool of applicants||The phrase \"good enough for mum,\" intended to highlight the quality of care, could inadvertently reinforce traditional gender roles. A more neutral and inclusive alternative could be \"meets our high standards of care,\" which maintains the emphasis on quality without implying gender-specific expectations.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The phrase \"We'd also love you to have experience working in Aged care but that's not essential\" might still discourage those who feel underqualified due to lacking this specific background. Instead, stating \"previous experience in care settings is beneficial but not required, as training will be provided\" could be more welcoming.",
    "verified":true,
    "synthetic":false,
    "text":"About Ryman Retirement Villages. Ryman Healthcare's Jane Winstone Retirement Village has a strong family and community focus. With a welcoming atmosphere, our village is filled with people who enjoy living and working here. Everything we do has to be good enough for mum, and our team love putting smiles on our resident's faces. About the Role. We have an exciting opportunity to join our supportive team as an Activity and Lifestyle Coordinator. This is a full time position working Monday to Friday, 0930 - 1630. For this position you will need to have a full drivers license and be comfortable driving a manual van. In this role you will: Plan and implement a programme of recreational, diversional, social and craft activities for residents. Promote happiness, wellbeing and quality of life for all residents. Work closely with, and support your colleagues. About You. To thrive in our supportive and caring environment you will have: Strong empathy and patience with elderly residents. Outstanding communication skills. A reliable, friendly and professional manner. Benefits of working at a Ryman Village. Fun, friendly and supportive team environment. Certainty of hours through fixed rosters. Work in a beautiful, resort style village. Opportunities for professional development and career progression. Ryman Team Benefits Card with discounts from a range of suppliers and retailers. We'd also love you to have experience working in Aged care but that's not essential. If you are interested in working for a company with a clear purpose that are committed to safety, kindness and developing our people we would love to hear from you.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b20f3439898511ecd08b0::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Ryman Healthcare\", \"position\": \"Activity and Lifestyle Coordinator\", \"notes\": \"\", \"original\": \"<p><strong>About Ryman Retirement Villages<\/strong><\/p>\\n<p>Ryman Healthcare's Jane Winstone Retirement Village has a strong family and community focus. With a welcoming atmosphere, our village is filled with people who enjoy living and working here. Everything we do has to be good enough for mum, and our team love putting smiles on our resident's faces.  <\/p>\\n<p><strong>About the Role<\/strong><\/p>\\n<p>We have an exciting opportunity to join our supportive team as an Activity and Lifestyle Coordinator. This is a full time position working Monday to Friday, 0930 - 1630.<\/p>\\n<p>For this position you will need to have a full drivers license and be comfortable driving a manual van.<\/p>\\n<p>In this role you will:<\/p>\\n<ul>\\n<li>Plan and implement a programme of recreational, diversional, social and craft activities for residents<\/li>\\n<li>Promote happiness, wellbeing and quality of life for all residents<\/li>\\n<li>Work closely with, and support your colleagues  <\/li>\\n<\/ul>\\n<p><strong>About You<\/strong><\/p>\\n<p>To thrive in our supportive and caring environment you will have:<\/p>\\n<ul>\\n<li>Strong empathy and patience with elderly residents<\/li>\\n<li>Outstanding communication skills<\/li>\\n<li>A reliable, friendly and professional manner  <\/li>\\n<\/ul>\\n<p><strong>Benefits of working at a Ryman Village<\/strong><\/p>\\n<ul>\\n<li>Fun, friendly and supportive team environment<\/li>\\n<li>Certainty of hours through fixed rosters<\/li>\\n<li>Work in a beautiful, resort style village<\/li>\\n<li>Opportunities for professional development and career progression<\/li>\\n<li>Ryman Team Benefits Card with discounts from a range of suppliers and retailers<\/li>\\n<\/ul>\\n<p>We'd also love you to have experience working in Aged care but that's not essential.<\/p>\\n<p>If you are interested in working for a company with a clear purpose that are committed to safety, kindness and developing our people we would love to hear from you.<\/p>\"}"
}