{
    "id":"Kaggle::techmap::6147d7985596111f9cd849c1::monster2_us::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Average Pay: $19\/hrSchedule \/ Home Time: Home Daily. Equipment Type(s): Dry Van. Driver Activity: Drop & Hook. Operating Area: SCHiring Areas: Columbia, SCCDL Class: Class AEndorsements: NoneNFI Division: DedicatedOrientation: Local On-Site at Columbia, SCNFI Operating Center: 573 Recruiter: Susie @ 864-469-4692 All NFI Drivers Are Eligible For:Immediate Benefits – Health, Dental, Vision, Rx. Start accruing PTO after 90 days of employment401(k) with Match. Quarterly & Annual Safety Bonus$2000 Driver Referral Bonus. Clean Roadside Inspection Bonus. Local On-Site Orientations Technology & Equipment:Average Tractor Age Less Than 2. 5 Years. Collision Mitigation SystemsNavigation24 \/ 7 \/ 365 Driver Support Why NFI? Family-owned and operated since 1932Continued Reinvestment in People & EquipmentLong-Term Customer Contracts & Relationships. Consistent Pay & Schedules. Opportunities for Advancement. Driver Trainer, Dispatch OperationsRequirementsDriving for NFINFI basic driver qualifications include:Minimum 21 years of age. Current Class A CDL from your state of residence. Six (6) months of relevant Class A commercial driving experience or Recent Graduate from an Affiliated Truck Driving School. Acceptable references from past employers. Meet all DOT qualifications. Pass a DOT physical, including DOT drug screenNFI Driver Expectations:Perform all duties safely and responsibly. Following all federal and\/or state laws, regulations, and\/or customer rules, standards and guidelines. Physically capable to perform all job duties. Reporting problems with your truck, as well as accidents, traffic violations, and damage before and after route Physical Requirements:While performing the duties of this job, the associate will be required to move frequently, stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to regularly lift and\/or move up to 50lbs\/23kg and occasionally lift and\/or move up to 100lbs\/45kg. The associate must be able to legally operate a motor vehicle and safely and frequently enter\/exit the vehicle as well as the rear cargo area NFI is an equal opportunity employer\/disability\/veteran:All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status. Reasonable Accommodation Notice.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6147d7985596111f9cd849c1::monster2_us\", \"source\": \"monster2_us\", \"country\": \"US\", \"company\": \"NFI Industries\", \"position\": \"Volvo Dedicated Truck Driver CDL A\", \"notes\": \"\", \"original\": \"Average Pay: $19\/hrSchedule \/ Home Time: &nbsp;Home DailyEquipment Type(s): &nbsp;Dry VanDriver Activity: &nbsp;Drop &amp; HookOperating Area: &nbsp;SCHiring Areas: Columbia, SCCDL Class: &nbsp;Class AEndorsements: &nbsp;NoneNFI Division: &nbsp;DedicatedOrientation: &nbsp;Local On-Site at Columbia, SCNFI Operating Center: 573&nbsp;Recruiter: &nbsp;Susie @ 864-469-4692&nbsp;All NFI Drivers Are Eligible For:Immediate Benefits \\u2013 Health, Dental, Vision, RxStart accruing PTO after 90 days of employment401(k) with MatchQuarterly &amp; Annual Safety Bonus$2000 Driver Referral BonusClean Roadside Inspection BonusLocal On-Site Orientations&nbsp;&nbsp;Technology &amp; Equipment:Average Tractor Age Less Than 2.5 YearsCollision Mitigation SystemsNavigation24 \/ 7 \/ 365 Driver Support&nbsp;&nbsp;Why NFI?Family-owned and operated since 1932Continued Reinvestment in People &amp; EquipmentLong-Term Customer Contracts &amp; RelationshipsConsistent Pay &amp; SchedulesOpportunities for Advancement - Driver Trainer, Dispatch OperationsRequirementsDriving for NFINFI basic driver qualifications include:Minimum 21 years of ageCurrent Class A CDL from your state of residenceSix (6) months of relevant Class A commercial driving experience or Recent Graduate from an Affiliated Truck Driving SchoolAcceptable references from past employersMeet all DOT qualificationsPass a DOT physical, including DOT drug screenNFI Driver Expectations:Perform all duties safely and responsiblyFollowing all federal and\/or state laws, regulations, and\/or customer rules, standards and guidelinesPhysically capable to perform all job dutiesReporting problems with your truck, as well as accidents, traffic violations, and damage before and after route&nbsp;&nbsp;Physical Requirements:While performing the duties of this job, the associate will be required to move frequently, stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to regularly lift and\/or move up to 50lbs\/23kg and occasionally lift and\/or move up to 100lbs\/45kg. The associate must be able to legally operate a motor vehicle and safely and frequently enter\/exit the vehicle as well as the rear cargo area&nbsp;&nbsp;NFI is an equal opportunity employer\/disability\/veteran:All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.Reasonable Accommodation NoticeFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. &nbsp;Email or call 866.634.5627.\"}"
}