{
    "id":"Kaggle::techmap::61561d93a6740c534abc8c14::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The requirement to \"lift, move, push, pull, and carry up to 25 lbs\" may exclude individuals with physical disabilities who can otherwise perform the job functions with reasonable accommodations.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 3-5 years of culinary experience working in a high volume kitchen. Red Seal Cook Certification an asset. Post-secondary culinary education considered an asset. Must have or be willing to obtain a valid Standard First Aid certification and an Alberta Health Services approved Food Safety Certificate. Must have attention to detail and food presentation skills. Proven ability to lead a team, including strong organizational skills and time management skills. Strong organizational skills and time management skills. Strong interpersonal and communication skills (including reading, writing, and speaking English). Must be able to lift, move, push, pull, and carry up to 25 lbs. Available to work multiple rotations including but not limited to 21-7 and 14-7. Available to work a day shift, afternoon shift, split shift, or night shift. Be able to provide at least 2 professional work references. What We Offer: Opportunities for advancement through internal promotions and culinary apprenticeships. A strong safety culture emphasizing training and awareness so that you come home safely. Competitive industry wages which outperform similar jobs in urban areas. Benefits package available following probationary period. High performing coworkers who will help you excel and adapt to a remote camp environment. Our positions are safety sensitive and require employees to successfully complete a site pre-access drug and alcohol test and site specific training. Due to the volume of applications received phone calls, walk-ins and \/ or faxed resumes will not be accepted.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61561d93a6740c534abc8c14::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Royal Camp Services Ltd\", \"position\": \"st Cook ( camp)\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Royal Camp Services is a privately held company which provides industry leading remote location accommodations for workforce housing. We offer long-term and seasonal employment in the culinary, hospitality, remote site services, and remote site operations industries.<\/p> <p>Our highly skilled culinary team consists of employees with years of industry experience, formal culinary education, international training, and \/ or Red Seal Certification. Our team prepares hearty, tasty meals drawing from a variety of menus with access to our extensive inventory of fresh produce, fine quality meats and supplies. The large variety of meal offerings ensures clients with dietary restrictions, such as gluten sensitivity, are still able to have satisfying choices every day. We offer hands on training opportunities for our staff and partner with local post-secondary institutions to provide culinary practicums to the next generation of industry professionals.<\/p> <p>Reporting to the Chef, a 1st Cook plays an integral role within Royal Camp Services ltd by ensuring our clients are delivered an exceptional culinary experience. A 1st Cook is responsible for the food safety and quality of food prepared within their assigned station.<\/p> <p>Job duties can include but are not limited to the following:<\/p> <ul> <li>Assist Chef with meal preparation, inventory management, and ordering (if required)<\/li> <li>Demonstrate mastery of all aspects of cooking (i.e., proteins, sauces, starches, vegetables, etc.) for all meal types<\/li> <li>Accommodate various diets including vegetarian, vegan, cultural, food allergies, and other specific requests<\/li> <li>Bake basic breads and desserts<\/li> <li>Able to safely use, clean, and maintain all kitchen equipment (i.e., flattop, grill, fryer, meat slicer etc.)<\/li> <li>Demonstrate and ensure the use of proper knife skills<\/li> <li>Responsible for ensuring food quality, food safety (including reporting all food allergies), and food standards are met<\/li> <li>Supervise, manage, train, mentor, and direct other kitchen staff (as required) Ensure all daily, weekly, and monthly cleaning tasks are completed<\/li> <li>Ensure food quality, food safety (including reporting all food allergies), and food standards are met<\/li> <li>Adhere to all safety policies and procedures as per task, equipment usage, or PPE requirements<\/li> <li>Complete OHS required documents, including temperature charts<\/li> <li>Participate in Toolbox\/Tailgate meetings, complete Field Level Hazard Assessment, and Hazard Identifications on a daily basis<\/li> <li>Assist in unloading the grocery truck<\/li> <li>All other duties as assigned<\/li> <\/ul> <p>Requirements:<\/p> <ul> <li>Must be able to supply own travel to our transport locations of Edmonton, Grande Prairie, and \/ or Prince George<\/li> <li>3-5 years of culinary experience working in a high volume kitchen<\/li> <li>Red Seal Cook Certification an asset<\/li> <li>Post-secondary culinary education considered an asset<\/li> <li>Must have or be willing to obtain a valid Standard First Aid certification and an Alberta Health Services approved Food Safety Certificate&nbsp;<\/li> <li>Must have attention to detail and food presentation skills<\/li> <li>Proven ability to lead a team, including strong organizational skills and time management skills<\/li> <li>Strong organizational skills and time management skills<\/li> <li>Strong interpersonal and communication skills (including reading, writing, and speaking English)<\/li> <li>Must be able to lift, move, push, pull, and carry up to 25 lbs.<\/li> <li>Available to work multiple rotations including but not limited to 21-7 and 14-7<\/li> <li>Available to work a day shift, afternoon shift, split shift, or night shift<\/li> <li>Be able to provide at least 2 professional work references<\/li> <\/ul> <p>What We Offer:<\/p> <ul> <li>Opportunities for advancement through internal promotions and culinary apprenticeships<\/li> <li>A strong safety culture emphasizing training and awareness so that you come home safely<\/li> <li>Competitive industry wages which outperform similar jobs in urban areas<\/li> <li>Benefits package available following probationary period<\/li> <li>High performing coworkers who will help you excel and adapt to a remote camp environment<\/li> <\/ul> <p>Our positions are safety sensitive and require employees to successfully complete a site pre-access drug and alcohol test and site specific training.<\/p> <p>Due to the volume of applications received phone calls, walk-ins and \/ or faxed resumes will not be accepted.<\/p> <\/div>\"}"
}