{
    "id":"Kaggle::techmap::61557ad8c0ea986004cd4567::linkedin_it::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Overview. Are you a travelling CRA who want to move out of the road? Covance is now Labcorp, we are much more than a normal CRO. We were named to Fast Company magazines list of 2021 Most Innovative Companies for its leadership in scientific innovation in the fight against COVID-19. Labcorps Drug Development Business, Covance, was recognized with the 2020 Global CRO Company of the Year Award by Frost & Sullivan for our capacity to integrate digital technologies, remote monitoring, and telemedicine services to ensure continuity of and decentralizing clinical trials. We have supported the pharmaceutical industry develop more medicines worldwide than any other company, including the top 50 best-selling drugs on the market today. Join us and see why more than 90% of the top 20 global pharmaceutical companies are repeat customers. THE JOB. The COVID pandemic is changing the future of Clinical Monitoring. With Different Levels Of Growth, This Path Can Offer All Career Options, Candidates Interested. Covance has created a full career development path for Clinical Research professionals interested in a remote site monitoring type of job. We call it In-House CRA. Either in a long term, non-travelling career. Or those who would want to change to a full travelling CRA job in time. We currently have a job opportunity at Senior IHCRA level, so we are looking for candidates: With a Life Science or Nursing Degree. Certified according to D. M. 15 NOV 2011. A minimim of 2 years of independent Clinical Monitoring experience as a travelling CRA with onsite monitoring experience. Kindly consider this is not an entry level job, we need: At least 2 years of independent Clinical monitoring experience as a travelling CRA with onsite monitoring experience. Certified as per D. M. 15 Nov 2011 CTA, CTC or Study Coordinators. This is a remote, home based job, you can work anywhere in Italy. EMEA AND THE SAME JOB REF. EMEA Remote. Minimum Required. Education\/Qualifications: University or college degree, or certification in a related allied health profession from an appropriately accredited institution (e. g., nursing licensure). Thorough knowledge of ICH-GCP guidelines, clinical trial process and understanding of local regulatory requirements. Thorough knowledge of monitoring procedures process. Valid Driver's License. Experience. Minimum Required: A minimum of 2 years of independent Clinical Monitoring experience as a traveling CRA with onsite monitoring experience.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61557ad8c0ea986004cd4567::linkedin_it\", \"source\": \"linkedin_it\", \"country\": \"IT\", \"company\": \"Labcorp Drug Development\", \"position\": \"Senior house CRA\", \"notes\": \"\", \"original\": \"<strong><u>Job Overview<br><br><\/u><\/strong><strong>Are you a travelling CRA who want to move out of the road?<br><br><\/strong>Covance is now Labcorp, we are much more than a normal CRO.<br><br>We were named to <strong>Fast Company magazine\\u2019s list of 2021 Most Innovative Companies<\/strong> for its leadership in scientific innovation in the fight against COVID-19. Labcorp\\u00b4s Drug Development Business, Covance, was recognized with the <strong>2020 Global CRO Company of the Year Award<\/strong> by Frost &amp; Sullivan for our capacity to integrate digital technologies, remote monitoring, and telemedicine services to ensure continuity of and decentralizing clinical trials.<br><br>We have supported the pharmaceutical industry develop more medicines worldwide than any other company, including the top 50 best-selling drugs on the market today.<br><br>Join us and see why more than 90% of the top 20 global pharmaceutical companies are repeat customers.<br><br><strong>THE JOB<br><br><\/strong>The COVID pandemic is changing the future of Clinical Monitoring.<br><br><strong><u>With Different Levels Of Growth, This Path Can Offer All Career Options, Candidates Interested<br><br><\/u><\/strong>Covance has created a full career development path for Clinical Research professionals interested in a remote site monitoring type of job. We call it In-House CRA.<br><ul><li>Either in a long term, non-travelling career <\/li><li>Or those who would want to change to a full travelling CRA job in time.<br><\/li><\/ul>We currently have a job opportunity at <strong>Senior IHCRA<\/strong> level, so we are looking for candidates:<br><ul><li>With a Life Science or Nursing Degree<\/li><li>Certified according to D.M. 15 NOV 2011<\/li><li>A minimim of 2 years of independent Clinical Monitoring experience as a travelling CRA with onsite monitoring experience<br><\/li><\/ul>Kindly consider this is not an entry level job, we need:<br><ul><li>At least 2 years of independent Clinical monitoring experience as a travelling CRA with onsite monitoring experience<\/li><li>Certified as per D.M. 15 Nov 2011 CTA, CTC or Study Coordinators<br><\/li><\/ul>This is a remote, home based job, you can work anywhere in Italy.<br><br>EMEA AND THE SAME JOB REF<br><br>EMEA Remote<br><br><strong><u>Minimum Required<br><br><\/u><\/strong>Education\/Qualifications:<br><ul><li>University or college degree, or certification in a related allied health profession from an appropriately accredited institution (e.g., nursing licensure). <\/li><li>Thorough knowledge of ICH-GCP guidelines, clinical trial process and understanding of local regulatory requirements<\/li><li>Thorough knowledge of monitoring procedures process<\/li><li>Valid Driver's License<br><\/li><\/ul><strong><u>Experience<br><br><\/u><\/strong>Minimum Required:<br><ul><li>A minimum of 2 years of independent Clinical Monitoring experience as a traveling CRA with onsite monitoring experience <\/li><li>Ability to monitor study sites independently according to protocol monitoring guidelines, SOP, and local regulatory Guidelines<\/li><li>Have a full understanding of the Serious Adverse Event (SAE) reporting, process production of reports, narratives and follow up of SAEs<\/li><\/ul> <strong> 2021-69283<br><br><br><br><\/strong><strong>Covance is proud to be an Equal Opportunity Employer:<br><br><\/strong> As an EOE\/AA employer, the organization will not discriminate in its employment practices due to an applicant's race, age, color, religion, sex, national origin, sexual orientation, gender identity, disability or veteran status.\"}"
}