{
    "id":"Kaggle::techmap::615ae552c05bbf161916ffc8::linkedin_ke::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Government commitments to put in place comprehensive measures necessary for realising gender equality in line with Beijing Platform for Action. 1.1. Enhanced collaboration between the National Gender and Equality Commission and other key state agencies and decision-makers. Quality and ambition of joint action plans. Number of national actions planned and delivered. Regularity and meaningfulness of meetings between state actors and CSOs. AFGMB\/Childrens department \/ODPP\/local administration\/relevant CSO (Kajiado\/Narok). NGEC\/Childrens department \/ODPP\/local administration\/relevant CSO (Busia\/Kisumu\/Kwale). 1.2. Strengthened coalitions of national and subnational CSO partners holding the Kenyan government to account on protection and advancement of women and girls rights at national and county levels. Number of SDG Kenya Forum events\/fora and Civil society initiatives held, assessing implementation of SDG5. Effectiveness of the SDG 5 working group of the SDG Kenya Forum (the working group's influence within the forum). On how the working group ensures proper attention is paid to SDG 5 in Forum events, reports and publications. On the extent to which the group can influence other actors such as government officials and bodies to ensure proper attention is paid to SDG 5. Quality of SDG implementation assessment reports developed through the SDGs Kenya Forum. Extent to which SDG 5 working group members and other relevant informants have been fully included in the preparation of the report with direct and regular participation throughout the process. Extent to which SDG 5 and its components are reported in a similar degree of detail as other SDGs in SDG Kenya reports including covering all SDG indicators. Extent to which reporting of SDG 5 is based on data from credible sources and analysis by recognized experts. Extent to which SDG 5 data and information in the reports is based on coverage of all the counties and not from an unduly restricted geographical scope. Extent to which reporting includes analysis of government action and inaction (including responses to recommendations by relevant UN bodies) and the conclusions and recommendations are directly related to the data and analysis presented in the report. Number of subnational CSO coalitions established\/strengthened at county level. Sub-indicator: Number of active networks of organizations in place against FGM\/Child marriage\/Sexual violence and description of their activities. Number and regularity of County technical working groups meeting to address implementation of SDG 5.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615ae552c05bbf161916ffc8::linkedin_ke\", \"source\": \"linkedin_ke\", \"country\": \"KE\", \"company\": \"Equality Now\", \"position\": \"Consultancy - End of Project Evaluation Gender Justice: Driving SDG 5 Accountability Kenya\", \"notes\": \"\", \"original\": \"<strong>Equality Now - End of Project Evaluation<br><br><\/strong><strong><em>Gender Justice: Driving SDG 5 Accountability in Kenya 2018-2021<br><br><\/em><\/strong><strong>Terms of Reference<br><br><\/strong>Deadline for bids: October 4th, 2021. 18:00 EAT<br><ul><li> Introduction<br><br><\/li><\/ul>Equality Now seeks expressions of interest to support the final evaluation of the project \\u2013 \\u2018<strong><em>Gender Justice: Driving SDG 5 Accountability in Kenya<\/em><\/strong>.\\u2019 The project began implementation in September 2018 and is due to end in December 2021.<br><br>The overall goal of the project is to<strong> improve implementation of gender focused laws and policies by the Kenyan Government on protection and promotion of the rights of women and girls<\/strong> in line with SDG 5 priorities and legal commitments included in the Protocol to the African Charter on Human and Peoples' Rights on the Rights of Women in Africa (Maputo Protocol).<br><br>This overall goal is sought through the achievement of <strong>four intermediate outcomes<\/strong>:<br><ul><li>Enhanced collaboration between the National Gender and Equality Commission and other key state agencies and decision-makers.<\/li><li>Strengthened coalitions of national and subnational CSO partners holding the Kenyan government to account on protection and advancement of women and girls rights at national and county levels. <\/li><li>Increased public awareness and support for the protection and promotion of the rights of women and girls in line with SDG 5 priorities and the Maputo Protocol.<\/li><li>Enhanced advocacy capacity amongst national and subnational CSOs to hold the government of Kenya to account on delivery of its commitments on women and girls rights using national, regional and international human rights commitments.<br><br><\/li><\/ul>Within this framework, Equality Now and its partners have been <strong>focusing on the areas of sexual violence and harmful practices including female genital mutilation (FGM) and child marriage<\/strong>. This includes addressing the current legal frameworks including those that that overlap in some provisions, generating conflict and confusion (Sexual Offences Act and Children Act) and jeopardise the efforts of appropriate law enforcement. We have also been working on the protection and of the Prohibition of FGM Act, which was threatened by a constitutional petition that was rejected by the courts early this year..<br><br>The project is being implemented primarily in <strong>Narok, Kajiado, Busia, Kwale and Kisumu<\/strong> counties, where we work with and through local civil society partners, and <strong>national advocacy work and engagement with official agencies and government representatives<\/strong> being undertaken in Nairobi. There are also some complementary activities in <strong>Makueni<\/strong> county. The thematic focus of work varies between the primary locations:<br><ul><li>Narok and Kajiado - Female Genital Mutilation<\/li><li>Busia and Kisumu - Sexual violence<\/li><li>Kwale - Child marriage<\/li><li>Nairobi - the focus relates to the promotion of a multi-sectoral approach (MSA) and how the nationally mandated authorities, namely National Gender Equality Commission, The Anti Female Genital Mutilation Board, the Director of Public Prosecution and the National Gender Sector Working Group, ensure protections against SGBV and harmful practices (Child Marriage and FGM) and prosecution for their perpetration. <br><br><\/li><\/ul>During the final year of the project, additional funding and activities were introduced, as well as a short extension to the implementation period. This was primarily intended to enable effective engagement with and participation in the convened by UN Women, as an important advocacy opportunity with the Kenyan government and other stakeholders.<br><ul><li> Scope of the Work<br><br><\/li><\/ul>The evaluation should cover the full range of work conducted since 2018, with and by all partners in the six counties and at national level.<br><br><strong>Overall purpose<br><br><\/strong>The evaluation should identify the principal changes that have been brought about through the project, analyse their significance and sustainability, and identify the factors that facilitated or limited the achievements and impact of the project. Through this, we seek to identify what lessons can be drawn from the project, as well as recommendations for future programming and learning by Equality Now, the project partners, donors, official agencies and others.<br><br>The evaluation should be focused on the following key questions:<br><br><strong>3.1. What changes has the project led to?<br><br><\/strong>We wish to know about the different types of changes that may have occurred:<br><ul><li>Those that are directly attributable to the project and those to which it contributed indirectly<\/li><li>Those that were expected and those which were unexpected<\/li><li>Those that are positive, and any which are negative or that have led to negative consequences. <\/li><li>Any important changes that occurred largely or completely without contributions from the project but which relate to its objectives.<br><br><\/li><\/ul>The identification and analysis of change should pay particular attention to, but not be limited to, the project\\u2019s overall goal and its four intermediate outcomes, which are noted above in the Introduction to these ToR and can be further understood by reference to the outcome indicators presented in Annex 1. It is also important to analyse change at national level and within each county and to differentiate between impacts on sexual violence, FGM and child marriage.<br><br>Because most of the outcome indicators were assessed during March of this year, detailed assessment of most of them is not now required. The exceptions are the following indicators that were not assessed at that time:<br><ul><li>1b - Higher rates of prosecution of reported cases of violation against women and girls in targeted counties<\/li><li>1f - Government commitments to put in place comprehensive measures necessary for realising gender equality in line with Beijing Platform for Action<\/li><li>1.3a - Proportion and level of awareness and agreement by the general public, in particular, key project target groups (women and girls, community leaders) with key provisions of the Sexual Offences Act (SOA) and with the Anti-FGM law, children\\u2019s Act.<br><br><\/li><\/ul>The most recent data collected on the other outcome indicators should be reviewed with project staff and other informants as appropriate to determine whether there may have been significant changes in the course of 2021 or reasons to question its validity. In any such cases, the current status of the indicators in question should be assessed.<br><br><strong>3.2. What is the significance of these changes? <br><\/strong><ul><li>How important are the changes that have come about? What is their significance for those women and girls most affected by sexual violence, FGM and child marriage?<\/li><li>How do they relate to, and impact upon, the concerns and felt needs of women and girls, the problems identified by Equality Now and the project partners, and the underlying causes of sexual violence, FGM and child marriage?<\/li><li>If there have been negative changes, how are these likely to affect women and girls and the ability of the project partners and\/or other actors - including official national and county-level bodies - to support them?<br><br><\/li><\/ul><strong>3.3. How have these changes been accomplished?<br><br><\/strong>What were the main activities and approaches used by Equality Now and its partners to deliver the project, and did they lead to change in an efficient and effective way? What are the key success factors?<br><ul><li>Which were the most effective activities and approaches used, and which were the least effective? Were any activities or approaches negative or problematic?<\/li><li>What were the main obstacles to progress? What strategies were used to address those obstacles and which, if any, have been helpful?<\/li><li>What were the major changes made in activities and approaches during the course of the project? Why were they made and how did they impact on achievements?<\/li><li>Did the ways in which Equality Now managed and delivered the project help or hinder the achievement of positive change? Did they enable on-going learning and adaptation to facilitate success?<\/li><li>How did Equality Now relate with the project partners, other CSOs and networks, government members, bodies and officials and what have been the main positive and negative aspects of those relationships? <br><br><\/li><\/ul><strong>3.4. Are the changes sustainable beyond the end of the project?<br><\/strong><ul><li>Have the changes achieved impacted on the attitudes and behavioiur of key targets (particularly national and county-level government officials) regarding sexual violence, FGM and child marriage and is there evidence that they will maintain those attitudes and behaviour?<\/li><li>Are any changes to national or county-level legislation and policies likely to be upheld and implemented in the coming years?<\/li><li>Will the long-term effect of the positive changes achieved outweigh the impact of any negative changes?<\/li><li>What are the principal risks that could undermine sustainability?<br><br><\/li><\/ul><strong>3.5. What learning and recommendations can be drawn from this project for the partners, Equality Now and other actors seeking to end sexual violence, FGM and child marriage in Kenya?<br><\/strong><ul><li>What are the key lessons from the project?<\/li><li>What actions should Equality Now and its partners take to maximise the gains from the project and maintain sustainability?<\/li><li>What recommendations can be drawn from the evaluation findings to inform the future programming and learning of the partners, Equality Now and others? Which are particular to the context and themes of the project, and which are more generalizable?<\/li><li> Methodology<br><br><\/li><\/ul>The range of issues to be studied requires a mixed methods approach incorporating quantitative and qualitative elements, desk-based research and field research at county level. In-so-far-as possible, the study should use participatory approaches.<br><br>We expect the approach and design to:<br><ul><li>Be ethical and reasonable.<\/li><li>Build continuous and ongoing analysis into the methodology.<\/li><li>Be appropriate and relevant for the purpose.<\/li><li>Analyse data in a systematic way that leads to convincing conclusions.<\/li><li>Bring in the perspectives of different stakeholders.<\/li><li>Present and explain conflicting findings and divergent perspectives in the analysis and conclusions.<br><br><\/li><\/ul>Development of the final methodology and inception report will be agreed with staff of Equality Now based in Nairobi and the Monitoring, Evaluation, Knowledge and Information Manager based in the UK.<br><br><strong> Deliverables and timeframe <br><br><\/strong>The study should produce the following deliverables:<br><ul><li>An inception report detailing a proposed methodology, the timeline and tools for data collection.<\/li><li>A draft report. This should be clear and simply written, free of unnecessary jargon. The main body of the report should not exceed 30 pages. The report template will be agreed with the consultant as part of the inception report.<\/li><li>A final report, with feedback integrated from Equality Now and its partners<\/li><li>Raw data and any complementary materials should be provided as annexes to the draft report <br><br><\/li><\/ul>The deadline for bids is October 4th. It is expected that the contract will be awarded by or before the 15th of that month allowing the inception report to be agreed by November 1st. Collection and analysis of evidence should then be conducted principally during November. It is envisaged that preliminary findings should be presented to and discussed with Equality Now and its partners during a (virtual) convening in Nairobi held in December. The final report must be submitted by the January 14th, 2022 at the latest.<br><br><strong> Payment Schedule <br><\/strong><ul><li>30% of the agreed fee will be paid on approval of the inception report.<\/li><li>30% of the agreed fee plus expenses on submission of the draft study report.<\/li><li>40% of the agreed fee on approval of the final study report.<br><br><\/li><\/ul><strong>Expertise Required<br><\/strong><ul><li>Proven experience conducting evaluations of projects and programmes.<\/li><li>Expertise in qualitative and quantitative evaluation methods for social programmes and projects.<\/li><li>Understanding and experience in relation to women\\u2019s rights, legal advocacy and public policy, especially as regards sexual violence, FGM and child marriage.<\/li><li>Excellent report writing.<\/li><li>Excellent written and spoken English.<\/li><li>Understanding and experience of working with national and county-level agencies relevant to the project, including the police, is highly desirable.<br><br><\/li><\/ul><strong> Submission of Proposals <br><br><\/strong>Interested individual consultants and teams are requested to submit technical and financial proposals including the duration of the assignment, CVs of all members of the proposed team and budget. The proposal should include the following:<br><ul><li>A technical proposal comprising a draft evaluation design and methodology to meet the objectives and answer the research questions.<\/li><li>Approximate timeline for the assignment.<\/li><li>A detailed financial offer including time estimates for each task, billing rate and estimation of direct expenses (e.g. phone calls and travel costs).<\/li><li>The CV or CVs of the persons involved in the assignment with their roles and responsibilities in the baseline process.<\/li><li>A minimum of two samples of written work in English that demonstrate the experience of the consultant(s) that will draft the baseline study report. Hyperlinks to <br><br><\/li><\/ul>Applications that do not include all the above will not be considered.<br><br>Proposals should be sent by email to Mike Clulow, Monitoring, Evaluation, Knowledge and Information Manager - mclulow@equalitynow.org \\u2013 with copies to the Africa Office Manager, Mary Ciugu - equalitynownairobi@equalitynow.org - and be received by 6pm EAT on 4th October, 2021.<br><br><strong>Submissions will be reviewed on a rolling basis. <\/strong>Due to the volume of applicants anticipated for this role, only shortlisted candidates will be contacted for an interview.<br><br><em>Equality Now is strong because it is diverse. We actively seek a diverse applicant pool and encourage candidates of all backgrounds to apply. Equality Now does not discriminate on the basis of disability, age, gender identity and expression, national origin, race and ethnicity, religious beliefs, or sexual orientation. We welcome all kinds of diversity. Candidates are selected on the basis of ability, in accordance with all country and location specific laws.<br><br><\/em><strong>Annex 1 - Results Framework Extract<br><br><\/strong><strong>ID<br><br><\/strong><strong>Outcome<br><br><\/strong><strong>Indicator(s)<br><br><\/strong>1<br><br>Improved implementation of gender focused laws and policies by the Kenyan Government on protection and promotion of the rights of women and girls in line with the Beijing Platform for Action, SDG 5 priorities and legal commitments included in the Protocol to the African Charter on Human and Peoples' Rights on the Rights of Women in Africa (Maputo Protocol).<br><ul><li> Reformed sexual offences act enacted and Prohibition of FGM act upheld by courts.<\/li><li> Higher rates of prosecution of reported cases of violation against women and girls in targeted counties.<\/li><li> Sub indicator 1 - # SGBV &amp; FGM cases reported at police stations in identified locations<\/li><li> Sub indicator 2 - # Prosecutions on FGM &amp; SGBV brought before identified courts<\/li><li> Quality of prosecutions and judgements under legislation on sexual offences and FGM<\/li><li> Measures established on safety security, confidentiality<\/li><li> Measures on quality referral pathways<\/li><li> Effectiveness of multi-sectoral coordination and collaboration<\/li><li> Emerging Trends<\/li><li> NGEC \/ Kenyan government produce high quality data on SDG 5.2 and 5.3.<\/li><li> Support given to the prosecution process by other state actors including the Children's department\/AFGMB, local administrations, ministry of health, ministry of education<\/li><li> Formal reporting of cases<\/li><li> Provision of expert opinion to the prosecution process<\/li><li> Support to investigations and evidence gathering<\/li><li> Logistical support to survivors and witnesses<\/li><li> Witness security and protection<\/li><li> Medical and psychosocial support to survivors<\/li><li> Government commitments to put in place comprehensive measures necessary for realising gender equality in line with Beijing Platform for Action<br><br><\/li><\/ul>1.1<br><br>Enhanced collaboration between the National Gender and Equality Commission and other key state agencies and decision-makers.<br><ul><li> Quality and ambition of joint action plans<\/li><li> Number of national actions planned and delivered.<\/li><li> Regularity and meaningfulness of meetings between state actors and CSOs<br><br><\/li><\/ul>AFGMB\/Children\\u2019s department \/ODPP\/local administration\/relevant CSO (Kajiado\/Narok)<br><br>NGEC\/Children\\u2019s department \/ODPP\/local administration\/relevant CSO (Busia\/Kisumu\/Kwale)<br><br>1.2<br><br>Strengthened coalitions of national and subnational CSO partners holding the Kenyan government to account on protection and advancement of women and girls rights at national and county levels.<br><ul><li> Number of SDG Kenya Forum events\/fora and Civil society initiatives held, assessing implementation of SDG5.<\/li><li> Effectiveness of the SDG 5 working group of the SDG Kenya Forum (the working group's influence within the forum)<\/li><li> On how the working group ensures proper attention is paid to SDG 5 in Forum events, reports and publications<\/li><li> On the extent to which the group can influence other actors such as government officials and bodies to ensure proper attention is paid to SDG 5<\/li><li> Quality of SDG implementation assessment reports developed through the SDGs Kenya Forum.<\/li><li> Extent to which SDG 5 working group members and other relevant informants have been fully included in the preparation of the report with direct and regular participation throughout the process<\/li><li> Extent to which SDG 5 and its components are reported in a similar degree of detail as other SDGs in SDG Kenya reports including covering all SDG indicators<\/li><li> Extent to which reporting of SDG 5 is based on data from credible sources and analysis by recognized experts<\/li><li> Extent to which SDG 5 data and information in the reports is based on coverage of all the counties and not from an unduly restricted geographical scope<\/li><li> Extent to which reporting includes analysis of government action and inaction (including responses to recommendations by relevant UN bodies) and the conclusions and recommendations are directly related to the data and analysis presented in the report<\/li><li> Number of subnational CSO coalitions established\/strengthened at county level<\/li><li> Sub-indicator: Number of active networks of organizations in place against FGM\/Child marriage\/Sexual violence and description of their activities.<\/li><li> Number and regularity of County technical working groups meeting to address implementation of SDG 5<\/li><li> Number of national gender equality CSO coalition meetings (national and sub-national).<br><br><\/li><\/ul>1.3<br><br>Increased public awareness and support for the protection and promotion of the rights of women and girls in line with the Beijing Platform for Action, SDG 5 priorities and the Maputo Protocol.<br><ul><li> Proportion and level of awareness and agreement by the general public, in particular, key project target groups (women and girls, community leaders) with key provisions of the Sexual Offences Act (SOA) and with the Anti-FGM law, children\\u2019s Act.<\/li><li> Community actions taken to uphold anti-FGM law and protect women and girls from the practice (Narok and Kajiado)<br><br><\/li><\/ul>1.4<br><br>Enhanced advocacy capacity amongst national and subnational CSOs to hold the government of Kenya to account on delivery of its commitments on women and girls rights using national, regional and international human rights commitments.<br><ul><li> Type of actions taken by CSO partners to hold government to account.<\/li><li> Policy Advocacy<\/li><li> Budget Advocacy<\/li><li> Regional and International Advocacy<\/li><li> Media campaigns<\/li><li> Level of political support for legal reform on project themes promoted by partners and other national and subnational CSOs.<br><br><\/li><\/ul>We take your privacy very seriously and we are committed to protecting your personal information online. See our<br><br>Powered by JazzHR<br><br>bBcGSphMcc\"}"
}