{
    "id":"Kaggle::techmap::6130991dcc52335dbd48ce61::linkedin_se::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Are you up for a new challenge? Are you our next digital electronics designer? Your role. Saab is looking for an electronics designer with SW\/FW skills for its laser product unit. Your role will be to develop, improve and maintain new and existing digital electronics solutions and its corresponding SW\/FW. Your main work will include theoretical calculations, practical testing and verification, documentation of work and production support for digital electronic boards. You shall be able to design from a requirements specification and understand how these requirements affect the electrical design and cost. Depending on your personal profile the work will also include: CAD of PCB. Advanced hands on debugging \/ fault finding. Managing component library. SW\/FW development in VHDL, C\/C, Python and LABview. To achieve the above, you are integrated in a team with purchasing, sales, system-, mechanical-, power-, optical. and transmitter-designers. Therefore you need to be able to express yourself in writing and speech. The work is in close contact with the customer it is therefore important that you understand the customer and end-user needs of the products. There will also be close work with the manufacturers and it is therefore a need to understand the process of manufacturing and to communicate requirements and expectations on deliveries. When needed international traveling to customer\/manufactures can occur. You shall also keep yourself updated with the latest electrical standards and regulations. Your profile. We are looking for a person with strong personal drive and result focused. You shall perform your tasks with profound investigations and have the ability to independently gather information from all possible sources. Your working method shall be systematic with written documentation as a normal standard. Your personal skills are: Language skills in Swedish and English is required. Bachelor or Master of Science degree in electrical\/software engineering or corresponding education or corresponding work experience. Structured with drive and quality awareness. Communicative and accurate. See solution to complex problems. Programing skills in C\/C, Pyhton, VHDL and\/or LABview. Experience from CAD of PCB is a merit. Experience of Cadence Allegro is a merit. Experience in Component engineering a merit. Driver license for car is a merit. This position requires that you pass a security vetting based on the current regulations around\/of security protection. For positions requiring security clearance additional obligations on citizenship may apply. What you will be a part of.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6130991dcc52335dbd48ce61::linkedin_se\", \"source\": \"linkedin_se\", \"country\": \"SE\", \"company\": \"Saab\", \"position\": \"Digital electronics designer\", \"notes\": \"\", \"original\": \"<em>Are you up for a new challenge? Are you our next digital electronics designer?<br><br><\/em>Your role<br><br>Saab is looking for an electronics designer with SW\/FW skills for its laser product unit. Your role will be to develop, improve and maintain new and existing digital electronics solutions and its corresponding SW\/FW.<br><br>Your main work will include theoretical calculations, practical testing and verification, documentation of work and production support for digital electronic boards. You shall be able to design from a requirements specification and understand how these requirements affect the electrical design and cost.<br><br>Depending on your personal profile the work will also include:<br><ul><li>CAD of PCB<\/li><li>Advanced hands on debugging \/ fault finding<\/li><li>Managing component library <\/li><li>SW\/FW development in VHDL, C\/C++, Python and LABview <br><\/li><\/ul>To achieve the above, you are integrated in a team with purchasing, sales, system-, mechanical-, power-, optical- and transmitter-designers. Therefore you need to be able to express yourself in writing and speech.<br><br>The work is in close contact with the customer it is therefore important that you understand the customer and end-user needs of the products. There will also be close work with the manufacturers and it is therefore a need to understand the process of manufacturing and to communicate requirements and expectations on deliveries. When needed international traveling to customer\/manufactures can occur.<br><br>You shall also keep yourself updated with the latest electrical standards and regulations.<br><br>Your profile<br><br>We are looking for a person with strong personal drive and result focused. You shall perform your tasks with profound investigations and have the ability to independently gather information from all possible sources. Your working method shall be systematic with written documentation as a normal standard.<br><br>Your personal skills are:<br><ul><li>Language skills in Swedish and English is required<\/li><li>Bachelor or Master of Science degree in electrical\/software engineering or corresponding education or corresponding work experience<\/li><li>Structured with drive and quality awareness<\/li><li>Communicative and accurate<\/li><li>See solution to complex problems<\/li><li>Programing skills in C\/C++, Pyhton, VHDL and\/or LABview<\/li><li>Experience from CAD of PCB is a merit<\/li><li>Experience of Cadence Allegro is a merit<\/li><li>Experience in Component engineering a merit<\/li><li>Driver license for car is a merit<br><\/li><\/ul>This position requires that you pass a security vetting based on the current regulations around\/of security protection. For positions requiring security clearance additional obligations on citizenship may apply.<br><br>What you will be a part of<br><br>The laser development unit is an effective team of : 15 people located in Gothenburg in Sweden where engineering competence for laser rangefinders and other laser products is gathered. The group contains engineering, sales, and project leaders.<br><br>The laser product unit has close contact with purchasing and production.<br><br>The <em>laser product unit<\/em> is a part of the <em>business unit Airborne surveillance system<\/em> which is a part of the <em>business area Surveillance.<br><br><\/em>Saabs culture is expressed in the words Drive, Trust, Expertise and Diversity<br><br>If you are interested in what benefits you can take part of as an employee at Saab in Sweden, you can read more about them here.<br><br>Observe that you can send us your application in either Swedish or English.<br><br>If you have any questions about the job, don\\u00b4t hesitate to contact Stefan Horrdin, Recruiting manager +46 734 18 65 03<br><br><em>If you aspire to help create and innovate whilst developing yourself in a challenging team setting, Saab may well have the perfect conditions for you to grow. We pride ourselves on a nurturing environment, where everyone is different yet we share the same goal \\u2013 to help protect people.<\/em>\"}"
}