{
    "id":"Kaggle::techmap::614e28a048f252376a32d00e::britishjobs_uk::6",
    "label_age":true,
    "analysis_age":"Stating that the role is \"highly suited to Newly Qualified Teachers\" is favouring younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"AK Teaching Limited are looking to recruit Primary Teachers and Teaching Assistants to work in Cramlington and Alnwick from September 2021 onwards to work in long term and permanent roles in our client schools. Often, these roles are highly suited to Newly Qualified Teachers NQTs and we are very experienced in securing NQTs positions that help them complete their induction. These roles are often termly, maternity or fixed term posts, with the ability to complete your NQT induction. Our office in Newcastle covers schools in Gateshead, Newcastle, North Tyneside, Northumberland, and many other areas. We work with both Primary and Secondary schools that have an outstanding reputation in their local area. And are passionate about ensuring our agents provides the best possible education for their children. We have built up great relationships with our partnership schools and as a result we have successfully placed many people in fantastic roles on a short, long term and permanent basis. Salary is dependent on experience, training or qualifications. The minimum experience, training or qualifications required for teaching positions are QTS. AK Teaching is committed to Safeguarding children and young people. We take our responsibilities extremely seriously. All staff we register will undertake thorough interviewing and referencing checks and hold, or be prepared to undergo, an Enhanced DBS Check that must be registered to the Update Service. The role. The desired candidates will be working in our client schools from September 2021. We pride ourselves on our provision of good and outstanding practitioners to fantastic schools in the area. We are looking to hear from passionate and determined Newly Qualified Teachers (NQTs) who are looking to start their career in teaching. Posts are subject to DBS and references. AK Teaching LTD. is committed to safeguarding and promoting the welfare of children. Hold relevant QTS. Have a genuine desire to become part of a committed team of teaching and support staff. Have zero criminal convictions and if not in possession already be willing to apply for a DBS (Disclosure and Barring service) Certificate. Have enthusiasm for learning and supporting teachers and pupils in school. You must have recent experience of working in a classroom environment. As a valued employee of AK Teaching, you will receive:. Excellent daily rates paid weekly. Guaranteed pay scheme (subject to availability and qualifying criteria)..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614e28a048f252376a32d00e::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"AK Teaching Limited\", \"position\": \"Northumberland Based Primary Teacher\/Teaching Assistant\", \"notes\": \"\", \"original\": \"AK Teaching Limited are looking to recruit Primary Teachers and Teaching Assistants to work in Cramlington and Alnwick from September 2021 onwards to work in long term and permanent roles in our client schools. Often, these roles are highly suited to Newly Qualified Teachers NQTs and we are very experienced in securing NQTs positions that help them complete their induction. These roles are often termly, maternity or fixed term posts, with the ability to complete your NQT induction.<br><br>Our office in Newcastle covers schools in Gateshead, Newcastle, North Tyneside, Northumberland, and many other areas. We work with both Primary and Secondary schools that have an outstanding reputation in their local area; and are passionate about ensuring our agents provides the best possible education for their children. We have built up great relationships with our partnership schools and as a result we have successfully placed many people in fantastic roles on a short, long term and permanent basis.<br><br>Salary is dependent on experience, training or qualifications. The minimum experience, training or qualifications required for teaching positions are QTS. AK Teaching is committed to Safeguarding children and young people. We take our responsibilities extremely seriously. All staff we register will undertake thorough interviewing and referencing checks and hold, or be prepared to undergo, an Enhanced DBS Check that must be registered to the Update Service.<br><br>The role<br><br>The desired candidates will be working in our client schools from September 2021. We pride ourselves on our provision of good and outstanding practitioners to fantastic schools in the area. We are looking to hear from passionate and determined Newly Qualified Teachers (NQTs) who are looking to start their career in teaching. Posts are subject to DBS and references. AK Teaching LTD. is committed to safeguarding and promoting the welfare of children.<br><br>To be considered for any role we require that people meet the following minimum standards:<br><br>  * Hold relevant QTS<br><br>  * Have a genuine desire to become part of a committed team of teaching and support staff.<br><br>  * Have zero criminal convictions and if not in possession already be willing to apply for a DBS (Disclosure and Barring service) Certificate.<br><br>  * Have enthusiasm for learning and supporting teachers and pupils in school<br><br>  * You must have recent experience of working in a classroom environment<br><br>As a valued employee of AK Teaching, you will receive:<br><br>&bull; Excellent daily rates paid weekly<br><br>&bull; Guaranteed pay scheme (subject to availability and qualifying criteria).<br><br>&bull; Full compliance with AWR (Agency Workers&rsquo; Regulations), to make sure you get the pay and working conditions you are entitled to.<br><br>&bull; Training to help with your professional development such as Team Teach,<br><br>&bull; &pound;50 refer a friend or colleague bonus scheme after working 10 full days.<br><br>&bull; Access to a dedicated primary consultant, who will provide ongoing support.<br><br>We pride ourselves on our provision of good and outstanding practitioners to fantastic schools in the area. We are looking to hear from passionate and determined Newly Qualified Teachers (NQTs) who are looking to start their career in teaching.<br><br>For more information contact Beth in our Newcastle branch<br><br>Tel: (phone number removed)<br>\"}"
}