{
    "id":"Kaggle::techmap::61319ae98afbd955ab34f6d4::monsterasia_hk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"he \/she\" can be seen as excluding those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job De ion : Clerk I (holding the functional title of Senior Executive Assistant) in the Centre for Civil Society and Governance (Ref. : 508170) (to commence as soon as possible, on a two-year fixed-term basis with contract-end gratuity and University contribution to a retirement benefits scheme, totaling up to 10% of basic salary, with the possibility of renewal subject to satisfactory performance and funding availability). Applicants should possess a Bachelor's degree, with at least 4 years full-time work experience in office, project and teaching programme administration preferably in tertiary education settings. They should have a good command of written and spoken English and Chinese good communication and organizational skills and good knowledge of and skills in computer and web applications (including MS Office, Word. Press and video-conferencing software). The appointee will provide support to office administration, management of project and academic programmes, event planning and execution, social media management, and general IT management. He\/She will also perform any other general clerical duties as assigned by the Director of the Centre. Working outside normal office hours and on weekends may be occasionally required. A highly competitive salary commensurate with qualifications and experience will be offered, in addition to annual leave and medical benefits. The University only accepts online application for the above post. Applicants should apply online and upload an up-to-date CV. Review of applications will start as soon as possible and continue until September 30, 2021, or until the post is filled, whichever is earlier.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61319ae98afbd955ab34f6d4::monsterasia_hk\", \"source\": \"monsterasia_hk\", \"country\": \"HK\", \"company\": \"The University of Hong Kong\", \"position\": \"Clerk I (holding the functional title of Senior Executive Assistant)\", \"notes\": \"\", \"original\": \"<br>Job De ion :<br>Clerk I (holding the functional title of Senior Executive Assistant) in the Centre for Civil Society and Governance (Ref.: 508170) (to commence as soon as possible, on a two-year fixed-term basis with contract-end gratuity and University contribution to a retirement benefits scheme, totaling up to 10% of basic salary, with the possibility of renewal subject to satisfactory performance and funding availability)<br>Applicants should possess a Bachelor's degree, with at least 4 years full-time work experience in office, project and teaching programme administration preferably in tertiary education settings. They should have a good command of written and spoken English and Chinese good communication and organizational skills and good knowledge of and skills in computer and web applications (including MS Office, WordPress and video-conferencing software).<br>The appointee will provide support to office administration, management of project and academic programmes, event planning and execution, social media management, and general IT management. He\/She will also perform any other general clerical duties as assigned by the Director of the Centre. Working outside normal office hours and on weekends may be occasionally required.<br>A highly competitive salary commensurate with qualifications and experience will be offered, in addition to annual leave and medical benefits.<br>The University only accepts online application for the above post. Applicants should apply online and upload an up-to-date CV. Review of applications will start as soon as possible and continue until <strong><u>September 30, 2021<\/u><\/strong>, or until the post is filled, whichever is earlier.\"}"
}