{
    "id":"Kaggle::techmap::61448162b690c70161a9ad68::linkedin_pa::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Apply strategic thinking in order to aid and recommend for shop decisions such as industrial health and modernization. Provide electronic and written deliverables as required in a timely and efficient manner as not to delay Government progress. Ensure Contractor personnel complete mandatory and required training on time or ahead of schedule and maintain an electronic list of all trainings, certifications, licenses and appropriate expiration dates per employee. Be available and onsite (NSWC-PCD) during normal working hours and available after hours if needed. Qualifications. Minimum Qualifications: 10 years experience in project management, with 5 years in a production environment including fabrication and shop planning preferred. Experience in evaluating performance requirements including providing data analysis for cost control, scheduling, performance, and quality. Experience with fabrication processes required for unique prototypes that have specialized and stringent requirements. Experience in job prioritization, resource and personnel allocation based on skill sets and customer needs. Understanding and interpreting shop drawings, sketches, schematics and design documents including geometric dimensioning and tolerance standards. Experience applying quality control and quality assurance procedures. to material and parts manufacturing. Communicating effectively and working closely with employees, suppliers, engineers, technicians, and scientists. Proficient in Excel, Word and Outlook. Active U. S. Secret Clearance. Auto req ID. 325276BR. Affiliate Sponsor. Akima. Minimum Education Required. High School\/GED. JobCategory. Manufacturing. City. Panama City. State. Florida. Job Code. Project Management.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61448162b690c70161a9ad68::linkedin_pa\", \"source\": \"linkedin_pa\", \"country\": \"PA\", \"company\": \"VetJobs\", \"position\": \"Project Manager - NSWC SHOPS - Panama City, FL\", \"notes\": \"\", \"original\": \"<strong><u>Job Description<br><br><\/u><\/strong><strong>Attention Veterans, Transitioning Military, National Guard Members, Military Spouses and Caregivers of War Wounded: To apply for this position, please click on the submit button and follow the instructions.<br><br><\/strong><strong>Lynxnet, an Akima Company, <\/strong>is an agile and innovative government contractor focused on delivering the very best value to every customer. We are also a military-friendly employer, supporting critical initiatives in rapid prototyping and fabrication, program support services, and technical support services across the Department of Defense, Homeland Security and federal civilian agencies. Our personnel enjoy competitive benefits packages and challenging roles in work environments committed to innovation, diversity and opportunity for career growth. As an Alaska Native Corporation (ANC), 100% of our company\\u2019s profits go back to our 14,300 I\\u00f1upiat shareholders that have resided near and above the Arctic Circle for more than 10,000 years. Our business helps support their way of life and contributes to the survival of a culture that has thrived in a challenging environment.<br><br><strong><u>Job Responsibilities<br><\/u><\/strong><ul><li> Responsible for managing a full production and fabrication of parts shop environment <\/li><li> Familiarity with Cost Plus contracts and managing DOD projects (i.e. understanding FAR, project financials, etc.) while managing deliverables and tasks allocated in the SOW. <\/li><li> Supervise on-site contract personnel including tradesmen effectively to ensure productivity and fabrication of high-quality products (i.e. Planners, Machinists, Painters, Welders, Riggers and Machine Maintenance workers) <\/li><li> Ensure recruitment and retention strategies and processes are in place to address demand. <\/li><li> Attend and facilitate weekly Shop production meetings providing status updates for each work order and machinery <\/li><li> Ensure proper, safe, and secure usage of Government furnished equipment and material including but not limited to machinery, tooling, facilities, Hazardous Materials (HAZMAT), Information Technology (IT) assets, etc. <\/li><li> Invoicing - facilitate accurate and timely billing of shop projects. Submit accurate electronic weekly job billing sheets for all Contractor personnel indicating the labor hours and equipment hours expended broken down by work order number. <\/li><li> Ensure cost control, schedule, and quality product execution regarding planning, estimating, and executing work meets or exceeds performance-based requirements. <\/li><li> Assist with the purchasing and procurement of equipment and material <\/li><li> Responsible for outsourcing shop work and operational requirements when capacity or capability issues arise <\/li><li> Consult with the Government personnel and Production Manager to determine the priority of each work order. <\/li><li> Perform proper resourcing and personnel allocation based on skill sets and customer need for each job. <\/li><li> Apply strategic thinking in order to aid and recommend for shop decisions such as industrial health and modernization. <\/li><li> Provide electronic and written deliverables as required in a timely and efficient manner as not to delay Government progress. <\/li><li> Ensure Contractor personnel complete mandatory and required training on time or ahead of schedule and maintain an electronic list of all trainings, certifications, licenses and appropriate expiration dates per employee. <\/li><li> Be available and onsite (NSWC-PCD) during normal working hours and available after hours if needed <br><\/li><\/ul><strong><u>Qualifications<br><br><\/u><\/strong><strong> Minimum Qualifications: <br><\/strong><ul><li> 10 years\\u2019 experience in project management, with 5 years in a production environment including fabrication and shop planning preferred <\/li><li> Experience in evaluating performance requirements including providing data analysis for cost control, scheduling, performance, and quality. <\/li><li> Experience with fabrication processes required for unique prototypes that have specialized and stringent requirements. <\/li><li> Experience in job prioritization, resource and personnel allocation based on skill sets and customer needs. <\/li><li> Understanding and interpreting shop drawings, sketches, schematics and design documents including geometric dimensioning and tolerance standards. <\/li><li> Experience applying quality control and quality assurance procedures.to material and parts manufacturing <\/li><li> Communicating effectively and working closely with employees, suppliers, engineers, technicians, and scientists. <\/li><li> Proficient in Excel, Word and Outlook <\/li><li> Active U.S. Secret Clearance <br><\/li><\/ul><strong>Auto req ID<br><br><\/strong>325276BR<br><br><strong>Affiliate Sponsor<br><br><\/strong>Akima<br><br><strong><u>Minimum Education Required<br><br><\/u><\/strong>High School\/GED<br><br><strong>Job_Category<br><br><\/strong>Manufacturing<br><br><strong>City*<br><br><\/strong>Panama City<br><br><strong>State*<br><br><\/strong>Florida<br><br><strong>Job Code<br><br><\/strong>Project Management\"}"
}