{
    "id":"Kaggle::techmap::614d71073312cb28ebe6f304::monsterasia_my::2",
    "label_age":true,
    "analysis_age":"\"Matured personality\" is a very subjective term and open to interpretation. Could discourage many from applying.",
    "label_disability":true,
    "analysis_disability":"\" Individual may be required to sit, stand, walk regularly and occasionally lift 0-10kg\" - no clarification offered about accommodations. Could be interpreted as being subtly biased against those with disabilities.",
    "label_masculine":true,
    "analysis_masculine":"The job description uses terms such as \"Strong leadership skills,\" \"Strong knowledge,\" \"Excellent problem-solving skills,\" \"Ability to challenge and debate issues,\" and \"Ability to look at situations from multiple points of view.\" These terms are often associated with masculine-coded language that may subtly favour male candidates over female candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Registered Safety and Health officer with DOSH is a must. Experience in a Managerial roles is an added advantage. Other HSE competency is an added advantage. Knowledge\/Skills: Strong leadership skills and execute the safety program. Strong knowledge of HSE Management system (ISO 14001 and ISO 45001). - A good understanding of local HSE regulations is a must. Excellent verbal and written communication skills. Excellent problems solving skills. Excellent interpersonal skills and a collaborative management\/working style. Demonstrated commitment to high professional ethical standards. Ability to challenge and debate issues of importance to the organization tactfully. and professionally. Ability to look at situations from multiple points of view to arrive at optimum. solutions. Ability to delegate and manage multiple responsibilities effectively. Fluent user of Microsoft Office software suite. Supervises: No direct reports. PHYSICAL\/MENTAL REQUIREMENTS: Matured personality. Ability to solve complex practical problems. Deal with a wide variety of variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. Ability to work effectively under pressure to meet deadlines. Individual may be required to sit, stand, walk regularly and occasionally lift 0-10kg. WORK ENVIRONMENT: Work environment is typically considered an office environment located on-site, within a Smiths location during normal or extended business hours. Work environment may also include employee's residence, customer site & meeting venues, or to other location as required. About Smiths. At Smiths we apply leading-edge technology to design, manufacture and deliver market-leading innovative solutions that meet our customers evolving needs, and touch the lives of millions of people every day. We are a FTSE100, global business of around 23, 000 colleagues, based in 55 countries. Our solutions have a real impact on lives across the planet, enabling industry, improving healthcare, enhancing security, advancing connectivity and supporting new homes. Our products and services are often critical to our customers operations, while our proprietary technology and high service levels help create competitive advantage. We welcome colleagues with a curious mind, who are happy with responsibility, enjoy a challenge and are attracted by the idea of working at a business with an almost 170 year history of innovation, and five global divisions, all experts in their field. About Smiths Detection. Smiths Detection is a global leader in threat detection and screening technologies for aviation, ports and borders, urban security and defence.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d71073312cb28ebe6f304::monsterasia_my\", \"source\": \"monsterasia_my\", \"country\": \"MY\", \"company\": \"Smiths Group\", \"position\": \"ASSISTANT HSE MANAGER\", \"notes\": \"\", \"original\": \"<br>Job Description<br>. To support technical and functional responsibilities related to health, safety and environment and loss prevention as of company goals and objectives.<br>. Engage appropriate stakeholders to ensure collaboration in development and full implementation of HSE policies and procedures to ensure regulatory compliance.<br>. Develop and implement best practice procedures, develop and report key performance indicators and enforce all safety regulations are followed<br>. Develop training and audit\/inspection tools to support robust HSE program. Support specific HSE processes and procedures in support of site initiatives and direction. Develop programs specifically designed to improve site HSE provision.<br>. Develop and implement plans, processes and procedures to ensure conformance with regulatory and where appropriate HSE Management System certifications and company requirements and initiatives at site<br>. Work with the site management to ensure they understand and able to provide a safe place of work for their reports, understand the impact of decisions on HSE and their role in environmental management<br>Duties & Responsibilities<br>. At a tactical level facilitate robust site HSE and LP programs designed to comply with national, state, local and company requirements to ensure regulatory compliance, reduced risk of employee injury, company loss or exposure, and environmental releases.<br>. Support in the development of specific HSE processes and procedures in support of company-wide initiatives and direction.<br>. Develop and implement plans, process and procedures to maintain HSE management system certifications (ISO 14001 and ISO 45001) and coordinate for external audit schedules for HSE management system certification audit, compliance audits and other audits.<br>. Engage site and service management teams to ensure they are equipped to be responsible for and control HSE & LP matters.<br>. Provide leadership with subject matter expertise that ensures they understand appropriate HSE systems and ensure they are in place.<br>. Develop and implement plans, processes and procedures to ensure conformance with regulatory, and company requirements and initiatives.<br>. Manage and track site Key Performance Indicators and drive site improvements toward goals. Lead problem resolution and provide site leadership with guidance on possible solutions.<br>. Ensure the timely & accurate reporting of HSE performance data and incidents.<br>. Drive reviews to recognise Hazards at site and ensure execution of tactical and strategic initiatives eliminate \/ control risks driving continuous HSE performance improvement.<br>. Work with site management teams to assess HSE hazards and assist where specific technical expertise is required to meet local regulations or company policies, procedures and programs.<br>. Plan and direct site HSE activities and programs establish priority for project execution based upon risk presented.<br>. Actively participate in the investigation of significant HSE incidents and ensure timely and complete implementation of corrective actions.<br>. Be aware of and ensure HSE participation in site Continuous Improvement activity.<br>. Support the Regional HSE Manager and organization in the sharing of current processes, best practices and site capabilities.<br>. Work proactively with site team to resolve issues and implement appropriate solutions.<br>. Engage local contacts on status of proposed changes to regulatory requirements for Malaysia<br>. Contribute to the development of future HSE initiatives and collaboration with relevant authorities on matters pertaining to occupational safety and health<br>. Actively participate in HSE related organizations or trade associations to ascertain current industry trends<br>. Responsible for ensuring the overall effectiveness and efficiency of site security administration of company premises and access controls<br>. Develops, implements and maintains security policy, procedures and system to meet the corporate security requirement and compliance to local regulations.<br>. Provide security advise and lead the security investigation where necessary<br>. Supervise security guards in their daily specific duties i.e access controls of staffs, contractors and visitors, inspection of the vehicles and patrolling.<br>. Liaise with local security enforcement and other external security provider on security monitoring issues and services<br>. Collaborate with internal and external training provider to update, develop and implement security training programs<br>. Perform vulnerability risk analysis and site security assessment<br>. Plan and work with Global Security Manager and Director on site security improvement<br>. Special HSE and Security projects assigned from time to time<br>Diversity & Inclusion<br>We believe that different perspectives and backgrounds are what make a company flourish. All qualified applicants will receive equal consideration for employment regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, economic status, disability, age, or any other legally protected characteristics. We are proud to be an inclusive company with values grounded in equality and ethics, where we celebrate, support, and embrace diversity.<br>The Individual<br>Education\/Training: BS or MS in Health, Safety and Environment or equivalent or five to eight years related HSE experience and\/or training or equivalent combination of education and experience. All certification required to be recognised as an HSE professional in local jurisdiction.<br>Experience: - Minimum of five years manufacturing experience in a safety related position<br>with three years serving in HSE management systems.<br>- Registered Safety and Health officer with DOSH is a must<br>- Experience in a Managerial roles is an added advantage<br>- Other HSE competency is an added advantage<br>Knowledge\/Skills: - Strong leadership skills and execute the safety program.<br>- Strong knowledge of HSE Management system (ISO 14001 and ISO 45001)<br>- A good understanding of local HSE regulations is a must<br>- Excellent verbal and written communication skills.<br>- Excellent problems solving skills.<br>- Excellent interpersonal skills and a collaborative management\/working style.<br>- Demonstrated commitment to high professional ethical standards.<br>- Ability to challenge and debate issues of importance to the organization tactfully<br>and professionally.<br>- Ability to look at situations from multiple points of view to arrive at optimum<br>solutions.<br>- Ability to delegate and manage multiple responsibilities effectively.<br>- Fluent user of Microsoft Office software suite.<br>Supervises: No direct reports<br>PHYSICAL\/MENTAL REQUIREMENTS:<br>. Matured personality<br>. Ability to solve complex practical problems<br>. Deal with a wide variety of variables in situations where only limited standardization exists<br>. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form<br>. Ability to work effectively under pressure to meet deadlines<br>. Individual may be required to sit, stand, walk regularly and occasionally lift 0-10kg<br>WORK ENVIRONMENT:<br>Work environment is typically considered an office environment located on-site, within a Smiths location during normal or extended business hours. Work environment may also include employee's residence, customer site & meeting venues, or to other location as required.<br>About Smiths<br>At Smiths we apply leading-edge technology to design, manufacture and deliver market-leading innovative solutions that meet our customers evolving needs, and touch the lives of millions of people every day. We are a FTSE100, global business of around 23,000 colleagues, based in 55 countries. Our solutions have a real impact on lives across the planet, enabling industry, improving healthcare, enhancing security, advancing connectivity and supporting new homes. Our products and services are often critical to our customers operations, while our proprietary technology and high service levels help create competitive advantage. We welcome colleagues with a curious mind, who are happy with responsibility, enjoy a challenge and are attracted by the idea of working at a business with an almost 170 year history of innovation, and five global divisions, all experts in their field.<br>About Smiths Detection<br>Smiths Detection is a global leader in threat detection and screening technologies for aviation, ports and borders, urban security and defence. With more than 40 years of field-tested experience, we deliver the solutions needed to protect society from the threat and illegal passage of explosives, prohibited weapons, contraband, toxic chemicals and narcotics. Every minute of every day our technology and our people make the world a safer place. Smiths Detection is part of Smiths Group, a global leader in applying advanced technologies to markets in threat as well as contraband detection, energy, medical devices, communications and engineered components. Smiths Group employs around 23,000 people in more than 50 countries.\"}"
}