{
    "id":"Kaggle::techmap::6149f436f04ffe48df1fb57a::headhunter_kz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  6 . ,  . : 10years field pre-commissioning and commission experience of mechanical equipment and systems. Direct involvement with Systems Completion work processes, procedures, ITRs and check-sheets. Develop work execution plans work method statements, resourced schedules with vendor support. Direct supervision of commissioning technicians, and specialty sub-contractors for assigned systems. Supervise multiple crews. dynamic testing of rotating equipment Oil flushing\/ Chemical cleaning techniques \/ Steam blow \/ N2He leak testing activities. Fixed\/ Static Equipment. Plan and execute firsts fill loading of lubes -chemicals- catalyst. Direct involvement in SIMOPs. Commission Utility and Process Systems. Interface with construction, Engineering, Operations Maintenance & Reliability teams to resolve issues. Understanding and application of Safety and IIF principles and behaviors. RoK Regulatory Authority requirements. Developing and implementing the Systems Completion process. CPMS, the integration of OE into CPMS, project management skills, and CPDEP principles and associated processes, practices, and tools (including front-end loading, project execution and administrative methodology) in multiple phases. Operational Excellence principles and how they are implemented through the Systems Completion process. : Tengiz 28\/28.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6149f436f04ffe48df1fb57a::headhunter_kz\", \"source\": \"headhunter_kz\", \"country\": \"KZ\", \"company\": \"FIRCROFT ENGINEERING SERVICES LIMITED, KAZAKHSTAN\", \"position\": \"SC Utilities Piping Coordinator (Utilities\/NS)\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u0431\\u043e\\u043b\\u0435\\u0435 6 \\u043b\\u0435\\u0442<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u041f\\u043e\\u043b\\u043d\\u0430\\u044f \\u0437\\u0430\\u043d\\u044f\\u0442\\u043e\\u0441\\u0442\\u044c<!-- -->, <span>\\u0412\\u0430\\u0445\\u0442\\u043e\\u0432\\u044b\\u0439 \\u043c\\u0435\\u0442\\u043e\\u0434<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <strong>\\u0422\\u0440\\u0435\\u0431\\u043e\\u0432\\u0430\\u043d\\u0438\\u044f:<\/strong> \\n  <ul> \\n   <li>10years\\u2019 field pre-commissioning and commission experience of mechanical equipment and systems.<\/li> \\n   <li>Direct involvement with Systems Completion work processes, procedures, ITR\\u201ds and check-sheets<\/li> \\n   <li>Develop work execution plans work method statements, resourced schedules with vendor support.<\/li> \\n   <li>Direct supervision of commissioning technicians, and specialty sub-contractors for assigned systems<\/li> \\n   <li>Supervise multiple crews. \\n    <ul> \\n     <li>dynamic testing of rotating equipment \\n      <ul> \\n       <li>Oil flushing\/ Chemical cleaning techniques \/ Steam blow \/ N2He leak testing activities<\/li> \\n       <li>Fixed\/ Static Equipment<\/li> \\n      <\/ul> <\/li> \\n    <\/ul> <\/li> \\n   <li>Plan and execute firsts fill loading of lubes -chemicals- catalyst.<\/li> \\n   <li>Direct involvement in SIMOPs<\/li> \\n   <li>Commission Utility and Process Systems<\/li> \\n   <li>Interface with construction, Engineering, Operations Maintenance &amp; Reliability teams to resolve issues<\/li> \\n   <li>Understanding and application of Safety and IIF principles and behaviors<\/li> \\n   <li>RoK Regulatory Authority requirements<\/li> \\n   <li>Developing and implementing the Systems Completion process<\/li> \\n   <li>CPMS, the integration of OE into CPMS, project management skills, and CPDEP principles and associated processes, practices, and tools (including front-end loading, project execution and administrative methodology) in multiple phases<\/li> \\n   <li>Operational Excellence principles and how they are implemented through the Systems Completion process<\/li> \\n  <\/ul> <strong>\\u0423\\u0441\\u043b\\u043e\\u0432\\u0438\\u044f:<\/strong> \\n  <ul> \\n   <li>Tengiz 28\/28<\/li> \\n  <\/ul>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\"}"
}