{
    "id":"Kaggle::techmap::614d7b1b9fec692ae986f887::linkedin_iq::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The requirement for \"fluent\" English can disadvantage candidates whose first language is not English, potentially favouring native English speakers and excluding those who may have adequate levels of proficiency.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2 years of relevant experience at the national or international level in procurement management. CIPS I. I is compulsory and required. Experience in Crisis country is a tremendous asset. Language skills. English(Mandatory), Level - Fluent. Arabic(Optional), Level. Working Knowledge. Area of expertise Procurement and contracting Area of expertise details. Experience in the usage of computers and office software packages (MS Word, Excel, etc) and advance knowledge of web based management systems. Driving license Competencies values Accountability, Client Orientation, Commitment and Motivation, Communication, Integrity, Planning and Organizing, Professionalism Application procedure. Not yet registered in the UNV Talent Pool? Please first register your profile at httpsvmam. unv. org\/candidate\/signup. Important: After creating your account, complete all sections of your profile and submit it. Then go to My Page at httpsvmam. unv. org\/candidate\/mypage and click on the Special Calls hyperlink. Lastly, select the special call to which you would like to apply. Already registered in the UNV Talent Pool? Please first update your profile at httpsvmam. unv. org\/candidate\/profile. Then go to My Page at httpsvmam. unv. org\/candidate\/mypage and click on the Special Calls hyperlink to select the special call to which you would like to apply. This is a national UN Volunteer assignment, therefore only nationals of Iraq and legal residents in Iraq with the status of refugee or with the status of being stateless are eligible to apply. Application deadline: 29-09-2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d7b1b9fec692ae986f887::linkedin_iq\", \"source\": \"linkedin_iq\", \"country\": \"IQ\", \"company\": \"UNV LTD\", \"position\": \"Procurement Analyst\", \"notes\": \"\", \"original\": \"Eligibility criteria Minimum age: 22 years old. Applicants must be nationals of or legal residents in the country of assignment. Description of task<br><ul><li>Ensures elaboration and implementation of operational strategies focusing on achievement of the following results:<br><\/li><\/ul>Full compliance of procurement activities with UN\/UNDP rules, regulations, policies and strategies; elaboration of the effective internal control, proper design and functioning of a client-oriented procurement management system<br><ul><li>Elaboration and implementation of cost saving and reduction strategies.<\/li><li>Conceptualization, elaboration and implementation of contract strategy in the stabilization project including tendering processes and evaluation, contractor appraisal, evaluation and negotiation of offers, management of the contract and contractor, legal considerations and payment conditions, risk assessment and developing mitigation strategies.<\/li><li>Conceptualization, elaboration and implementation of strategic procurement for the office and projects including sourcing strategy, supplier selection and evaluation, quality management, customer relationship management, e-procurement introduction and promotion, performance measurement.<\/li><li>2. Ensures efficient management of procurement processes focusing on achievement of the following results: <\/li><li>Ensure quality in the preparation of all procurement documentation including organization of RFQ, ITB, RFP and IC Notices, receipt and evaluation of quotations, bids and proposals, negotiation of certain conditions of contracts in full compliance with UNDP rules and regulation.<\/li><li>Establishment and implementation of proper monitoring system and control of procurement processes;<\/li><li>Preparation and submissions of procurement cases to the UNDP review Committees (CAP\/RACP\/ACP).<\/li><li>Management of procurement contracts and perform functions of a Buyer in Atlas.<\/li><li>Elaboration and implementation of the internal control system which ensures that Purchase Orders (PO) are duly prepared and dispatched. Timely corrective actions on POs with budget check errors and other problems.<\/li><li>Management of the implementation of the procurement processes monitoring system and mechanisms to eliminate deficiencies in procurement.<\/li><li>Ensures timely delivery of procurement processes for the assigned Projects, which constitute the bulk of the procurement requests.<\/li><li>Ensures elaboration, introduction and implementation of sourcing strategy and e-procurement tools focusing on achievement of the following results: <\/li><li>Development and management of the rosters of suppliers, elaboration of supplier selection and evaluation, quality and performance measurement mechanisms.<\/li><li>Management of the e-procurement system in the CO.<\/li><li>Synthesis of lessons learned and best practices in Procurement.<\/li><li>Sound contributions to knowledge networks and communities of practice.<br><\/li><\/ul>Qualifications\/Requirements Required degree level Bachelor degree or equivalent Educational additional comments<br><br>Bachelor Degree or equivalent in Business Administration, Public Administration, Finance, Economics or related field.<br><br><strong><u>Required<br><br><\/u><\/strong>Required experience 24 Months Experience remark<br><br>2 years of relevant experience at the national or international level in procurement management.<br><ul><li>CIPS II is compulsory and required.<\/li><li>Experience in Crisis country is a tremendous asset.<\/li><\/ul> Language skills<br><ul><li>English(Mandatory), Level - Fluent<\/li><li>Arabic(Optional), Level - Working Knowledge<\/li><\/ul> Area of expertise Procurement and contracting Area of expertise details<br><br>Experience in the usage of computers and office software packages (MS Word, Excel, etc) and advance knowledge of web based management systems<br><br>Driving license Competencies values Accountability, Client Orientation, Commitment and Motivation, Communication, Integrity, Planning and Organizing, Professionalism Application procedure * Not yet registered in the UNV Talent Pool? Please first register your profile at https:\/\/vmam.unv.org\/candidate\/signup. Important: After creating your account, complete all sections of your profile and submit it. Then go to \\u2018My Page\\u2019 at https:\/\/vmam.unv.org\/candidate\/mypage and click on the \\u2018Special Calls\\u2019 hyperlink. Lastly, select the special call to which you would like to apply. * Already registered in the UNV Talent Pool? Please first update your profile at https:\/\/vmam.unv.org\/candidate\/profile. Then go to \\u2018My Page\\u2019 at https:\/\/vmam.unv.org\/candidate\/mypage and click on the \\u2018Special Calls\\u2019 hyperlink to select the special call to which you would like to apply. This is a national UN Volunteer assignment, therefore only nationals of Iraq and legal residents in Iraq with the status of refugee or with the status of being stateless are eligible to apply. Application deadline: 29-09-2021\"}"
}