{
    "id":"Kaggle::techmap::61464d5c7d35694f6a3d408d::linkedin_si::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" $3, 000 Sign on bonus for Full Time new hires! For an immediate interview, please contact Leah Wiggins at 509.758. 2523 or at prestigecare. com. What does a Certified Nursing Assistant (CNA) do? The Certified Nursing Assistant is responsible for providing residents with direct nursing care and assistance with daily activities under the direction of a Licensed Nurse and as directed in resident care plan. Nursing Assistant Certified (NAC), and Nursing Assistant Registered (NAR) are the state of Washington only. In this job, every day you will. Ensure residents personal care needs are being met through routine check-ins and promptly responding to call lights. Provide care to residents as outlined in the resident care plan. Reviews changes to resident care plans daily. Communicate observed changes in the residents condition to charge nurse for assessment. Assist residents with individual personal care needs such as grooming, bathing, oral hygiene, feeding, incontinent care, toileting, skin care, or other needs as required in the residents care plan. Perform tasks as assigned by the charge nurse including but not limited to taking vital signs, capturing residents weights, and collecting specimens. Lift, move, and transfer residents using proper methods and lifting devices as required in the resident care plan. Document care and assistance provided to residents as required by company policy. Protect the personal belongings of each resident such as eyeglasses, dentures, hearing aids, furnishings, jewelry, clothing, and memorabilia. Promptly report missing items according to established policy. Complete all job duties while following required infection control procedures, including but not limited to thorough hand washing, proper use of personal protective equipment and proper disposal of soiled materials. Follow and supports fire life safety practices and procedures and promptly reports any unsafe conditions or equipment to immediate supervisor. Complete all requirements for in-service training. Perform other duties as assigned. Education & Experience You Need To Qualify. A high school diploma or equivalent knowledge and skills obtained through a combination of education, training, and experience. Must hold current Certification in the specific state in which you wish to practice. Ability to communicate effectively, in English, with residents, visitors, and staff. Good written and oral communication skills. Ability to understand verbal directions and read written instructions. Ability to understand the daily needs of residents. Ability to read and interpret documents, including safety rules, operating and maintenance instructions, and procedure manuals.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61464d5c7d35694f6a3d408d::linkedin_si\", \"source\": \"linkedin_si\", \"country\": \"SI\", \"company\": \"Prestige Care, Inc.\", \"position\": \"Certified Nursing Assistant (CNA)\", \"notes\": \"\", \"original\": \"<strong>$3,000 Sign on bonus for Full Time new hires! <\/strong><strong>For an immediate interview, please contact Leah Wiggins at 509.758.2523 or at <u> lwiggins@prestigecare.com <br><br><\/u><\/strong><strong>What does a Certified Nursing Assistant (CNA) do?<br><br><\/strong>The Certified Nursing Assistant is responsible for providing residents with direct nursing care and assistance with daily activities under the direction of a Licensed Nurse and as directed in resident care plan.<br><br><em><strong>Nursing Assistant Certified (NAC), and Nursing Assistant Registered (NAR) are the state of Washington only.<br><br><\/strong><\/em><strong>In this job, every day you will\\u2026<br><\/strong><ul><li> Ensure resident\\u2019s personal care needs are being met through routine check-ins and promptly responding to call lights.<\/li><li>Provide care to residents as outlined in the resident care plan. Reviews changes to resident care plans daily.<\/li><li>Communicate observed changes in the resident\\u2019s condition to charge nurse for assessment.<\/li><li>Assist residents with individual personal care needs such as grooming, bathing, oral hygiene, feeding, incontinent care, toileting, skin care, or other needs as required in the resident\\u2019s care plan.<\/li><li>Perform tasks as assigned by the charge nurse including but not limited to taking vital signs, capturing residents\\u2019 weights, and collecting specimens.<\/li><li>Lift, move, and transfer residents using proper methods and lifting devices as required in the resident care plan.<\/li><li>Document care and assistance provided to residents as required by company policy.<\/li><li>Protect the personal belongings of each resident such as eyeglasses, dentures, hearing aids, furnishings, jewelry, clothing, and memorabilia. Promptly report missing items according to established policy.<\/li><li>Complete all job duties while following required infection control procedures, including but not limited to thorough hand washing, proper use of personal protective equipment and proper disposal of soiled materials.<\/li><li>Follow and supports fire life safety practices and procedures and promptly reports any unsafe conditions or equipment to immediate supervisor.<\/li><li>Complete all requirements for in-service training.<\/li><li>Perform other duties as assigned.<br><\/li><\/ul><strong><u>Education &amp; Experience You Need To Qualify<br><\/u><\/strong><ul><li>A high school diploma or equivalent knowledge and skills obtained through a combination of education, training, and experience.<\/li><li>Must hold current Certification in the specific state in which you wish to practice.<\/li><li>Ability to communicate effectively, in English, with residents, visitors, and staff. Good written and oral communication skills. Ability to understand verbal directions and read written instructions. Ability to understand the daily needs of residents. Ability to read and interpret documents, including safety rules, operating and maintenance instructions, and procedure manuals.<\/li><li>Ability to add, subtract, multiply, and divide simple numbers.<\/li><li>Ability to accurately observe, report, and problem-solve residents\\u2019 needs with assistance of a supervisor. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.<\/li><li>Work with residents in a Skilled Nursing Center. Potential exposure to blood and bodily fluids.<br><\/li><\/ul><strong>Why join the Prestige Care Family in the Certified Nursing Assistant (CNA) role and what can we offer you?<br><\/strong><ul><li>We are a 35+ year old, family owned and operated organization that has a strong promote from within culture. We have a defined career path for you to take, if you want to move up.<\/li><li>any locations so you can move up sooner, into leadership roles, where you can have greater job titles, make more money, and have a larger impact.<\/li><li>Robust and comprehensive benefits package including medical, dental, vision, EAP, 401k match, employer paid life and disability insurance, and more.<\/li><li>Accessible and engaging local and regional nursing support staff to bounce ideas off of, get additional guidance + training, and partnership to allow you to be a high performer.<\/li><li>Lots of training and support from the Resident Care Managers, Staff Development Coordinators, Registered Nurses, and Directors of Nursing.<br><\/li><\/ul><strong>Ways you can advance beyond the Certified Nursing Assistant (CNA) role:<br><br><\/strong>Once you master this role, you could consider the Lead CNA, Central Supply Coordinator, or with additional education, the Licensed Practical Nurse (LPN), Registered Nurse (RN) or other more clinical jobs with Prestige Care.<br><br>EOE\/M\/F\/VETS\/DISABLED \\u2013 At Prestige, it is our promise to personally touch lives every day. It is a philosophy of caring based on our core values of integrity, trust, commitment, and respect, that are at the center of all that we do. We are committed to a diverse and inclusive workforce that represents all of us, coming from different experiences, cultures, backgrounds, and viewpoints. Inclusion is the way we treat one another and how we celebrate what makes us different.<br><br><strong> <strong> In adherence with state mandates, Prestige Care team members are required to be fully vaccinated for COVID-19 by October 18, 2021 as a condition of employment, unless a team member qualifies for a religious or medical exemption. <\/strong> <br><br><\/strong><strong>Prestige Care and Rehabilitation - Clarkston<br><br><\/strong><strong><u>Information About Prestige Care &amp; Rehabilitation - Clarkston<br><br><\/u><\/strong>Located in Beautiful Clarkston, WA, at 1242 11th Street, Prestige Care &amp; Rehabilitation provides the comfort of knowing that each resident is well cared for in a safe and pleasant environment. We promote a positive and healthy atmosphere so that our residents can achieve the highest level of independence on their recovery journey. We provide the very best in physical therapy, occupational therapy, speech therapy and restorative nursing. During your recovery, our center also provides a comprehensive program of stimulating activities for all our patients to meet social, recreational, and spiritual care needs. In addition, our food service manager takes pride in planning well-balanced meals personalized to nutritional needs and tastes. We are situated in the southeastern part Washington State, within very close proximity to Tri-State Memorial Hospital.<br><br>U.S. News evaluated more than 15,000 centers nationwide on key service differentiators, including quality of care, safety of residents, health inspection grades, staffing and more. Prestige Care &amp; Rehabilitation - Clarkston earned high ratings in these categories and was awarded the \\u201cBest Nursing Home\\u201d distinction by U.S. News. Join our award-winning care team today!<br><br><strong><u>Who Is Prestige Care\/Prestige Senior Living?<br><br><\/u><\/strong>Prestige Care is a family of over 75 skilled nursing + post-acute care centers, as well as assisted living and memory care communities in 8 Western states. We are an organization of over 5,000 team members who serve thousands of residents, where we have the privilege of personally touching their lives every day.<br><br>We have four core values of integrity, trust, commitment, and respect that guide everything that we do. With a strong commitment to career development and advancement, Prestige Care is a employer that can help you achieve your career goals and objectives. With a healthcare career at Prestige Care, you will enjoy a collaborative, team-oriented environment where your work truly matters at the end of every day.\"}"
}