{
    "id":"Kaggle::techmap::6156132ea6740c534abc5378::monster_ca::0",
    "label_age":true,
    "analysis_age":"The specification \"Part of the Youth Hiring Program\" and the intention to \"hire and employ Youths in the Community under the age of 30\" explicitly favours younger candidates, potentially disadvantaging older candidates who may have the relevant experience and skills but do not fit within the age limit of the program.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description Company Overview. Recreation Marketing was founded and established in 2017, by our management team that has 30 years experience in trade marketing, distribution, brand management and pricing strategy in heavily regulated industries: cannabis, tobacco and vaping. Partnered with Turning Point Brands, the ownera€s to the rights of Zig-Zag in North America, the company is poised to grow and build on the iconic brand in the Canadian Market. From the management team all the way down, Re. Creation Marketing has assembled a team with dynamic and agile skill sets, needed to thrive in these heavily regulated industries. We are an experienced team, with a company that is growing quickly and providing a lot of opportunity. We are flexible, collaborative and looking for people who want to quickly establish their place in a company and grow fast. We will provide a competitive base salary with bonus and car allowance. Part of the Youth Hiring Program. This position is intended to hire and employ Youths in the Community under the age of 30 and above the age of majority to provide knowledge and experience in their field. The Role. Prepare and analyze financial ratios. Preparation of monthly and weekly financial reports for department heads like Sales, Inventory, CFO. Develop and utilize spreadsheets, databases and other computer applications like Onplan and SOS. Collect operational and inventory data for financial analysis. Compare financial data with forecasts and plans to determine current financial condition for each budget. Identify trends and variances from the data. Deliver a unique recommendation to ensure cost and operational efficiency. Compile a comprehensive report of results to the CFO and recommendation to be proposed to the management. COVID-19: During this time job duties may be modified at any time in order to keep our employees and clients safe and healthy, as well as follow any protocols put in place but the federal or provincial government. Duties will resume as normal once the situation has come to a close. PrAsentation de L'Entreprise. Recreation Marketing a AtA fondAe et Atablie en 2017, par notre Aquipe de direction qui a plus de 30 ans d'expArience dans le marketing commercial, la distribution, la gestion de la marque et la stratAgie de prix dans des industries fortement rAglementAes : cannabis, tabac et vaping.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156132ea6740c534abc5378::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"ReCreation Marketing\", \"position\": \"Finance Coordinator - Coordonnateur des Finances\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p style=\\\"text-align:center\\\"><strong>Company Overview<\/strong><\/p> <p>Recreation Marketing was founded and established in 2017, by our management team that has 30 years experience in trade marketing, distribution, brand management and pricing strategy in heavily regulated industries: cannabis, tobacco and vaping. Partnered with Turning Point Brands, the owner\\u00e2\\u20ac\\u2122s to the rights of Zig-Zag in North America, the company is poised to grow and build on the iconic brand in the Canadian Market.From the management team all the way down, ReCreation Marketing has assembled a team with dynamic and agile skill sets, needed to thrive in these heavily regulated industries.&nbsp;<\/p> <p>We are an experienced team, with a company that is growing quickly and providing a lot of opportunity. We are flexible, collaborative and looking for people who want to quickly establish their place in a company and grow fast. We will provide a competitive base salary with bonus and car allowance.<\/p> <p>&nbsp;<\/p> <p style=\\\"text-align:center\\\"><strong>Part of the Youth Hiring Program<\/strong><\/p> <p>This position is intended to hire and employ Youths&nbsp;in the Community under the age of 30 and above the age of majority to provide knowledge and experience in their field.&nbsp;<\/p> <p>&nbsp;<\/p> <p style=\\\"text-align:center\\\"><strong>The Role<\/strong><\/p> <p>- Prepare and analyze financial ratios<br>- Preparation of monthly and weekly financial reports for department heads like Sales, Inventory, CFO<br>- Develop and utilize spreadsheets, databases and other computer applications like Onplan and SOS<br>- Collect operational and inventory data for financial analysis<br>- Compare financial data with forecasts and plans to determine current financial condition for each budget<br>- Identify trends and variances from the data<br>- Deliver a unique recommendation to ensure cost and operational efficiency<br>- Compile a comprehensive report of results to the CFO and recommendation to be proposed to the management<\/p> <p>COVID-19: During this time job duties may be modified at any time in order to keep our employees and clients safe and healthy, as well as follow any protocols put in place but the federal or provincial government. Duties will resume as normal once the situation has come to a close.<\/p> <p>&nbsp;<\/p> <p>&nbsp;<\/p> <p style=\\\"text-align:center\\\">Pr\\u00c3\\u00a9sentation de L'Entreprise<\/p> <p>Recreation Marketing a \\u00c3\\u00a9t\\u00c3\\u00a9 fond\\u00c3\\u00a9e et \\u00c3\\u00a9tablie en 2017, par notre \\u00c3\\u00a9quipe de direction qui a plus de 30 ans d'exp\\u00c3\\u00a9rience dans le marketing commercial, la distribution, la gestion de la marque et la strat\\u00c3\\u00a9gie de prix dans des industries fortement r\\u00c3\\u00a9glement\\u00c3\\u00a9es : cannabis, tabac et vaping. En partenariat avec Turning Point Brands, le propri\\u00c3\\u00a9taire des droits de Zig-Zag en Am\\u00c3\\u00a9rique du Nord, la soci\\u00c3\\u00a9t\\u00c3\\u00a9 est pr\\u00c3\\u00aate \\u00c3&nbsp; se d\\u00c3\\u00a9velopper et \\u00c3&nbsp; s'appuyer sur la marque embl\\u00c3\\u00a9matique sur le march\\u00c3\\u00a9 canadien.De l'\\u00c3\\u00a9quipe de direction jusqu'\\u00c3&nbsp; la base, ReCreation Marketing a r\\u00c3\\u00a9uni une \\u00c3\\u00a9quipe avec des comp\\u00c3\\u00a9tences dynamiques et agiles, n\\u00c3\\u00a9cessaires pour prosp\\u00c3\\u00a9rer dans ces industries fortement r\\u00c3\\u00a9glement\\u00c3\\u00a9es.&nbsp;<\/p> <p>Nous sommes une \\u00c3\\u00a9quipe exp\\u00c3\\u00a9riment\\u00c3\\u00a9e, au sein d'une entreprise qui conna\\u00c3\\u00aet une croissance rapide et offre de nombreuses possibilit\\u00c3\\u00a9s. Nous sommes flexibles, collaboratifs et nous recherchons des personnes qui veulent rapidement se faire une place dans une entreprise et \\u00c3\\u00a9voluer rapidement. Nous offrirons un salaire de base comp\\u00c3\\u00a9titif avec une prime et une allocation de voiture.<\/p> <p style=\\\"text-align:center\\\"><strong>Fait partie du programme d'embauche des Jeunes<\/strong><\/p> <p>Ce poste a pour but d'embaucher et d'employer des jeunes de la communaut\\u00c3\\u00a9 \\u00c3\\u00a2g\\u00c3\\u00a9s de moins de 30 ans et ayant atteint l'\\u00c3\\u00a2ge de la majorit\\u00c3\\u00a9, afin de leur apporter des connaissances et de l'exp\\u00c3\\u00a9rience dans leur domaine.&nbsp;<\/p> <p style=\\\"text-align:center\\\"><strong>Le R\\u00c3\\u00b4le<\/strong><\/p> <p>- Pr\\u00c3\\u00a9parer et analyser les ratios financiers<br>- Pr\\u00c3\\u00a9paration de rapports financiers mensuels et hebdomadaires pour les chefs de service comme les ventes, l'inventaire, le directeur financier.<br>- D\\u00c3\\u00a9velopper et utiliser des feuilles de calcul, des bases de donn\\u00c3\\u00a9es et d'autres applications informatiques comme Onplan et SOS.<br>- Collecter des donn\\u00c3\\u00a9es op\\u00c3\\u00a9rationnelles et d'inventaire pour l'analyse financi\\u00c3\\u00a8re<br>- Comparer les donn\\u00c3\\u00a9es financi\\u00c3\\u00a8res avec les pr\\u00c3\\u00a9visions et les plans afin de d\\u00c3\\u00a9terminer la situation financi\\u00c3\\u00a8re actuelle pour chaque budget.<br>- Identifier les tendances et les \\u00c3\\u00a9carts \\u00c3&nbsp; partir des donn\\u00c3\\u00a9es<br>- Formuler une recommandation unique pour garantir l'efficacit\\u00c3\\u00a9 des co\\u00c3\\u00bbts et des op\\u00c3\\u00a9rations.<br>- R\\u00c3\\u00a9diger un rapport complet des r\\u00c3\\u00a9sultats \\u00c3&nbsp; l'intention du directeur financier et une recommandation \\u00c3&nbsp; proposer \\u00c3&nbsp; la direction.<\/p> <p>COVID-19 : Pendant cette p\\u00c3\\u00a9riode, les t\\u00c3\\u00a2ches peuvent \\u00c3\\u00aatre modifi\\u00c3\\u00a9es \\u00c3&nbsp; tout moment afin d'assurer la s\\u00c3\\u00a9curit\\u00c3\\u00a9 et la sant\\u00c3\\u00a9 de nos employ\\u00c3\\u00a9s et de nos clients, ainsi que de suivre les protocoles mis en place par le gouvernement f\\u00c3\\u00a9d\\u00c3\\u00a9ral ou provincial. Les t\\u00c3\\u00a2ches reprendront leur cours normal lorsque la situation aura pris fin.<\/p> <p>&nbsp;<\/p> <p>Powered by JazzHR<\/p> <\/div>\"}"
}