{
    "id":"Kaggle::techmap::6145d854e6c602312c32e6fe::linkedin_dk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" WS Audiology. Formed in 2019, through the merger of Sivantos and Widex, WS Audiology combines over 140 years experience in pioneering the use of technology to help people with hearing loss hear the sounds that make life wonderful. We are active in over 125 markets and employ 11, 000 people worldwide. Our broad portfolio of hearing related products and services generates annual revenues of around EUR 2 billion. Learn about us on www. wsa. com. The Role. We are looking for an newly graduated profile to join our Global IT Service Desk team and learn the way a local and global IT Service Desk team works. With more than 10.000 employees worldwide, Global IT is supporting our colleagues primarily from our hubs located in Denmark, Germany, Singapore and US. The support includes procurement of hardware, support to mobile devices (iOS\/Android) and printers. You will participate in IT projects on a random basis and author knowledgebase documentation for internal IT use. You will learn to provide onsite and remote desktop\/infrastructure support to users, including first-level support in WS Audiologys core applications. You will primarily be supporting business functions in Denmark and the rest of the Nordics. As a IT Supporter at WSA, you will be the face of IT in Lynge and will have contact with WSA employees everyday, both welcoming new employees and supporting existing ones. This is why communication and customer service is essential for us. The Team. You will join our local IT team based in Lynge and will have close collaboration with our Global IT Support services function. You will also be apart of a global team with 50 colleagues in Europe, Asia and the US. We are a self-driven, service minded team and our motto is to ensure a great work environment where IT support and customer satisfaction goes hand in hand with. The team typically works within normal working hours to support our colleagues when they are also in the office. You will be reporting to the local Manager of the IT Service Desk, located in our CO2 neutral HQ north of Copenhagen, Lynge,. Your responsibility. Daily operation in the Onsite IT Service Desk and contact with your colleagues who is responsible for the 24\/7 Global Service Desk. Execute service requests and standard changes such as creating AD users, share folders, mail accounts, backup data, or restore files.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145d854e6c602312c32e6fe::linkedin_dk\", \"source\": \"linkedin_dk\", \"country\": \"DK\", \"company\": \"WSAudiology\", \"position\": \"IT Supporter\", \"notes\": \"\", \"original\": \"WS Audiology<br><br>Formed in 2019, through the merger of Sivantos and Widex, WS Audiology combines over 140 years\\u2019 experience in pioneering the use of technology to help people with hearing loss hear the sounds that make life wonderful. We are active in over 125 markets and employ 11,000 people worldwide. Our broad portfolio of hearing related products and services generates annual revenues of around EUR 2 billion.<br><br>Learn about us on www.wsa.com<br><br>The Role<br><br>We are looking for an newly graduated profile to join our Global IT Service Desk team and learn the way a local and global IT Service Desk team works. With more than 10.000 employees worldwide, Global IT is supporting our colleagues primarily from our hubs located in Denmark, Germany, Singapore and US.<br><br>The support includes procurement of hardware, support to mobile devices (iOS\/Android) and printers. You will participate in IT projects on a random basis and author knowledgebase documentation for internal IT use.<br><br>You will learn to provide onsite and remote desktop\/infrastructure support to users, including first-level support in WS Audiology`s core applications. You will primarily be supporting business functions in Denmark and the rest of the Nordics.<br><br>As a IT Supporter at WSA, you will be the face of IT in Lynge and will have contact with WSA employees everyday, both welcoming new employees and supporting existing ones. This is why communication and customer service is essential for us.<br><br><strong>The Team<br><br><\/strong>You will join our local IT team based in Lynge and will have close collaboration with our Global IT Support services function. You will also be apart of a global team with +50 colleagues in Europe, Asia and the US. We are a self-driven, service minded team and our motto is to ensure a great work environment where IT support and customer satisfaction goes hand in hand with.<br><br>The team typically works within normal working hours to support our colleagues when they are also in the office.<br><br>You will be reporting to the local Manager of the IT Service Desk, located in our CO2 neutral HQ north of Copenhagen, Lynge,<br><br><strong>Your responsibility<br><\/strong><ul><li>Daily operation in the Onsite IT Service Desk and contact with your colleagues who is responsible for the 24\/7 Global Service Desk. <\/li><li>Execute service requests and standard changes such as creating AD users, share folders, mail accounts, backup data, or restore files.<\/li><li>Dispatch (incl. prioritization and categorization), receive, solve, and close incidents through the IT Service Management system. <\/li><li>1st level user support (desktop, mobile, applications, connectivity, etc.) <\/li><li>Procurement and deployment of IT equipment. <\/li><li>Ensure continuous update\/creation of relevant knowledge base articles for smooth operation<br><\/li><\/ul>The role is very central in our local IT presence and deliveries and we offer you a great opportunity to join a global function where you can accelerate your personal development with both local and global exposure.<br><br><strong>Candidate Profile<br><br><\/strong><strong>You must have <br><\/strong><ul><li>Relevant IT degree<\/li><li>Experience and\/or interest in an outgoing support environment is essential<\/li><li>Experience handling multiple issues without jeopardizing the service level of the individual deliveries<\/li><li>Experience with mail &amp; communication solutions <\/li><li>Are experienced in creating user focused &amp; technical documentation and procedures <\/li><li>Strong written and spoken Danish and English is required<br><\/li><\/ul><strong>Would be nice if you also have<br><\/strong><ul><li>Analytical skills and have technical interest <\/li><li>Possess experience with Microsoft technologies and Active Directory<\/li><li>An ITIL Foundation certification is preferred and you have experience with IT Service Management processes<\/li><li>Have a good knowledge of IT infrastructure and for supporting client and operating systems<br><\/li><\/ul><strong><u>Other Soft-skills And Personal Competencies<br><\/u><\/strong><ul><li>You are service minded, knowledgeable, and self-driven<\/li><li>You have a strong desire for providing the best customer service, every single time <\/li><li>You take responsibility and is not afraid to take a decision<\/li><li>You show initiative and have a pro-active approach<br><\/li><\/ul><strong>Join WS Audiology<br><br><\/strong>We will be conducting interviews on a continuous basis, so please send your CV, no application needed, as soon as possible and no later than Thursday the 7th of October 2021.\"}"
}