{
    "id":"Kaggle::techmap::614619712942e66f10984e4a::linkedin_pt::1",
    "label_age":true,
    "analysis_age":"The phrase \"10 years' experience working on Data Warehousing, Master Data Management or Business Intelligence solutions\" may introduce age bias by setting an unattainable standard for younger workers, thereby favouring older candidates with more years of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years' experience working on Data Warehousing, Master Data Management or Business Intelligence solutions. Strong technical skills and the ability to work with project teams geographically dispersed. Deep knowledge of SaaS business model and end-to-end delivery model, with specific expertise in IM Implementation. Robust experience designing and delivering complex IT solutions. Expert in Data Warehousing, BI and Master Data Management solutions including experience and expertise in several leading technologies on those respective domains (example: SQL Server, Snowflake, Qlik, Power BI, Tableau, Micro. Strategy, Reltio MDM, Informatica MDM, Tibco EBX, ). Demonstrated success building effective relationships with a broad spectrum of internal and external stakeholders, including senior technical leaders and associates across different functions. Thrives in a fast-paced environment and able to match stakeholder expectations to urgently deliver exceptional results. Excellent communications, problem solving and technical skills. Experience in global roles. Understanding of cultural sensitivities and time zones required. Flexible, periodic travel for internal and client meetings. Skills & Experience  Nice To Have \/ Desired. Snowflake (DWH), Reltio (MDM), Informatica (ETL), Mulesoft (Integration), Data Visualization tool (Qlik, PowerBI, ). Strong Expertise in mainstream base technologies: Big Data, NoSQL, Graph DB, Cassandra, Spark, Hadoop, AWS, Amazon S3, RedShift. Knowledge of Healthcare\/Life Sciences Industry a strong plus. Knowledge \/ project experience using Life sciences data feeds a strong plus (One key, MIDAS, national \/ subnational sales data, ). SM-LI3. At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible  to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70, 000. employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs. iqvia. com.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614619712942e66f10984e4a::linkedin_pt\", \"source\": \"linkedin_pt\", \"country\": \"PT\", \"company\": \"IQVIA\", \"position\": \"BI\/ Architect\", \"notes\": \"\", \"original\": \"<strong>Information Management Architect (MDM)<br><br><\/strong>Location: <strong>Spain, Portugal, Italy, Poland, Czech Republic, Romania<br><br><\/strong><strong>Function Purpose<br><br><\/strong>Technology Solutions' Global Delivery organization contributes to the implementation and ongoing support of the IQVIA technology product portfolio at Life Sciences clients around the world. The scope of Global Delivery includes:<br><br><ul><li> Serving the needs of IQVIA Regional Business Units to deliver IQVIA Tech Solutions product offerings either in full, or in coordination with their regional Delivery teams<\/li><li> End-to-end delivery coverage for the full SDLC (implementation through support)<\/li><li> Leadership of complex multi-country or integrated solutions, particularly in Europe (Program\/Project Mgmt, Business Analysis, Solution Architecture)<\/li><li> Supplying skilled technical resources from low-cost delivery centers in Europe and South Asia (Dev\/Config, Testing, Service Desk, Tier 2 Support)<br><\/li><\/ul><strong><u>Role Overview<br><br><\/u><\/strong>The <strong><em>Information Management and Performance Management and Insights (IM &amp; PMI) Architect<\/em><\/strong> position ensures successful product delivery by designing and delivering, in close relationship with the technical developers, end-to-end Master Data Management (MDM), Data Warehousing and BI solution architectures for IQVIA Clients.<br><br><strong><u>Responsibilities<br><br><\/u><\/strong>As <strong><em>IM and PMI Architect<\/em><\/strong>, you will:<br><br><ul><li>Be accountable for the overall design of technical MDM, CDW and BI solution architecture<\/li><li>Ensure that technical conditions are in place for a successful delivery of the MDM \/ CDW \/ BI solutions<\/li><li>Work hand-in-hand with delivery managers to ensure escalations (from Clients or internal from RBU\/Country stakeholders) are addressed adequately; the architect will work alongside project experts to take responsibility to address technical issues and propose adequate solutions in coordination with the technical teams<\/li><li>Engage with customers on regular basis (project kick-off, project meeting)<\/li><li>Within a project, technically manage \/ advise the technical delivery team (onshore, nearshore and\/or offshore)<\/li><li>Work closely with additional teams contributing to the delivery of Information &amp; Performance Management solutions; including PMO, offshore technical delivery centers and service management.<\/li><li>Work closely with the IM and PMI product teams, to get full knowledge and understand the IM and PMI products (MDM, CDW and BI); provide feedback to the product roadmap, anticipate impact on the assigned IM and PMI projects.<\/li><li>Work closely with RBU IM and PMI leaders to understand IM &amp; PMI forecast and regional specifics<\/li><li>Participate in the business development process for IM a PMI opportunities as needed<br><\/li><\/ul><strong><u>Skills &amp; Experience \\u2013 Must Haves<br><\/u><\/strong><ul><li> 5+ years\\u2019 experience withReltio MDM, Informatica MDM, Tibco EDX or other MDM product<\/li><li> Advanced knowledge of Object Oriented Programming languages (Java \/ Python \/ .Net) and working with JSON<\/li><li> 10+ years' experience working on Data Warehousing, Master Data Management or Business Intelligence solutions<\/li><li> Strong technical skills and the ability to work with project teams geographically dispersed<\/li><li> Deep knowledge of SaaS business model and end-to-end delivery model, with specific expertise in IM Implementation<\/li><li> Robust experience designing and delivering complex IT solutions<\/li><li> Expert in Data Warehousing, BI and Master Data Management solutions including experience and expertise in several leading technologies on those respective domains (example: SQL Server, Snowflake, Qlik, Power BI, Tableau, MicroStrategy, Reltio MDM, Informatica MDM, Tibco EBX, \\u2026)<\/li><li> Demonstrated success building effective relationships with a broad spectrum of internal and external stakeholders, including senior technical leaders and associates across different functions<\/li><li> Thrives in a fast-paced environment and able to match stakeholder expectations to urgently deliver exceptional results<\/li><li> Excellent communications, problem solving and technical skills<\/li><li> Experience in global roles; understanding of cultural sensitivities and time zones required.<\/li><li> Flexible, periodic travel for internal and client meetings<br><\/li><\/ul><strong><u>Skills &amp; Experience \\u2013 Nice To Have \/ Desired<br><\/u><\/strong><ul><li>Snowflake (DWH), Reltio (MDM), Informatica (ETL), Mulesoft (Integration), Data Visualization tool (Qlik, PowerBI, \\u2026)<\/li><li>Strong Expertise in mainstream base technologies: Big Data, NoSQL, Graph DB, Cassandra, Spark, Hadoop, AWS, Amazon S3, RedShift<\/li><li>Knowledge of Healthcare\/Life Sciences Industry a strong plus<\/li><li>Knowledge \/ project experience using Life sciences data feeds a strong plus (One key, MIDAS, national \/ subnational sales data, \\u2026)<br><\/li><\/ul>#SM-LI3<br><br>At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible \\u2013 to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70,000+ employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs.iqvia.com.<br><br>\"}"
}