{
    "id":"Kaggle::techmap::6140a8768269ff5ac3b6b0c5::monster2_se::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You feel motivated and see it as an exciting challenge to be involved in building and developing the assistant role at Star Stable, and feel comfortable with supporting and coaching the people you support in a smooth and educational way. About Star Stable. Star Stable Entertainment is the home of the 1 fastest-growing horse adventure game in the world. Star Stable Online. With over 21 million registered users, across 180 countries, and supported in 14 languages we are proud to provide an expanding gaming and entertainment platform that fosters social connections, adventures, and creativity for an underserved community of gamers. Founded in 2011, Star Stable Entertainment has grown to become a multi-channel entertainment company. The home of an independent record label, short-form animations, book series, comics, and mobile apps. We are a dedicated, eclectic team of over 170 employees, hailing from 25 different countries around the globe and we remain steadfast in our mission. To inspire girls, to celebrate the power of sisterhood, and to create a more inclusive gaming environment. We are on an adventure to scale our unique impact in the world with several games in development across desktop\/mobile, working with both internal and external development teams. And, were hiring and we'd love to hear from you! Whats in it for you? As a consultant at The Pace you will always be offered a salary in line with the business standards, healthcare and pension as well as joining our collective agreement  the most important thing for us is that you feel safe in your role. In the same way that we expect professionalism from you, we also want you to have high expectations on us. No matter where you are in your career, we want the role as a consultant to give you knowledge and experiences that are beneficial in your future career path. Want to know more? You are welcome to contact us if you have questions regarding this position or the ongoing process. Working with this assignment is Talent Acquisition Specialist Emma Holster (thepace. se) and Consultant Manager Johan Fernstrom (thepace. se). We will go through the applications directly and in the consultancy business the processes are often fast. This means that the position can be filled before the application deadline, dont wait with sending in your application! We are looking forward to hear from you.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6140a8768269ff5ac3b6b0c5::monster2_se\", \"source\": \"monster2_se\", \"country\": \"SE\", \"company\": \"Star Stable\", \"position\": \"Executive Assistant to Star Stable\", \"notes\": \"\", \"original\": \"This is a nine-month full-time consulting assignment via The Pace starting as soon as possible. After completing the assignment, extension\/employment with Star Stable may also be possible. Your main task will be to support the CEO and CMO at a high level, and you will have the opportunity to build the assistant role from scratch.Your assignmentIt comes natural for you to plan, organize and prioritize the work in an effective way and take the initiative for routines that suit the business. Star Stable offers a varied job in a rapidly changing and driven organization that is characterized by success and cohesion. The right person gets the opportunity to be someone for the CEO and CMO to bounce ideas off in all possible types of issues - high and low. The role also includes support for the management team when needed. Examples of tasks and responsibilities included in the role:Calendar management as well as coordination and booking of internal and external meetings in a way that is as smooth and structured as possibleCreate and compile presentations in PowerPointPrepare and compile different types of documentation and materials, as well as keep record of management group meetingsFacilitate the CEO's and CMO's daily work with both administrative and practical tasksParticipate in and arrange meetings and upcoming eventsTravel bookings and handling of expenses, receipts, and agreementsYour backgroundWe are looking for you who have good experience of the role as Executive Assistant before. You have advantageous experience of working in a modern and creative environment, and it is a plus if you have an interest in games and game development. You communicate freely in English, in both speech and writing. You feel comfortable working in the Office suite and are used to producing high quality PowerPoint presentation materials.This is a perfect role for you who are driven by working in an organization that is characterized by committed employees and a high pace. We are looking for you who are used to working proactively, who can find solutions to problems and put structure on the business you work in.To be successful in this role, you need to be coordinating, have a habit of being administrative and unpretentious when taking on different types of tasks. You feel motivated and see it as an exciting challenge to be involved in building and developing the assistant role at Star Stable, and feel comfortable with supporting and coaching the people you support in a smooth and educational way.About Star StableStar Stable Entertainment is the home of the #1 fastest-growing horse adventure game in the world - Star Stable Online. With over 21 million registered users, across 180 countries, and supported in 14 languages we are proud to provide an expanding gaming and entertainment platform that fosters social connections, adventures, and creativity for an underserved community of gamers.Founded in 2011, Star Stable Entertainment has grown to become a multi-channel entertainment company; the home of an independent record label, short-form animations, book series, comics, and mobile apps. We are a dedicated, eclectic team of over 170 employees, hailing from 25 different countries around the globe and we remain steadfast in our mission; to inspire girls, to celebrate the power of sisterhood, and to create a more inclusive gaming environment.We are on an adventure to scale our unique impact in the world with several games in development across desktop\/mobile, working with both internal and external development teams. And, we\\u2019re hiring and we'd love to hear from you!What\\u2019s in it for you?As a consultant at The Pace you will always be offered a salary in line with the business standards, healthcare and pension as well as joining our collective agreement \\u2013 the most important thing for us is that you feel safe in your role. In the same way that we expect professionalism from you, we also want you to have high expectations on us. No matter where you are in your career, we want the role as a consultant to give you knowledge and experiences that are beneficial in your future career path.Want to know more?You are welcome to contact us if you have questions regarding this position or the ongoing process. Working with this assignment is Talent Acquisition Specialist Emma Holster (emma.holster@thepace.se) and Consultant Manager Johan Fernstr\\u00f6m (johan.fernstrom@thepace.se).We will go through the applications directly and in the consultancy business the processes are often fast. This means that the position can be filled before the application deadline, don\\u2019t wait with sending in your application!We are looking forward to hear from you.\"}"
}