{
    "id":"Kaggle::techmap::613f8a4d797d630914825d2a::simplyhired_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The phrases \"our values of Kind, Supportive and Trusted\" and \"keep the Home running efficiently and smoothly\" resonate with traditionally feminine qualities, which could subtly favour female candidates.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 25 hours per week, 6 months contract. £9.37 per hour (reviewed annually) pension, hospital plan, emergency dental cover, confidential external counselling services, discounts at retail outlets and days out, and reduced gym membership. 28 days holiday per annum (inclusive of allowance in lieu of bank holidays), increasing with length of service up to a maximum of 33 days. Free meal provided whilst on duty. Free car parking. Do you want to work in an environment which makes a difference to peoples lives? Do you love meeting new people and pride yourself on excellent customer service? Do you see yourself aligned to our values of Kind, Supportive and Trusted? If so, then RMBI Care Co is looking for you to join us as part of our Administration\/Reception team! REPORTS TO. Business Relationship Manager. OVERVIEW. As Administrator\/Receptionist you will be the first point of contact for all visitors to our Care Home. Working as part of the administration team, you will also provide a wide range of administrative support to keep the Home running efficiently and smoothly. We are looking for someone with a professional and courteous attitude, excellent interpersonal skills and a highly organised approach to their work. Whilst previous experience within a similar role would be an advantage it is not essential and full training and support will be given along with providing knowledge of working within the Care sector. An enhanced DBS check is required for this position. Please note candidates must have received both doses of the Covid-19 vaccination, or be willing to do so by 11th November 2021 at the latest unless medically exempt, in order to comply with new legislative requirements for social care. IND1.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613f8a4d797d630914825d2a::simplyhired_uk\", \"source\": \"simplyhired_uk\", \"country\": \"UK\", \"company\": \"The Royal Masonic Benevolent Institution Care Company\", \"position\": \"Administrator\/Receptionist (25 Hours Per Week)\", \"notes\": \"\", \"original\": \"<ul><li>25 hours per week, 6 months contract<\/li><li>\\u00a39.37 per hour (reviewed annually) pension, hospital plan, emergency dental cover, confidential external counselling services, discounts at retail outlets and days out, and reduced gym membership<\/li><li>28 days holiday per annum (inclusive of allowance in lieu of bank holidays), increasing with length of service up to a maximum of 33 days.<\/li><li>Free meal provided whilst on duty<\/li><li>Free car parking<\/li><\/ul>\\nDo you want to work in an environment which makes a difference to people\\u2019s lives? Do you love meeting new people and pride yourself on excellent customer service? Do you see yourself aligned to our values of Kind, Supportive and Trusted?\\n<br \/><br \/>\\nIf so, then RMBI Care Co is looking for you to join us as part of our Administration\/Reception team!\\n<br \/><br \/>\\nREPORTS TO\\n<br \/><br \/>\\nBusiness Relationship Manager\\n<br \/><br \/>\\nOVERVIEW\\n<br \/>As Administrator\/Receptionist you will be the first point of contact for all visitors to our Care Home. Working as part of the administration team, you will also provide a wide range of administrative support to keep the Home running efficiently and smoothly.\\n<br \/><br \/>\\nWe are looking for someone with a professional and courteous attitude, excellent interpersonal skills and a highly organised approach to their work.\\n<br \/><br \/>\\nWhilst previous experience within a similar role would be an advantage it is not essential and full training and support will be given along with providing knowledge of working within the Care sector.\\n<br \/><br \/>\\nAn enhanced DBS check is required for this position.\\n<br \/><br \/>\\nPlease note candidates must have received both doses of the Covid-19 vaccination, or be willing to do so by 11th November 2021 at the latest unless medically exempt, in order to comply with new legislative requirements for social care.\\n<br \/><br \/>\\nIND1\"}"
}