{
    "id":"Kaggle::techmap::613e2cd0a6f446465d9174ec::indeed_de::9",
    "label_age":true,
    "analysis_age":"The phrase \"Become a member of a young and international team of scientists\" is biased against older people.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"At Advanced Materials & Systems Research we are innovating to make a valuable contribution for our customers and the world we are living in. Together with the operating divisions and our academic partners we develop functional materials and systems for high performance and sustainable solutions for our customers in various industries. RESPONSIBILITIES. Become a member of a young and international team of scientists with expertise in chemistry, material science, microbiology and biochemistry, collaborating with academic cooperation partners and stakeholders across the globe. You will screen and adapt existing methods and develop new techniques to assess the biodegradability of plastics, microplastics and polymers in different end of life scenarios. You will assess biodegradability by linking material and environmental properties, microbial communities and enzymes involved in the biodegradation process to elucidate mechanisms. You will investigate metabolites and degradation products of different materials together with experts at the BASF analytical department. Hereby, you will use automation and digitalization processes to further increase research efficiency. You will publish the results of state-of-the-art research in high impact, peer-reviewed journals and contribute to the development of international standards on plastic biodegradation. QUALIFICATIONS. PhD in environmental chemistry, ecology, material science, analytical chemistry, microbiology or biochemistry. preferably, previous experience on biodegradable materials, biodegradation testing method or microplastic. experience with bioinformatics or have collaborated with members of bioinformatics teams on your past projects are desireable. praxis in using and applying data management software, databases and related programming skills. a creative and motivated team player with strong communication and presentation skills in English. BENEFITS. From day one you will be part of the BASF family. You will get involved in challenging fields of activity and have the opportunity to work on exciting projects in an interdisciplinary environment. Depending on the location of the respective group company you will get to know BASF and participate in various workshops and guided tours. In this way you will make numerous interesting experiences and get a deep insight into the world's leading chemical company. Information regarding internships: on. basf. com\/internship ABOUT US. Do you have questions regarding the application process or position? Mrs. Khand Thräner (Talent Acquisition) Tel. -Nr. : +49 (0)30 2005 59929. Please note that we do not return paper applications including folders. Please submit copies only and no original documents. Ludwigshafen is the world's largest integrated chemical complex and home to BASF Group headquarters. Located in the heart of Europe's Rhine-Neckar metropolitan region, you will find this to be an attractive place for both work and leisure time.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613e2cd0a6f446465d9174ec::indeed_de\", \"source\": \"indeed_de\", \"country\": \"DE\", \"company\": \"BASF\", \"position\": \"PostDoc Biodegradability and digitalization\", \"notes\": \"\", \"original\": \"At Advanced Materials &amp; Systems Research we are innovating to make a valuable contribution for our customers and the world we are living in. Together with the operating divisions and our academic partners we develop functional materials and systems for high performance and sustainable solutions for our customers in various industries.\\n<br>RESPONSIBILITIES\\n<br><br>\\nBecome a member of a young and international team of scientists with expertise in chemistry, material science, microbiology and biochemistry, collaborating with academic cooperation partners and stakeholders across the globe.\\n<br><br>\\nYou will screen and adapt existing methods and develop new techniques to assess the biodegradability of plastics, microplastics and polymers in different end of life scenarios.\\n<br>You will assess biodegradability by linking material and environmental properties, microbial communities and enzymes involved in the biodegradation process to elucidate mechanisms.\\n<br>You will investigate metabolites and degradation products of different materials together with experts at the BASF analytical department.\\n<br>Hereby, you will use automation and digitalization processes to further increase research efficiency.\\n<br>You will publish the results of state-of-the-art research in high impact, peer-reviewed journals and contribute to the development of international standards on plastic biodegradation.\\n<br>QUALIFICATIONS\\n<br><br>\\nPhD in environmental chemistry, ecology, material science, analytical chemistry, microbiology or biochemistry\\n<br>preferably, previous experience on biodegradable materials, biodegradation testing method or microplastic\\n<br>experience with bioinformatics or have collaborated with members of bioinformatics teams on your past projects are desireable\\n<br>praxis in using and applying data management software, databases and related programming skills\\n<br>a creative and motivated team player with strong communication and presentation skills in English\\n<br>BENEFITS\\n<br><br>\\nFrom day one you will be part of the BASF family.\\n<br>You will get involved in challenging fields of activity and have the opportunity to work on exciting projects in an interdisciplinary environment.\\n<br>Depending on the location of the respective group company you will get to know BASF and participate in various workshops and guided tours.\\n<br>In this way you will make numerous interesting experiences and get a deep insight into the world's leading chemical company. Information regarding internships: on.basf.com\/internship ABOUT US\\n<br><br>\\nDo you have questions regarding the application process or position? Mrs. Khand Thr\\u00e4ner (Talent Acquisition) Tel.-Nr.: +49 (0)30 2005 59929\\n<br><br>\\nPlease note that we do not return paper applications including folders. Please submit copies only and no original documents.\\n<br><br>\\nLudwigshafen is the world's largest integrated chemical complex and home to BASF Group headquarters. Located in the heart of Europe's Rhine-Neckar metropolitan region, you will find this to be an attractive place for both work and leisure time.\\n<br><br>\\nLearn more about BASF SE at http:\/\/on.basf.com\/Headquarters\\n<br><br>\\nAt BASF, the chemistry is right. Because we are counting on innovative solutions, on sustainable actions, and on connected thinking. And on you. Become a part of our formula for success and develop the future with us - in a global team that embraces diversity and equal opportunities irrespective of gender, age, origin, sexual orientation, disability or belief.\\n<br>Please note that we do not return paper applications including folders. Please submit copies only and no original documents.\\n<br>Please upload the documents, summarized in a PDF if possible.\"}"
}