{
    "id":"Kaggle::techmap::6151a5fe41b6b507d739bc6d::linkedin_kr::1",
    "label_age":true,
    "analysis_age":"The requirement for \"10 years relevant experience in acquisition and\/or asset management\" can introduce age bias by favouring older candidates who are more likely to have accumulated this level of experience, potentially disadvantaging younger but equally capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The term 'strong personality' can resonate with masculine-coded traits such as assertiveness and dominance.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years relevant experience in acquisition and\/or asset management, however, consideration will be given to experience in one or more of the following industries: commercial real estate, corporate finance, investment banking, real estate lending, private equity, management consulting or similar. Committed team player with ability to work on own initiative. Excellent interpersonal and communication skills  both written and verbal. Ability to develop deep relationships and positively influence key stakeholders. Ability to identify trends and give insights\/recommendations for action. Excellent analytical and quantitative skills. Candidates must have strong analytical financial modelling and valuation skills. Project planning and self-management skills. Strong personality and ability to interact across cultures\/geographies. Disclaimer: Brookfield Asset Management does not accept any unsolicited resumes from Recruitment Agencies and the company shall not be liable for any fees incurred from any unsolicited resumes received from third parties. For More Details, We Encourage Applicants To Read Brookfield's Applicant Data Protection And Privacy Notice, Found On Our Website. At Brookfield, we care about your privacy and strive to protect Applicant Data throughout the recruitment process. To that end, information that we gather from applicants via job postings, is used solely for the purposes of recruiting and hiring. httpswww. brookfield. com\/applicant-data-protection-and-privacy-notice.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6151a5fe41b6b507d739bc6d::linkedin_kr\", \"source\": \"linkedin_kr\", \"country\": \"KR\", \"company\": \"Brookfield Asset Management\", \"position\": \"Vice President, Portfolio Management\", \"notes\": \"\", \"original\": \"<strong><u>About Us<br><br><\/u><\/strong>With more than $625 billion in assets under management, and an over 100-year heritage as a global owner and operator, we focus on investing in the backbone of the global economy, and are committed to supporting and enhancing the communities in which we operate. We put our own capital to work alongside our partners\\u2019 in virtually every transaction, aligning interests and bringing the strengths of our operational expertise, global reach and large-scale capital to bear on everything we do.<br><br><strong><u>About The Role<br><br><\/u><\/strong>In this newly created position, you will have strategic oversight of Brookfield\\u2019s existing and future Korean real estate portfolios along with the ongoing composition and management of real estate within each portfolio to optimise value for investors and Brookfield. Your responsibilities will include, but not limited to<br><br><em>Platform Creation<br><\/em><ul><li>Oversee the creation and maintenance of corporate investment models that delivers a high degree of functionality and scalability in accordance with Brookfield global standards.<\/li><li>Deliver a coherent platform for analysis and reporting of Brookfield\\u2019s real estate portfolios to determine performance inclusive of finance, tax and compliance as appropriate.<\/li><li>In conjunction with Brookfield Properties and operating companies, create and analyse proposals to maximise investment returns on Brookfield\\u2019s real estate assets and portfolios.<br><\/li><\/ul><em>Optimisation of existing assets <br><\/em><ul><li>Work with Brookfield Properties and operating companies to monitor existing investments and ensure execution of the strategic business plans for the Korean assets within each portfolio.<\/li><li>Review investment performance reports, monitor KPI\\u2019s and work with Brookfield Properties and operating companies to realign as necessary to achieve goals and objectives.<\/li><li>Liaise with senior management teams of Brookfield Properties and operating companies to provide advisory assistance around integration, organizational efficiencies and business plan execution.<br><\/li><\/ul><em>Support acquisition of new assets and platform <br><\/em><ul><li>Play a lead role in due diligence supporting the BPG Investments team making sound decisions on the accretive value of acquisitions for the respective portfolios.<\/li><li>Proactively support the BPG investments team with a bottom up approach to real estate valuation and mechanics.<br><\/li><\/ul><em>Governance, reporting and management<\/em><ul><li>Reporting of the Brookfield Korea real estate portfolios performance including:<\/li><ul><li>analysis of reports from FP&amp;A team and finance teams along with confirmation of legal and regulatory compliance obligations.<br><\/li><\/ul><\/ul><strong><u>About You<br><br><\/u><\/strong>To be successful in this position, you will ideally posses the following:<br><ul><li>Bachelor\\u2019s degree in Business, finance, accounting or related field<\/li><li>10+ years\\u2019 relevant experience in acquisition and\/or asset management, however, consideration will be given to experience in one or more of the following industries: commercial real estate, corporate finance, investment banking, real estate lending, private equity, management consulting or similar.<\/li><li>Committed team player with ability to work on own initiative<\/li><li>Excellent interpersonal and communication skills \\u2013 both written and verbal<\/li><li>Ability to develop deep relationships and positively influence key stakeholders<\/li><li>Ability to identify trends and give insights\/recommendations for action<\/li><li>Excellent analytical and quantitative skills<\/li><li>Candidates must have strong analytical financial modelling and valuation skills<\/li><li>Project planning and self-management skills<\/li><li>Strong personality and ability to interact across cultures\/geographies<br><\/li><\/ul><em><strong>Disclaimer: Brookfield Asset Management does not accept any unsolicited resumes from Recruitment Agencies and the company shall not be liable for any fees incurred from any unsolicited resumes received from third parties.<br><br><\/strong><\/em><strong><u>For More Details, We Encourage Applicants To Read Brookfield's Applicant Data Protection And Privacy Notice, Found On Our Website<br><br><\/u><\/strong>At Brookfield, we care about your privacy and strive to protect Applicant Data throughout the recruitment process. To that end, information that we gather from applicants via job postings, is used solely for the purposes of recruiting and hiring.<br><br>https:\/\/www.brookfield.com\/applicant-data-protection-and-privacy-notice\"}"
}