{
    "id":"Kaggle::techmap::615b84f71181fd05660b926c::snagajob_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The physical requirements mentioned, such as lifting heavy objects and exposure to fumes and noise, are likely essential functions directly related to the core duties of repairing vehicles in an auto body shop setting.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Service Center. Cheyenne. Job Summary. Repair vehicles thoroughly, safely, and profitably in a manner consistent with Caliber S. O. P., insurance partner and industry guidelines\/standards. Essential Job Duties Complete dis-assembly of vehicle in order to assist Service Advisors in assessing damage to prepare a 100% Repair Plan. Ensure all needed repairs identified to eliminate supplements and minimize repair time. Plan work procedure: follow work order for all operations listed. Remove upholstery, accessories, electrical and hydraulic window and seat operating equipment and trim to gain access to damaged area of vehicle if needed. Store parts on carts or cover to eliminate potential damage. Mend damaged body by hammering out or filling in dents and welding broken parts. Ensure all gaps and fits are to industry standards. Remove damaged fenders, panels and grills. And bolts or welds replacement parts in position and reassemble after parts are painted. Operate a variety of hand and power tools (e. g. welder, soldering equipment, cutting torch, blocks, hammers, wrenches, sander, spray guns, etc. ). File, grind, and sand repaired surfaces with 120-grit paper before turning vehicle over to the Paint Dept. Repair or replace defective parts. Ensure all needed repairs identified to eliminate supplements and minimize repair time. Inspect and test drive repaired vehicles to check for compliance with safety and quality standards. Wash and prepare vehicles for customer return. Comply with all Caliber safety rules, guidelines and standards. Perform other related duties as assigned relating to, but not limited to washing cars, cleaning the shop, etc. Skill\/Requirements Must be at least 18 years of age. Ability to effectively communicate with others. Ability to read and understand instructions, written estimates and work orders. Multi-tasking. Adapts easily to fast-paced environment. Personable, friendly demeanor with \"World Class\" customer service approach to internal and external customers. Maintain a well-groomed appearance. Physical Requirements \/ Working Conditions. Position is based in a normal shop environment. Occasional physical activity such as reaching below and above shoulder level, kneeling, bending, squatting and stooping to inspect repairs, and lifting and carrying objects over 50lbs. Exposure to fumes, chemicals, dust, along with high levels of noise. Subject to weather conditions both inside and outside. Required to wear protective equipment when necessary. Occasional sedentary work. Must have visual acuity to determine the accuracy and thoroughness of the work assigned.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615b84f71181fd05660b926c::snagajob_us\", \"source\": \"snagajob_us\", \"country\": \"US\", \"company\": \"Caliber Collision\", \"position\": \"Auto Body Technician\", \"notes\": \"\", \"original\": \"<div _ngcontent-sc255=\\\"\\\" class=\\\"job-description\\\">\\n <div _ngcontent-sc255=\\\"\\\">\\n  <div _ngcontent-sc255=\\\"\\\" class=\\\"ng-star-inserted\\\">\\n   <b>Service Center<\/b>\\n   <br>\\n   <br>Cheyenne \\n   <br>\\n   <br><b><b>Job Summary<\/b><\/b>\\n   <br>\\n   <br>Repair vehicles thoroughly, safely, and profitably in a manner consistent with Caliber S.O.P., insurance partner and industry guidelines\/standards. \\n   <br>\\n   <br><b>Essential Job Duties<\/b>\\n   <ul>\\n    <li>Complete dis-assembly of vehicle in order to assist Service Advisors in assessing damage to prepare a 100% Repair Plan<\/li>\\n    <li>Ensure all needed repairs identified to eliminate supplements and minimize repair time<\/li>\\n    <li>Plan work procedure: follow work order for all operations listed<\/li>\\n    <li>Remove upholstery, accessories, electrical and hydraulic window and seat operating equipment and trim to gain access to damaged area of vehicle if needed. Store parts on carts or cover to eliminate potential damage<\/li>\\n    <li>Mend damaged body by hammering out or filling in dents and welding broken parts; ensure all gaps and fits are to industry standards; remove damaged fenders, panels and grills; and bolts or welds replacement parts in position and reassemble after parts are painted<\/li>\\n    <li>Operate a variety of hand and power tools (e.g. welder, soldering equipment, cutting torch, blocks, hammers, wrenches, sander, spray guns, etc.)<\/li>\\n    <li>File, grind, and sand repaired surfaces with 120-grit paper before turning vehicle over to the Paint Dept.<\/li>\\n    <li>Repair or replace defective parts<\/li>\\n    <li>Ensure all needed repairs identified to eliminate supplements and minimize repair time<\/li>\\n    <li>Inspect and test drive repaired vehicles to check for compliance with safety and quality standards; Wash and prepare vehicles for customer return<\/li>\\n    <li>Comply with all Caliber safety rules, guidelines and standards<\/li>\\n    <li>Perform other related duties as assigned relating to, but not limited to washing cars, cleaning the shop, etc.<\/li>\\n   <\/ul><b>Skill\/Requirements<\/b>\\n   <ul>\\n    <li>Must be at least 18 years of age<\/li>\\n    <li>Ability to effectively communicate with others<\/li>\\n    <li>Ability to read and understand instructions, written estimates and work orders<\/li>\\n    <li>Multi-tasking; adapts easily to fast-paced environment<\/li>\\n    <li>Personable, friendly demeanor with \\\"World Class\\\" customer service approach to internal and external customers<\/li>\\n    <li>Maintain a well-groomed appearance<\/li>\\n   <\/ul><b>Physical Requirements \/ Working Conditions<\/b>\\n   <br>\\n   <br>Position is based in a normal shop environment. Occasional physical activity such as reaching below and above shoulder level, kneeling, bending, squatting and stooping to inspect repairs, and lifting and carrying objects over 50lbs. Exposure to fumes, chemicals, dust, along with high levels of noise. Subject to weather conditions both inside and outside. Required to wear protective equipment when necessary. Occasional sedentary work. Must have visual acuity to determine the accuracy and thoroughness of the work assigned.\\n   <br>\\n   <br>\\n  <\/div>\\n <\/div>\\n<\/div>\"}"
}