{
    "id":"Kaggle::techmap::613720eb25bbdb1fe3185fe0::linkedin_be::9",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The use of the term \"he\/she\" can be seen as exclusionary by those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"At NTT we believe that by using innovative technology we can solve global challenges and create a world that is sustainable and secure. We are looking for curious people, from diverse backgrounds, that are keen to work in a fast-paced and agile environment. At NTT we trust our employees to do the right thing, even when no one is watching, which is why we offer flexibility in the workplace. The majority of our roles are hybrid, meaning we encourage a balance of working from home and our local office. Ask our recruitment team if this is a hybrid role. Want to be a part of our team? The Senior Client Project \/ Programme Manager leads and directs concurrent client projects classified as standard or complex. They may also be involved in larger scale programmes and responsible for delivery across domains, business areas, geographies and technologies. The primary responsibility of the Senior Client Project \/ Programme Manager will be to interface with all project stakeholders to take projects from original concept through to final implementation, including handing over to Operations (whether internal to NTT or to the client's support operations). He \/ she may take responsibility for the management of projects and programmes within more complex \/ partnership accounts and collaborate and engage with senior members involved in programme delivery at the client site. Radford Information. Coordinates all aspects of a product or service offering project for a client, from inception to installation. Installations may involve acceptance of capitalized equipment or enterprise software systems, or system integration or consulting projects\/engagements. May work at client site from time to time. Typically involves extensive interaction with sales, systems engineering, product development, and other members of cross-functional teams. Project is typically focused on the delivery of new or enhanced products to improvement of customer satisfaction through the use of technology. Project management skills, rather than technical skills, are key, but a strong technical background is often required to manage competing interests. Typically oversees schedules and budgets to ensure goal attainment. Survey Tip: This role is most common in a software or professional services organization in which the individual does not have responsibility over product development, but does have overall project management responsibility. This job manages specific projects that have a distinct beginning and end. Working at NTT. Key Roles And Responsibilities.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613720eb25bbdb1fe3185fe0::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"NTT Ltd.\", \"position\": \"Senior Client Project Manager\", \"notes\": \"\", \"original\": \"At NTT we believe that by using innovative technology we can solve global challenges and create a world that is sustainable and secure. We are looking for curious people, from diverse backgrounds, that are keen to work in a fast-paced and agile environment.<br><br>At NTT we trust our employees to do the right thing, even when no one is watching, which is why we offer flexibility in the workplace. The majority of our roles are hybrid, meaning we encourage a balance of working from home and our local office. Ask our recruitment team if this is a hybrid role.<br><br><strong>Want to be a part of our team?<br><br><\/strong>The Senior Client Project \/ Programme Manager leads and directs concurrent client projects classified as standard or complex. They may also be involved in larger scale programmes and responsible for delivery across domains, business areas, geographies and technologies.<br><br>The primary responsibility of the Senior Client Project \/ Programme Manager will be to interface with all project stakeholders to take projects from original concept through to final implementation, including handing over to Operations (whether internal to NTT or to the client's support operations). He \/ she may take responsibility for the management of projects and programmes within more complex \/ partnership accounts and collaborate and engage with senior members involved in programme delivery at the client site. In this instance the Senior Client Project \/ Programme Manager will lead the coordinated management of multiple related projects within a programme to achieve the business objectives and ensure the strategic benefits are transitioned to the client organisation.<br><br><strong><u>Radford Information<br><br><\/u><\/strong>Coordinates all aspects of a product or service offering project for a client, from inception to installation. Installations may involve acceptance of capitalized equipment or enterprise software systems, or system integration or consulting projects\/engagements. May work at client site from time to time. Typically involves extensive interaction with sales, systems engineering, product development, and other members of cross-functional teams. Project is typically focused on the delivery of new or enhanced products to improvement of customer satisfaction through the use of technology. Project management skills, rather than technical skills, are key, but a strong technical background is often required to manage competing interests. Typically oversees schedules and budgets to ensure goal attainment. Survey Tip: This role is most common in a software or professional services organization in which the individual does not have responsibility over product development, but does have overall project management responsibility. This job manages specific projects that have a distinct beginning and end.<br><br><strong>Working at NTT<br><br><\/strong><strong><u>Key Roles And Responsibilities<br><\/u><\/strong><ul><li>Lead and direct concurrent standard or complex projects and in the case of programme management, ensure the management of multiple related projects directed towards a common objective<\/li><li>Engage with stakeholders to deliver projects from original concept through final implementation<\/li><li>Ensure client satisfaction and manages escalations, acting as single point of contact to the client<\/li><li>Ensure that the project \/ programme delivers as-sold solution, remains within the baselined budget and is delivered on time whilst maintaining quality criteria and client satisfaction<\/li><li>Manage delivery of the project\/programme, including rigorous scope control and change management<\/li><li>Ensure client satisfaction and manages escalations, acting as single point of contact to the client<\/li><li>Documentation and management of risks and issues<\/li><li>Ensuring clear and concise communications to all stakeholders<\/li><li>Provide pre-sales support by working with sales teams to scope and cost a project or programme solution which includes the completion of a proposal. This may include Client presentations of our delivery approach as part of a tender process.<\/li><li>Identification of opportunities and influence the sale by conducting a business conversation with the client positioning NTT Ltd consulting and technical services offerings<\/li><li>Coordinate activities of the project teams through task delegation, resource assignment and programme management<br><\/li><\/ul><strong><u>Knowledge, Skills And Attributes<br><\/u><\/strong><ul><li>Ability to establish strong relationships with internal stakeholders and external clients<\/li><li>Strategic thinking capability with an outcomes-focussed and results orientation<\/li><li>Excellent client centricity skills<\/li><li>Ability to manage customer satisfaction, commitment and expectations to high service levels and manage escalations adequately<\/li><li>Ability to work on client sites for an extended period<\/li><li>Excellent team building and skills<\/li><li>Mentoring of junior members of the Project Services Community<\/li><li>Excellent written and verbal communication skills<\/li><li>Ability to work in high-pressure environments<\/li><li>Ability to manage urgent and complex tasks simultaneously<\/li><li>Excellent business acumen and commercial skills<\/li><li>Passionate, strong initiative, self-driven with commitment to succeed<\/li><li>Good influencing ability whilst taking a collaborative approach<\/li><li>Detailed, meticulous and highly organised<\/li><li>Proactive in approach with excellent facilitation skills<br><\/li><\/ul><strong><u>Academic Qualifications And Certifications<br><\/u><\/strong><ul><li>Advanced Project Management degree or equivalent with significant related experience<\/li><li>Relevant project management certifications preferably PMP<\/li><li>ITIL certification is preferable<br><\/li><\/ul><strong><u>Required Experience<br><\/u><\/strong><ul><li>Demonstrated project \/ programme management experience preferably in a multi-national Professional Services environment<\/li><li>Proven client engagement experience<\/li><li>Demonstrated understanding of the project\/programme life cycle<\/li><li>Demonstrated competency in project\/programme change management<\/li><li>Proven experience managing expectations when balancing alternatives against business and financial constraints<br><\/li><\/ul><strong>What will make you a good fit for the role?<br><br><\/strong><strong><u>Standard Career Level Descriptor For Job Level<br><\/u><\/strong><ul><li> Have wide-ranging experience<\/li><li> Uses professional concepts and company objectives to solve complex issues in creative ways<\/li><li> Networks with others outside own area of expertise<\/li><li> Exercises judgment in selecting methods, techniques and evaluation criteria to obtain results<\/li><li> May coordinate others\\u2019 activities<\/li><li> Typically requires significant related experience with a Bachelor\\u2019s or equivalent degree<br><\/li><\/ul><strong>Join our growing global team and accelerate your career with us. Apply today.<br><br><\/strong><strong>Equal opportunity employer <br><br><\/strong>NTT is proud to be an equal opportunity employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category.<br><br><strong> R-63351<\/strong>\"}"
}