{
    "id":"Kaggle::techmap::6138a7be255128355562718e::britishjobs_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Mentions \"Requirements: . . Physically fit (Essential)\" without specifically detailing the physical requirements for the role. This may discourage those who might be physically able for the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Title: Production Operative FULL TIME. 12 Week Temp2Perm. Location: Standlake, Witney. Pay Rate: £9. 83 P\/h (Overtime £12. 28 P\/h). Days and Hours: 2 week rolling rota: Week 1: Monday 06:00-16:30 Tuesday 06:00-16:30 Wednesday Off Thursday Off Friday 06:00-16:30 Saturday 06:00-18:00 Sunday 06:00-18:00. Week 2: Monday Off Tuesday Off Wednesday 06:00-17:30 Thursday 06:00-17:30 Friday Off Saturday Off. Sunday Off. Active Staff Recruitment is proud to be working with a very reputable company based in Witney approximately 31 minutes’ drive from Oxford city centre. The company packs and distributes chicken and chicken eggs and prides itself on the industry leading standards it maintains and operates to. Responsibilities include:. Working with the team leader & other Operatives to achieve production targets and maximise efficiency. Follow Company Health & Safety guidelines throughout. Identify areas of inefficiency and waste Tray wash. Ensure product rotation to minimise waste. To be mindful of product quality, integrity, and tractability. To complete tasks to a high-standard, and ensure necessary documentation is completed. Maintain a respectful, constructive working relationship with colleagues and management. Possible Training provided if needed:. Health & Safety. Manual handling. - Manual\/electric pallet truck. - HACCP. Safe systems of work. Food handling\/hygiene. Requirements:. Physically fit (Essential). Own transport due to location of work (Essential). Previous warehouse experience (Preferred). Company benefits include:. Coffee Fob to use daily for 3 FREE Hot drinks per shift! Discounted eggs and chicken. Mental health and wellbeing service access. Welcome pack on arrival containing gifts & Info. Enhanced holiday scheme, which increases with length of service.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6138a7be255128355562718e::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Active Staff\", \"position\": \"Food Production Operative\", \"notes\": \"\", \"original\": \"Job Title: Production Operative FULL TIME<br><br>12 Week Temp2Perm<br><br>Location: Standlake, Witney<br><br>Pay Rate: &pound;9.83 P\/h (Overtime &pound;12.28 P\/h)<br><br>Days and Hours: 2 week rolling rota:<br><br>Week 1:<br><br>Monday 06:00-16:30 Tuesday 06:00-16:30 Wednesday Off Thursday Off Friday 06:00-16:30 Saturday 06:00-18:00 Sunday 06:00-18:00<br><br>Week 2:<br><br>Monday Off Tuesday Off Wednesday 06:00-17:30 Thursday 06:00-17:30 Friday Off Saturday Off<br><br>Sunday Off<br><br>Active Staff Recruitment is proud to be working with a very reputable company based in Witney approximately 31 minutes&rsquo; drive from Oxford city centre. The company packs and distributes chicken and chicken eggs and prides itself on the industry leading standards it maintains and operates to.<br><br>Responsibilities include:<br><br>&bull; Working with the team leader &amp; other Operatives to achieve production targets and maximise efficiency.<br><br>&bull; Follow Company Health &amp; Safety guidelines throughout.<br><br>&bull; Identify areas of inefficiency and waste Tray wash.<br><br>&bull; Ensure product rotation to minimise waste.<br><br>&bull; To be mindful of product quality, integrity, and tractability.<br><br>&bull; To complete tasks to a high-standard, and ensure necessary documentation is completed.<br><br>&bull; Maintain a respectful, constructive working relationship with colleagues and management.<br><br>Possible Training provided if needed:<br><br>- Health &amp; Safety<br><br>- Manual handling<br><br>- Manual\/electric pallet truck<br><br>- HACCP<br><br>- Safe systems of work<br><br>- Food handling\/hygiene<br><br>Requirements:<br><br>- Physically fit (Essential)<br><br>- Own transport due to location of work (Essential)<br><br>- Previous warehouse experience (Preferred)<br><br>Company benefits include:<br><br>&bull; Coffee Fob to use daily for 3 FREE Hot drinks per shift!<br><br>&bull; Discounted eggs and chicken.<br><br>&bull; Mental health and wellbeing service access.<br><br>&bull; Welcome pack on arrival containing gifts &amp; Info.<br><br>&bull; Enhanced holiday scheme, which increases with length of service<br>\"}"
}