{
    "id":"Kaggle::techmap::6137bb587d4ffc16c87fffdf::careerbuilder_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Spirit Halloween is now hiring! CHECK OUT OUR BENEFITS! Competitive salary & incentive opportunity. Career advancement. 30% discount on merchandise. We are currently hiring for the following position in your area-. Sales Associate Description: Understands and is totally sales and service focused on Spirits unique guest. Selling is our priority. Acknowledges all guests through a greeting, smile or eye contact regardless of the task at hand. Demonstrates knowledge of store products and uses this knowledge to build sales. Practices suggestive selling, offering every guest related items in order to build multiple sales. Maintains the highest standards of integrity, quality and timeliness in all of our business practices both internally and with our external partners. Assists in merchandising the store following the Supervisors instructions. Maintains store merchandising and operational standards. Follows all Company policies and procedures. May be asked to perform sign waver duties on a daily basis. We are looking for creative, high energy, fun people with strong leadership and customer service skills. DON'T MISS A GREAT OPPORTUNITY - APPLY NOW ONLINE. EEO M\/F\/D\/V.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137bb587d4ffc16c87fffdf::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Spirit Halloween\", \"position\": \"Sales Associates\", \"notes\": \"\", \"original\": \"<p>Spirit Halloween is now hiring!<br \/> <br \/> <strong>CHECK OUT OUR BENEFITS!<\/strong><br \/> \\u2022\\u00a0Competitive salary & incentive opportunity<br \/> \\u2022\\u00a0Career advancement<br \/> \\u2022\\u00a030% discount on merchandise<\/p>\\n<div style=\\\"text-align: center;\\\"><hr \/><\/div>\\n<p><strong>We are currently hiring for the following position in your area-<\/strong><\/p>\\n<br \/>\\n<p><strong>Sales Associate Description:<br \/> <\/strong><\/p>\\n<ul>\\n<li>\\n<div>Understands and is totally sales and service focused on Spirit\\u2019s unique guest.\\u00a0 Selling is our priority.<\/div>\\n<\/li>\\n<li>Acknowledges all guests through a greeting, smile or eye contact regardless of the task at hand.<\/li>\\n<li>\\n<div>Demonstrates knowledge of store products and uses this knowledge to build sales.<\/div>\\n<\/li>\\n<li>\\n<div>Practices suggestive selling, offering every guest related items in order to build multiple sales.<\/div>\\n<\/li>\\n<li>\\n<div>Maintains the highest standards of integrity, quality and timeliness in all of our business practices both internally and with our external partners.<\/div>\\n<\/li>\\n<li>\\n<div>Assists in merchandising the store following the Supervisor\\u2019s instructions.<\/div>\\n<\/li>\\n<li>\\n<div>Maintains store merchandising and operational standards.<\/div>\\n<\/li>\\n<li>\\n<div>Follows all Company policies and procedures.<\/div>\\n<\/li>\\n<li>May be asked to perform sign waver duties on a daily basis.<\/li>\\n<\/ul><p><strong>We are looking for creative, high energy, fun people with strong leadership and customer service skills. <br \/>\\r<br \/>\\r<br \/>\\rDON'T MISS A GREAT OPPORTUNITY - APPLY NOW ONLINE.<\/strong><\/p>\\r<p><strong>\\u00a0<\/strong><\/p>\\r<p><strong>EEO M\/F\/D\/V<\/strong><\/p>\\r<p><strong><\/strong><\/p>\"}"
}