{
    "id":"Kaggle::techmap::6155ea2bc3a99e7015a510f7::linkedin_ro::0",
    "label_age":true,
    "analysis_age":"The term \"young and experienced professionals\" subtly favours younger candidates while also implying a preference for those with significant experience. This language can disadvantage older applicants by implying a bias towards youthful energy and potentially disregarding seasoned professionals",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Requirements. What profiles are we looking for? Its an exciting time to join TELUS International. Were on a mission to find, attract, and bring aboard the best and brightest  superstars who are also great team players and leaders. We are continuously developing our departments and are looking for young and experienced professionals to join our teams. We Have Openings In The Following Areas. Mobile Customer Support. Customer Experience. Backoffice Gaming Support. Human Resources Positions. Digital Solutions. Software Customer Support. Why TELUS International? Step up your career. At TELUS International, we offer more than just jobs. we offer careers. When you join us, you are taking an important step in your success journey. We are going to challenge you, invest in you, train you, and prepare you for the next level in your career. Part of our philosophy is to promote from within. Over 70% of our managerial team started as front line customer service professionals. With more than 500 promotions since 2015, TELUS International is the place to build a career. Develop personally and professionally. We have designed and created programs that will help you on every step of your personal and professional development journey. Positioning you for success at the very beginning of your career is critical. Through our internal training programs, we provide a foundation of learning that enhances your onboarding experience and provides the necessary building blocks to hit the ground running in your new job. With our flexible schedule, you can work day or night, in four, six or eight hour shifts. Team members working at night can still take advantage of our fun and social environment with benefits such as free coffee, play and relax areas, a library, and much more. Plus, when your night shift is over, your taxi drive home is covered by the company. Enjoy an inspiring workplace. We are now working remotely, from everywhere, but when things are ready to get back to normal, youll have the opportunity to see how cool our office is. Convenience is also something very important to us. Our offices are easily accessible via public transportation so you dont waste precious time in traffic. You can come to work and go back home by subway or by one of the 12 different tram and bus lines available.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155ea2bc3a99e7015a510f7::linkedin_ro\", \"source\": \"linkedin_ro\", \"country\": \"RO\", \"company\": \"TELUS International Romania\", \"position\": \"Depune-ti CV-ul la TELUS International \\u00e2\\u0080\\u0093 Angajatori de TOP Business\", \"notes\": \"\", \"original\": \"<strong><u>Requirements<br><br><\/u><\/strong><strong>What profiles are we looking for?<br><br><\/strong>It\\u2019s an exciting time to join TELUS International. We\\u2019re on a mission to find, attract, and bring aboard the best and brightest \\u2013 superstars who are also great team players and leaders. We are continuously developing our departments and are looking for young and experienced professionals to join our teams.<br><br><strong><u>We Have Openings In The Following Areas<br><\/u><\/strong><ul><li>Mobile Customer Support<\/li><li>Customer Experience<\/li><li>Backoffice Gaming Support<\/li><li>Human Resources Positions<\/li><li>Digital Solutions<\/li><li>Software Customer Support<br><\/li><\/ul><strong>Why TELUS International?<br><br><\/strong><strong><u>Step up your career<br><br><\/u><\/strong>At TELUS International, we offer more than just jobs - we offer careers. When you join us, you are taking an important step in your success journey. We are going to challenge you, invest in you, train you, and prepare you for the next level in your career.<br><br>Part of our philosophy is to promote from within. Over 70% of our managerial team started as front line customer service professionals. With more than 500 promotions since 2015, TELUS International is the place to build a career.<br><br><strong><u>Develop personally and professionally<br><br><\/u><\/strong>We have designed and created programs that will help you on every step of your personal and professional development journey.<br><br>Positioning you for success at the very beginning of your career is critical. Through our internal training programs, we provide a foundation of learning that enhances your onboarding experience and provides the necessary building blocks to hit the ground running in your new job.<br><br>With our flexible schedule, you can work day or night, in four, six or eight hour shifts. Team members working at night can still take advantage of our fun and social environment with benefits such as free coffee, play and relax areas, a library, and much more. Plus, when your night shift is over, your taxi drive home is covered by the company.<br><br><strong><u>Enjoy an inspiring workplace<br><br><\/u><\/strong>We are now working remotely, from everywhere, but when things are ready to get back to normal, you\\u2019ll have the opportunity to see how cool our office is. Convenience is also something very important to us. Our offices are easily accessible via public transportation so you don\\u2019t waste precious time in traffic. You can come to work and go back home by subway or by one of the 12 different tram and bus lines available.<br><br>Located right next to the largest shopping mall in Romania, AFI Palace Cotroceni, our offices are only a few steps away from 300 stores, a cinema complex with 20 screens, over 30 restaurants, a hypermarket open daily until 1 a.m., and a 2,000 sqm fitness club.<br><br><strong><u>Help leave the world better than you found it<br><br><\/u><\/strong>Do you want to join an organization that gives back to the community and enables you to make a difference? TELUS International has award-winning Corporate Social Responsibility (CSR) programs, as we understand the relationship between the success of our company and the wellbeing of our community.<br><br>\\u201cWe give where we live\\u201d - these five simple words embody our approach to CSR and volunteering. Our flagship global initiative is TELUS Days of Giving, an annual event where our team members join efforts to better the communities in which they live, work and serve. To date, more than 1,700 of our Romanian team members have volunteered over 15,000 hours in local TELUS Days of Giving events, building homes, refurbishing daycare centers or constructing entire schools from the ground up.<br><br>Moreover, the TELUS International Romania Community Board allocates US$100,000 each year to projects focused on health, education and environment, having positively impacted the lives of more than 1,450 children and families in Romania so far.<br><br><strong>Who is TELUS International?<br><br><\/strong>TELUS International focuses on the value of human connection to design, build and deliver high-tech, high-touch customer experiences powered by next-gen digital solutions.<br><br>With almost 50,000 team members as well as delivery centers across North and Central America, Europe and Asia, TELUS International empowers customer experience innovation through digital enablement, spirited teamwork, agile thinking, and a caring culture that puts customers first.<br><br>By joining us, you will meet the customer care needs of some of the world\\u2019s most successful and disruptive brands across fast-growing tech, financial services and fintech, games, travel and hospitality and healthcare industries. The company serves clients in 50 languages.<br><br>No matter your position in our company, you will take part in shaping the future of customer care. If you choose Customer Care Support, you will master the skills of effective communication, problem solving, customer service, and strong cultural awareness.<br><br>You will have the opportunity to be part of something big and change lives through technology, amazing people and a strong brand like TELUS International.\"}"
}