{
    "id":"Kaggle::techmap::615666247aa49c40310e01f5::monster_uk::9",
    "label_age":true,
    "analysis_age":"\"Join our young and dynamic admin team\" is biased towards younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Receptionist Birchills Health Centre The closing date is 15 October 2021 Apply for this job Job summary. A new oppurtunity has arisen for a Receptionist position within a successful GP Surgery. You will be part of a team working together to help and advise patients whilst offering clerical support to a team of clinical staff. Previous GP Practice experience with EMIS software is preferred but not essential as full training will be provided. Main duties of the job. The purpose of your new Receptionist's position will beto ensure that patients are able to access health services including contact\/make an appointment to see a doctor in the appropriate manner depending on need and that all patient records are up-to-date and available for all users when required. The purpose of the job is also to contribute to maintaining practice administrative systems such as some basic data input, new patient registrations, correspondence, results and repeat prescribing systems. About us. Join our young and dynamic admin team within a well established and well led GP Surgery. Full training will be provided as well as guidelines with future skill growth. Job description Job responsibilities. JOB DESCRIPTION MEDICAL RECEPTIONIST. RESPONSIBLE TO: The Receptionist is responsible in the first instance to the Office Manager and thereafter to the Practice Manager and then to the Partners. PURPOSE OF JOB: The purpose of the job is also to contribute to maintaining practice administrative systems such as data input, new patient registrations, correspondence, results and repeat prescribing systems. KEY RELATIONSHIPS\/CONTACTS. Internal: Office\/reception manager. Practice Manager. GPs. Doctors in Training. Practice Nurse Team. Administration Team. Secretarial Team. Health Visitors. Community Nurses. Pharmacist. External: Patients, carers and relatives. CCG\/Board\/Practitioner Services. Local pharmacies. Local hospitals. Local laboratory services. Ambulance Service. Out of hours service. Practice suppliers. GENERALThe Receptionist will adhere at all times to the practices agreed protocols and procedures, will contribute to updating them as required and will protect patient confidentiality at all times. TELEPHONES. Reception staff will answer the various incoming outside lines into reception and also the internal lines.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615666247aa49c40310e01f5::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"National Health Service\", \"position\": \"Receptionist\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div class=\\\"nhsuk-grid-row\\\"> <div class=\\\"nhsuk-grid-column-two-thirds\\\"> <h1 class=\\\"nhsuk-heading-xl nhsuk-u-margin-bottom-2 word-wrap\\\" id=\\\"heading\\\">Receptionist<\/h1> <h2 class=\\\"nhsuk-heading-m\\\" id=\\\"employer_name\\\">Birchills Health Centre<\/h2> <h2 class=\\\"nhsuk-heading-m\\\" id=\\\"closing_date\\\">The closing date is 15 October 2021<\/h2> <\/div> <div class=\\\"nhsuk-grid-column-one-third nhsuk-u-padding-top-2\\\"> <div class=\\\"nhsuk-action-link\\\"> <a class=\\\"nhsuk-action-link__link\\\" href=\\\"\/candidate\/application\/A0439-21-5279\/pre-application-questions-pause?referrer=jobadvert&amp;ref=A0439-21-5279\\\" id=\\\"apply\\\" rel=\\\"nofollow nofollow\\\">Apply for this job<\/a> <\/div> <\/div> <div class=\\\"nhsuk-grid-column-two-thirds\\\"> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Job summary<\/h3> <p id=\\\"job_overview\\\"><\/p> <p>A new oppurtunity has arisen for a Receptionist position within a successful GP Surgery. You will be part of a team working together to help and advise patients whilst offering clerical support to a team of clinical staff.<\/p> <p>Previous GP Practice experience with EMIS software is preferred but not essential as full training will be provided.<\/p> <p><\/p> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2 \\\">Main duties of the job<\/h3> <p id=\\\"job_description\\\"><\/p> <p>The purpose of your new Receptionist's position will beto ensure that patients are able to access health services including contact\/make an appointment to see a doctor in the appropriate manner depending on need and that all patient records are up-to-date and available for all users when required.<\/p> <p><\/p> <p>The purpose of the job is also to contribute to maintaining practice administrative systems such as some basic data input, new patient registrations, correspondence, results and repeat prescribing systems.<\/p> <p><\/p> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">About us<\/h3> <p id=\\\"about_organisation\\\"><\/p> <p>Join our young and dynamic admin team within a well established and well led GP Surgery. Full training will be provided as well as guidelines with future skill growth.<\/p> <p><\/p> <h2 class=\\\"nhsuk-heading-l nhsuk-u-margin-bottom-2\\\">Job description<\/h2> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Job responsibilities<\/h3> <p id=\\\"job_description_large\\\" style=\\\"white-space:pre-line\\\"><\/p> <p>JOB DESCRIPTION MEDICAL RECEPTIONIST<\/p> <p>RESPONSIBLE TO:<\/p> <p>The Receptionist is responsible in the first instance to the Office Manager and thereafter to the Practice Manager and then to the Partners. <\/p> <p>PURPOSE OF JOB:<\/p> <p>The purpose of the Receptionist's job is to ensure that patients are able to access health services including contact\/make an appointment to see a doctor in the appropriate manner depending on need and that all patient records are up-to-date and available for all users when required. <\/p> <p>The purpose of the job is also to contribute to maintaining practice administrative systems such as data input, new patient registrations, correspondence, results and repeat prescribing systems.<\/p> <p>KEY RELATIONSHIPS\/CONTACTS<\/p> <p>Internal:<\/p> <ul> <li>Office\/reception manager<\/li> <li>Practice Manager<\/li> <li>GPs<\/li> <li>Doctors in Training<\/li> <li>Practice Nurse Team<\/li> <li>Administration Team<\/li> <li>Secretarial Team<\/li> <li>Health Visitors<\/li> <li>Community Nurses<\/li> <li>Pharmacist <\/li> <\/ul> <p>External:<\/p> <ul> <li>Patients, carers and relatives<\/li> <li>CCG\/Board\/Practitioner Services<\/li> <li>Local pharmacies<\/li> <li>Local hospitals<\/li> <li>Local laboratory services<\/li> <li>Ambulance Service<\/li> <li>Out of hours service<\/li> <li>Practice suppliers<\/li> <\/ul> <p><\/p> <p>GENERALThe Receptionist will adhere at all times to the practices agreed protocols and procedures, will contribute to updating them as required and will protect patient confidentiality at all times.<\/p> <p>TELEPHONES<\/p> <p>Reception staff will answer the various incoming outside lines into reception and also the internal lines. <\/p> <ul> <li>Switch incoming lines from out of hours message in the morning.<\/li> <li>Handle patients telephoning with an emergency in accordance with the practices protocol.<\/li> <li>Provide future\/on-the-day appointments\/telephone advice slots with team members in accordance with practices Access Protocol.<\/li> <li>Record patient information accurately and pass it on to appropriate team member for advice\/triage including emergencies.<\/li> <li>Forward calls to team members.<\/li> <li>Answer patient enquiries.<\/li> <li>Record and pass on messages.<\/li> <li>Assist patients checking the availability of their prescription or with a query.<\/li> <li>Switch incoming lines to out of hours message at the end of working day.<\/li> <\/ul> <p>RECEPTION DESK<\/p> <p>Reception staff will greet patients when they arrive in the practice and ensure that they are assisted appropriately. This will include the following list, which is not exhaustive:<\/p> <ul> <li>Handle patients presenting at reception as an emergency in accordance with the practices protocol.<\/li> <li>Provide future\/on-the-day appointments in accordance with the practices Access Protocol.<\/li> <li>Assist patients to check in for their appointments.<\/li> <li>Process requests for repeat and acute prescriptions.<\/li> <li>Pass out prescriptions for collection and answer associated queries.<\/li> <li>Advise walk-in patients about how to access the service according to patient need.<\/li> <li>Take requests for repeat prescriptions.<\/li> <li>Welcome and provide practice information\/registration protocol details for patients wishing to register with the practice.<\/li> <li>Process changes of address\/patient details.<\/li> <li>Record and pass on messages.<\/li> <li>Assist with unlocking and locking the surgery and ensure adherence to security procedures.<\/li> <\/ul> <p>RECORDS<\/p> <p>Receptionists will contribute to the updating and maintenance of all patient records. This will include the following. The list is not exhaustive: <\/p> <ul> <li>Update registration and clinical details.<\/li> <li>Input new patient registration data.<\/li> <li>Transmit new registration and de-registration data updates to Practitioner Services (registration details and records transfers).<\/li> <li>Highlight incoming mail for coding.<\/li> <li>Provide data for house calls (i-Pad\/printed visit summary sheets).<\/li> <li>Scan incoming correspondence and workflow to correct clinician.<\/li> <li>Workflow Out of Hours contact details to correct clinician.<\/li> <li>Workflow incoming results to correct clinician.<\/li> <li>Process incoming new patient records including arranging summarisation.<\/li> <li>Provide printed appointments list for each surgery as a backup in the event that the system is unavailable. <\/li> <li>Accurately re-file any paper records accessed by clinicians.<\/li> <li>Repair damaged Lloyd George\/A4 records.<\/li> <li>File\/scan ECGs.<\/li> <\/ul> <p>MESSAGES<\/p> <p>Receptionists will accurately record and pass on patient details and the content of the message in accordance with the practices message protocol. <\/p> <p>PRESCRIPTION REQUESTS<\/p> <p>Receptionists will take and action requests for repeat prescriptions over the telephone and in person in accordance with the practices Repeat Prescription Protocol.<\/p> <ul> <li>Process GPs requests to amend patients repeat prescribing records in accordance with the practices Repeat Prescription Protocol.<\/li> <li>Print repeat and acute prescriptions requested by patients and pass on for signature in accordance with protocol and within agreed timescales.<\/li> <li>Direct signed prescriptions in the appropriate direction (pharmacy\/post\/for collection).<\/li> <\/ul> <p>CONTACTING PATIENTS<\/p> <p>Receptionists will contact patients by phone or using standard letters in accordance with doctors instructions and to agreed timescales.<\/p> <p>PATIENT TRANSPORTReceptionists will book patient transport in accordance with local arrangements and within agreed timescales.<\/p> <p>Recording Deceased Patients <\/p> <p>Receptionists will ensure that they record any deaths according to the practices protocol and inform the appropriate professionals in the practice. <\/p> <p>Photocopying of Patient Notes<\/p> <p>Receptionists will photocopy patient notes for solicitors\/insurance companies as required, in accordance with the practices protocol.<\/p> <p>Processing paymentsReceptionists will accept and process payments for non-NHS services provided by the practice.<\/p> <p>CommunicationReceptionists will:<\/p> <ul> <li>Communicate effectively, promptly and courteously with patients, carers and relatives.<\/li> <li>Use the most expedient and appropriate means to communicate information to other team members.<\/li> <li>Communicate appropriately and accurately with colleagues outside the practice and with due reference to the common law of confidentiality and the Data Protection Act.<\/li> <li>Immediately inform a member of staff if a patient appears ill or if their behaviour causes concern (including correct use of Emergency\/Collapse\/Security protocols).<\/li> <li>Be aware of Child Protection issues and communicate concerns in accordance with practice protocol.<\/li> <\/ul> <p>DECISION-MAKING CONTRIBUTIONReceptionists will attend and contribute to meetings in the practice (staff meetings, planning meetings, significant event, special projects). This will include contributing to the development and review of practice protocols.<\/p> <p>QUALITY AND PERSONAL DEVELOPMENT<\/p> <p>Receptionists will:<\/p> <ul> <li>Participate in the practice appraisal system.<\/li> <li>Perform tasks to the best of their ability and contribute to the performance of the team.<\/li> <li>Take action to report\/tackle identified issues which affect quality or present risk to patients, team members or the practice.<\/li> <\/ul> <p>CONFIDENTIALITYIn the course of their duties, receptionists will have access to confidential information relating to patients, their carers and relatives and colleagues within and outside the practice. They may also have access to information relating to the practice as a business. All such information from any source whatsoever will be treated as strictly confidential.<\/p> <p>Information relating to patients, their carers and relatives and colleagues within and outside the practice and in relation to the practice as a business will only be shared in accordance with the practices Confidentiality Policy, the Data Protection Act and the Freedom of Information Act and in such a way that personal and sensitive patient-identifiable data is protected.<\/p> <p>HEALTH AND SAFETYAll receptionists will be aware of and comply with the practices Health and Safety Policy. This will include:<\/p> <ul> <li>Minimising risk to self and others in the workplace.<\/li> <li>Identifying and reporting hazards\/risks and contributing to control measures.<\/li> <li>Adhering to all relevant policies including infection control, cold chain<\/li> <li>Contribute to keeping the working area and patient areas tidy and free from hazards.<\/li> <li>Using protective equipment and clothing if necessary and in accordance with the practices policy.<\/li> <li>Attending regular Health and Safety training.<\/li> <\/ul> <p>EQUALITY AND DIVERSITY<\/p> <p>Receptionists will comply with the practices Equality and Diversity Policy, including:<\/p> <ul> <li>Recognising the rights of patients, carers, relatives and colleagues and respecting their needs, beliefs, privacy and dignity.<\/li> <li>Not discriminating against patients, carers, relatives or colleagues on the grounds of any of the protected characteristics in the Equality Act 2010.<\/li> <\/ul> <p>COMPLAINTS<\/p> <p>Receptionists will provide patients who wish to complain with a copy of the practices complaints procedure and will explain how a patient should proceed if they want to complain face to face or in writing. <\/p> <p>OTHER DUTIES <\/p> <p>Receptionists may, from time to time, be asked to undertake other reasonable duties, with appropriate training and it expected that agreement to this will not be unreasonably withheld.<\/p> <p>The Receptionist will from time to time undertake work on special projects as agreed with the Practice Manager and\/or GPs. <\/p> <p><\/p> <p><\/p> <h2 class=\\\"nhsuk-heading-l nhsuk-u-margin-bottom-2\\\">Person Specification<\/h2> <h3 class=\\\"nhsuk-heading-s nhsuk-u-margin-bottom-2\\\" id=\\\"skill_category_1\\\"> Please refer to the Person Specification <\/h3> <h4 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Essential<\/h4> <ul class=\\\"nhsuk-list nhsuk-list--bullet nhsuk-u-margin-bottom-2\\\"> <li id=\\\"essential_skill_1_criteria_1\\\">Good interpersonal and communication skills<\/li> <li id=\\\"essential_skill_1_criteria_2\\\">Reliable<\/li> <li id=\\\"essential_skill_1_criteria_3\\\">Flexible<\/li> <\/ul> <h4 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Desirable<\/h4> <ul class=\\\"nhsuk-list nhsuk-list--bullet nhsuk-u-margin-bottom-4\\\"> <li id=\\\"desirable_skill_1_criteria_1\\\">Basic IT skills are essential and some previous GP Practice experience with EMIS software is preferred but not essential as full training will be provided.<\/li> <\/ul> <div id=\\\"dbs-container\\\"><\/div> <h2 class=\\\"nhsuk-heading-l nhsuk-u-margin-bottom-2\\\">Employer details<\/h2> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Employer name<\/h3> <p id=\\\"employer_name_details\\\">Birchills Health Centre<\/p> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Address<\/h3> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_address_line_1_a\\\">23 - 37 Old Birchills<\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_address_line_2_b\\\"><\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_town_c\\\">Walsall<\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_county_d\\\">West Midlands<\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_postcode_e\\\">WS2 8QH<\/p> <br> <h4 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\" id=\\\"employer_website_heading\\\">Employer's website<\/h4> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_website_url\\\"><a href=\\\"https:\/\/www.birchillshc.co.uk\\\" id=\\\"employer_website_url_link\\\" rel=\\\"nofollow noopener noreferrer\\\" target=\\\"_blank\\\">https:\/\/www.birchillshc.co.uk<\/a><\/p> <\/div> <\/div> <\/div>\"}"
}