{
    "id":"Kaggle::techmap::6151e025ac8d0e45ee4d288c::simplyhired_ie::3",
    "label_age":true,
    "analysis_age":"Let's adjust the phrasing for better readability:  The requirement for \"energetic\" candidates could subtly deter older applicants. Adjusting this phrasing would enhance inclusivity.",
    "label_disability":true,
    "analysis_disability":" The need for a \"secure presence\" might imply physical requirements that exclude those with disabilities. Adjusting this phrasing would enhance inclusivity.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement to wear a \"full clean uniform\" might affect individuals with specific cultural or religious dress practices; rephrasing this to \"full clean uniform, with provisions made for cultural and religious attire\" could be more inclusive.",
    "verified":true,
    "synthetic":false,
    "text":"The Wyatt Hotel is a bustling boutique-style hotel in the heart of Westport featuring 90 tastefully decorated bedrooms, an upmarket Brasserie and a traditional Irish Bar. We are currently recruiting for a Hotel receptionist who enjoys working in a vibrant fast-paced environment with excellent terms and conditions. Part Time and Full time positions available. Successful candidates will be driven, energetic, with superb customer service skills and a drive to create change. PURPOSE OF JOB: Welcome guests to The Wyatt Hotel in a courteous manner, check guests in and out of the hotel, deal with guest queries, provide prompt and professional guest service to meet guest needs and ensure guest satisfaction. Answer the phone promptly and politely. Maintain a secure presence within the Hotel and assure all security measures are adhered to during your shift. RESPONSIBLE TO: General Manager, Front Office Manager, Front Office Supervisor, Assistant Managers, and Manager on Duty. RESPONSIBLE FOR: The role of Receptionist is ultimately to greet guests and allocate rooms according to laid-down procedures. To care for all guests needs and for the security of Hotel and guests. MAIN DUTIES: To arrive for work on time and dressed in a full clean uniform. Greet the customer and identify reservations as per customer details. Excellent Knowledge of OPERA, register the guest, ensuring that the necessary details are obtained, i. e. name in full, address, whether company or private booking, special rate, allowances, VIP, charge details, nationality, passport number, etc. Verify the guest's payment method. Verify and imprint credit cards for authorization if necessary. Provide accurate information about local attractions and services. Liaise with necessary staff including housekeeping and maintenance to address any problems or complaints made by guests. Complete and maintain any incident reports, daily activity reports or other reports requested by management. Have excellent knowledge of Hotel rate and availability taking\/imputing reservations correctly. Liaise or alert porter\/bar so that the guest's luggage is taken to his room if required and the key issued. Ensure that all departments, particularly restaurants, are notified of the package entitlements. Ensure that all departments’ charges are correctly posted onto guests’ bill, particularly restaurant and bar charges. Check out procedures in accordance with your SOP. Process accurate payment of guest accounts.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6151e025ac8d0e45ee4d288c::simplyhired_ie\", \"source\": \"simplyhired_ie\", \"country\": \"IE\", \"company\": \"The Wyatt Hotel\", \"position\": \"Hotel Receptionist\", \"notes\": \"\", \"original\": \"The Wyatt Hotel is a bustling boutique-style hotel in the heart of Westport featuring 90 tastefully decorated bedrooms, an upmarket Brasserie and a traditional Irish Bar. We are currently recruiting for a Hotel receptionist who enjoys working in a vibrant fast-paced environment with excellent terms and conditions. Part Time and Full time positions available. Successful candidates will be driven, energetic, with superb customer service skills and a drive to create change.\\n<br \/><br \/>\\n<b>PURPOSE OF JOB:<\/b><br \/>\\nWelcome guests to The Wyatt Hotel in a courteous manner, check guests in and out of the hotel, deal with guest queries, provide prompt and professional guest service to meet guest needs and ensure guest satisfaction. Answer the phone promptly and politely. Maintain a secure presence within the Hotel and assure all security measures are adhered to during your shift.\\n<br \/><br \/>\\n<b>RESPONSIBLE TO:<\/b><br \/>\\nGeneral Manager, Front Office Manager, Front Office Supervisor, Assistant Managers, and Manager on Duty.\\n<br \/><br \/>\\n<b>RESPONSIBLE FOR:<\/b><br \/>\\nThe role of Receptionist is ultimately to greet guests and allocate rooms according to laid-down procedures. To care for all guests needs and for the security of Hotel and guests.\\n<br \/><br \/>\\n<b>MAIN DUTIES:<\/b><br \/>\\nTo arrive for work on time and dressed in a full clean uniform.\\n<br \/>Greet the customer and identify reservations as per customer details.\\n<br \/>Excellent Knowledge of OPERA, register the guest, ensuring that the necessary details are obtained, i.e. name in full, address, whether company or private booking, special rate, allowances, VIP, charge details, nationality, passport number, etc.\\n<br \/>Allocate room according to reservations list, ensuring that this is what the guest has booked, both in terms of the room itself and the rate to be paid.\\n<br \/>Verify the guest&#39;s payment method. Verify and imprint credit cards for authorization if necessary.\\n<br \/>Provide accurate information about local attractions and services.\\n<br \/>Liaise with necessary staff including housekeeping and maintenance to address any problems or complaints made by guests.\\n<br \/>Complete and maintain any incident reports, daily activity reports or other reports requested by management.\\n<br \/>Have excellent knowledge of Hotel rate and availability taking\/imputing reservations correctly.\\n<br \/>Liaise or alert porter\/bar so that the guest&#39;s luggage is taken to his room if required and the key issued.\\n<br \/>Ensure that all departments, particularly restaurants, are notified of the package entitlements.\\n<br \/>Ensure that all departments\\u2019 charges are correctly posted onto guests\\u2019 bill, particularly restaurant and bar charges.\\n<br \/>Check out procedures in accordance with your SOP.\\n<br \/>Process accurate payment of guest accounts\\n<br \/>inform housekeeping when rooms have been vacated and are ready for cleaning\\n<br \/>monitor visitors to the hotel\\n<br \/>Ensure to carry out the correct cash up procedures, and opening and closing procedures as stated in SOP.\\n<br \/>Ensure to RUN the NIGHT ADUIT correctly on the start of AM Shift as per SOP.\\n<br \/>Complete AM \/ PM checklist making sure all tasks are complete and provide a detailed handover to next shift.\\n<br \/>Ensure that all storage areas are maintained to a high level of cleanliness.\\n<br \/>Report any faulty, broken or damaged equipment immediately to Manager on Duty.\\n<br \/>Ensuring that all reasonable care is taken for the health and safety of yourself and others in the Front of House area\\n<br \/>Report any problems directly to the Manager.\\n<br \/>Answer phone at all times in a polite and courteous manner.\\n<br \/>Carry out a complete cleaning of Front Office area before the end of shift.\\n<br \/>Remain vigilant and alert at all times. Make yourself visually available.\\n<br \/>Ensure that all company standards of performance are consistently adhered to.\\n<br \/>Do not use company equipment for any other business other than the business of the Hotel i.e.\\n<br \/>Do not use computers for surfing the internet or personal e-mails Computers are not for personal use.\\n<br \/>To comply with company regulations regarding.\\n<br \/><br \/>\\n<ul><li>Fire<\/li><li>Health &amp; Safety<\/li><li>Customer Care<\/li><li>Security<\/li><\/ul>\\nEnsuring that a high standard of personal hygiene and grooming is adhered to.\\n<br \/>Attendance of any training courses required by management.\\n<br \/>To perform all duties instructed by your supervisor\/manager in a timely and courteous manner\\n<br \/>To read, understand and carry out your responsibilities as defined in the Staff Handbook.\\n<br \/><br \/>\\n<b>Occasional Duties:<\/b><br \/>\\nDuring certain periods you may be asked to carry out duties in other areas in the hotel.\\n<br \/><br \/>\\nThis Job Description is not exhaustive and can be updated in the future.\\n<br \/><br \/>\\nWhat else do I need to know?\\n<br \/><br \/>\\nA more detailed job description is available on request and will be discussed at interview stage. We will only respond to applicants who are successful for interview.\\n<br \/><br \/>\\nWe are an equal opportunities employer. Under GDPR all unsuccessful applicants\\u2019 information will be removed from the system within one month and will not be passed to any third parties.\"}"
}