{
    "id":"Kaggle::techmap::615099187d360e49a1f60672::careerbuilder_us::0",
    "label_age":true,
    "analysis_age":"\"Must be at least 21 years old\" may exclude younger individuals who are legally eligible to work and may be capable of performing the job's duties.  It is not stated if there are legal or insurance reasons.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" $1000 Bonus. Delivery Driver  DPL4 Fairless Hills, PA (Starting Pay $19.25\/hr). Amazon Delivery Service Partners. Shifts: Morning, afternoon, weekday and\/or weekend. Location: DPL4. Fairless Hills. 1 Geoffrey Drive, Fairless Hills, PA. Compensation: Starting pay $19.25\/hr  benefits. Are you interested in a new opportunity where you can work independently, make a difference in your community, and delight hundreds of customers every day? Apply to be a Delivery Driver for an Amazon Delivery Service Partner (DSP) today. DSPs provide contracted delivery services to Amazon and are hiring Delivery Drivers to meet growing customer demand as we approach the holiday season. DSPs offer competitive compensation, benefits, a great company culture, and opportunities for growth. No delivery experience required. apply today to schedule your in-person or virtual interview. DSPs are making on-the-spot job offers contingent on meeting eligibility requirements. What Youll Do: As a Delivery Driver, youll drive an Amazon-branded vehicle, delivering 200-250 packages per day. You will be a delivery hero in the neighborhoods you serve. delivering hundreds of smiles to customers every day in the form of critical supplies, household goods, toys and so much more. You can expect to work 4-5 days per week and up to 10 hours per day. Why Youll Love Working For a DSP: Earn more: competitive compensation starting at $19.25 per hour. Compelling Benefits:paid time off and health insurance for all full time employees. Independence: spend the majority of your day on the road delivering smiles to customers. Stay active: youll be on the move during your shift as you deliver packages from the delivery vehicle to the customers doorstep. Professional growth: many DSPs offer career growth opportunities such as moving into Lead Driver, Dispatcher, or Operations Manager roles, DOT certification, and professional development and training. Team environment: a fun, fast-paced, and supportive company culture. Equal opportunity employer: DSP is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. What Youll Need: Must be at least 21 years old. Must have a valid driver's license within the state of employment. Must be able to move boxes up to 50 lbs., with or without reasonable accommodation. Health and safety are always a top priority for Amazon and the Delivery Service Partners Amazon contracts with.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615099187d360e49a1f60672::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Amazon DSP Driver\", \"position\": \"Bonus - Amazon DSP - Delivery Driver\", \"notes\": \"\", \"original\": \"<br \/><br \/><b>$1000 Bonus- Delivery Driver \\u2013 DPL4\\u00a0 Fairless Hills, PA (Starting Pay $19.25\/hr+) - Amazon Delivery Service Partners<\/b><br \/><br \/><p><strong>\\u00a0<\/strong><\/p><p><strong>Shifts: <\/strong>Morning, afternoon, weekday and\/or weekend<\/p><p><strong>Location: <\/strong>DPL4 - Fairless Hills\\u00a0- 1 Geoffrey Drive, Fairless Hills, PA<\/p><p><strong>Compensation: <\/strong>Starting pay $19.25\/hr + benefits<\/p><p><strong>\\u00a0<\/strong><\/p><p>Are you interested in a new opportunity where you can work independently, make a difference in your community, and delight hundreds of customers every day? Apply to be a Delivery Driver for an Amazon Delivery Service Partner (DSP) today. DSPs provide contracted delivery services to Amazon and are hiring Delivery Drivers to meet growing customer demand as we approach the holiday season. DSPs offer competitive compensation, benefits, a great company culture, and opportunities for growth. No delivery experience required - apply today to schedule your in-person or virtual interview. DSPs are making on-the-spot job offers contingent on meeting eligibility requirements.<\/p><p><br \/><strong>What You\\u2019ll Do:<\/strong><\/p><p>As a Delivery Driver, you\\u2019ll drive an Amazon-branded vehicle, delivering 200-250 packages per day. You will be a delivery hero in the neighborhoods you serve - delivering hundreds of smiles to customers every day in the form of critical supplies, household goods, toys and so much more. You can expect to work 4-5 days per week and up to 10 hours per day.<\/p><p><br \/><strong>Why You\\u2019ll Love Working For a DSP:<\/strong><\/p><ul><li><strong>Earn more<\/strong>: competitive compensation starting at $19.25 per hour<\/li><li><strong>Compelling Benefits<\/strong>:<strong> <\/strong>paid time off and health insurance for all full time employees<\/li><li><strong>Independence<\/strong>: spend the majority of your day on the road delivering smiles to customers<\/li><li><strong>Stay active<\/strong>: you\\u2019ll be on the move during your shift as you deliver packages from the delivery vehicle to the customer\\u2019s doorstep<\/li><li><strong>Professional growth<\/strong>: many DSPs offer career growth opportunities such as moving into Lead Driver, Dispatcher, or Operations Manager roles, DOT certification, and professional development and training<\/li><li><strong>Team environment<\/strong>: a fun, fast-paced, and supportive company culture<\/li><li><strong>Equal opportunity employer<\/strong>: DSP is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. <\/li><\/ul><p><strong>What You\\u2019ll Need:\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/strong><\/p><ul><li>Must be at least 21 years old<\/li><li>Must have a valid driver's license within the state of employment<\/li><li>Must be able to move boxes up to 50 lbs., with or without reasonable accommodation<\/li><\/ul><p>Health and safety are always a top priority for Amazon and the Delivery Service Partners Amazon contracts with. In partnership with one another, Amazon and the DSPs continue to consult with medical and health experts, and take all recommended precautions to keep everyone healthy.<\/p>&nbsp;\"}"
}