{
    "id":"Kaggle::techmap::614b4b0e197ded0b6d1f70eb::britishjobs_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The phrases \"Be caring, patient\" and \"Calming mannerisms\" are often culturally and stereotypically associated with women, which may inadvertently signal a preference for female candidates.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1:1 Full Time LSA (mobility requirements). Bristol. Are you an experienced teaching assistant? Prospero Teaching are looking for an LSA to work 1:1 on a full time basis in a mainstream Primary School in Bristol with a pupil with extra mobility requirements in a reception class. Duties would include assisting the teacher in the classroom environment and supporting a child who requires additional help. The candidate should also be able to think quickly & problem solve without the supervision of the teacher. A successful candidate will have a experience working with individuals with Extra mobility requirements. Experience within a classroom environment would be advantageous but not essential. Having a current enhanced child workforce DBS on the update service would also be advantageous, if not you will be required to pay for a new DBS before being introduced to schools (£45.80). Contract\/ Position Details. Location: Bristol. Position: 1:1 Full-time LSA. Type of work: Teaching Assistant\/ LSA. Contract or position start date: ASAP. Duration \/ Likely Duration: Temp to Perm. Full time\/part time: Full time. Minimum rate of pay: £75 per day. Hours: 8:30 am - 4pm (full day), half day (am or pm)Experience, training and qualification: Experience of mobility requirements. essential. Ability to think quickly & without supervision. Confident when working 1 to 1. Strong behaviour management skills while creating a fun learning environment. Driven to motivate the pupil and increase their participation. Be caring, patient and have good communication skills. Calming mannerisms in challenging situations. The ability to grow individual personal development. Willing to complete Safeguarding online training. Complete a face-to-face registration, currently being done remotely on Zoom. To Be Eligible For This Role Through Prospero Teaching, You Must: Hold Right to Work in the UK. Hold an enhanced child barred list DBS certificate registered with the online update service or be willing to process a new application. Provide two professional child related references. Other. Prospero Teaching is acting as an employment business\/education recruitment agency in relation to this vacancy. The successful candidate will be required to register with Prospero Teaching in order to fill this vacancy. Prospero Teaching is able to offer the successful candidate: Free, accredited continued professional development courses including safeguarding and behaviour management. In-house Training and Development Team. If you would like to be considered for this role, please apply with a copy of your up to date CV.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b4b0e197ded0b6d1f70eb::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Prospero Teaching\", \"position\": \"LSA (mobility requirements) - Bristol\", \"notes\": \"\", \"original\": \"1:1 Full Time LSA (mobility requirements) - Bristol<br><br>Are you an experienced teaching assistant? Prospero Teaching are looking for an LSA to work 1:1 on a full time basis in a mainstream Primary School in Bristol with a pupil with extra mobility requirements in a reception class.<br><br>Duties would include assisting the teacher in the classroom environment and supporting a child who requires additional help. The candidate should also be able to think quickly &amp; problem solve without the supervision of the teacher.<br><br>A successful candidate will have a experience working with individuals with Extra mobility requirements. Experience within a classroom environment would be advantageous but not essential. Having a current enhanced child workforce DBS on the update service would also be advantageous, if not you will be required to pay for a new DBS before being introduced to schools (&pound;45.80).<br><br>Contract\/ Position Details<br><br>Location: Bristol<br>Position: 1:1 Full-time LSA<br>Type of work: Teaching Assistant\/ LSA<br>Contract or position start date: ASAP<br>Duration \/ Likely Duration: Temp to Perm<br>Full time\/part time: Full time<br>Minimum rate of pay: &pound;75 per day<br>Hours: 8:30 am - 4pm (full day), half day (am or pm)Experience, training and qualification:<br><br>Experience of mobility requirements- essential<br>Ability to think quickly &amp; without supervision<br>Confident when working 1 to 1<br>Strong behaviour management skills while creating a fun learning environment<br>Driven to motivate the pupil and increase their participation<br>Be caring, patient and have good communication skills<br>Calming mannerisms in challenging situations<br>The ability to grow individual personal development<br>Willing to complete Safeguarding online training<br>Complete a face-to-face registration, currently being done remotely on Zoom <br><br>To Be Eligible For This Role Through Prospero Teaching, You Must: <br><br>Hold Right to Work in the UK<br>Hold an enhanced child barred list DBS certificate registered with the online update service or be willing to process a new application<br>Provide two professional child related references <br><br>Other <br><br>Prospero Teaching is acting as an employment business\/education recruitment agency in relation to this vacancy. The successful candidate will be required to register with Prospero Teaching in order to fill this vacancy.<br><br>Prospero Teaching is able to offer the successful candidate:<br><br>Free, accredited continued professional development courses including safeguarding and behaviour management<br>In-house Training and Development Team <br><br>If you would like to be considered for this role, please apply with a copy of your up to date CV. Only shortlisted candidates will be contacted.<br><br>For more information about the role or how Prospero Teaching can help you secure your next role, contact Nila at the Bristol branch on (phone number removed) or email your CV to (url removed)<br><br>\"}"
}