{
    "id":"Kaggle::techmap::614f3eaea2141e01bdd3ba83::linkedin_id::1",
    "label_age":true,
    "analysis_age":"The requirement of \"10 years experience\" can introduce age bias by favouring older candidates who are more likely to have accumulated this level of experience, potentially disadvantaging younger but equally capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The phrase specifically encouraging applications from \"experienced and capable women\" introduces feminine bias by singling out a gender, which could discourage male or non-binary candidates from applying.",
    "label_racial":false,
    "analysis_racial":"The requirement for fluency in Bahasa Indonesia and English is relevant to the job's specific linguistic needs and does not introduce bias, as it ensures candidates can effectively perform the necessary communication tasks.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years experience in developing and supporting the implementation of communication strategies, preferably for development projects. Capability and proven experience in developing communication materials in various formats (print, radio, web-based, television, etc. ) targeting a variety of audiences. Strong experience working with national and sub-national media. Proven ability to work fast and multi-task, take initiative and work well under pressure. Fluency in Bahasa Indonesia and English. Understanding of gender equality and social inclusion issues. Further Information & Application Details. Applications should be submitted online via the Careers page of Abt Associates website and MUST include a CV and covering letter addressing the key requirements listed above. We are an equal opportunity employer and encourage applications from experienced and capable women. Applications close: Wednesday, 6 October 2021  midnight (AEST). We welcome and thank all applicants however. Only shortlisted applicants will be contacted. Abt Associates  Who We Are. Abt Associates is a recognised leader in the international development sector. Working with our many partners, Abt Associates implements bold innovative solutions to improve the lives of the community and deliver valued outcomes for our clients. We provide a comprehensive range of services from policy to service delivery in the public and private sectors contributing to long term benefits for clients and communities. Operating in remote and challenging environments, we offer innovative solutions, extensive experience in the region, strong technical capacity, and a proven project management track record. We are committed to gender equity in our employment strategies and encourage applications from capable women. Abt Associates is a child safe organisation and promotes the safety, wellbeing and inclusion of all children. For more information about our company and what we do visit our website at www. abtassociates. com.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f3eaea2141e01bdd3ba83::linkedin_id\", \"source\": \"linkedin_id\", \"country\": \"ID\", \"company\": \"Abt Associates\", \"position\": \"Communications Manager\", \"notes\": \"\", \"original\": \"<p><strong>KOMPAK Program<\/strong><\/p><p>KOMPAK is an Australia-Indonesia government partnership supporting the Government of Indonesia's efforts in reducing poverty through improvements in basic service delivery and creating opportunities for work. KOMPAK focuses its efforts on three result areas:<\/p><ol><li>Supporting Local Governments and Service Units to better address the needs of basic service users;<\/li><li>Supporting the poor and vulnerable to benefit from improved village governance; and<\/li><li>Supporting the poor and vulnerable to benefit from increased opportunities for employment and economic development.<\/li><\/ol><p><strong>&nbsp;<\/strong><\/p><p><strong>The Opportunity<\/strong><\/p><p>The key purpose of the&nbsp;<strong><em>Communications Manager<\/em><\/strong>&nbsp;is to support the Communications and Knowledge Management Lead on the implementation of the communications strategy, with specific focus on providing communications support to the program implementation team and managing the end-to-end process for production of communications materials.<\/p><p><em><u>The advertised position is a full-time role expected to continue till June 2022. However, candidates with suitable qualifications who are willing to take a part-time role, are encouraged to apply (please mention your preference within the statement addressing the selection criteria).<\/u><\/em><\/p><p><strong>&nbsp;<\/strong><\/p><p><strong>Key Duties<\/strong><\/p><p>The Communications Manager will be assisting the Communications and Knowledge Management Lead in addressing the communications needs of the program and manage the dissemination of program activities and results. The Communications Manager will work closely with the Implementation Team to develop advocacy and communications materials to support program implementation, as well as manage contracts and consultants related to communications, media, journalists and the website.<\/p><p>The Communications Manager will have the following duties (although not limited to):<\/p><ul><li>Coordinate\/manage the production of communications materials in various formats for website and knowledge centre platform to raise program visibility<\/li><li>Coordinate and supervise the works of vendors and\/or consultants<\/li><li>Provide technical inputs to the implementation team on communications elements of program activities to strengthen impact and results, starting from the design and planning of activities<\/li><li>Coordinate the quality assurance process of various communications products and creative disseminations strategies<\/li><li>Support the event executions for various activities when required, including administrative management<\/li><li>Support the implementation of communications initiatives, including acting as the gatekeeper for branding guidelines on its updates and implementation<\/li><li>Assist in relationship building with media outlets and key communications partners that will lead to mainstream media coverage of KOMPAK<\/li><li>Assist in generating press releases and media invites in close coordination with the Program Implementation Delivery team members<\/li><\/ul><p><br><\/p><p>&nbsp;<\/p><p><strong>Key Requirements<\/strong><\/p><ul><li>Educational background in communication, journalism or related social studies area<\/li><li>10+ years\\u2019 experience in developing and supporting the implementation of communication strategies, preferably for development projects<\/li><li>Capability and proven experience in developing communication materials in various formats (print, radio, web-based, television, etc.) targeting a variety of audiences<\/li><li>Strong experience working with national and sub-national media<\/li><li>Proven ability to work fast and multi-task, take initiative and work well under pressure<\/li><li>Fluency in Bahasa Indonesia and English<\/li><li>Understanding of gender equality and social inclusion issues<\/li><\/ul><p><strong>&nbsp;<\/strong><\/p><p><strong>Further Information &amp; Application Details<\/strong><\/p><p>Applications should be submitted online via the Careers page of Abt Associates\\u2019 website and&nbsp;<strong>MUST<\/strong>&nbsp;include a CV and covering letter&nbsp;addressing the key requirements listed above.&nbsp;<\/p><p>We are an equal opportunity employer and encourage applications from experienced and capable women.<\/p><p><strong><em>Applications close: Wednesday, 6 October 2021 \\u2013 midnight (AEST)<\/em><\/strong><\/p><p>We welcome and thank all applicants however; only shortlisted applicants will be contacted.<\/p><p><strong>&nbsp;<\/strong><\/p><p><strong>Abt Associates \\u2013 Who We Are<\/strong><\/p><p>Abt Associates is a recognised leader in the international development sector. Working with our many partners, Abt Associates implements bold innovative solutions to improve the lives of the community and deliver valued outcomes for our clients. We provide a comprehensive range of services from policy to service delivery in the public and private sectors contributing to long term benefits for clients and communities. Operating in remote and challenging environments, we offer innovative solutions, extensive experience in the region, strong technical capacity, and a proven project management track record. We are committed to gender equity in our employment strategies and encourage applications from capable women. Abt Associates is a child safe organisation and promotes the safety, wellbeing and inclusion of all children. For more information about our company and what we do visit our website at&nbsp;www.abtassociates.com<\/p>\"}"
}