{
    "id":"Kaggle::techmap::615bc58d0adfb61978547068::seek_au::1",
    "label_age":true,
    "analysis_age":"The text encourages recent graduates to apply, which is inclusive for younger applicants but might deter older applicants who are equally qualified but not recent graduates.  The requirement for \"digital fluency\" also suggests role is looking for a younger candidate. ",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"About the business. Box of Books is a digital leader in the Edu. Tech space. We streamline the delivery of e. Books, digital resources and ship physical textbooks to teachers and students and work hard to keep leading secondary schools at the forefront of digital learning. Backed by all major global and Australian educational publishers, this is a great opportunity to grow your career as we continue to expand domestically. Box of Books is looking for Customer Success and Operations Officers to deliver excellent service outcomes for both new and existing clients in our rapidly growing customer base. This opportunity is open to applicants located in Sydney, Australia. About the role. Report to the General Manager, Customer Success and Operations. Provide outstanding customer service via our in-app messaging, email and telephone channels. Engage with sales team and key stakeholders within schools. Engage with publishers for resourcing queries. Contribute to the improvement and innovation of customer service processes across the business. Assist in other operational aspects of the business as required. Benefits and perks. Team environment – you'll be working closely with our talented team nationally. Work from home and the office. a working environment that encourages work life balance. Future prospects – an exciting career for highly motivated individuals with one of Australia's fastest growing and innovative Edu. Tech companies. Skills and experience. Top communicator – strong written and verbal communication with ability to adapt communication style to the situation. Team player – collaborative approach to issue resolution. Digital fluency – willing to learn internal systems and processes, type reasonably fast and is familiar with G Suite. Attitude – optimistic, problem-solving mindset with the ability to juggle changing priorities. Eagle eyed – high attention to detail. Experience – undergraduate degree or previous customer support experience preferred. Recent graduates are encouraged to apply. The application form will include these questions: Which of the following statements best describes your right to work in Australia? Do you have experience in an administration role? Do you have customer service experience? What's your expected annual base salary?.....",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615bc58d0adfb61978547068::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Box of Books\", \"position\": \"Customer Success and Operations Officer\", \"notes\": \"\", \"original\": \"<p><strong>About the business<\/strong><\/p> <p>Box of Books is a digital leader in the EduTech space. We streamline the delivery of eBooks, digital resources and ship physical textbooks to teachers and students and work hard to keep leading secondary schools at the forefront of digital learning.\\u00a0<\/p> <p>Backed by all major global and Australian educational publishers, this is a great opportunity to grow your career as we continue to expand domestically.\\u00a0<\/p> <p>Box of Books is looking for Customer Success and Operations Officers to deliver excellent service outcomes for both new and existing clients in our rapidly growing customer base. \\u00a0<\/p> <p>This opportunity is open to applicants located in Sydney, Australia.\\u00a0<\/p> <p><strong>About the role<\/strong><\/p> <ul> <li>Report to the General Manager, Customer Success and Operations<\/li> <li>Provide outstanding customer service via our in-app messaging, email and telephone channels<\/li> <li>Engage with sales team and key stakeholders within schools<\/li> <li>Engage with publishers for resourcing queries<\/li> <li>Contribute to the improvement and innovation of\\u00a0customer service processes across the business<\/li> <li>Assist in other operational aspects of the business as required<\/li><\/ul> <p><strong>Benefits and perks<\/strong><\/p> <ul> <li>Team environment \\u2013\\u00a0you'll be working closely with our talented team nationally<\/li> <li>Work from home and the office - a working environment that encourages work life balance<\/li> <li>Future prospects \\u2013 an exciting career for highly motivated individuals with one of Australia's fastest growing and innovative EduTech companies<\/li><\/ul> <p><strong>Skills and experience<\/strong><\/p> <ul> <li>Top communicator \\u2013\\u00a0strong written and verbal communication with ability to adapt communication style to the situation<\/li> <li>Team player \\u2013 collaborative approach to issue resolution<\/li> <li>Digital fluency \\u2013 willing to learn internal systems and processes,\\u00a0type reasonably fast and is familiar with G Suite<\/li> <li>Attitude \\u2013\\u00a0optimistic, problem-solving mindset with the ability to juggle changing priorities<\/li> <li>Eagle eyed\\u00a0\\u2013 high attention to detail<\/li> <li>Experience \\u2013\\u00a0undergraduate degree or previous customer support experience preferred; recent graduates are encouraged to apply<\/li><\/ul> <p><strong>The application form will include these questions:<\/strong><\/p> <ul> <li>Which of the following statements best describes your right to work in Australia?<\/li> <li>Do you have experience in an administration role?<\/li> <li>Do you have customer service experience?<\/li> <li>What's your expected annual base salary?<\/li><\/ul> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p>\\u00a0<\/p>\"}"
}