{
    "id":"Kaggle::techmap::61444111a5224e6280f6a340::careerbuilder_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Adecco is hiring immediately for General Laborers at a local client in Buford, GA. In this role, you will be pulling and packing online orders into bags and small boxes. You will use RF scanners, label product, and perform other duties as required. Requirements: This position is entry-level, no experience needed. Good work ethic. Must be able to follow verbal and written instructions. Must be comfortable working in a small team with high order output on some days. Ability to stand and\/or walk for the entire shift. What's in this for you? Weekly pay starting at $16. 00\/hr. Monday-Friday, 8:30am to 5:30pm. Benefits after 1 week. medical, dental, vision, options. Click on apply now for immediate consideration for these General Laborer positions in Buford, GA! Equal Opportunity Employer\/Veterans\/Disabled. To read our Candidate Privacy Information Statement, which explains how we will use your information, please navigate to [Link available when viewing the job] \/>. The Company will consider qualified applicants with arrest and conviction records.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61444111a5224e6280f6a340::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Adecco USA\", \"position\": \"General Laborer\", \"notes\": \"\", \"original\": \"Adecco is hiring immediately for General Laborers at a local client in Buford, GA. In this role, you will be pulling and packing online orders into bags and small boxes. You will use RF scanners, label product, and perform other duties as required.<br \/> <br \/> Requirements:<br \/> <li>This position is entry-level, no experience needed<\/li> <li>Good work ethic<\/li> <li>Must be able to follow verbal and written instructions<\/li> <li>Must be comfortable working in a small team with high order output on some days<\/li> <li>Ability to stand and\/or walk for the entire shift<\/li> \\u00a0<br \/> What's in this for you?<br \/> <li>Weekly pay starting at $16.00\/hr.<\/li> <li>Monday-Friday, 8:30am to 5:30pm<\/li> <li>Benefits after 1 week - medical, dental, vision, options<\/li> \\u00a0<br \/> Click on apply now for immediate consideration for these General Laborer positions in Buford, GA!<br \/><br \/>Equal Opportunity Employer\/Veterans\/Disabled<br \/><br \/>To read our Candidate Privacy Information Statement, which explains how we will use your information, please navigate to [Link available when viewing the job] \/><br \/>The Company will consider qualified applicants with arrest and conviction records <br \/><br \/>&nbsp;\"}"
}