{
    "id":"Kaggle::techmap::6150933fa5134478aac90d0a::monsterasia_hk::1",
    "label_age":true,
    "analysis_age":"The phrase \"over 10 years professional career\" reinforces a preference for older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"- **General:** The specification for \"advanced degree and\/or working experience from North America or Europe is a plus\" may disadvantage candidates from other regions, implying a preference for certain educational backgrounds and geographical experiences.",
    "verified":true,
    "synthetic":false,
    "text":" -Establish a culture that values engineering capability, technical depth, and deployment of scientific method -Recognized as a subject matter expert on EEx (6-Sigma, MIE\/MEE) methodologies and is sought out to provide guidance on risks and resources regarding significant projects and technical issues. -Scope \/ initiate specific projects as necessary. Ensure the application of appropriate technologies -Lead or participate in key project design reviews, scope reviews, etc to ensure overall project status. -Drives high impact process step changes in key manufacturing, engineering and technology projects -Develop and maintain effective relationships with other MT&E departments\/directorates especially EIG, NBD teams. Leverage MT&E, division and plants engineering capabilities and resources to execute projects. -Ensure documentation of manufacturing processes, quality systems and best practices on all projects. -Champion and encourage I. A generation through RTR, ID and Patent filing on projects. -Extensive travel to Corning Incorporated and vendors locations in Asia and USA on project assignments (50 travels). Education and Experience: -Minimum Master's in engineering or equivalent technical degree -Minimum 10 years experience in leading highly technical multi-discipline and multi-cultural engineering projects. -Prior engineering experience with project leadership responsibility for the design, development, and deployment of robust cost-effective process, and quality systems for product manufacturing -Over 10 years professional career in process engineering and product manufacturing support. -Advanced degree and\/or working experience from North America or Europe is a plus. Required Skills: -Technical curiosity and willingness to learn new methodologies, processes and products. -Track record of engineering and manufacturing accomplishments (e. g. Leading teams in delivering significant capital projects to manufacturing, meeting manufacturing improvement goals, making step change process improvements, managing innovation, and expanding technical capability with a focus on key project management skills. -Operation experience in material conversion or processing to products in manufacturing plant. -Ability to manage and influence a matrix project team (division, plant, and MT&E members) to deliver results. -Teamwork and collaborative skills across diverse multi-function and multiple technical organizations. -Sound problem solving and decision-making skills. -Excellent written\/oral communication skills in English and Asian language (Mandarin, Japanese and Korea) -Ability to manage multiple priorities through sound planning and organizing.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6150933fa5134478aac90d0a::monsterasia_hk\", \"source\": \"monsterasia_hk\", \"country\": \"HK\", \"company\": \"CORNING\", \"position\": \"Sr. Process Project Leader\", \"notes\": \"\", \"original\": \"<br>Corning is one of the world's leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in speciality glass, ceramics, and optical physics to develop products that have created new industries and transformed people's lives.<br>Corning succeeds through sustained investment in R&D, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.<br>Corning's Manufacturing, Technology and Engineering division (MTE) is recognized as the leader in engineering excellence & innovative manufacturing technologies by providing diverse skills to Corning's existing & emerging businesses.<br>We anticipate & provide timely, valued, leading edge manufacturing technologies and engineering expertise. We partner with Corning's businesses and the Science & Technology division. Together we create and sustain Corning's manufacturing as a differential advantage.<br>Purpose of the Position: This position is with Manufacturing, Technology and Engineering (MTE&E) directorate in Asia to lead process\/product development\/improvement and technology transfer projects into Corning manufacturing operations. -Designs and plans layout for such processes as hardening, coating, annealing, cleaning, forming, washing, laminating, etching, engraving, polishing, plating, and other material-processing operations. -Plans sequence of operations and specifies procedures for cutting, shaping, and otherwise preparing basic material. -Conducts tests and measurements through various stages of innovation and manufacturing to determine control over such variables as temperature, density, specific gravity, pressure, and viscosity that affect the product\/process performances. -Establishes and submits processing requirements to be met in designing and acquiring processing equipment. -Exercising judgment by using project management and MIE defined practices and procedures in selecting methods, techniques, and evaluation criteria for achieving process\/product capability and capacity for effective transfers into manufacturing. -Works on complex problems using MEE where analysis of situations or data requires an in-depth evaluation of various factors. -Project assignment will involve traveling to across Asia (China, Japan, Taiwan, Thailand, S. Korea etc) and emerging regions. Strong technical linkage with MTE\/S&T and division core technology groups in USA. Day to Day Responsibilities: -Define and successfully assemble capable matrix project teams to support critical projects. -Build an effective technical network of internal relationships within the technology community, division engineering and plant levels and external relationship with critical technology suppliers, peers, and academia and reach labs. -Be member of the Engineering Excellence community of practice to advance process\/product fundamental understanding in solving difficult technology and manufacturing problems. -Establish a culture that values engineering capability, technical depth, and deployment of scientific method -Recognized as a subject matter expert on EEx (6-Sigma, MIE\/MEE) methodologies and is sought out to provide guidance on risks and resources regarding significant projects and technical issues. -Scope \/ initiate specific projects as necessary. Ensure the application of appropriate technologies -Lead or participate in key project design reviews, scope reviews, etc to ensure overall project status. -Drives high impact process step changes in key manufacturing, engineering and technology projects -Develop and maintain effective relationships with other MT&E departments\/directorates especially EIG, NBD teams. Leverage MT&E, division and plants engineering capabilities and resources to execute projects. -Ensure documentation of manufacturing processes, quality systems and best practices on all projects. -Champion and encourage IA generation through RTR, ID and Patent filing on projects. -Extensive travel to Corning Incorporated and vendors locations in Asia and USA on project assignments (50-+% travels). Education and Experience: -Minimum Master's in engineering or equivalent technical degree -Minimum 10 years experience in leading highly technical multi-discipline and multi-cultural engineering projects. -Prior engineering experience with project leadership responsibility for the design, development, and deployment of robust cost-effective process, and quality systems for product manufacturing -Over 10 years professional career in process engineering and product manufacturing support. -Advanced degree and\/or working experience from North America or Europe is a plus. Required Skills: -Technical curiosity and willingness to learn new methodologies, processes and products. -Track record of engineering and manufacturing accomplishments (e.g. Leading teams in delivering significant capital projects to manufacturing, meeting manufacturing improvement goals, making step change process improvements, managing innovation, and expanding technical capability with a focus on key project management skills. -Operation experience in material conversion or processing to products in manufacturing plant. -Ability to manage and influence a matrix project team (division, plant, and MT&E members) to deliver results. -Teamwork and collaborative skills across diverse multi-function and multiple technical organizations. -Sound problem solving and decision-making skills. -Excellent written\/oral communication skills in English and Asian language (Mandarin, Japanese and Korea) -Ability to manage multiple priorities through sound planning and organizing.\"}"
}