{
    "id":"Kaggle::techmap::615bc1410adfb61978546e78::seek_au::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"ABOUT US. At SE Building Solutions, we specialise in renovating Brisbane’s best family homes. We achieve this by offering a wide range of building solutions from large-scale renovations, extensions and lifts on character homes, to new build architectural design. We are seeking a Contracts Administrator to ensure maximum efficiency of all projects through effective procurement, negotiation and contract administration. THE ROLE. Due to high volume of work and growth the company has experienced, there is an immediate opportunity for a passionate and driven Contracts Administrator to join this established team of leading construction professionals. As a Contracts Administrator you will be working closely with the Project Manager and Site teams to produce a comprehensive scope of works and then assist with all contractual matters including sub-contractor awards, claims, variations and payments. You will keep the project’s sub-contractors updated at every stage as to their contractual obligations and keep them pulling towards a successful outcome for the projects. Your duties and skill sets. An in-depth knowledge of construction, methodology and procurement strategy. A passion to work in the construction industry. Ability to work with Estimators, Architects, Designers, Supervisors and Sub-Contractors. Ability to hold people to account and drive an outcome. And. A driven individual who is looking for a career and welcomes the opportunity to take responsibility and commit. Skills & experience. You will be required to have 2 years experience as a Contracts Administrator in both procurement and contract management.. Construction software experience, preferably builder trend. Ability to work with Builders, Estimators, and designers. 1 plus years of current experience working as a Junior Contracts Administrator for another Building Company. Tertiary qualifications in Construction eg. Quantity Surveying or Construction Management. You will have a can do attitude and be able to communicate effectively with everyone involved on the projects at all levels. Excellent communication and presentation skills are required as you will be dealing clients, Sub-contractors and suppliers. WHY JOIN US? Work-Life Balance – Monday to Friday with set hours. Ongoing training and genuine career opportunities. This is a long-term career opportunity with the potential to progress into a senior role. Fun and Supportive Environment. Be apart of a team where you are treated like family. We are here to help you succeed and grow!.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615bc1410adfb61978546e78::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"SE Building Solutions\", \"position\": \"Construction Administrator\", \"notes\": \"\", \"original\": \"<p><strong>ABOUT US<\/strong><\/p><p>At SE Building Solutions, we specialise in renovating Brisbane\\u2019s best family homes. We achieve this by offering a wide range of\\u00a0building solutions\\u00a0from large-scale renovations, extensions and lifts on character homes, to new build architectural design.\\u00a0<\/p><p>We are seeking a Contracts Administrator to ensure maximum efficiency of all projects through effective procurement, negotiation and contract administration.<\/p><p><strong>THE ROLE<\/strong><\/p><p>Due to high volume of work and growth the company has experienced, there is an immediate opportunity for a passionate and driven Contracts Administrator to join this established team of leading construction professionals.<\/p><p>As a Contracts Administrator you will be working closely with the Project Manager and Site teams to produce a comprehensive scope of works and then assist with all contractual matters including sub-contractor awards, claims, variations and payments.<\/p><p>You will keep the project\\u2019s sub-contractors updated at every stage as to their contractual obligations and keep them pulling towards a successful outcome for the projects.<\/p><p><em><strong>Your duties and skill sets\\u00a0<\/strong><\/em><\/p><ul><li>An in-depth knowledge of construction, methodology and procurement strategy;<\/li><li>A passion to work in the construction industry;\\u00a0<\/li><li>Ability to work with Estimators, Architects, Designers, Supervisors and Sub-Contractors;<\/li><li>Ability to hold people to account and drive an outcome; and<\/li><li>A driven individual who is looking for a career and welcomes the opportunity to take responsibility and commit.<\/li><\/ul><p><strong>Skills &amp; experience\\u00a0<\/strong><\/p><ul><li>You will be required to have 2 years experience as a Contracts Administrator in both procurement and contract management.;<\/li><li>Construction software experience, preferably builder trend\\u00a0<\/li><li>A passion for construction and ability to manage both team members and sub-contractors;<\/li><li>Ability to work with Builders, Estimators, and designers;\\u00a0<\/li><li>1 plus years of current experience working as a Junior Contracts Administrator for another Building Company<\/li><li>Tertiary qualifications in Construction eg. Quantity Surveying or Construction Management.<\/li><li>You will have a can do\\u00a0attitude and be able to communicate effectively with everyone involved on the projects at all levels.<\/li><li>Excellent communication and presentation skills are required as you will be dealing clients, Sub-contractors and suppliers.<\/li><\/ul><p><strong>WHY JOIN US?<\/strong><\/p><ul><li>Work-Life Balance \\u2013\\u00a0Monday to Friday with set hours<\/li><li>Ongoing training and genuine career opportunities\\u00a0- This is a long-term career opportunity with the\\u00a0potential to progress into a senior role.<\/li><li>Fun and Supportive Environment\\u00a0- Be apart of a team where you are treated like family. We are here to help you succeed and grow!<\/li><\/ul><p>\\u00a0<\/p>\"}"
}