{
    "id":"Kaggle::techmap::613ea3e624976a7e537fd7b7::aarp_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"In a world of disruption and increasingly complex business challenges, our professionals bring truth into focus with the Kroll Lens. Our sharp analytical skills, paired with the latest technology, allow us to give our clients clarity not just answers in all areas of business. We embrace diverse backgrounds and global perspectives, and we cultivate diversity by respecting, including, and valuing one another. As part of One team, One Kroll, you ll contribute to a supportive and collaborative work environment that empowers you to excel. Through a combination of in-depth subject matter expertise, global research capabilities and flexible technology tools, the Compliance Risk and Diligence practice of Kroll helps clients take a risk-based approach toward meeting obligations or remediating failures regarding anti-bribery, anti-corruption and related regulatory mandates. These include pre-transactional intelligence. Vendor, supplier and distributor due diligence. Vendor management platform. Leadership\/executive vetting. Sanctions screening and monitoring. Country\/industry risk. And bespoke inquiries. Have an analytical mind and a passion for research and investigation? Come join our thriving global team and work with Fortune 500 clients in a highly collaborative, fast-paced environment! We are committed to the continuous professional development of our people. Hone your skills and master new ones with the support of a world-class in-house training program. Become a regional specialist, learn to lead, deepen your linguistic abilities, build technical expertise-the opportunities are endless. The right candidate will have outstanding English reading and writing skills, meticulous attention to detail, a sense of curiosity, the ability to learn quickly, and a dedication to client satisfaction. Fluency in other languages is a plus. At Kroll, your work will help deliver clarity to our clients most complex governance, risk, and transparency challenges. Apply now to join One team, One Kroll. RESPONSIBILITIES: This position is currently remote-we plan to maintain an agile working environment. Conduct increasingly complex Korean and English-language research using public record databases, commercial and proprietary databases, media sources and the Internet. Analyze and synthesize relevant research findings. Manage multiple assignments from start to finish in a fast-paced environment. Manage internal process\/workflow requirements related to resource maintenance. REQUIREMENTS:..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613ea3e624976a7e537fd7b7::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Kroll\", \"position\": \"Lead Associate, Compliance Risk and Diligence\", \"notes\": \"\", \"original\": \"<div><p>In a world of disruption and increasingly complex business challenges, our professionals bring truth into focus with the Kroll Lens. Our sharp analytical skills, paired with the latest technology, allow us to give our clients clarity not just answers in all areas of business. We embrace diverse backgrounds and global perspectives, and we cultivate diversity by respecting, including, and valuing one another. As part of One team, One Kroll, you ll contribute to a supportive and collaborative work environment that empowers you to excel.<\/p><br \/><br \/><p>Through a combination of in-depth subject matter expertise, global research capabilities and flexible technology tools, the Compliance Risk and Diligence practice of Kroll helps clients take a risk-based approach toward meeting obligations or remediating failures regarding anti-bribery, anti-corruption and related regulatory mandates. These include pre-transactional intelligence; vendor, supplier and distributor due diligence; vendor management platform; leadership\/executive vetting; sanctions screening and monitoring; country\/industry risk; and bespoke inquiries.<\/p><br \/><br \/><p>Have an analytical mind and a passion for research and investigation?<\/p><br \/><br \/><p>Come join our thriving global team and work with Fortune 500 clients in a highly collaborative, fast-paced environment!<\/p><br \/><br \/><p>We are committed to the continuous professional development of our people; hone your skills and master new ones with the support of a world-class in-house training program. Become a regional specialist, learn to lead, deepen your linguistic abilities, build technical expertise-the opportunities are endless. The right candidate will have outstanding English reading and writing skills, meticulous attention to detail, a sense of curiosity, the ability to learn quickly, and a dedication to client satisfaction. Fluency in other languages is a plus.<\/p><br \/><br \/><p>At Kroll, your work will help deliver clarity to our clients most complex governance, risk, and transparency challenges. Apply now to join One team, One Kroll.<\/p><br \/><br \/><p><br \/><b>RESPONSIBILITIES:<\/b><\/p><br \/><br \/><p><b>This position is currently remote-we plan to maintain an agile working environment.<\/b><\/p><br \/><br \/><ul><li><br \/><\/li><li>Conduct increasingly complex Korean and English-language research using public record databases, commercial and proprietary databases, media sources and the Internet<br \/><br \/><\/li><li>Analyze and synthesize relevant research findings<br \/><br \/><\/li><li>Write well-structured, concise, logical and objective reports to provide clients with an accurate assessment of the findings<br \/><br \/><\/li><li>Manage multiple assignments from start to finish in a fast-paced environment<br \/><br \/><\/li><li>Manage internal process\/workflow requirements related to resource maintenance<br \/><br \/><\/li><\/ul><br \/><p><b>REQUIREMENTS:<\/b><\/p><br \/><br \/><ul><li><br \/><\/li><li>Native or equivalent English language proficiency in reading comprehension is required<br \/><br \/><\/li><li>Native or equivalent Korean language proficiency in reading comprehension is required<br \/><br \/><\/li><li>Extremely strong English-language writing skills<br \/><br \/><\/li><li>Ability to conduct online research using various primary and secondary sources<br \/><br \/><\/li><li>Ability to quickly and effectively summarize information from multiple sources into concise analytical assessments<br \/><br \/><\/li><li>Undergraduate or graduate degree at an accredited university majoring in: International Relations\/Affairs, Regional Studies, Political Science, Criminal Justice, Law or other related areas of study<br \/><br \/><\/li><li>Ability to work independently in a fast-paced environment<br \/><br \/><\/li><li>Ability to accept and apply constructive feedback<br \/><br \/><\/li><li>Ability to mentor and offer constructive feedback to others<br \/><br \/><\/li><li>Ability to manage and prioritize several projects or assignments simultaneously while meeting tight deadlines<br \/><br \/><\/li><\/ul><br \/><p><b>PREFERRED SKILLS<\/b><\/p><br \/><br \/><ul><li><br \/><\/li><li>2+ years of relevant professional experience (including internships)<br \/><br \/><\/li><li>Advanced knowledge of litigation, regulatory, sanctions and corporate organization \/ structure terminology and concepts is highly preferred<br \/><br \/><\/li><li>Organizational and time management competencies<br \/><br \/><\/li><li>Attention to detail<br \/><br \/><\/li><li>Ability to communicate effectively verbally and in writing<br \/><br \/><\/li><li>Interest and understanding of current events, international affairs, financial regulations, and economics and\/or finance<br \/><br \/><\/li><\/ul><br \/><p>In order to be considered for a position, you must formally apply via careers.kroll.com.<\/p><br \/><br \/><p>Kroll is committed to creating an inclusive work environment. We are proud to be an equal opportunity employer and will consider all qualified applicants regardless of gender, gender identity, race, religion, color, nationality, ethnic origin, sexual orientation, marital status, veteran status, age or disability.<\/p><\/div><p><\/p>\"}"
}