{
    "id":"Kaggle::techmap::614c3e99bfb8e7511d3ac3e4::careerbuilder_us::18",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"WTS International, the world's leading spa, fitness and leisure firm, is seeking a Fitness Attendant. The Fitness Attendant is responsible for the general supervision of a fitness center. Sets-up, maintains and cleans fitness equipment. Welcomes guests, explains programs and activities, teaches guests how to use the equipment. Reports and resolves complaints. Maintains attendance records and ensures rules and regulations are enforced in a tactful manner. Is timely and punctual when reporting to work. Attend all scheduled training and meetings as required. Meet with supervisor on an established basis. Ensure the desk and surrounding area is safe, clean and orderly. Other duties as assigned. High School diploma or GED. Community C. P. R. certification. Standard First Aid certification. At least 6 months of experience working at a multi-recreational facility in sports\/recreation programming. A strong work ethic. Possess effective verbal communication and expression. Good listening skills. Adaptable and flexible under stressful and\/or unusual situations. Must exhibit organizational and time management skills. Ability to work independently. Excellent customer service skills. Energetic, enthusiastic and motivational. Professional manner, discretion, and appearance. Able to show initiative and make decisions. Positive and enthusiastic attitude towards job and facility. Must be able to trouble shoot and anticipate problems. Consistently exhibit team spirit promoting a productive environment. Ability to meet deadlines. Ability to stand for long periods. This position required the ability to stand, stoop, kneel, crouch, bend, walk, and talk. The employee is regularly required to use hands to finger, handle, feel or operate objects, tools, or controls. And reach with hands and arms. Ability to lift 25 lbs. Normal work hours: varied to include nights, weekends, and holidays. WTS International, LLC is an equal employment opportunity employer that is committed to having a diverse work force.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c3e99bfb8e7511d3ac3e4::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"WTS International\", \"position\": \"Fitness Attendant\", \"notes\": \"\", \"original\": \"<p>WTS International, the world's leading spa, fitness and leisure firm, is seeking a Fitness Attendant.\\u00a0The Fitness Attendant is responsible for the general supervision of a fitness center.<\/p><br \/><ul><li>Sets-up, maintains and cleans fitness equipment<\/li><li>Welcomes guests, explains programs and activities, teaches guests how to use the equipment<\/li><li>Reports and resolves complaints<\/li><li>Maintains attendance records and ensures rules and regulations are enforced in a tactful manner<\/li><li>Is timely and punctual when reporting to work.\\u00a0\\u00a0<\/li><li>Attend all scheduled training and meetings as required.<\/li><li>Meet with supervisor on an established basis.<\/li><li>Ensure the desk and surrounding area is safe, clean and orderly.<\/li><li>Other duties as\\u00a0assigned<\/li><\/ul><br \/><ul><li>High School diploma or GED<\/li><li>Community C.P.R. certification<\/li><li>Standard First Aid certification<\/li><li>At least 6 months of experience working at a multi-recreational facility in sports\/recreation programming.<\/li><li>A strong work ethic<\/li><li>Possess effective verbal communication and expression.<\/li><li>Good listening skills<\/li><li>Adaptable and flexible under stressful and\/or unusual situations.<\/li><li>Must exhibit organizational and time management skills<\/li><li>Ability to work independently.<\/li><li>Excellent customer service skills<\/li><li>Energetic, enthusiastic and motivational<\/li><li>Professional manner, discretion, and appearance<\/li><li>Able to show initiative and make decisions<\/li><li>Positive and enthusiastic attitude towards job and facility.<\/li><li>Must be able to trouble shoot and anticipate problems.<\/li><li>Consistently exhibit team spirit promoting a productive environment.<\/li><li>Ability to meet deadlines<\/li><li>Ability to stand for long periods<\/li><li>Awareness of proper body mechanics to prevent injury<\/li><li>This position required the ability to stand, stoop, kneel, crouch, bend, walk, and talk<\/li><li>The employee is regularly required to use hands to finger, handle, feel or operate objects, tools, or controls; and reach with hands and arms<\/li><li>Ability to lift 25 lbs.<\/li><li>Normal work hours:\\u00a0 varied to include nights, weekends, and holidays<\/li><\/ul><br \/><p>WTS International, LLC is an equal employment opportunity employer that is committed to having a diverse work force.<\/p>&nbsp;\"}"
}