{
    "id":"Kaggle::techmap::615bd3fa34538e557c0bdb5e::linkedin_it::1",
    "label_age":true,
    "analysis_age":"The term \"10 years Significative experience within the pharmaceutical industry (quality, regulatory and pharmacovigilance area)\" may introduce age bias by setting an unattainable standard for younger workers, thereby favouring older candidates with more years of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":"The requirement for fluency in Italian and English is specific but does not introduce racial bias as it pertains to job functionality and communication needs without excluding any racial group.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years Significative experience within the pharmaceutical industry (quality, regulatory and pharmacovigilance area). Working knowledge of relevant local and international regulations and ICH, ISPE, ASTM standards\/guidelines. Strong understanding of pharmaceutical business and quality governance. Ability to work across multiple business functions to build consensus. Experience leading team\/budget (functional or project acquired experience). Experience in hosting and collaborating with national or international regulatory agencies. Excellent interpersonal skills. Outstanding communication skills (verbal and written). Experience working with CMOs, CLOs, vendors preferred. Ability to conceptualize, analyze, plan and manage in a fast-paced environment. Ability to be agile and effectively collaborate in a dynamic, cross-functional matrix environment. Ability to navigate through ambiguity and rapid growth and adapt to change. Language Skills. Fluency in Italian and English (written and spoken) is essential. Fluency \/ Knowledge of additional languages is advantageous but not essential. About Moderna. In 10 years since its inception, Moderna has transformed from a science research-stage company advancing programs in the field of messenger RNA (mRNA), to an enterprise with a diverse clinical portfolio of vaccines and therapeutics across six modalities, a broad intellectual property portfolio in areas including mRNA and lipid nanoparticle formulation, and an integrated manufacturing plant that allows for both clinical and commercial production at scale and at unprecedented speed. Moderna maintains alliances with a broad range of domestic and overseas government and commercial collaborators, which has allowed for the pursuit of both groundbreaking science and rapid scaling of manufacturing. Most recently, Modernas capabilities have come together to allow the authorized use of one of the earliest and most effective vaccines against the COVID-19 pandemic. Modernas mRNA platform builds on continuous advances in basic and applied mRNA science, delivery technology and manufacturing, and has allowed the development of therapeutics and vaccines for infectious diseases, immuno-oncology, rare diseases, cardiovascular diseases and auto-immune diseases. Moderna has been named a top biopharmaceutical employer by Science for the past six years. To learn more, visit www. modernatx. com. Moderna is a smoke-free, alcohol-free and drug-free work environment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615bd3fa34538e557c0bdb5e::linkedin_it\", \"source\": \"linkedin_it\", \"country\": \"IT\", \"company\": \"Moderna\", \"position\": \"Director, Country Head Quality Assurance - Italy & Greece\", \"notes\": \"\", \"original\": \"<strong><u>The Role<br><br><\/u><\/strong>As Moderna continues its international growth, we are seeking an experienced Quality Assurance professional to lead our in-country QA activities across Italy and Greece.<br><br>As Director, Country Head, Quality Assurance, you will be responsible to ensure the organization (and monitoring) of the company's vaccine\/pharmaceutical operations are conducted in agreement with company standards and applicable regulations. These operations range from manufacturing, distribution, advertising, information, product quality, batch monitoring and recall, to the corresponding storage operations, where appropriate.<br><br><strong><u>Working In Collaboration With Global And Local Quality Heads, You Must Ensure That All Vaccine\/pharmaceutical Related Activities Are Conducted In The Respect Of Applicable<br><\/u><\/strong><ul><li>Good Practices (GxP);<\/li><li>Procedures (Policies, SOPs);<\/li><li>Marketing authorization;<\/li><li>Contracts and quality technical agreements.<br><\/li><\/ul>We are seeking for this person to be bold in suggesting new and innovative process and systems improvements \\u2013 working in a highly collaborative way (that maintains a flat organization and supports fast decision-making) you will be relentless in your pursuit of excellence.<br><br>If you are forward-thinking, dynamic in your outlook, and attracted to a challenge which is demanding and rewarding \\u2013 this is your next step.<br><br><strong><u>Here\\u2019s What You\\u2019ll Do<br><\/u><\/strong><ul><li> Serve as Company's Management Representative <\/li><li> Ensure Local Implementation, application, and maintenance of the company's quality system <\/li><li> Lead preparation of Quality Reviews <\/li><li> Lead monitoring and management review of Quality KPIs <\/li><li> Develop and administer department budgets, schedules, and other administrative functions. <\/li><li> Ensure Creation, update and application of procedural documents (SOPs) <\/li><li> Lead preparation of internal and external audits, inspections, certifications and monitoring of associated CAPAs for manufacturing (GMP) <\/li><li> Support, as requested for GCP, GVP inspections <\/li><li> Reporting to the Local Pharmaceuticals Agency any placing on the national market of a medicine which he considers to be falsified, for which he ensures the distribution. <\/li><li> Lead local Risk analysis <\/li><li> Ensure appropriate Complaint management <\/li><li> Ensure appropriate Deviation management <\/li><li> Management of medical queries <\/li><li> Management of vaccine\/pharmaceutical subcontractors for local market: ensuring that the transportation conditions guarantee the appropriate conservation, integrity and security of the products. <\/li><li> Ensure Monitoring of medical samples <\/li><li> Ensure implementation and monitoring of the distribution system (contracts, specifications, etc.) <\/li><li> Ensure stock monitoring (stock forecast, authorization to distribute, declaration in the event of a risk or confirmed shortage, transport conditions, batch recall, returns, etc.) <br><\/li><\/ul>This list is non exhaustive. Other missions may be added.<br><br><strong><u>Here\\u2019s What You\\u2019ll Bring To The Table<br><\/u><\/strong><ul><li>Bachelor\\u2019s degree in relevant scientific discipline<\/li><li>Additional qualifications (MSc, PhD, MBA) are advantageous<\/li><li>+10 years Significative experience within the pharmaceutical industry (quality, regulatory and pharmacovigilance area)<\/li><li>Working knowledge of relevant local and international regulations and ICH, ISPE, ASTM standards\/guidelines<\/li><li>Strong understanding of pharmaceutical business and quality governance<\/li><li>Ability to work across multiple business functions to build consensus<\/li><li>Experience leading team\/budget (functional or project acquired experience)<\/li><li>Experience in hosting and collaborating with national or international regulatory agencies<\/li><li>Excellent interpersonal skills<\/li><li>Outstanding communication skills (verbal and written)<\/li><li>Experience working with CMOs, CLOs, vendors preferred<\/li><li>Ability to conceptualize, analyze, plan and manage in a fast-paced environment.<\/li><li>Ability to be agile and effectively collaborate in a dynamic, cross-functional matrix environment.<\/li><li>Ability to navigate through ambiguity and rapid growth and adapt to change.<br><\/li><\/ul><strong><u>Language Skills<br><\/u><\/strong><ul><li>Fluency in Italian and English (written and spoken) is essential<\/li><li>Fluency \/ Knowledge of additional languages is advantageous but not essential<br><\/li><\/ul><strong><u>About Moderna<br><br><\/u><\/strong>In 10 years since its inception, Moderna has transformed from a science research-stage company advancing programs in the field of messenger RNA (mRNA), to an enterprise with a diverse clinical portfolio of vaccines and therapeutics across six modalities, a broad intellectual property portfolio in areas including mRNA and lipid nanoparticle formulation, and an integrated manufacturing plant that allows for both clinical and commercial production at scale and at unprecedented speed. Moderna maintains alliances with a broad range of domestic and overseas government and commercial collaborators, which has allowed for the pursuit of both groundbreaking science and rapid scaling of manufacturing. Most recently, Moderna\\u2019s capabilities have come together to allow the authorized use of one of the earliest and most effective vaccines against the COVID-19 pandemic.<br><br>Moderna\\u2019s mRNA platform builds on continuous advances in basic and applied mRNA science, delivery technology and manufacturing, and has allowed the development of therapeutics and vaccines for infectious diseases, immuno-oncology, rare diseases, cardiovascular diseases and auto-immune diseases. Moderna has been named a top biopharmaceutical employer by Science for the past six years. To learn more, visit www.modernatx.com .<br><br><em>Moderna is a smoke-free, alcohol-free and drug-free work environment.<br><br><\/em>\"}"
}