{
    "id":"Kaggle::techmap::61446e8acd02df1f318e1249::linkedin_sv::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Position: Medical Appointment Scheduler. Reports to: Operations Manager. Description\/Purpose of position. This position is responsible for performing various functions, including managing the flow of patient care by accurately scheduling patient appointments in the scheduling system. Have the ability to prioritize and perform work in an organized, efficient, and effective manner without constant supervision and direction. Able to adjust appropriately to the volume of work and complete tasks in a timely manner without interfering with the quality of work. Responsibilities. Coordinate appointments and reschedule as needed through EMR system. Take or respond to telephone calls and emails promptly to establish or confirm appointments. Resolve scheduling conflicts. Provide support to other team members as needed. Maintain HIPAA compliance. Demonstrate proficiency within assigned areas of responsibility. Duties may include. Guiding patients through the scheduling process. Collaborating with Nurse Practitioners if a patient needs to schedule outside their normal availability. Accurately and thoroughly schedule within the booking radius. Confirms scheduled appointments by sending confirmation to patient and nurse practitioner. Minimum Qualifications. Education: Undergraduate Degree. Experience: 2 years medical appointment scheduling preferred. Characteristics\/Skills: Proficient word processing. English proficiency level C1. Detail oriented. Excellent communication skills. Interpersonal skills. Decision making skills. Other. Study abroad.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61446e8acd02df1f318e1249::linkedin_sv\", \"source\": \"linkedin_sv\", \"country\": \"SV\", \"company\": \"Thrivelab\", \"position\": \"Medical Appointment Scheduler for US based Company\", \"notes\": \"\", \"original\": \"Position: Medical Appointment Scheduler<br><br>Reports to: Operations Manager<br><br>Description\/Purpose of position<br>This position is responsible for performing various functions, including managing the flow of patient care by accurately scheduling patient appointments in the scheduling system. Have the ability to prioritize and perform work in an organized, efficient, and effective manner without constant supervision and direction. Able to adjust appropriately to the volume of work and complete tasks in a timely manner without interfering with the quality of work.<br><br>Responsibilities<br>Coordinate appointments and reschedule as needed through EMR system <br>Take or respond to telephone calls and emails promptly to establish or confirm appointments<br>Resolve scheduling conflicts<br>Provide support to other team members as needed<br>Maintain HIPAA compliance<br>Demonstrate proficiency within assigned areas of responsibility<br><br>Duties may include<br>Guiding patients through the scheduling process<br>Collaborating with Nurse Practitioners if a patient needs to schedule outside their normal availability<br>Accurately and thoroughly schedule within the booking radius<br>Confirms scheduled appointments by sending confirmation to patient and nurse practitioner<br><br>Minimum Qualifications<br>Education: Undergraduate Degree<br>Experience: 2 years medical appointment scheduling preferred<br>Characteristics\/Skills: <br>Proficient word processing<br>English proficiency level C1<br>Detail oriented<br>Excellent communication skills<br>Interpersonal skills<br>Decision making skills<br><br>Other<br>Study abroad<br><br><br>\"}"
}