{
    "id":"Kaggle::techmap::61562299a6740c534abc93aa::monster_ca::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Company Description At McDonald’s Canada, people are the foundation of our business. For over 50 years, the health and well-being of our crew, guests and communities have been of the utmost importance to us, and we know that now, more than ever, these things are top concerns for candidates like yourself. To learn about the ways we are keeping our crew and guests safe, please click here (https:\/\/www. mcdonalds. com\/ca\/en-ca\/about-us\/advisory. html). We are more than just your local restaurant. We are a collection of hardworking small-business owners, students working part-time, career builders, and active seniors getting the most out of life. Did you know that from coast to coast, we serve delicious choices to more than 2. 5 million people in over 1, 400 locations every day or that we have proudly helped more than 300, 000 Canadian families with sick kids through Ronald Mc. Donald House Charities? Job Description How about flexible hours that let you do your thing, whatever your thing is. The opportunity to grow, Professionally, personally and financially. You are trustworthy and have trust in others. You find joy in the details and believe good quality is what keeps guests coming back. You remain cool, calm and collected under pressure. You understand there is no “I” in team and thrive in social situations. You get that service isn’t a transaction. It’s about connection. That a smile can make all the difference in someone’s day. It’s genuine, and it’s who you are. If that sounds good to you, then we’d love to hear from you. Good customer service skills are integral to the way we do things at McDonald's. A crew member will be expected to provide customers with a quick and accurate service and show sensitivity to their individual needs, both from behind the till as well as in the dining areas. Qualifications + A wonderful smile and great attitude working with a team (mix of full time and part time staff). Energetic, strong work ethic, flexible and the ability to learn and thrive with new skills and opportunities. Uses proper procedures to ensure the accuracy of every order for every guest. Prepares and finishes products to ensure quality standards are met. Helps support speed of service targets by working quickly and efficiently to fill orders and meet guest’s needs.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61562299a6740c534abc93aa::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"McDonald's\", \"position\": \"Crew Person- Mayor Magrath Dr N\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Company Description At McDonald\\u2019s Canada, people are the foundation of our business. For over 50 years, the health and well-being of our crew, guests and communities have been of the utmost importance to us, and we know that now, more than ever, these things are top concerns for candidates like yourself. To learn about the ways we are keeping our crew and guests safe, please click here (https:\/\/www.mcdonalds.com\/ca\/en-ca\/about-us\/advisory.html) . We are more than just your local restaurant. We are a collection of hardworking small-business owners, students working part-time, career builders, and active seniors getting the most out of life. Did you know that from coast to coast, we serve delicious choices to more than 2.5 million people in over 1,400 locations every day or that we have proudly helped more than 300,000 Canadian families with sick kids through Ronald McDonald House Charities? Job Description How about flexible hours that let you do your thing, whatever your thing is. The opportunity to grow, Professionally, personally and financially. You are trustworthy and have trust in others. You find joy in the details and believe good quality is what keeps guests coming back. You remain cool, calm and collected under pressure. You understand there is no \\u201cI\\u201d in team and thrive in social situations. You get that service isn\\u2019t a transaction. It\\u2019s about connection. That a smile can make all the difference in someone\\u2019s day. It\\u2019s genuine, and it\\u2019s who you are. If that sounds good to you, then we\\u2019d love to hear from you. A Crew Member has three main responsibilities: Customer Service, Food Preparation and Cleanliness and Hygiene. Good customer service skills are integral to the way we do things at McDonald's. A crew member will be expected to provide customers with a quick and accurate service and show sensitivity to their individual needs, both from behind the till as well as in the dining areas. Qualifications + A wonderful smile and great attitude working with a team (mix of full time and part time staff) + Energetic, strong work ethic, flexible and the ability to learn and thrive with new skills and opportunities + Uses proper procedures to ensure the accuracy of every order for every guest; prepares and finishes products to ensure quality standards are met + Helps support speed of service targets by working quickly and efficiently to fill orders and meet guest\\u2019s needs + Promptly executes service recovery for any guest concerns or complaints by making it right with the guest, regardless of involvement in the issue Requsition ID: REF21436M McDonald's Corporation and McDonald's USA, LLC (the \\\"Company\\\") are committed to a policy of Equal Employment Opportunity and will not discriminate against an applicant or employee of the Company, including any corporate-owned restaurant, on the basis of age, sex, sexual orientation, race, color, creed, religion, ethnicity, national origin, alienage or citizenship, disability, marital status, veteran or military status, genetic information, or any other legally-recognized protected basis under federal, state or local laws, regulations or ordinances. Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and\/or certain state or local laws. A reasonable accommodation is a change in the way things are normally done that will ensure an equal employment opportunity without imposing an undue hardship on the Company. Please contact recruiting.supportteam@us.mcd.com if you need assistance completing any forms or to otherwise participate in the application process or to request or discuss an accommodation in connection with a job at the Company or at a McDonald\\u2019s corporate-owned restaurant to which you are applying. McDonald's and its franchisees are taking proactive steps in response to the COVID-19 outbreak to ensure the safety in our restaurants across all communities. Our values of quality, service, and cleanliness continue to guide us. We're following direction from the CDC, state, and local governments and adhering to our deep cleaning procedures in every restaurant, every day. We also fully support employees who stay home from work if they are feeling sick. Read more about the ways we are prioritizing health at https:\/\/news.mcdonalds.com\/news-releases\/news-release-details\/prioritizing-health-safety-and-community-mcdonalds-shares. McDonald's and its franchisees are always looking for top candidates and encourage you to apply online. If you have any questions, please first call the restaurant as this will help the restaurant comply with any social distancing guidelines or other compliance obligations. For corporate roles, please proceed to the online application, or if you already applied, contact supportteam@us.mcd.com <\/div>\"}"
}