{
    "id":"Kaggle::techmap::61457b47e330a74d7cecf781::linkedin_pa::0",
    "label_age":true,
    "analysis_age":"\" thrive in a fast-paced warehouse manager environment. High-energy\" intruduces an implicit age bias.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Supply Chain & Logistics Management Trainee. From $26 to $35 per hour. $2, 000 Sign-on Bonus. Start by 11\/1. Pennsylvania Branch. 700 Uline Way, Allentown, PA 18106. The Morning Call's 1 Large Employer in the Lehigh Valley, three years in a row! Uline is proud to operate as a drug-free workplace. All new hires must complete a pre-employment hair follicle drug screening. Walk-in interviews every Wednesday 4 PM. 7 PM. Come in to learn more about this position and interview on the spot. Visit the Events section on uline. jobs for more details. Position Responsibilities. Master Uline's inbound and outbound warehouse manager operations through an 18-month Rotational Management Program. Participate in hands-on UPS, Freight, Returns, Receiving, Restock, Transfers, Velocity, Inventory Control, QC and Maintenance department training. Develop Warehouse Manager \/ Management skills by leading and motivating others. Complete forklift and warehouse equipment certifications throughout warehouse job rotations. Minimum Requirements. Bachelor's degree. Ability to learn quickly and thrive in a fast-paced warehouse manager environment. High-energy, self-motivated team player with the ability to multitask. Excellent problem-solving and critical-thinking skills. Strong attention to detail. Willing to relocate (with support) to another Uline Warehouse location as needed. Benefits. Complete insurance coverage that includes medical, dental, vision and life insurance, Flexible Spending Accounts and wellness programs. 401(k) with 5% employer match. Paid holidays and generous paid time off. Bonus programs that include annual performance, sales goals and profit sharing. Scholarship program for children of employees. Employee Perks. A complete fitness center with weights, modern equipment and full-service locker rooms. Three miles of beautifully maintained walking trails. Free chair massages. Numerous employee appreciation events throughout the year. Opportunities for community involvement. Best-in-class, clean, modern facilities. About Uline. Uline is North America's leading distributor of shipping, industrial and packaging materials. We're a family-owned company known for incredible service, our 800. page catalog of over 38, 500 quality products and same-day shipping of our huge in-stock inventory. With over 7, 000 employees across 12 locations, it's time you joined Uline. Uline provides the essential supplies needed to keep organizations operational and productive. To protect the health and safety of our employees, we have modified our normal operating policies in response to COVID-19.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61457b47e330a74d7cecf781::linkedin_pa\", \"source\": \"linkedin_pa\", \"country\": \"PA\", \"company\": \"Uline\", \"position\": \"Supply Chain & Logistics Management Trainee - 2,000 Sign-on Bonus\", \"notes\": \"\", \"original\": \"<strong>Supply Chain &amp; Logistics Management Trainee<br><br>From $26 to $35 per hour<br><br>$2,000 Sign-on Bonus - Start by 11\/1<br><br><\/strong><strong>Pennsylvania Branch<br><br>700 Uline Way, Allentown, PA 18106<br><br>The Morning Call's #1 Large Employer in the Lehigh Valley, three years in a row!<br><br><\/strong>Uline is proud to operate as a drug-free workplace. All new hires must complete a pre-employment hair follicle drug screening.<br><br><strong>Walk-in interviews every Wednesday 4 PM - 7 PM.<\/strong> Come in to learn more about this position and interview on the spot. Visit the Events section on uline.jobs for more details.<br><br><strong><u>Position Responsibilities<br><\/u><\/strong><ul><li>Master Uline's inbound and outbound warehouse manager operations through an 18-month Rotational Management Program.<\/li><li>Participate in hands-on UPS, Freight, Returns, Receiving, Restock, Transfers, Velocity, Inventory Control, QC and Maintenance department training.<\/li><li>Develop Warehouse Manager \/ Management skills by leading and motivating others.<\/li><li>Complete forklift and warehouse equipment certifications throughout warehouse job rotations.<br><\/li><\/ul><strong><u>Minimum Requirements<br><\/u><\/strong><ul><li>Bachelor's degree.<\/li><li>Ability to learn quickly and thrive in a fast-paced warehouse manager environment.<\/li><li>High-energy, self-motivated team player with the ability to multitask.<\/li><li>Excellent problem-solving and critical-thinking skills.<\/li><li>Strong attention to detail.<\/li><li>Willing to relocate (with support) to another Uline Warehouse location as needed.<br><\/li><\/ul><strong><u>Benefits<br><\/u><\/strong><ul><li>Complete insurance coverage that includes medical, dental, vision and life insurance, Flexible Spending Accounts and wellness programs.<\/li><li>401(k) with 5% employer match.<\/li><li>Paid holidays and generous paid time off.<\/li><li>Bonus programs that include annual performance, sales goals and profit sharing.<\/li><li>Scholarship program for children of employees.<br><\/li><\/ul><strong>Employee Perks<br><\/strong><ul><li>A complete fitness center with weights, modern equipment and full-service locker rooms.<\/li><li>Three miles of beautifully maintained walking trails.<\/li><li>Free chair massages.<\/li><li>Numerous employee appreciation events throughout the year.<\/li><li>Opportunities for community involvement.<\/li><li>Best-in-class, clean, modern facilities.<br><\/li><\/ul><strong><u>About Uline<br><br><\/u><\/strong>Uline is North America's leading distributor of shipping, industrial and packaging materials. We're a family-owned company known for incredible service, our 800+ page catalog of over 38,500 quality products and same-day shipping of our huge in-stock inventory. With over 7,000 employees across 12 locations, it's time you joined Uline.<br><br>Uline provides the essential supplies needed to keep organizations operational and productive. To protect the health and safety of our employees, we have modified our normal operating policies in response to COVID-19.<br><br>Each resume submitted gets individually reviewed by our team and retained for 24 months in case a great opportunity opens for you to join our Uline family.<br><br>EEO\/AA Employer\/Vet\/Disabled<br><br>#UWPA<br><br>\"}"
}