{
    "id":"Kaggle::techmap::61370f29b083b201aa2dc9b4::linkedin_us::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Contains the phrase \"can stand for long periods of time\". This might discourage those with a disability from applying.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Position Summary. Want to make a lot of people’s day? Our Member Frontline Cashier Associates are the heart of our front end. You play a major role in how our members feel in the club and when they leave. You might be the first, last, and sometimes only associate that our members interact with. That’s why it’s so important to smile, greet, and thank each and every one. We are looking for friendly faces to run registers and support our members through the self-checkout experience! The pace can be really fast, especially in the evenings, on weekends, and during a holiday season. There are times when you have to juggle several tasks in a short amount of time while helping members: scanning items, processing payments, and maintaining a clean area—you get the idea! It’s hard work, but our cashiers find it rewarding, especially since they’re a part of a large team with a common goal: happy, satisfied members. You Will Sweep Us Off Our Feet If. You thrive in fast-paced environments. You’re a multi-tasker at heart. You keep member satisfaction as your top priority. You can stand for long periods of time while assisting members quickly and accurately. You’re a problem solver who tackles obstacles head-on to ensure each task is completed with excellence. You Will Make An Impact By. Maintaining a positive attitude by smiling, greeting and thanking members. Maintaining a clean, neat, and member-ready area. The member frontline cashier is a great way to start a fulfilling career at Sam’s Club. Apply now! The above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The full job description can be made available as part of the hiring process. What you'll do. Communicates and supports membership by providing information on membership types, programs, and benefits to current and prospective members. Processing memberships, upgrades, and credit accounts. Encouraging membership renewals. Participating in sales and marketing events. Completing and maintaining marketing recaps and other required documentation. Making efforts to meet membership goals.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61370f29b083b201aa2dc9b4::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Sam's Club\", \"position\": \"Member Frontline\", \"notes\": \"\", \"original\": \"Position Summary...Want to make a lot of people\\u2019s day? Our Member Frontline Cashier Associates are the heart of our front end. You play a major role in how our members feel in the club and when they leave. You might be the first, last, and sometimes only associate that our members interact with. That\\u2019s why it\\u2019s so important to smile, greet, and thank each and every one. We are looking for friendly faces to run registers and support our members through the self-checkout experience! The pace can be really fast, especially in the evenings, on weekends, and during a holiday season. There are times when you have to juggle several tasks in a short amount of time while helping members: scanning items, processing payments, and maintaining a clean area\\u2014you get the idea! It\\u2019s hard work, but our cashiers find it rewarding, especially since they\\u2019re a part of a large team with a common goal: happy, satisfied members.<br><br><strong><u>You Will Sweep Us Off Our Feet If<br><\/u><\/strong><ul><li> You thrive in fast-paced environments<\/li><li> You\\u2019re a multi-tasker at heart<\/li><li> You keep member satisfaction as your top priority<\/li><li> You can stand for long periods of time while assisting members quickly and accurately<\/li><li> You\\u2019re a problem solver who tackles obstacles head-on to ensure each task is completed with excellence<br><\/li><\/ul><strong><u>You Will Make An Impact By<br><\/u><\/strong><ul><li> Maintaining a positive attitude by smiling, greeting and thanking members<\/li><li> Providing exceptional customer service to members across the club as needed, answering any questions they may have<\/li><li> Maintaining a clean, neat, and member-ready area<br><\/li><\/ul>The member frontline cashier is a great way to start a fulfilling career at Sam\\u2019s Club. Apply now!<br><br>The above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The full job description can be made available as part of the hiring process. What you'll do...<br><br>Communicates and supports membership by providing information on membership types, programs, and benefits to current and prospective members; processing memberships, upgrades, and credit accounts; encouraging membership renewals; participating in sales and marketing events; completing and maintaining marketing recaps and other required documentation; making efforts to meet membership goals; and promoting the value of Sam's Club products and services.<br><br>Ensures area of responsibility is maintained in accordance with Company policies and procedures by properly handling returns; zoning the area; arranging and organizing merchandise; and identifying shrink and damages.<br><br>Provides member service by acknowledging the member and identifying member needs; assisting members with purchasing decisions; locating merchandise; resolving member issues and concerns; promoting Sam's Club products and services; providing guidance and support to members regarding member self-service technology; processing member purchases; assisting members with payments according to company policies and procedures for different membership and payment types; assisting members with transactions utilizing belted registers.<br><br>Complies with company policies, procedures, and standards of ethics and integrity by implementing related action plans; using the Open Door Policy; and applying these in executing business processes and practices.<br><br>Completes work assignments and priorities by using policies, data, and resources; collaborating with managers, co-workers, customers, and other business partners; identifying priorities, deadlines, and expectations; carrying out tasks; communicating progress and information; determining and recommending ways to address improvement opportunities; and adapting to and learning from change, difficulties, and feedback.<br><br><strong><u>Minimum Qualifications...<br><br><\/u><\/strong><em><em>Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. <br><br><\/em><\/em><strong><u>Preferred Qualifications...<br><br><\/u><\/strong><em><em>Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. <br><br><\/em><\/em>Customer Service, Retail experience including operating front end equipment (for example, cash register), Working with mobile retail applications Primary Location...1301 S LONE HILL AVE, GLENDORA, CA 91740-5348, United States of America\"}"
}