{
    "id":"Kaggle::techmap::6148acaa5a44ed56cb912398::linkedin_gh::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 6 months fully paid parental leave and subsidized fertility assistance. Unlimited vacation with a 20-day minimum requirement. $10, 000 annual charitable donation matching. Requirements. Minimum of 4 years of professional experience as a software engineer. There's no need to have previous experience with our stack, if you are willing to learn. Native or fluent English. You might be a good fit if you. Reflexively ask yourself, is this code the best way to make my users happy? Are excited to deeply understand the inner workings of the tools you use. Push through hard problems without giving up. Are not afraid to take on complicated systems. Can communicate clearly with colleagues who work, speak and think differently. Work to make things easier for the next engineer who will touch your code. Always try to improve as a programmer and colleague. About engineering at Wave. You'll join an autonomous, cross-functional team focused on a single area of Wave's product. Each team is led by a product manager and mentored by a senior engineer on the team. We organize projects to give you as much ownership as possible. Typically, you'll be responsible for a feature or improvement end-to-end, from design through deployment. Our stack (note that we will train you on any of theseyou don't need any prior experience): backend: Python 3 ( mypy). API layer: GraphQL. android frontend: Kotlin\/Jetpack. iOS frontend: Swift\/SwiftUI. web frontend: TypeScript\/React. database: Postgres. infrastructure: GCP \/ Terraform. orchestration: Kubernetes. Our team. We have a continuously growing in-country team in Senegal, Cote D'Ivoire and Uganda, plus remote team members spread across the world. We're deeply passionate about our mission of bringing great financial services to the people who need them most. We foster autonomy for our employees. You'll learn to own your own projects at every stage, from understanding the problem to monitoring your solution in production. Were backed by world-class investors including Khosla Ventures, Founders Fund, Y Combinator, and the cofounders of PayPal. How to apply. Fill out the form below, and upload a resume plus a cover letter describing your interest in Wave and the role. We review applications on a rolling basis. Wave is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148acaa5a44ed56cb912398::linkedin_gh\", \"source\": \"linkedin_gh\", \"country\": \"GH\", \"company\": \"Wave Mobile Money\", \"position\": \"Senior Software Engineer\", \"notes\": \"\", \"original\": \"<p>Our mission<\/p><p><br><\/p><p>We're making Africa the first cashless continent.<\/p><p><br><\/p><p>In 2017, nearly 60% of adults in sub-Saharan Africa had no bank account. That's for good reason\\u2014the fees are too high, the closest branch can be miles away, and nobody takes cards. Without access to financial institutions, people are forced to keep their savings under the mattress. Small business owners rely on lenders who charge extortionate rates. Parents spend hours waiting in line to pay school fees in cash.<\/p><p><br><\/p><p>We're solving this by building financial services that just work: no account fees, instantly available, and accepted everywhere. In places where electricity, water and roads don't always work, you can still send money with Wave. In November 2017, we launched a mobile app in Senegal for cash deposit, withdrawal, and peer-to-peer and business payments. In 2019, we expanded to Cote d'Ivoire. Now, we're enabling millions of users and growing fast. Our goal is to make Africa the first cashless continent. And that's where you come in....<\/p><p><br><\/p><p><strong>How you'll help us achieve it<\/strong><\/p><p>We\\u2019re looking for an experienced engineer who\\u2019s independent, excited about getting things done and ready to hit the ground running. You'll be responsible for building and improving the ways people pay with Wave. You'll own every step of the process\\u2014from understanding the problem, to shipping your solution for users, to helping the customer support team resolve problems.&nbsp;<\/p><p><br><\/p><p>Our to-do list changes constantly, but here are some recent projects:<\/p><ul><li>Allowing people to pay their electricity bills with Wave, by integrating with Senelec, the national electrical utility.<\/li><li>Building an app for business owners to pay their employees' salaries using Wave.<\/li><li>Letting us safely lend smartphones to thousands of taxi drivers so they can accept payments with Wave, by building software to manage the phones and discourage theft.<\/li><\/ul><p><br><\/p><p><strong>Key Details<\/strong><\/p><ul><li>You can work remotely from anywhere (between UTC -5 and +4) with reliable internet access.<\/li><li>Every two to four months, our remote team meets in Africa for a one-week retreat. (Wave covers all costs.)<\/li><li>Our salaries are competitive and are calculated using a transparent formula. For this role, we are offering a salary range of 108,000 -170,000 USD depending on your level and location, including equity<\/li><\/ul><p><br><\/p><p><strong>Major benefits:<\/strong><\/p><ul><li>Subsidized health insurance for you and your dependents and&nbsp;retirement contributions (both vary from country-to-country)<\/li><li>6 months fully paid parental leave and subsidized fertility assistance<\/li><li>Unlimited vacation with a 20-day<em>&nbsp;minimum<\/em>&nbsp;requirement<\/li><li>$10,000 annual charitable donation matching<\/li><\/ul><p><br><\/p><p><strong>Requirements<\/strong><\/p><ul><li>Minimum of 4 years of professional experience as a software engineer.&nbsp;There's no need to have previous experience with our stack, if you are willing to learn.<\/li><li>Native or fluent English.<\/li><\/ul><p><br><\/p><p><strong>You might be a good fit if you<\/strong><\/p><ul><li>Reflexively ask yourself, \\u201cis this code the best way to make my users happy?\\u201d<\/li><li>Are excited to deeply understand the inner workings of the tools you use.<\/li><li>Push through hard problems without giving up.<\/li><li>Are not afraid to take on complicated systems.<\/li><li>Can communicate clearly with colleagues who work, speak and think differently.<\/li><li>Work to make things easier for the next engineer who will touch your code.<\/li><li>Always try to improve as a programmer and colleague.<\/li><\/ul><p><br><\/p><p><strong>About engineering at Wave<\/strong><\/p><ul><li>You'll join an autonomous, cross-functional team focused on a single area of Wave's product. Each team is led by a product manager and mentored by a senior engineer on the team.<\/li><li>We organize projects to give you as much ownership as possible. Typically, you'll be responsible for a feature or improvement end-to-end, from design through deployment.<\/li><li>Our stack (note that&nbsp;<strong>we will train you on any of these<\/strong>\\u2014you don't need any prior experience):<\/li><li>backend: Python 3 (+ mypy)<\/li><li>API layer: GraphQL<\/li><li>android frontend: Kotlin\/Jetpack<\/li><li>iOS frontend: Swift\/SwiftUI<\/li><li>web frontend: TypeScript\/React<\/li><li>database: Postgres<\/li><li>infrastructure: GCP \/ Terraform<\/li><li>orchestration: Kubernetes<\/li><\/ul><p><br><\/p><p><strong>Our team<\/strong><\/p><ul><li>We&nbsp;have a continuously growing in-country&nbsp;team&nbsp;in Senegal, Cote D'Ivoire and Uganda, plus remote&nbsp;team&nbsp;members spread across the world.&nbsp;We're deeply passionate about our mission of bringing great financial services to the people who need them most.<\/li><li>We foster autonomy for our employees. You'll learn to own your own projects at every stage, from understanding the problem to monitoring your solution in production.<\/li><li>We\\u2019re backed by world-class investors including Khosla Ventures, Founders Fund, Y Combinator, and the cofounders of PayPal.<\/li><\/ul><p><br><\/p><p><strong>How to apply<\/strong><\/p><p>Fill out the form below, and upload a resume plus a cover letter describing your interest in Wave and the role. We review applications on a rolling basis.<\/p><p><br><\/p><p>Wave is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.<\/p>\"}"
}