{
    "id":"Kaggle::techmap::6146b08b695a4544e08e9a2d::monsterasia_hk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" RESPONSIBILITIES: Develop mechanical design solutions for field instruments & meters, such as Flow Meters, Pressure Transmitters, and Liquid Level Meters, and Marine products from initial requirements captured through analysis, design, implementation, test and certification. Implement engineering change per product continuation, improvement or cost reduction. Support new product development with Voice of Customer (VOC) input obtained through normal job activities. Develop customer specials and performing value engineering (VE). Cost analysis and investigation of the market requirements for new devices. Ensure effective support for manufacturing, quality, sales and other cross functions for new product introduction, and maintenance of current product lines, quality issues and manufacturing problems. Communicate with global team and take the responsibility of local technology focal of above mentioned products. QUALIFICATION: Master\/Bachelor degree in mechanical engineering or equivalent. At least 10 years of engineering experience, of which, at least 8 years experience in developing and designing field or Marine instruments (Flow Meters, Marine products. ) Domain knowledge of natural gas industry or Marine industry. Mechanical design knowledge of explosion-proof conformity. Lead at least one new product introduction project of above mentioned products. Excellent written & verbal communication skills and relationship building skills. Self-motivated and team-oriented personality. Interested in working in fast paced, global business environment. Able to work and travel in global collaborating environment with intensive challenges. Strong troubleshooting and analytical skills. Travel up to 20% of the time is required in this role. SKILLS: Excellent skills on AutoCAD, SolidWorks\/Pro-E\/Inventor and MathCAD. Skilled FEA capability and experience is must. CFD experience would be plus. Deep understanding of materials such as cast steel, spheroidal iron, aluminium, stainless steel, plastics, elastomers and experience of different global material norms. Rich knowledge of heat treatment methods and surface treatment methods. Knowledge of certification: PED, ASME, TSG, ATEX, NEPSI, FM, CSA, SIL. Knowledge of DFX: design for manufacturing, design for test. Knowledge of manufacturing processes such as multi-axis CNC machining, sand casting, investment, forging, aluminium die casting, plastic injection moulding, sheet metal forming, welding.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6146b08b695a4544e08e9a2d::monsterasia_hk\", \"source\": \"monsterasia_hk\", \"country\": \"HK\", \"company\": \"Honeywell\", \"position\": \"Sr Advanced Mech Design Engr, Tianjin, HPS PMT\", \"notes\": \"\", \"original\": \"<br>RESPONSIBILITIES:<br>Develop mechanical design solutions for field instruments & meters, such as Flow Meters, Pressure Transmitters, and Liquid Level Meters, and Marine products from initial requirements captured through analysis, design, implementation, test and certification.<br>Implement engineering change per product continuation, improvement or cost reduction.<br>Support new product development with Voice of Customer (VOC) input obtained through normal job activities.<br>Develop customer specials and performing value engineering (VE).<br>Cost analysis and investigation of the market requirements for new devices.<br>Ensure effective support for manufacturing, quality, sales and other cross functions for new product introduction, and maintenance of current product lines, quality issues and manufacturing problems.<br>Communicate with global team and take the responsibility of local technology focal of above mentioned products.QUALIFICATION:<br>Master\/Bachelor degree in mechanical engineering or equivalent<br>At least 10 years of engineering experience, of which, at least 8 years experience in developing and designing field or Marine instruments (Flow Meters, Marine products ...).<br>Domain knowledge of natural gas industry or Marine industry.<br>Mechanical design knowledge of explosion-proof conformity.<br>Lead at least one new product introduction project of above mentioned products.<br>Excellent written & verbal communication skills and relationship building skills.<br>Self-motivated and team-oriented personality.<br>Interested in working in fast paced, global business environment.<br>Able to work and travel in global collaborating environment with intensive challenges.<br>Strong troubleshooting and analytical skills.<br>Travel up to 20% of the time is required in this role.<br>SKILLS:<br>Excellent skills on AutoCAD, SolidWorks\/Pro-E\/Inventor and MathCAD<br>Skilled FEA capability and experience is must. CFD experience would be plus.<br>Deep understanding of materials such as cast steel, spheroidal iron, aluminium, stainless steel, plastics, elastomers and experience of different global material norms.<br>Rich knowledge of heat treatment methods and surface treatment methods.<br>Knowledge of certification: PED, ASME, TSG, ATEX, NEPSI, FM, CSA, SIL<br>Knowledge of DFX: design for manufacturing, design for test<br>Knowledge of manufacturing processes such as multi-axis CNC machining, sand casting, investment, forging, aluminium die casting, plastic injection moulding, sheet metal forming, welding.\"}"
}