{
    "id":"Kaggle::techmap::6134cc4fc668ec50178f1018::linkedin_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"He\/she should have the ability to foster relationships...\" could subtly introduce gender bias by using binary gender pronouns, which might not be inclusive of all potential applicants. A more inclusive approach would be to use gender-neutral language, such as \"The ideal candidate should have the ability to foster relationships...\". This adjustment helps ensure that the job description is welcoming to all candidates, regardless of gender identity. ",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job ID: 1083203_RR00050808. NYU Langone Health is a world-class, patient-centered, integrated academic medical center, known for its excellence in clinical care, research, and education. It comprises more than 200 locations throughout the New York area, including five inpatient locations, a children's hospital, three emergency rooms and a level 1 trauma center. Also part of NYU Langone Health is the Laura and Isaac Perlmutter Cancer Center, a National Cancer Institute designated comprehensive cancer center, and NYU Grossman School of Medicine, which since 1841 has trained thousands of physicians and scientists who have helped to shape the course of medical history. For more information, go to nyulangone. org, and interact with us on Linked. In, Glassdoor, Indeed, Facebook, Twitter, You. Tube and Instagram. Position Summary. We have an exciting opportunity to join our team as a Payroll Systems Analyst. In this role, the successful candidate will be responsible for configuration of My. Time pay policies with analysis of documented Pay Policies including implementing and testing of system changes. This role will work closely with the My. Time Systems Manager to support new and existing processes and systems initiatives. The ideal candidate is able to operate in a fast paced changing environment. He\/she should have the ability to foster relationships by establishing and working collaboratively within the department. They will focus on building the My. Time system by participation on My. Time related projects with clear deliverables and due dates in alignment with signed-off functional specifications in adherence with Institutional Pay Policies. Job Responsibilities. Participates in evaluation and redesign, as necessary, of internal processes. Respects and maintains confidentiality of all information within NYU Langone Health. Demonstrates creative thinking when seeking alternative solutions to process challenges and issues. Communicates clearly and concisely with customers in a professional and timely manner. Excellent communication skills. Efficiently organizes and manages tasks\/projects. Perform other job-related duties as required. Identify, evaluate, analyze and recommend changes to support process improvements. Work together with Technical staff to develop custom extensions to seeded business applications when needed. Perform troubleshooting activities including troubleshoot issues as related to maintenance of the KRONOS Pay Policies. Ensure that the program and system configuration of Kronos accurate and effectively processes defined NYU Policies. Work with business users and the IT team to troubleshoot and resolve application issues.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6134cc4fc668ec50178f1018::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"NYU Langone Health\", \"position\": \"Payroll Systems Analyst\", \"notes\": \"\", \"original\": \"Job ID: 1083203_RR00050808<br><br><strong>NYU Langone Health<\/strong> is a world-class, patient-centered, integrated academic medical center, known for its excellence in clinical care, research, and education. It comprises more than 200 locations throughout the New York area, including five inpatient locations, a children's hospital, three emergency rooms and a level 1 trauma center. Also part of NYU Langone Health is the Laura and Isaac Perlmutter Cancer Center, a National Cancer Institute designated comprehensive cancer center, and NYU Grossman School of Medicine, which since 1841 has trained thousands of physicians and scientists who have helped to shape the course of medical history. <em>For more information, go to <\/em><em>nyulangone.org<\/em><em>, a<\/em><em>nd interact with us on <\/em><em>LinkedIn<\/em><em>, <\/em><em>Glassdoor<\/em><em>, <\/em><em>Indeed<\/em><em>,<\/em> <em>Facebook<\/em><em>, <\/em><em>Twitter<\/em><em>, <\/em><em>YouTube<\/em><em> and <\/em><em>Instagram<\/em><em>.<br><br><\/em><strong><u>Position Summary<br><br><\/u><\/strong>We have an exciting opportunity to join our team as a Payroll Systems Analyst.<br><br>In this role, the successful candidate will be responsible for configuration of MyTime pay policies with analysis of documented Pay Policies including implementing and testing of system changes. This role will work closely with the MyTime Systems Manager to support new and existing processes and systems initiatives. The ideal candidate is able to operate in a fast paced changing environment. He\/she should have the ability to foster relationships by establishing and working collaboratively within the department. They will focus on building the MyTime system by participation on MyTime related projects with clear deliverables and due dates in alignment with signed-off functional specifications in adherence with Institutional Pay Policies.<br><br><strong><u>Job Responsibilities<br><\/u><\/strong><ul><li>Participates in evaluation and redesign, as necessary, of internal processes.<\/li><li>Respects and maintains confidentiality of all information within NYU Langone Health<\/li><li>Demonstrates creative thinking when seeking alternative solutions to process challenges and issues.<\/li><li>Communicates clearly and concisely with customers in a professional and timely manner. Excellent communication skills.<\/li><li>Efficiently organizes and manages tasks\/projects.<\/li><li>Perform other job-related duties as required.<\/li><li>Identify, evaluate, analyze and recommend changes to support process improvements.<\/li><li>Work together with Technical staff to develop custom extensions to seeded business applications when needed.<\/li><li>Perform troubleshooting activities including troubleshoot issues as related to maintenance of the KRONOS Pay Policies.<\/li><li>Ensure that the day to day operations for the Kronos system users are adequately supported.<\/li><li>Ensure that the program and system configuration of Kronos accurate and effectively processes defined NYU Policies.<\/li><li>Work with business users and the IT team to troubleshoot and resolve application issues.<\/li><li>Create detailed functional and technical design documents, test plans and test cases.<\/li><li>Updates Pay Policy configuration objects for the Kronos Workforce Central application<br><\/li><\/ul><strong><u>Minimum Qualifications<br><br><\/u><\/strong>To qualify you must have a BA\/BS is required. The MyTime Systems Analyst should exhibit sound knowledge of the MyTime\/Kronos Pay Policies component. In addition, he\/she should maintain pay practices\/policies as configured and configurable for all union and non-union employees. The MyTime Systems Analyst should have subject matter analytical ability to address matters of moderate to high complexity related to Payroll Policies and MyTime Configuration. A penchant for creative problem solving and troubleshooting is preferred. The MyTime Systems Analyst must have strong written and verbal communication skills and should proactively monitor customer satisfaction and the quality of the services provided. He\/she should demonstrate skills to meet and exceed the needs of his\/her customers.<br><br><strong><u>Preferred Qualifications<br><br><\/u><\/strong>Two (2) years of related Kronos experience preferred. FPC or CPP preferred. Familiarity with related HRIS and Finance enterprise systems a plus.<br><br><em>Qualified candidates must be able to effectively communicate with all levels of the organization.<br><br><\/em>NYU Langone Health provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.<br><br>NYU Langone Health is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online.<br><br>If you wish to view NYU Langone Health's EEO policies, please click here. Please click here to view the Federal \\\"EEO is the law\\\" poster or visit https:\/\/www.dol.gov\/ofccp\/regs\/compliance\/posters\/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here.\"}"
}