{
    "id":"Kaggle::techmap::61415eb18be8df1fa24cf1fa::careerbuilder_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Will then be required to maintain a minimum of 16 hours of trauma education every 4 years or continue TNCC certification. Code Grey within 6 months of hire. Moderate Sedation within 6 months of hire. IV Ultrasound class within 1 year of hire. PALS within 6 months of hire. Preferred: Department specific acute care certification. (i. e. RNC, CCRN, CEN). EXPERIENCE. Required: 1 year of recent primary ICU experience. Preferred: Emergency department and\/or PACU experience. PERSONAL PROTECTIVE EQUIPMENT. Must be able to wear appropriate Personal Protective Equipment (PPE) required to perform the job safely. ADDITIONAL POSITION INFORMATION: Must have excellent communication skills and ability to interact with a diverse population and professionally represent St. Charles Health System. Excellent organizational and multi-tasking skills. Strong teamwork and collaborative skills. Strong analytical, problem solving and decision making skills. Basic to intermediate ability and experience with computer applications, specifically electronic medical records system and MS Office. PHYSICAL REQUIREMENTS: Continually (75% or more): Standing and walking, keyboard operation, use of clear and audible speaking voice and the ability to hear normal speech level. Frequently (50%): Sitting, lifting\/carrying\/pushing or pulling 1-25 pounds. The use and operation of a motor vehicle for Home Health and Wound Caregivers. Occasionally (25%): Bending, stooping\/kneeling\/crouching, climbing ladder\/step-stool (varies by area), reaching overhead, lifting\/carrying\/pushing or pulling 25-50 pounds, grasping\/squeezing, ability to hear whispered speech level. Rarely (10%): Climbing stairs. Never (0%): Climbing ladder\/step-stool (varies by area), operation of a motor vehicle. Exposure to Elemental Factors. Rarely (10%): Wet\/slippery area, chemical solution. Never (0%): Heat, cold, noise, dust, vibration, uneven surface. Blood-Borne Pathogen (BBP) Exposure Category. Risk for Exposure to BBP. Schedule Weekly Hours: 36. Caregiver Type: Regular. Shift: Third Shift (United States of America). Is Exempt Position? Job Family: REGISTERED NURSE Scheduled Days of the Week: Variable. Includes every other weekend and holidays. Shift Start & End Time: 1900-0730.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61415eb18be8df1fa24cf1fa::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"StCharles\", \"position\": \"RN Critical Care Resource ( Nights) *Eligible for Sign-On and Retention Bonus - 10,000 +Relocation\", \"notes\": \"\", \"original\": \"\\\"This position is eligible for a combined sign on and retention bonus in the amount of $10,000*, based on experience. To qualify for the bonus, candidates must start prior to 11\/30\/2021 AND must not have been employed by St. Charles Health System in the last 6 months. <br \/><br \/>Also eligible for in-state or out of state relocation bonus, amount based on location. <br \/><br \/>*Bonuses are available to external applicants only and are subject to all applicable tax withholdings. \\\"<p><\/p><p><\/p><p><\/p><p><b>ST. CHARLES HEALTH SYSTEM<\/b><\/p><p><b>JOB DESCRIPTION<\/b><\/p>\\r\\n\\r\\n<p><b>TITLE:<\/b>\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 RN - Critical Care Resource - Redmond\\u00a0\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/p><p><b>REPORTS TO POSITION:<\/b>\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Manager \\u2013 Patient Care Support<\/p><p><b>DEPARTMENT:<\/b>\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 Patient Care Support<\/p>\\r\\n\\r\\n<p><b>OUR VISION:\\u00a0 \\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 <\/b>Creating America\\u2019s healthiest community, together<\/p>\\r\\n<p><b>OUR MISSION:\\u00a0 \\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 <\/b>In the spirit of love and compassion, better health, better care, better value<\/p>\\r\\n<p><b>OUR VALUES:\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 <\/b>Accountability, Caring and Teamwork<\/p>\\r\\n\\r\\n<p><b>DEPARTMENT SUMMARY:<\/b> These departments include but are not limited to the Emergency Department, Medical\/Surgical, Telemetry, Intensive Care Unit, Peri-Op, and radiology.\\u00a0 These departments provide 24\/7 specialized care to patients throughout their hospitalization and discharge.<\/p>\\r\\n<p><b>POSITION OVERVIEW: <\/b>The <b>RN \\u2013 Critical Care Resource - Redmond <\/b>provides quality patient and family centered care as a member of the health care team in accordance with St. Charles Health System mission, philosophy, policies, and procedures.\\u00a0 Applies standards for professional nursing practice and focuses clinical care to enhance the experience for patients, families, and all others. As a nurse, this position will oversee the work of other caregivers, providing specific care to assigned patient(s) throughout the shift, as required under the scope of the RN licensure.<\/p>\\r\\n<p><b>ESSENTIAL FUNCTIONS AND DUTIES: <\/b><\/p>\\r\\n<p>Maintains and demonstrates an in-depth knowledge of nursing principles, practices, standards, and techniques and applies this knowledge in accordance with St. Charles Health System policies and procedures and within laws and regulations governing nursing practice in the State of Oregon.<\/p>\\r\\n<p>Assesses the patient\\u2019s condition and needs using critical thinking and clinical judgment: sets outcomes; implements appropriate nursing actions and collaborates with other disciplines to meet the patient\\u2019s\/family\\u2019s physical, emotional, spiritual, social, and intellectual needs; and evaluates patient\\u2019s progress.<\/p>\\r\\n<p>Provides the following services while on shift \\u2013 moderate sedation, code response\/rapid response team, disaster response, assist with patient recoveries, provide unit break relief and ability to provide strong clinical support to all clinical departments.<\/p>\\r\\n<p>Demonstrates awareness of and supports St. Charles departmental and operating unit goals through participation in continuous quality improvement and departmental activities.<\/p>\\r\\n<p>Participates in activities that promote professional growth and development of self and others.<\/p>\\r\\n<p>Communicates (both written and orally) effectively and maintains professional relationships with caregivers, medical staff, patients, and guests.<\/p><p>Identifies work-related problems with possible solutions and implements solution(s) within scope of practice, as appropriate.<\/p>\\r\\n<p>Supports the vision, mission and values of the organization in all respects.<\/p>\\r\\n<p>Supports Value Improvement Practice (VIP- Lean) principles of continuous improvement with energy and enthusiasm, functioning as a champion of change.<\/p>\\r\\n<p>Conducts all activities with the highest standards of professionalism and confidentiality.\\u00a0 Complies with all applicable laws, regulations, policies and procedures, supporting the organization\\u2019s corporate integrity efforts by acting in an ethical and appropriate manner, reporting known or suspected violation of applicable rules, and cooperating fully with all organizational investigations and proceedings.<\/p>\\r\\n<p>Delivers customer service and\/or patient care in a manner that promotes goodwill, is timely, efficient and accurate.\\u00a0<\/p>\\r\\n<p>Participates in creating a healing environment that supports all aspects of the care environment and the wholeness of each individual, patient and caregiver.<\/p>\\r\\n<p>Participates in creating intentional relationships and demonstrates focus attitudes and behaviors that enhance the care experience.<\/p>\\r\\n<p>Provides a therapeutic presence in service to others by purposefully responding to the needs of patients in a caring way, including introducing oneself and explaining role in patient\\u2019s care,\\u00a0asking the patient his or her preferred name, sitting with the patient to determine his or her care goals, active listening, and communicating effectively and appropriately through touch, eye contact, etc.<\/p>\\r\\n<p>Provides and maintains a safe environment for caregivers, patients and guests<\/p>\\r\\n<p>Documents all patient care with proficiency in compliance with hospital policies, procedures and regulatory agencies.\\u00a0 <\/p>\\r\\n<p>Calculates dosages and administers medications accurately in accordance with St. Charles Health System policies and procedures for medication administration.<\/p>\\r\\n<p>Develops cultural competence and provides appropriate care to patients and family members who belong to diverse cultural backgrounds.<\/p>\\r\\n<p>Functions as Rapid Response Team Nurse as assigned following department specific guidelines.\\u00a0 <\/p>\\r\\n<p>Performs stand by callback as assigned.\\u00a0 Varies by department.<\/p>\\r\\n<p>May perform additional duties of similar complexity within the organization, as required or assigned.<\/p>\\r\\n<p>Will be assigned to work in various units as needed.\\u00a0<\/p>\\r\\n<p><b>EDUCATION<\/b><\/p><p><\/p><p><b>Required<\/b>:\\u00a0 As required by RN licensure\\u00a0\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/p><p><b>Preferred<\/b>:\\u00a0 BSN\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/p>\\r\\n<p><b>LICENSURE\/CERTIFICATION\/REGISTRATION<\/b><\/p>\\r\\n<p><b>Required<\/b>:\\u00a0 Current Oregon RN license.<\/p><p>AHA Basic Life Support for Healthcare Provider certification.\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/p><p>ACLS<\/p><p>TNCC certification within 6 months of hire. Will then be required to maintain a minimum of 16 hours of trauma education every 4 years or continue TNCC certification.\\u00a0<\/p><p>Code Grey within 6 months of hire.<\/p><p>Moderate Sedation within 6 months of hire.\\u00a0<\/p><p>IV Ultrasound class within 1 year of hire.<\/p><p>PALS within 6 months of hire.<\/p>\\r\\n<p><b>Preferred<\/b>:\\u00a0 Department specific acute care certification. (i.e. RNC, CCRN, CEN)\\u00a0<\/p>\\r\\n<p><b>EXPERIENCE<\/b><\/p>\\r\\n<p><b>Required<\/b>:\\u00a0 1 year of recent primary ICU experience. \\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/p><p><b>Preferred<\/b>:\\u00a0 Emergency department and\/or PACU experience. \\u00a0\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/p>\\r\\n<p><b>PERSONAL PROTECTIVE EQUIPMENT <\/b><\/p>\\r\\n<p>Must be able to wear appropriate Personal Protective Equipment (PPE) required to perform the job safely.<\/p>\\r\\n<p><b>ADDITIONAL POSITION INFORMATION:\\u00a0 <\/b><\/p>\\r\\n<p>Must have excellent communication skills and ability to interact with a diverse population and professionally represent St. Charles Health System.<\/p><p>Excellent organizational and multi-tasking skills.\\u00a0<\/p><p>Strong teamwork and collaborative skills.<\/p><p>Strong analytical, problem solving and decision making skills. \\u00a0<\/p><p>Basic to intermediate ability and experience with computer applications, specifically electronic medical records system and MS Office.<\/p>\\r\\n\\r\\n<p><b>PHYSICAL REQUIREMENTS:\\u00a0<\/b><\/p><p>Continually (75% or more): Standing and walking, keyboard operation, use of clear and audible speaking voice and the ability to hear normal speech level.<\/p><p>Frequently (50%): Sitting, lifting\/carrying\/pushing or pulling 1-25 pounds. The use and operation of a motor vehicle for Home Health and Wound Caregivers.<\/p><p>Occasionally (25%): Bending, stooping\/kneeling\/crouching, climbing ladder\/step-stool (varies by area), reaching overhead, lifting\/carrying\/pushing or pulling 25-50 pounds, grasping\/squeezing, ability to hear whispered speech level.<\/p><p>Rarely (10%): Climbing stairs.<\/p><p>Never (0%):\\u00a0 Climbing ladder\/step-stool (varies by area), operation of a motor vehicle.<\/p><p>Exposure to Elemental Factors<\/p><p>Rarely (10%): Wet\/slippery area, chemical solution.<\/p><p>Never (0%):\\u00a0 Heat, cold, noise, dust, vibration, uneven surface.<\/p><p>Blood-Borne Pathogen (BBP) Exposure Category<\/p><p>Risk for Exposure to BBP<\/p>\\r\\n\\r\\n<p><\/p><p><\/p><p>Schedule Weekly Hours:<\/p>36<p><\/p><p><\/p><p>Caregiver Type:<\/p>Regular<p><\/p><p><\/p><p>Shift:<\/p>Third Shift (United States of America)<p><\/p><p><\/p><p>Is Exempt Position?<\/p>No<p><\/p><p><\/p><p>Job Family:<\/p>REGISTERED NURSE\\r\\n\\r\\n<p>Scheduled Days of the Week:<\/p>Variable; includes every other weekend and holidays<p><\/p><p><\/p><p>Shift Start & End Time:<\/p>1900-0730&nbsp;\"}"
}