{
    "id":"Kaggle::techmap::61412bf98be8df1fa24b6c7b::careerbuilder_us::9",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The role does not sound like a physically demanding role yet states \"Must be able to walk or stand for long periods of time\"",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Description Summary. Under the supervision and direction of the Production Supervisor and\/or Process Operator, this position is responsible for operation and control of formed product equipment, including starting up and shutting down of all line equipment. This position is responsible for setting up the equipment and support functions for the formed product lines. This position will monitor the operation of the equipment and make changes as required under the direction of the Production Supervisor and Process Operator. It will be their responsibility to assure that acceptable product quality levels are attained and maintained. During downtime period they will set up, monitor and operate all said equipment in accordance with established cleaning procedures. Maintains safe work practices at all times and participates in safety programs. Responsible for the operation and control of patty line and co-product line equipment in accordance with established procedures. Perform all sanitation duties as prescribed by company procedures and standards, including mid-shift clean up schedule and thorough knowledge of chemicals used. Disassemble, clean and reassemble shredder and forming equipment on formed product lines during clean-up periods. Maintaining on an hourly and daily basis, legible records of his\/her line performance including F. F. A. 's, SAPP content, downtime (operational and mechanical). Monitor and\/or control potato flow and quantity. Job Qualifications. Qualifications: Must have good communication skills oral and written. Must be able to lift up to 50 pounds. Must be able to work for prolonged periods of time in hot humid area. Must be able to walk or stand for long periods of time. Sanitation of area and weekend cleanups. Performs other jobs or duties as assigned by Production Supervisor. If you would like to apply to this amazing opportunity, please click the link below: [Link available when viewing the job]. Key Word: LambWestYakimaWA.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61412bf98be8df1fa24b6c7b::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Manpower Inc\", \"position\": \"Formed Product Operator- RELOCATION PROVIDED\", \"notes\": \"\", \"original\": \"<p><strong>Job Description Summary<\/strong><\/p><p>Under the supervision and direction of the Production Supervisor and\/or Process Operator, this position is responsible for operation and control of formed product equipment, including starting up and shutting down of all line equipment.<br \/> <br \/> This position is responsible for setting up the equipment and support functions for the formed product lines. This position will monitor the operation of the equipment and make changes as required under the direction of the Production Supervisor and Process Operator. It will be their responsibility to assure that acceptable product quality levels are attained and maintained. During downtime period they will set up, monitor and operate all said equipment in accordance with established cleaning procedures.<\/p><p><\/p><ul><li>Maintains safe work practices at all times and participates in safety programs.<\/li><li>Responsible for the operation and control of patty line and co-product line equipment in accordance with established procedures.<\/li><li>Perform all sanitation duties as prescribed by company procedures and standards, including mid-shift clean up schedule and thorough knowledge of chemicals used. Disassemble, clean and reassemble shredder and forming equipment on formed product lines during clean-up periods.<\/li><li>Maintaining on an hourly and daily basis, legible records of his\/her line performance including F.F.A.'s, SAPP content, downtime (operational and mechanical).<\/li><li>Monitor and\/or control potato flow and quantity.<\/li><\/ul><p><strong>Job Qualifications<\/strong><\/p><p><strong>Qualifications:<\/strong><\/p><ul><li>Must have good communication skills oral and written.<\/li><li>Must be able to lift up to 50 pounds.<\/li><li>Must be able to work for prolonged periods of time in hot humid area.<\/li><li>Must be able to walk or stand for long periods of time.<\/li><li>Must have working knowledge of basic arithmetic.<\/li><li>Sanitation of area and weekend cleanups<\/li><li>Performs other jobs or duties as assigned by Production Supervisor.<\/li><\/ul><p><\/p><p><\/p><p>If you would like to apply to this amazing opportunity, please click the link below:<\/p><p>[Link available when viewing the job]<\/p><p>Key Word: LambWestYakimaWA<\/p>&nbsp;\"}"
}