{
    "id":"Kaggle::techmap::614391fdba307065bf90162e::linkedin_cl::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrases  \"You are HUNGRY to sell! Driven by sales and making connections with clients.\" can come across aggressive and competitive language typically associated with masculine-coded traits.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The phrase \"someone that has a good sense of humour will fit in well\" can be biased as it might exclude individuals who have different cultural backgrounds, communication styles, or neurodiverse conditions that influence their sense of humour or social interactions. The phrase \"without taking things personally\" can be biased, as it dismisses emotional and psychological responses and implies a preference for emotional resilience that may not be universally applicable.",
    "verified":true,
    "synthetic":false,
    "text":" (Biology, Chemistry, Market Research, Business Intelligence, etc. ) We however require experience and real interest in the field of marketing & sales. : Team Player, Versatile, and WE CAN attitude  we are a start-up and need the candidate to have team spirit and be willing to do things that are not necessarily always considered in their job description. Things can come up unexpectedly and we need a lets go for it attitude. You are HUNGRY to sell! Driven by sales and making connections with clients. Punctuality is essential. Being on time for meetings is very important, both internally and externally! Having a good work environment is also key at DIWIS. Although we work hard, we also like to enjoy our time together. Therefore, someone that has a good sense of humor will fit in well! Well-Organized  You will be given a list of companies and each one will have different actions and priorities at different times. You will need to set tasks and reminders for yourself in order to stay organized and remember what needs to be done on each account. This requires someone who is highly organized. Self-motivated and the ability to work remotely  We understand that working remotely can be challenging, this is however essential in this internship. Daily communication is done by email and Whats. App and every week there is a zoom meeting to stay in touch. We are here to help you at any moment, we will teach you how. High level of professionalism  The clients that we are contacting are high-level professionals, Business Owners, and Governments from different countries, its important for us that you feel comfortable working with different cultures. We need someone who can approach these people with ease and always keep a professional relationship and attitude with them. We also need someone who can take constructive criticism with ease as the purpose of this experience is to learn and you will obviously need to be trained and explained how to correct errors along the way. It is essential that you understand and know how to listen to constructive criticism in order to improve in this position without taking things personally. At the moment there isnt any monetary compensation. In case you close a sale a commission will be discussed. : At the moment, we dont expect to travel to meet clients.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614391fdba307065bf90162e::linkedin_cl\", \"source\": \"linkedin_cl\", \"country\": \"CL\", \"company\": \"DIWIS\", \"position\": \"International Market Analyst Internship\", \"notes\": \"\", \"original\": \"<p>DIWIS Internships Programme is designed to support highly qualified and motivated students with diverse backgrounds in gaining hands-on experience in their field. This relates to Strategic Orientations of the Market Intelligence &amp; Insights, or the Digital Marketing Department, and to support the corporate functions of the Organisation. Its main goal is to give successful candidates the opportunity to improve their analytical and technical skills in an international environment.<\/p><p><br><\/p><p>The Internship Programme is open on an ongoing basis. Students enrolled at a fully accredited degree program (Bachelor, Master, Ph.D.) during the entire duration of their internship can apply online. Selected interns are expected to work remotely until further notice.<\/p><p><br><\/p><p>\\ud835\\ude52\\ud835\\ude5d\\ud835\\ude5a\\ud835\\ude63 \\ud835\\ude58\\ud835\\ude56\\ud835\\ude63 \\ud835\\ude44 \\ud835\\ude56\\ud835\\ude65\\ud835\\ude65\\ud835\\ude61\\ud835\\ude6e \\ud835\\ude5b\\ud835\\ude64\\ud835\\ude67 \\ud835\\ude56\\ud835\\ude63 \\ud835\\ude5e\\ud835\\ude63\\ud835\\ude69\\ud835\\ude5a\\ud835\\ude67\\ud835\\ude63\\ud835\\ude68\\ud835\\ude5d\\ud835\\ude5e\\ud835\\ude65?<\/p><p><br><\/p><p>We recruit interns on an ongoing basis and applications are accepted throughout the year. You can apply anytime via info@diwisinternationalconsultancy.com<\/p><p>Internship start dates will be set based on your dates of availability and the DIWIS hiring teams\\u2019 schedules: do not forget to specify the date and duration of your availability in the application form.<\/p><p>If your application is not successful, you are welcome to apply again to the next vacancy publication.<\/p><p>&nbsp;<\/p><p>\\ud835\\uddec\\ud835\\uddfc\\ud835\\ude02\\ud835\\uddff \\ud835\\ude01\\ud835\\uddee\\ud835\\ude00\\ud835\\uddf8\\ud835\\ude00 \\ud835\\ude00\\ud835\\uddf5\\ud835\\uddee\\ud835\\uddf9\\ud835\\uddf9 \\ud835\\uddf6\\ud835\\uddfb\\ud835\\uddf0\\ud835\\uddf9\\ud835\\ude02\\ud835\\uddf1\\ud835\\uddf2&nbsp;<\/p><p><br><\/p><ul><li>Working on a daily basis with sales tools such as LinkedIn, and Search Engines to identify potential in prospective companies and key contacts in those companies<\/li><li>Prospective calling on a daily basis to organize sales meetings with potential clients<\/li><li>Preparing sales presentations (note: you will be expected to also present sales presentations after a short training period)<\/li><li>Updating CRM using internal tools (Gsuite, and Office360, etc.)<\/li><li>Following up with prospects and clients to obtain RFPs and feedback on proposals that have been sent<\/li><li>Once you get successful in getting sales, you will also have the opportunity to do the follow-ups and you will be involved in coordinating it from start to finish: administrative duties such as working on MSAs, Confidentiality Agreements, Procurement processes, etc. as well as checking in with the client to see if they are satisfied with how the project is being run, working with the technical teams to organize meetings with the clients, making sure reports are sent on time and meet clients\\u2019 expectations.(under guidance and support from your supervisor).<\/li><\/ul><p><br><\/p><p>\\ud835\\udde3\\ud835\\uddff\\ud835\\uddfc\\ud835\\uddf3\\ud835\\uddf2\\ud835\\ude00\\ud835\\ude00\\ud835\\uddf6\\ud835\\uddfc\\ud835\\uddfb\\ud835\\uddee\\ud835\\uddf9 \\ud835\\udde3\\ud835\\uddff\\ud835\\uddfc\\ud835\\uddf3\\ud835\\uddf6\\ud835\\uddf9\\ud835\\uddf2:<\/p><p><br><\/p><ul><li>Bilingual Spanish\/English<\/li><li>Bilingual Portuguese\/English<\/li><li>Bilingual French\/English&nbsp;<\/li><li>Bilingual Italian\/English<\/li><li>Other languages are appreciated such as German,, Dutch, Swedish, Danish, etc.&nbsp;<\/li><li>Possibility to have an Internship contract full time.<\/li><li>Sales experience is a plus!&nbsp;<\/li><li>DIWIS is open to more technical applications. (Biology, Chemistry, Market Research, Business Intelligence, etc.) We however require experience and real interest in the field of marketing &amp; sales.<\/li><\/ul><p><br><\/p><p>\\ud835\\udde4\\ud835\\ude02\\ud835\\uddee\\ud835\\uddf9\\ud835\\uddf6\\ud835\\ude01\\ud835\\uddf6\\ud835\\uddf2\\ud835\\ude00:<\/p><ul><li>&nbsp;Team Player, Versatile, and \\u201cWE CAN\\u201d attitude \\u2013 we are a start-up and need the candidate to have team spirit and be willing to do things that are not necessarily always considered in their job description. Things can come up unexpectedly and we need a \\u201clet\\u2019s go for it\\u201d attitude.<\/li><li>You are HUNGRY to sell! \\u2013 Driven by sales and making connections with clients.<\/li><li>Punctuality is essential. Being on time for meetings is very important, both internally and externally!<\/li><li>Having a good work environment is also key at DIWIS. Although we work hard, we also like to enjoy our time together. Therefore, someone that has a good sense of humor will fit in well!<\/li><li>Well-Organized \\u2013 You will be given a list of companies and each one will have different actions and priorities at different times. You will need to set tasks and reminders for yourself in order to stay organized and remember what needs to be done on each account. This requires someone who is highly organized.<\/li><\/ul><p>&nbsp;<\/p><ul><li>Self-motivated and the ability to work remotely \\u2013 We understand that working remotely can be challenging, this is however essential in this internship. Daily communication is done by email and WhatsApp and every week there is a zoom meeting to stay in touch.&nbsp;<\/li><li>We are here to help you at any moment, we will teach you how.&nbsp;<\/li><li>High level of professionalism \\u2013 The clients that we are contacting are high-level professionals, Business Owners, and Governments from different countries, it\\u2019s important for us that you feel comfortable working with different cultures. We need someone who can approach these people with ease and always keep a professional relationship and attitude with them. We also need someone who can take constructive criticism with ease as the purpose of this experience is to learn and you will obviously need to be trained and explained how to correct errors along the way. It is essential that you understand and know how to listen to constructive criticism in order to improve in this position without taking things personally.<\/li><li>&nbsp;**At the moment there isn\\u2019t any monetary compensation. In case you close a sale a commission will be discussed.&nbsp;<\/li><\/ul><p>\\ud835\\udde7\\ud835\\uddff\\ud835\\uddee\\ud835\\ude03\\ud835\\uddf2\\ud835\\uddf9:<\/p><p>At the moment, we don\\u2019t expect to travel to meet clients. Our offices in The Netherlands, Chile, Peru, and Brazil are currently closed, as a result of the COVID-19 situation, we have been conducting business exclusively online and by telephone (Zoom, Skype, Teams, etc.).&nbsp;<\/p><p><br><\/p><p>We are DIWIS International Consultancy.<\/p><p>Connect your Business, Drive Change, and Build the Future!<\/p><p><br><\/p><p><br><\/p><p>&nbsp;<\/p><p><br><\/p>\"}"
}