{
    "id":"Kaggle::techmap::61536e5cd8a8764f488eb35b::monster2_be::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The term \"strongly encourages women to apply\" introduces feminine bias by implying that female candidates will be given preference, which could discourage men from applying as they may think women will be prioritised.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" COMPENSATION: candidates shortlisted will be provided with a simulation of the financial package for this post. Appointment will be subject to receipt of a security clearance (provided by the national Authorities of the selected candidate) and approval of the candidates medical file by the NATO Medical Adviser. ADDITIONAL INFORMATION NATO is committed to diversity and inclusion, and strives to provide equal access to employment, advancement and retention, independent of gender, age, nationality, ethnic origin, religion or belief, cultural background, sexual orientation, and disability. NATO welcomes applications of nationals from all member Nations, and strongly encourages women to apply. Building Integrity is a key element of NATOs core tasks. As an employer, NATO values commitment to the principles of integrity, transparency and accountability in accordance with international norms and practices established for the defence and related security sector. Selected candidates are expected to be role models of integrity, and to promote good governance through ongoing efforts in their work. Due to the broad interest in NATO and the large number of potential candidates, telephone or e-mail enquiries cannot be dealt with. Applicants who are not successful in this competition may be offered an appointment to another post of a similar nature, albeit at the same or a lower grade, provided they meet the necessary requirements. The nature of this position may require the staff member at times to be called upon to travel for work and\/or to work outside normal office hours. The organization offers several work-life policies including Teleworking and Flexible Working arrangements (Flexitime) subject to business requirements. Please note that the International Staff at NATO Headquarters in Brussels, Belgium is a non-smoking environment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61536e5cd8a8764f488eb35b::monster2_be\", \"source\": \"monster2_be\", \"country\": \"BE\", \"company\": \"NATO\", \"position\": \"Assistant Secretary General, Operations\", \"notes\": \"\", \"original\": \"Assistant Secretary General, Operations-210752&nbsp;<b>Primary Location<\/b>&nbsp;Belgium-Brussels<b>NATO Body<\/b>&nbsp;NATO International Staff (NATO IS)<b>Schedule<\/b>&nbsp;Full-time<b><\/b>&nbsp;&nbsp;Euro (EUR)&nbsp;MonthlyGrade&nbsp;Unclassified&nbsp;<b>Description<\/b>:&nbsp;&nbsp;1.SUMMARYThe mission of the Operations Division of the International Staff is to prepare NATO for the defence of Alliance territory, to respond to crises at home and abroad, and to strengthen the capabilities of partners. The Operations Division advances the core tasks of the Alliance (Collective Defence, Crisis Management, Cooperative Security) by providing political oversight of NATO\\u2019s crisis management activities and operations, situational awareness, advance planning, well-exercised and executed crisis response, and outcome-oriented defence and related security cooperation programmes.&nbsp;The Assistant Secretary General (ASG) reports directly to the NATO Secretary General. S\/he is the Secretary General\\u2019s primary advisor on crisis response operations. S\/he is a member of the Secretary General\\u2019s senior management team and will be responsible for managing the OPS Division (approximately 75 staff), and have oversight of the NATO Situation Centre.&nbsp;S\/he will be supported in this task by a Deputy, and two Directors.There are&nbsp;eight ASGs, all of whom report to the NATO Secretary General and are also accountable to the North Atlantic Council. As a member of the Secretary General\\u2019s senior management team, each ASG is also expected to contribute to overall policy development and delivery, including in areas beyond their direct set of responsibilities.2. QUALIFICATIONS AND EXPERIENCEThe candidate must:have at least 15 years of experience working on political-military issues, preferably at a large security policy and defence-related national or multi-national organisation;hold an advanced university degree in a relevant field;have experience working in a multilateral environment or an environment with a variety of stakeholders from multi-cultural backgrounds;have a proven track record of experience in progressively senior leadership positions and significant professional experience in managerial positions;have extensive people management experience and the capacity to lead, motivate and engage diverse and multidisciplinary teams;have extensive experience in the integration of complex political and military issues, ideally to include the politico-military aspects of crisis management or military operations;have a proven track record in facilitating high-level dialogue and consensus;be an innovative, strategic, conceptual thinker and be able to design and use complex influencing strategies to fulfil the required objectives;possess the following minimum levels of NATO\\u2019s official languages (English\/French): VI (\\u201cProficiency\\u201d) in one; I&nbsp;(\\u201cBeginner\\u201d) in the other.DESIRABLEThe following would be considered an advantage:experience in leading change management projects\/programmes;.experience in theater operations.3.ACCOUNTABILITIESThe ASG\/OPS will deal directly with NATO members and partners, as well as other International Organisations, on issues relating to operations and missions. S\/he will work extensively with other NATO bodies, other International Staff Divisions and the International Military Staff, employing cross-cutting approaches on topics relevant to the core areas.The ASG\/OPS is responsible for chairing several senior NATO committees, including the Operations Policy Committee, the Council Operations and Exercise Committee and the Deputies Committee, as required. Experience of facilitating high-level dialogue and consensus is therefore essential. The incumbent will also be called upon to represent the Secretary General at high-level meetings and will speak in public fora and to the Press on behalf of the Secretary General. There is a substantial representation function associated with this appointment.In her\/his role as manager of the Division, the incumbent will lead and oversee a large team of international staff working under the direct supervision of Heads of Sections. Specifically, s\/he will aim to achieve the following objectives:<u>Vision and Direction:<\/u> Develop, communicate and implement a vision for the future development of the Division to face the challenges of the future in an ever-changing environment. Champion change and federate the teams around common objectives, ensuring that vision guides their mid and long-term programme of work. Act as a role model of inclusive leadership and promote integrity, resilience and innovation;<u>Talent attraction:<\/u> Ensure recruitment panels for posts in her\/his Division are fair and objective; make selection recommendations with the best interests of the Organization in mind;<u>Talent development:<\/u> Adhere to sound management principles with staff, and provide in-depth mentoring, coaching and training opportunities; be available for guidance at critical moments; ensure that all divisional staff are clear on organisational and divisional objectives; provide regular and fair feedback on performance, informally as appropriate and via the performance management system;<u>Performance Management:<\/u> Participate in a collegial review of performance at divisional level to discuss possible development and mobility opportunities for individuals, identify high potentials and help ensure common standards are applied in the process across the Organization; make contract renewal or conversion recommendations with the best interests of the Organization in mind;<u>Continual improvement culture:<\/u> Actively contribute to the improvement of the Organizational policies and processes; Participate in leadership learning and development Programmes, related to the successful execution of her\/his duties.4.COMPETENCIESCandidates must demonstrate the following:<b>Achievement:<\/b> Demonstrates decisiveness based on solid considerations and trade-offs.<b>Change Leadership:<\/b> Champions change.<b>Conceptual Thinking:<\/b> Creates new concepts.<b>Developing Others:<\/b> Provides in-depth mentoring, coaching and training.<b>Impact and Influence:<\/b> Uses complex influence strategies.<b>Initiative:<\/b> Plans and acts for the long term.<b>Leadership:<\/b> Communicates a compelling vision.<b>Organizational Awareness:<\/b> Understands underlying issues.<b>Self-Control:<\/b> Stays composed and positive even under extreme pressure.5. KEY CHALLENGESKey challenges facing the successful candidate for ASG\/Ops during the next 3 years will likely include:Developing policy advice on current and future NATO operations and missions, including NATO Mission Iraq, NATO\\u2019s maritime operations, NATO\\u2019s KFOR operation, and NATO\\u2019s participation in the Global Coalition to Defeat Isis;Shaping and helping ensure the successful delivery of a NATO training and capacity building &nbsp;support to a range of partners, including countries aspiring to NATO membership;Ensuring that NATO\\u2019s crisis response planning and decision-making is sufficiently robust and agile to be able to meet current and future challenges from all strategic directions.!In addition to the application form, candidates are expected to submit a Word or pdf document summarising their views on the key&nbsp;(and possible other)&nbsp;challenges, and how they would address them if selected for the position. This essay will be evaluated as part of the longlisting assessment (see full instructions on how to apply below \\u201c7.Recruitment Process\\u201d).6.&nbsp;CONTRACTThe successful applicant will be employed for an initial period of 3 years. Exceptionally, there may be possibility of a one-year extension thereafter.7.&nbsp;RECRUITMENT PROCESS:Applications must be submitted using one of the following links, as applicable:For NATO civilian staff members only: please apply via the internal recruitment portal (for more information, please contact your local Civilian HR Manager);For all other applications: www.nato.int\/recruitmentSelection of candidates for NATO posts is based upon the merit principle.Candidates are requested to attach their essay to their application on Taleo,&nbsp;by latest 7&nbsp;November, 23h59 (CET Brussels time).The title of the attachment must include the vacancy reference&nbsp;<u>210752<\/u>&nbsp;and the words&nbsp;<u>\\u201cKey challenges\\u201d.<\/u>Shortlisted candidates will have to be available&nbsp;for the selection process, which is expected to take place in the week of 13 December, in Brussels, Belgium.COMPENSATION: candidates shortlisted will be provided with a simulation of the financial package for this post.Appointment will be subject to receipt of a&nbsp;security clearance&nbsp;(provided by the national Authorities of the selected candidate) and approval of the candidate\\u2019s&nbsp;medical file&nbsp;by the NATO Medical Adviser.<b>8. ADDITIONAL INFORMATION<\/b>&nbsp;NATO is committed to diversity and inclusion, and strives to provide equal access to employment, advancement and retention, independent of gender, age, nationality, ethnic origin, religion or belief, cultural background, sexual orientation, and disability. NATO welcomes applications of nationals from all member Nations, and strongly encourages women to apply.&nbsp;Building Integrity is a key element of NATO\\u2019s core tasks. As an employer, NATO values commitment to the principles of integrity, transparency and accountability in accordance with international norms and practices established for the defence and related security sector. Selected candidates are expected to be role models of integrity, and to promote good governance through ongoing efforts in their work.&nbsp;Due to the broad interest in NATO and the large number of potential candidates, telephone or e-mail enquiries cannot be dealt with.&nbsp;Applicants who are not successful in this competition may be offered an appointment to another post of a similar nature, albeit at the same or a lower grade, provided they meet the necessary requirements.&nbsp;The nature of this position may require the staff member at times to be called upon to travel for work and\/or to work outside normal office hours.&nbsp;The organization offers several work-life policies including Teleworking and Flexible Working arrangements (Flexitime) subject to business requirements.&nbsp;Please note that the International Staff at NATO Headquarters in Brussels, Belgium is a non-smoking environment.\"}"
}