{
    "id":"Kaggle::techmap::614129a68be8df1fa24b57c0::careerbuilder_us::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Stating a requirement for an \"Undergraduate degree in Accounting from a top school\" could potentially introduce bias by disproportionately favoring candidates from prestigious or elite educational institutions. This might limit the pool of applicants to those who have had the opportunity to attend such schools, potentially excluding equally qualified candidates from less renowned institutions.",
    "verified":true,
    "synthetic":false,
    "text":"Ref ID:00720-0011852850. Classification:Sr. Accountant. Compensation:$80000. 00 to $110000. 00 yearly. CPG Senior Accountant. Our client a Brand Name Fortune 1000 firm in the Consumer Products space continues to expand. This role is a key member of the global accounting team based at the company's corporate headquarters in Norwalk, CT and plays a critical role supporting the significant growth in their US business. This position will be primarily responsible for providing inventory \/ cost accounting support. ensuring compliance with US GAAP and company policies. Individual will also assist with the monthly reporting \/ consolidation process, playing a key role in accelerating close processes and supporting key company initiatives. The firm is known for a professional, team based culture. The role has tons of exposure to the \"C\" Suite and they are also known for promoting from within. For immediate consideration email your resume to ***@roberthalf. TY, Austin Royle. Undergraduate degree in Accounting from a top school, and 3 plus years of accounting experience is necessary. Consumer products industry experience, public accounting \/ audit experience and the CPA are all big pluses. For immediate consideration email your resume to ***@roberthalf. TY, Austin Royle. Robert Half is the world’s first and largest specialized talent solutions firm that connects highly qualified job seekers to opportunities at great companies. We offer contract, temporary and permanent placement solutions for finance and accounting, technology, marketing and creative, legal, and administrative and customer support roles. Robert Half puts you in the best position to succeed by advocating on your behalf and promoting you to employers. We provide access to top jobs, competitive compensation and benefits, and free online training. Download the Robert Half app and get 1-tap apply, instant notifications for AI-matched jobs, and more. Questions? Call your local office at [Phone number shown when applying]. All applicants applying for U. S. job openings must be legally authorized to work in the United States. Benefits are available to contract\/temporary professionals. Visit [Link available when viewing the job] for more information. © 2021 Robert Half. An Equal Opportunity Employer. M\/F\/Disability\/Veterans. By clicking “Apply Now, ” you’re agreeing to Robert Half’s Terms of Use ([Link available when viewing the job]).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614129a68be8df1fa24b57c0::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Robert Half\", \"position\": \"CPG - Senior Accountant\", \"notes\": \"\", \"original\": \"<b>Ref ID: <\/b>00720-0011852850<br \/><br \/><b>Classification: <\/b>Sr. Accountant<br \/><br \/><b>Compensation: <\/b>$80000.00 to $110000.00 yearly<br \/><br \/><p><b>CPG Senior Accountant. <\/b> Our client a Brand Name Fortune 1000 firm in the Consumer Products space continues to expand. This role is a key member of the global accounting team based at the company's corporate headquarters in Norwalk, CT and plays a critical role supporting the significant growth in their US business. This position will be primarily responsible for providing inventory \/ cost accounting support - ensuring compliance with US GAAP and company policies. Individual will also assist with the monthly reporting \/ consolidation process, playing a key role in accelerating close processes and supporting key company initiatives. The firm is known for a professional, team based culture. The role has tons of exposure to the \\\"C\\\" Suite and they are also known for promoting from within. For immediate consideration email your resume to austin.royle@roberthalf. TY, Austin Royle<\/p><p>Undergraduate degree in Accounting from a top school, and 3 plus years of accounting experience is necessary. Consumer products industry experience, public accounting \/ audit experience and the CPA are all big pluses. For immediate consideration email your resume to austin.royle@roberthalf. TY, Austin Royle<\/p><br \/><br \/><p>Robert Half is the world\\u2019s first and largest specialized talent solutions firm that connects highly qualified job seekers to opportunities at great companies. We offer contract, temporary and permanent placement solutions for finance and accounting, technology, marketing and creative, legal, and administrative and customer support roles.<\/p> <p>Robert Half puts you in the best position to succeed by advocating on your behalf and promoting you to employers. We provide access to top jobs, competitive compensation and benefits, and free online training. Stay on top of every opportunity \\u2013 even on the go. Download the Robert Half app and get 1-tap apply, instant notifications for AI-matched jobs, and more.<\/p> <p>Questions? Call your local office at [Phone number shown when applying]. All applicants applying for U.S. job openings must be legally authorized to work in the United States. Benefits are available to contract\/temporary professionals. Visit [Link available when viewing the job] for more information.<\/p> <p>\\u00a9 2021 Robert Half. An Equal Opportunity Employer. M\/F\/Disability\/Veterans. By clicking \\u201cApply Now,\\u201d you\\u2019re agreeing to Robert Half\\u2019s Terms of Use ([Link available when viewing the job]).<\/p>\"}"
}