{
    "id":"Kaggle::techmap::61415d1bd426d634aa3896e1::simplyhired_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" The Amber Foundation offers supported accommodation to homeless, unemployed and disadvantaged young people (aged 16 to 30) who are facing multiple disadvantage including lack of training, education and employment, addiction and substance misuse problems, mental health difficulties and may have been involved in crime and offending behaviour. To maintain excellent working relationships with our existing referrers and build upon these to identify new referral streams. To network with external stakeholders and to market and promote Amber in order to achieve maximum occupancy levels within the centre(s) that you work and reach target for funded placements. To have a professional approach to all work aspects in line with the vision and values of the organisation and maintain all records in line with statutory and local policies and procedures. Location - RN5 5NG. Primary Responsibilities, Tasks and Duties. To maintain an existing referral agencies list and market Amber to new referral sources on an ongoing basis which will involve some regional travel. To ensure that the Centre(s) operate at its minimum targeted occupancy according to the yearly budget. To reach target on funded occupancy set out in the yearly budget. To deal with all initial enquiries by phone, in person or via email. To complete a thorough and comprehensive Risk and Needs Assessment with all potential new residents to assess their suitability and appropriateness for the service, this will involve some regional travel. To ensure that all telephone calls and correspondence to the Admissions department email are answered professionally and promptly. To produce quarterly and ad hoc reports to statutory funders and work alongside colleagues on tender applications for new contracts. To ensure the smooth transition of all new arrivals to the centre, working closely with the Centre Manager(s) and other staff team members as required. To effectively communicate with colleagues, residents and agencies. Building and maintaining open and productive relationships between all parties. To attend team meetings and update all team members on future admissions. To attend networking events and deliver presentations to commissioners and potential referrers. The admissions manager must work towards the Company business plans and complete objectives and achieve targets set for the service. To undertake relevant training that may fall outside of their normal working pattern and hours.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61415d1bd426d634aa3896e1::simplyhired_uk\", \"source\": \"simplyhired_uk\", \"country\": \"UK\", \"company\": \"The Amber Foundation - Charity number 1051388\", \"position\": \"Admissions Manager - Social Care\", \"notes\": \"\", \"original\": \"<p>The Amber Foundation offers supported accommodation to homeless, unemployed and disadvantaged young people (aged 16 to 30) who are facing multiple disadvantage including lack of training, education and employment, addiction and substance misuse problems, mental health difficulties and may have been involved in crime and offending behaviour.<\/p><p>To maintain excellent working relationships with our existing referrers and build upon these to identify new referral streams. To network with external stakeholders and to market and promote Amber in order to achieve maximum occupancy levels within the centre(s) that you work and reach target for funded placements. To have a professional approach to all work aspects in line with the vision and values of the organisation and maintain all records in line with statutory and local policies and procedures.<\/p><ul><li><b>Location - RN5 5NG<\/b><\/li><\/ul><p><b>Primary Responsibilities, Tasks and Duties<\/b><\/p><p>To maintain an existing referral agencies list and market Amber to new referral sources on an ongoing basis which will involve some regional travel.<\/p><p>To ensure that the Centre(s) operate at its minimum targeted occupancy according to the yearly budget<\/p><p>To reach target on funded occupancy set out in the yearly budget.<\/p><p>To deal with all initial enquiries by phone, in person or via email.<\/p><p>To complete a thorough and comprehensive Risk and Needs Assessment with all potential new residents to assess their suitability and appropriateness for the service, this will involve some regional travel.<\/p><p>To ensure that all telephone calls and correspondence to the Admissions department email are answered professionally and promptly.<\/p><p>To produce quarterly and ad hoc reports to statutory funders and work alongside colleagues on tender applications for new contracts.<\/p><p>To ensure the smooth transition of all new arrivals to the centre, working closely with the Centre Manager(s) and other staff team members as required.<\/p><p>To effectively communicate with colleagues, residents and agencies. Building and maintaining open and productive relationships between all parties.<\/p><p>To attend team meetings and update all team members on future admissions.<\/p><p>To attend networking events and deliver presentations to commissioners and potential referrers.<\/p><p>The admissions manager must work towards the Company business plans and complete objectives and achieve targets set for the service.<\/p><p>To undertake relevant training that may fall outside of their normal working pattern and hours.<\/p><p>To maintain high standards of quality and service delivery using a person centred approach that places the dignity and integrity of the individual resident at the forefront of priorities.<\/p><p>Other tasks as required by your line manager which may be required to ensure the smooth and effective running of the service.<\/p><p><b>Review: <\/b> From time to time the demands of the organisation will require adjustments in the responsibilities of the post.<\/p><p><b>Confidentiality: <\/b> The post holder will be expected to maintain strict standards of confidentiality in accordance with Amber\\u2019s terms and conditions of service.<\/p><p><b>Lone Working: <\/b> This post will involve some lone working.<\/p><p>Reference ID: Admissions<\/p><p>Application Deadline: 10\/09\/2021<\/p><p>Expected Start Date: 20\/09\/2021<\/p><p>Job Types: Full-time, Permanent<\/p><p>Salary: \\u00a324,675.00-\\u00a324,676.00 per year<\/p><p>Benefits:<\/p><ul><li>Company pension<\/li><li>Discounted or free food<\/li><li>Life insurance<\/li><li>On-site parking<\/li><li>Private medical insurance<\/li><li>Sick pay<\/li><\/ul><p>Schedule:<\/p><ul><li>8 hour shift<\/li><\/ul><p>COVID-19 considerations:<br \/>regular covid testing, staff are vaccinated, infection control and isolation processes in place<\/p><p>Work remotely:<\/p><ul><li>No<\/li><\/ul>\"}"
}