{
    "id":"Kaggle::techmap::61425df22825612f6f978b84::linkedin_at::0",
    "label_age":true,
    "analysis_age":"The phrase \"This opportunity is not suitable for students\/Recent graduates\" implies a bias against younger individuals or those recently starting their careers. This exclusionary language could deter younger candidates who may possess the entrepreneurial spirit and drive necessary for the role",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase ' Entrepreneurial Spirit, Drive, Motivation, and Desire to Succeed' suggests a masculine bias",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Do you have an Entrepreneurial Spirit, Drive, Motivation, and Desire to Succeed? Do you have 15-20 hours a week to devote a new opportunity to build a business of your own? I partner with a dynamic Sales and Marketing Company in the Personal Development & Success Education industries. We build genuine and long-lasting relationships with clients around the world & provide state-of-the-art tools & training to assist individuals in creating long-term success. We currently have an opportunity available for motivated individuals who are looking to become self-employed & take their careers to new heights. I am looking to connect with like-minded professionals who are:  Big thinkers & desire to earn a Min. of Six Figures. income on an annual bases. Driven & self-motivated. Professionals. Passionate about Personal Development. Possess Leadership qualities. Looking to be the Boss. Looking to create freedom and flexibility in what you do. Speaking English. The Opportunity. Potential to earn an uncapped income part-time from home. Full training and support from experienced industry professionals. Work from home with your laptop and phone. Leadership Development \/ Personal Development Industry. Simple 3 Step Proven System. Unlimited income potential \/ highly profitable \/ no cap on income. Continual learning and expansion via daily training calls and streams. This opportunity is not suitable for students\/ Recent graduates. Min of 2 years working experience. Not available in India. This is an opportunity to be self-employed using a proven business model and strategies. Its an independent contractor opportunity. All the compensation is from the profit of the sale. Interested? Apply Now!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61425df22825612f6f978b84::linkedin_at\", \"source\": \"linkedin_at\", \"country\": \"AT\", \"company\": \"One Life To Make\", \"position\": \"HR & Finance Managers\/ Work Remotely-Online Business\", \"notes\": \"\", \"original\": \"Do you have an Entrepreneurial Spirit, Drive, Motivation, and Desire to Succeed?<br><br>Do you have 15-20 hours a week to devote a new opportunity to build a business of your own? <br><br>I partner with a dynamic Sales and Marketing Company in the Personal Development & Success Education industries. We build genuine and long-lasting relationships with clients around the world & provide state-of-the-art tools & training to assist individuals in creating long-term success.<br><br>We currently have an opportunity available for motivated individuals who are looking to become self-employed & take their careers to new heights. <br><br>I am looking to connect with like-minded professionals who are: <br><br>\\u2705 Big thinkers & desire to earn a Min. of Six Figures+ income on an annual bases <br>\\u2705 Driven & self-motivated<br>\\u2705 Professionals <br>\\u2705 Passionate about Personal Development <br>\\u2705 Possess Leadership qualities<br>\\u2705 Looking to be the Boss <br>\\u2705Looking to create freedom and flexibility in what you do <br>\\u2705Speaking English. <br><br>The Opportunity<br>\\u2705 Potential to earn an uncapped income part-time from home<br>\\u2705 Full training and support from experienced industry professionals<br>\\u2705 Work from home with your laptop and phone<br>\\u2705 Leadership Development \/ Personal Development Industry<br>\\u2705 Simple 3 Step Proven System<br>\\u2705 Unlimited income potential \/ highly profitable \/ no cap on income<br>\\u2705 Continual learning and expansion via daily training calls and streams<br><br>This opportunity is not suitable for students\/ Recent graduates. Min of 2 years working experience. <br><br>Not available in India.<br><br>This is an opportunity to be self-employed using a proven business model and strategies. It\\u2019s an independent contractor opportunity; all the compensation is from the profit of the sale. <br><br>Interested? Apply Now!\"}"
}