{
    "id":"Kaggle::techmap::613b71fc53aaed6b24ebad8f::linkedin_ch::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description. Principal Customer Solutions Manager. As an Amazon Web Services (AWS) Principal Customer Solutions Manager you will be responsible for helping to guide the largest and most complex AWS Swiss customers along their multi-year journey to the cloud. In this new, highly visible position you will ensure that all AWS teams are working together effectively and efficiently to deliver outcomes for the customer. In the role, you will be a critical partner to our Swiss customers, leveraging your delivery experience with large scale transformations and helping shepherd them through their stages of AWS adoption. Guiding the customer through the operational, educational and governance aspects of a successful AWS cloud journey. You will interface with customer and AWS leadership, driving collaboration between the other core account groups (Account Management, Support, Solutions Architecture and Professional Services), product\/engineering teams, and customer teams, planning and supporting major workload migrations. You will translate strategic initiatives in the account plan into executable actions, working backwards from our customers key milestones. The execution of education plans, roadmap to business outcome alignments, Executive Briefing Sessions, and go-live events and transitions are a few items owned by the CSM that are critical to the success of our customer’s cloud journey. At AWS, you are encouraged to think big, invent and take ownership on customer challenges. You will not only bring the best of AWS\/ Amazon to our customers, you will proactively help solve the customer’s challenges through new ideas, tools and mechanisms. You will be a peer leader, have the ability to gain stakeholder buy-in, negotiate and lead virtual teams. Your enterprise experience and operational excellence will influence the team’s decisions, provide insight, and help drive secure and robust solutions. You will evangelize AWS services and influence customers for adopting them. You should be passionate about delivering a great customer experience by deploying AWS solutions and inspiring innovation. You will be obsessed with contributing to the day-to-day management of your customers successful adoption of AWS. Do you look around corners for ways to engage and service customers? Are you passionate about using technology to solve business problems that have big customer impact? Come build the future with us. Basic Qualifications. Experience leading complex, large scale. IT\/digital\/business transformation programs. Experience in a senior customer facing role.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613b71fc53aaed6b24ebad8f::linkedin_ch\", \"source\": \"linkedin_ch\", \"country\": \"CH\", \"company\": \"Amazon Web Services (AWS)\", \"position\": \"Principal Customer Solutions Manager\", \"notes\": \"\", \"original\": \"<strong><u>Description<br><br><\/u><\/strong>Principal Customer Solutions Manager<br><br>As an Amazon Web Services (AWS) Principal Customer Solutions Manager you will be responsible for helping to guide the largest and most complex AWS Swiss customers along their multi-year journey to the cloud. In this new, highly visible position you will ensure that all AWS teams are working together effectively and efficiently to deliver outcomes for the customer.<br><br>In the role, you will be a critical partner to our Swiss customers, leveraging your delivery experience with large scale transformations and helping shepherd them through their stages of AWS adoption. Guiding the customer through the operational, educational and governance aspects of a successful AWS cloud journey.<br><br>You will interface with customer and AWS leadership, driving collaboration between the other core account groups (Account Management, Support, Solutions Architecture and Professional Services), product\/engineering teams, and customer teams, planning and supporting major workload migrations. You will translate strategic initiatives in the account plan into executable actions, working backwards from our customers key milestones. The execution of education plans, roadmap to business outcome alignments, Executive Briefing Sessions, and go-live events and transitions are a few items owned by the CSM that are critical to the success of our customer\\u2019s cloud journey.<br><br>At AWS, you are encouraged to think big, invent and take ownership on customer challenges. You will not only bring the best of AWS\/ Amazon to our customers, you will proactively help solve the customer\\u2019s challenges through new ideas, tools and mechanisms.<br><br>Successful candidates will have a strong delivery and change management background, be detail oriented, have excellent problem-solving abilities, and be exemplary communicators both at the executive and project team level. You will be a peer leader, have the ability to gain stakeholder buy-in, negotiate and lead virtual teams. Your enterprise experience and operational excellence will influence the team\\u2019s decisions, provide insight, and help drive secure and robust solutions.<br><br>You will evangelize AWS services and influence customers for adopting them. You should be passionate about delivering a great customer experience by deploying AWS solutions and inspiring innovation. You will be obsessed with contributing to the day-to-day management of your customers successful adoption of AWS.<br><br>Do you look around corners for ways to engage and service customers? Are you passionate about using technology to solve business problems that have big customer impact?<br><br>Come build the future with us.<br><br><br><strong><u>Basic Qualifications<br><\/u><\/strong><ul><li> Experience leading complex, large scale. IT\/digital\/business transformation programs<\/li><li> Experience in a senior customer facing role<\/li><li> Superior written and verbal communication skills, including a demonstrated ability to effectively deliver information to c-suite\/VP level<\/li><li> Strong organizational and troubleshooting skills with precise attention to detail<\/li><li> Business fluent English language skills<br><\/li><\/ul><strong><u>Preferred Qualifications<br><\/u><\/strong><ul><li> PMP, Prince 2, PgMP, SAFe, or SCRUM\/Agile certified<\/li><li> Direct experience implementing AWS\/cloud services<\/li><li> Deep understanding of software development\/engineering lifecycle from conception to delivery<\/li><li> Demonstrated leadership through influence<\/li><li> Working experience as a SCRUM master or leading a SAFe program<\/li><li> Prior experience working in a Technology sales organization<\/li><li> Business fluent German and\/ or French language skills<br><\/li><\/ul>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https:\/\/www.amazon.jobs\/en\/privacy\/eu ) to know more about how we collect, use and transfer the personal data of our candidates.<br><br>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify, and build.<br><br><br><strong>Company<\/strong> - AWS EMEA SARL (Switzerland)<br><br>Job ID: A1676086\"}"
}