{
    "id":"Kaggle::techmap::615612f4a6740c534abc5119::monster_ca::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The job description outlines essential physical functions that are necessary to perform the role effectively, such as building maintenance and equipment repair, which are inherent requirements of the position and do not constitute disability bias.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description Overview: The main purpose of the job is to support and assist the responsible manager to maintain a safe environment. The key role would be to repair and maintenance of equipment. Reporting to the Engineering Manager, the Maintenance Technician will follow task lists that give direction to tasks within the resort. Responsibilities: Perform preventive maintenance on guestrooms per checklist and maintain all records. Perform building maintenance duties. Perform preventive maintenance on equipment\/tools when needed. Display basic knowledge or ability to acquire knowledge in the following categories: air conditioning and refrigeration, electrical, mechanical, plumbing, pneumatic\/electronic systems and controls, carpentry and finish skills, kitchen equipment, vehicles, energy conservation, and\/or general building. Perform all surface preparation, painting, minor drywall and wood trim repair, light bulb and A\/C filter replacement and the complete and thorough clean-up of the painting or repair area. Test, troubleshoot and perform basic repair on all types of equipment, plumbing (e. g., plunge toilets and unclog drains), electrical components including lamps, cosmetic items, extension cords, vacuum cleaners, internet devices, replace electrical switches and outlets, and other guestroom items. Fire Alarm\/Life Safety System. to monitor systems as necessary. To act as quickly and responsibly as possible to return the building to its normal operating status. To inform Engineering Management of any such emergencies. Records. to read, log, track and interpret readings from meters, gauges and other measuring units. To maintain a thorough log of each daya€s activities and problems that occur and to ensure this information is passed on to other shifts. Departmental Duties. to clean all engineering areas as directed by Engineering Management. To work in a neat and efficient manner, keeping work areas clean and well organized. To serve as otherwise directed or needed to help maintain the effective and efficient operation of the resort. Each associate is expected to carry out, within their capabilities, all reasonable requests by management. To look out for the safety of yourself, co-workers and to follow all Health and Safety requirements in the workplace. All other duties as assigned. Qualifications: High school diploma or equivalent preferred. Emphasis in Technical Trades, one or more yearsa€ experience in a Technical Trade. Must hold a valid Alberta Drivera€s License. Clear drivers abstract.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615612f4a6740c534abc5119::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"River Cree Resort & Casino\", \"position\": \"Maintenance Technician\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Overview: <p style=\\\"margin:0px\\\">The main purpose of the job is to support and assist the responsible manager to maintain a safe environment. The key role would be to repair and maintenance of equipment. &nbsp;<\/p> <p style=\\\"margin:0px\\\">Reporting to the Engineering Manager, the Maintenance Technician will follow task lists that give direction to tasks within the resort.<\/p>Responsibilities: <ul> <li style=\\\"margin-left:0.25in\\\">Perform preventive maintenance on guestrooms per checklist and maintain all records.<\/li> <li style=\\\"margin-left:0.25in\\\">Perform building maintenance duties<\/li> <li style=\\\"margin-left:0.25in\\\">Perform preventive maintenance on equipment\/tools when needed.<\/li> <li style=\\\"margin-left:0.25in\\\">Display basic knowledge or ability to acquire knowledge in the following categories: air conditioning and refrigeration, electrical, mechanical, plumbing, pneumatic\/electronic systems and controls, carpentry and finish skills, kitchen equipment, vehicles, energy conservation, and\/or general building.<\/li> <li style=\\\"margin-left:0.25in\\\">Perform all surface preparation, painting, minor drywall and wood trim repair, light bulb and A\/C filter replacement and the complete and thorough clean-up of the painting or repair area.<\/li> <li style=\\\"margin-left:0.25in\\\">Test, troubleshoot and perform basic repair on all types of equipment, plumbing (e.g., plunge toilets and unclog drains), electrical components including lamps, cosmetic items, extension cords, vacuum cleaners, internet devices, replace electrical switches and outlets, and other guestroom items.<\/li> <li style=\\\"margin-left:0.25in\\\">Fire Alarm\/Life Safety System- to monitor systems as necessary.<\/li> <li style=\\\"margin-left:0.25in\\\">To act as quickly and responsibly as possible to return the building to its normal operating status. To inform Engineering Management of any such emergencies.<\/li> <li style=\\\"margin-left:0.25in\\\">Records - to read, log, track and interpret readings from meters, gauges and other measuring units. To maintain a thorough log of each day\\u00e2\\u20ac\\u2122s activities and problems that occur and to ensure this information is passed on to other shifts. &nbsp; <\/li> <li style=\\\"margin-left:0.25in\\\">Departmental Duties - to clean all engineering areas as directed by Engineering Management. To work in a neat and efficient manner, keeping work areas clean and well organized. &nbsp; To serve as otherwise directed or needed to help maintain the effective and efficient operation of the resort.<\/li> <li style=\\\"margin-left:0.25in\\\">Each associate is expected to carry out, within their capabilities, all reasonable requests by management.<\/li> <li style=\\\"margin-left:0.25in\\\">To look out for the safety of yourself, co-workers and to follow all Health and Safety requirements in the workplace.<\/li> <li style=\\\"margin:0in 0in 8pt 0.25in\\\">All other duties as assigned<\/li> <\/ul>Qualifications: <ul> <li style=\\\"color:#000000\\\">High school diploma or equivalent preferred<\/li> <li style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\">Emphasis in Technical Trades, one or more years\\u00e2\\u20ac\\u2122 experience in a Technical Trade<\/li> <li style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\">Must hold a valid Alberta Driver\\u00e2\\u20ac\\u2122s License<\/li> <li style=\\\"margin:0in 0in 0pt;color:#000000\\\">Clear drivers abstract<\/li> <\/ul> <p style=\\\"color:#000000\\\">This position requires proficiency in any one of the following categories, average skills in two more of the following categories and basic skills in the remaining categories.<\/p> <ul> <li> <div style=\\\"color:#000000\\\"> Air Conditioning and Refrigeration <\/div><\/li> <li> <div style=\\\"color:#000000\\\"> Electrical <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'times new roman' , serif;font-size:12pt;margin-top:0in;margin-bottom:0pt\\\"> Mechanical <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\"> Plumbing <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\"> Pneumatic\/Electronic Systems &amp; Controls <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\"> Carpentry &amp; Finish Skills <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\"> Kitchen Equipment <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:10pt\\\"> Vehicles <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\"> Energy Conservation <\/div><\/li> <li> <div style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\"> General Building <\/div><\/li> <\/ul> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">The schedule for this position may vary and would require the ability to work shift work, late nights, weekends and holidays.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>WE OFFER<\/strong><\/p> <ul> <li><strong> &nbsp;<\/strong>A competitive wage and excellent benefits. <\/li> <li>Shuttle service from West Edmonton location. <\/li> <li>All associates participate in our \\u00e2\\u20ac\\u0153Circle of Service\\u00e2\\u20ac program which rewards and empowers individuals who provide outstanding customer service. <\/li> <li>An opportunity to work within a progressive, exciting team environment.<\/li> <li>An opportunity to work with a skilled Management team.<\/li> <\/ul> <p style=\\\"color:#000000;font-family:'arial' , sans-serif;font-size:11pt\\\"> &nbsp;<\/p> <\/div>\"}"
}