{
    "id":"Kaggle::techmap::61476882a4a0b32abd56aa71::britishjobs_uk::14",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"This top 50 firm, who are well known for their recent expansions and ambitious nature, are innovative, dynamic and pioneering in the work that they do. This opportunity is for Associates looking to develop their knowledge and experience in a leading Real Estate practice in Leeds. You will have exposure to high value work from a top tier client base. The Firm. This top 50 ranked and top tier in a number of areas in the legal 500. They are multi-award winning, and just recently they won the award for legal employer of the year at a prestigious industry awards ceremony. The firm are innovative, forward-thinking and what really stands them apart is, despite their size they have a truly people focused approach. There is no better example of this than there growing number of home-grown Partners, the firm have a reputation throughout the industry for nurturing and developing legal talent. The firm have an impressive client base, which has a growing number of FTSE 250 companies. The practice now stands at over 10 offices nationally, with plans for a new office launch in the near future. You will also find that they have access to a global network, which gives them competitive edge. You will find a supportive culture, where Partners are accessible to all. The firm have a strong leadership team and ambitious plans to continue to take more market share, making now an exciting time to join the firm. The Role. You will work as part of a highly ranked legal 500 team. The team is busy and has had an influx of new work, making now an exciting time to join. The firm's national Commercial Property team advises on all aspects of the commercial property life-cycle, from acquisition and development through to asset management and disposal. and all in between. They have a broad spectrum of clients including developers, investors, retailers, lending institutions, registered providers, local authorities, charities, healthcare organisations and business occupiers. Acting for household name clients, this role will give you the opportunity to run with smaller matters on your own as well as work closely alongside Partners in the national team on larger scale. You will find a real level of variety to the deals, making for an interesting role. You will receive an excellent level of exposure, and given their level of growth, good prospects are in abundance. Requirements.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61476882a4a0b32abd56aa71::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"The Legists Ltd\", \"position\": \"Real Estate Solicitor\", \"notes\": \"\", \"original\": \"This top 50 firm, who are well known for their recent expansions and ambitious nature, are innovative, dynamic and pioneering in the work that they do. This opportunity is for Associates looking to develop their knowledge and experience in a leading Real Estate practice in Leeds. You will have exposure to high value work from a top tier client base.<br><br>The Firm<br><br>This top 50 ranked and top tier in a number of areas in the legal 500. They are multi-award winning, and just recently they won the award for legal employer of the year at a prestigious industry awards ceremony.<br><br>The firm are innovative, forward-thinking and what really stands them apart is, despite their size they have a truly people focused approach. There is no better example of this than there growing number of home-grown Partners, the firm have a reputation throughout the industry for nurturing and developing legal talent.<br><br>The firm have an impressive client base, which has a growing number of FTSE 250 companies. The practice now stands at over 10 offices nationally, with plans for a new office launch in the near future. You will also find that they have access to a global network, which gives them competitive edge.<br><br>You will find a supportive culture, where Partners are accessible to all. The firm have a strong leadership team and ambitious plans to continue to take more market share, making now an exciting time to join the firm.<br><br>The Role<br><br>This Top 50 firm are looking for a Real Estate Associate to join them in their Legal 500 ranked and Chambers ranked department within their Leeds office.<br><br>You will work as part of a highly ranked legal 500 team. The team is busy and has had an influx of new work, making now an exciting time to join.<br><br>The firm&#39;s national Commercial Property team advises on all aspects of the commercial property life-cycle, from acquisition and development through to asset management and disposal - and all in between. They have a broad spectrum of clients including developers, investors, retailers, lending institutions, registered providers, local authorities, charities, healthcare organisations and business occupiers.<br><br>Acting for household name clients, this role will give you the opportunity to run with smaller matters on your own as well as work closely alongside Partners in the national team on larger scale.<br><br>You will find a real level of variety to the deals, making for an interesting role. You will receive an excellent level of exposure, and given their level of growth, good prospects are in abundance.<br><br>Requirements<br><br>* You will be a Real Estate Associate with a minimum of 1 years&#39; experience<br>* Background in a firm with an excellent reputation in the field of commercial property law<br>* Excellent academic and professional qualifications<br>* You will be a team player with excellent attention to detail.<br>* The ability to confidentially manage your own caseload of high calibre work and clients<br><br>Renumeration<br><br>* Salary is competitive and negotiable depending on your level of experience, on offer is an excellent benefits package and very lucrative bonus scheme<br><br>This is an exciting opportunity for a Real Estate Associate to join this top tier firm based in the centre of Leeds.<br><br>Apply now for immediate consideration or feel free to give me a call for a confidential conversation.<br><br>\"}"
}