{
    "id":"Kaggle::techmap::615609b7a6740c534abc1c7d::monster_ca::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The physical requirements, while potentially limiting, appear to be directly related to the essential functions and safety needs of the industrial electrical maintenance role, and do not demonstrate explicit disability bias.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Safe work practices. Knowledge of computer software including but not limited to Microsoft Word, Excel, Outlook, data management systems and be able to operate plant PLCrsquo. S and SCADA systems. Additional post-secondary training will be considered an asset. Conditions amp. Physical Requirements. All work will be completed in the area surrounding Fort McMurray. Workers local to Fort Mc. Murray will be given preference. Work schedules will be a 14-on\/14-off, 12-hour work days. Night shifts could also be required on a rotational basis. The work area can involve a working environment indoors as well as outdoors, which could cause exposure to outdoor elements. Some areas can have loud noise, active machinery, high pressure fluid systems, electrical equipment, confined spaces, heights and depths, fumes, air borne particles, noxious gases, pathogens and various chemicals. The use of appropriate safety equipment will be mandatory in these areas to prevent hazardous contact. Must be able to sit, stand, stoop, twist and bend at the waist, turn, kneel, squat, raise arms above shoulder height, grasp, reach, perform repetitive hand movements and fine coordination to work on electrical equipment. Have vision sufficient to perform electrical maintenance. Have hearing in the normal range with or without correction. In a 12-hour shift must be able to transport self across the facility, ascend and descend stair steps, lift objects up to 50 pounds from floor level to waist height, climb and work off of a ladder or scaffold and climb into and out of vehicles having high ground clearance. Use arms and back to tighten and loosen nuts and bolts. Carry a 50 pound tool box up a flight of stairs. Work in confined spaces and wear and use appropriate safety equipment. Night and weekend shift rotation could be required. What we offer you Providing an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity. Our policy is to conduct background checks for all candidates who accept an offer of employment with us. If you have the passion and talent to keep up, it39. S time to test the limits of what you can become. Find your future with Worley.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615609b7a6740c534abc1c7d::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"WorleyParsons\", \"position\": \"Plant Shift Supervisor - (Job Number: FOR00LJ)\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Plant Shift Supervisor <br> <br><strong>Company:<\/strong> Worley <br><strong>Primary Location:<\/strong> CAN-AB-Fort McMurray <br><strong>Job:<\/strong> Plant Operations&lt; <br><strong>Schedule:<\/strong> Full-time <br><strong>Employment Type:<\/strong> Employee <br><strong>Job Level:<\/strong> Experienced&lt; <br><strong>Job Posting:<\/strong> Sep 21, 2021 <br><strong>Unposting Date:<\/strong> Oct 22, 2021 <br><strong>Reporting Manager Title:<\/strong> Manager <p style=\\\"margin-bottom:0px;font-family:'arial'\\\"><em><strong>48,000 people. 49 countries. Over 120 office locations.<\/strong><\/em><br><em>Wersquo;re not just engineers. Wersquo;re a global team of data scientists, consultants, construction workers andinnovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals andresources get one step closer to solving our planetrsquo;s toughest issues. Climate change. The energy transition.Digital transformation. And how we can deliver a more sustainable world.?<\/em><\/p> <br> <p style=\\\"margin-bottom:0px;font-family:'arial'\\\"><em>Whatever your ambition, therersquo;s a path for you here. And therersquo;s no barrier to your potential career success. For more information, visit Worley.com<\/em><\/p> <div style=\\\"border-bottom:dotted black 1.5pt;padding:0in 0in 6pt 0in\\\"> <ol start=\\\"7\\\" style=\\\"list-style-type:lower-alpha\\\"> <li style=\\\"border:none;padding:0in;margin-top:11px;margin-bottom:5px\\\" value=\\\"1907042656\\\">Duties and Responsibilities <\/li> <\/ol> <\/div> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">General<\/p> <ul> <li style=\\\"margin-bottom:13px\\\">Lead by example<\/li> <li style=\\\"margin-bottom:13px\\\">Provide consistency<\/li> <li style=\\\"margin-bottom:13px\\\">Deal with issues quickly<\/li> <li style=\\\"margin-bottom:13px\\\">Acknowledge others for good work<\/li> <\/ul> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">Safety<\/p> <ul> <li style=\\\"margin-bottom:13px\\\">Hold the team collectively and each team member individually accountable for engagement in safety and safety performance<\/li> <li style=\\\"margin-bottom:13px\\\">Act decisively on HSE issues by taking appropriate and timely action and engaging the appropriate resources<\/li> <\/ul> <ul> <li style=\\\"margin-bottom:13px\\\">Promote emphasis on safety<\/li> <li style=\\\"margin-bottom:13px\\\">Comply with policies and procedures<\/li> <li style=\\\"margin-bottom:13px\\\">Monitor crews for safe work practices<\/li> <li style=\\\"margin-bottom:13px\\\">Correct and coach unsafe acts\/conditions<\/li> <li style=\\\"margin-bottom:13px\\\">Actively participate in daily\/weekly safety meetings<\/li> <li style=\\\"margin-bottom:13px\\\">Ensure JHAs and FLHAs are completed with input from all workers involved in the task<\/li> <li style=\\\"margin-bottom:13px\\\">Review Safe Work Permits, FLHAs, JHAs, HazIDs, etc. for completeness and accuracy<\/li> <li style=\\\"margin-bottom:13px\\\">Complete at least two Leadership Activities per day<\/li> <\/ul> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">Planning<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Ensure appropriate resources to safely execute the work<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Ability to organize work teams, recognize problems and develop solutions<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Ensure employees are trained and qualified for their assigned tasks<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Have a clear understanding of the daily work scope<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Ensure required forms\/documents are readily available<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">Communication<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Listen and act ndash; engage team in mitigation plans for identified risks<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Communicate with area work coordinator to ensure work tasks are prioritized properly<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Communicate with supervision\/management to discuss work scope changes and\/or issues<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Document occurrences concerning employee issues, client relations, etc.<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Provide routine oral\/written feedback regarding individual and team performance<\/p> <div style=\\\"border-bottom:dotted black 1.5pt;padding:0in 0in 6pt 0in\\\"> <ol start=\\\"2\\\" style=\\\"list-style-type:lower-roman\\\"> <li style=\\\"border:none;padding:0in;margin-top:11px;margin-bottom:5px\\\" value=\\\"149254903463\\\">Responsibilities<\/li> <\/ol> <\/div> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Direct operators and work with maintenance on tasks and areas of responsibility for the day<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Oversee operations and maintenance activities in the field and onsite labs<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Interface with client and other contractors as needed for daily activities<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Other activities as assigned by management<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; On-call after regular working hours while on shift to support operations and maintenance issues in the facilities<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Lead daily toolbox meeting<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Act as permit issuer for Worley operated facilities, if required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Review operating data to ensure facility compliance<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Manage Supervisor email account and review third party lab emails<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Sample Receipt Confirmations (Job Confirmation Reports) to be reviewed and saved electronically<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Certificate of Analyses (Final Reports) to be reviewed, added to operations database and saved electronically<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Ensure that operations and maintenance work orders are completed thoroughly and in a timely manner<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Lead activities related to facility operational issues<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Provide back-up to operators as required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Complete two Leadership Activities per day by engaging with operations and maintenance in the field<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Perform refresher presentations of Safety Training during morning toolbox meetings on a regular basis<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Respond to maintenance Service Requests from Operators and Input Work Orders in CMMS<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Place bottle orders with third party lab as required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Order process chemicals as required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Order safety equipment and operations materials as required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Complete crossover notes (Weekly Summary) to document the main events from the week<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Create monthly facility reports as required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Approve timesheets for direct reports and others as required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Engage with employees during Team Meetings to provide status of present and future projects, maintenance, and corporate announcements<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Manage schedule changes and assignments for coverage due to vacation, sick time, training, etc. in cooperation with management<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Create written plans for facility operations and maintenance initiatives<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Review existing Standard Operating Procedures (SOPs) and create new SOPs when required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Update operations data management system when required<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Other tasks as assigned by the Project Manager<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Support creation of annual reports<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">bull; Lead annual performance reviews for direct reports and others as required<\/p> <div style=\\\"border-bottom:dotted black 1.5pt;padding:0in 0in 6pt 0in\\\"> <ol style=\\\"list-style-type:lower-roman\\\"> <li style=\\\"border:none;padding:0in;margin-top:11px;margin-bottom:5px\\\" value=\\\"469355\\\">Qualifications<\/li> <\/ol> <\/div> <ul> <li style=\\\"margin-bottom:13px\\\">High school diploma or GED<\/li> <li style=\\\"margin-bottom:13px\\\">Certification at Water Treatment and Wastewater Treatment Level II or higher in the province of Alberta, Canada <\/li> <li style=\\\"margin-bottom:13px\\\">Five years experience minimum in operating water\/wastewater treatment plants<\/li> <li style=\\\"margin-bottom:13px\\\">Possess a valid driverrsquo;s license<\/li> <\/ul> <div style=\\\"border-bottom:dotted black 1.5pt;padding:0in 0in 6pt 0in\\\"> <ol start=\\\"16\\\" style=\\\"list-style-type:lower-alpha\\\"> <li style=\\\"border:none;padding:0in;margin-top:11px;margin-bottom:5px\\\" value=\\\"3270243949912\\\">Qualifications<\/li> <\/ol> <\/div> <ul> <li style=\\\"margin-bottom:13px\\\">Detailed understanding of the principles and practices of water\/wastewater treatment plant operations; operating principles of valves, pumps, and motors; principles and methods of bacteriological and chemical sewage analyses; effects and problems of industrial waste in water\/wastewater treatment processes; safe work practices<\/li> <li style=\\\"margin-bottom:13px\\\">Knowledge of computer software including but not limited to Microsoft Word, Excel, Outlook, data management systems and be able to operate plant PLCrsquo;s and SCADA systems<\/li> <li style=\\\"margin-bottom:13px\\\">Additional post-secondary training will be considered an asset<\/li> <\/ul> <div style=\\\"border-bottom:dotted black 1.5pt;padding:0in 0in 6pt 0in\\\"> <ol style=\\\"list-style-type:lower-roman\\\"> <li style=\\\"border:none;padding:0in;margin-top:11px;margin-bottom:5px\\\" value=\\\"6970436441\\\">Conditions amp; Physical Requirements<\/li> <\/ol> <\/div> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">All work will be completed in the area surrounding Fort McMurray. Workers local to Fort McMurray will be given preference. Work schedules will be a 14-on\/14-off, 12-hour work days. Night shifts could also be required on a rotational basis.<\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">The work area can involve a working environment indoors as well as outdoors, which could cause exposure to outdoor elements. Some areas can have loud noise, active machinery, high pressure fluid systems, electrical equipment, confined spaces, heights and depths, fumes, air borne particles, noxious gases, pathogens and various chemicals. The use of appropriate safety equipment will be mandatory in these areas to prevent hazardous contact. <\/p> <br> <p style=\\\"margin-bottom:13px;font-family:'arial'\\\">Must be able to sit, stand, stoop, twist and bend at the waist, turn, kneel, squat, raise arms above shoulder height, grasp, reach, perform repetitive hand movements and fine coordination to work on electrical equipment; have vision sufficient to perform electrical maintenance; have hearing in the normal range with or without correction. In a 12-hour shift must be able to transport self across the facility, ascend and descend stair steps, lift objects up to 50 pounds from floor level to waist height, climb and work off of a ladder or scaffold and climb into and out of vehicles having high ground clearance; use arms and back to tighten and loosen nuts and bolts; carry a 50 pound tool box up a flight of stairs; work in confined spaces and wear and use appropriate safety equipment. Night and weekend shift rotation could be required.<\/p> <div><\/div> <div> <strong style=\\\"font-size:small\\\"><em><u>What we offer you<\/u><\/em><\/strong> <\/div> <div> <p style=\\\"font-family:'arial'\\\"><em>Providing an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.<\/em><br><em><\/em><\/p> <br> <p style=\\\"font-family:'arial'\\\"><em>Our policy is to conduct background checks for all candidates who accept an offer of employment with us.<\/em><\/p><strong><em>If you have the passion and talent to keep up, it#39;s time to test the limits of what you can become. Find your future with Worley.<\/em><\/strong> <\/div> <\/div>\"}"
}