{
    "id":"Kaggle::techmap::6148ddb44ca8eb4d9076a4b8::seek_au::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":"\"This position is only available to women\". Despite this phrase, it seems the role has special status under the law. ",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Demonstrated experience and working knowledge of the community services sector in NSW with a specific emphasis on family\/domestic violence and homelessness. Demonstrated experience building and maintaining collaborative relationships with key service providers. Experience in Trauma-Informed Care and Power threat meaning philosophy and approaches are desired. A valid Working with Children's Check. A current Senior First Aid Certificate. A current Driver's licence. A willingness to undergo a National Police check. What we offer. As a registered not for profit organisation in addition to your remuneration you will enjoy generous tax-free salary packaging benefits. Employee Assistance Program for you and your immediate family members. Corporate Private Health Insurance rates. Supportive and encouraging organisation. Please Note: The filling of this employment opportunity is intended to constitute a special measure under the Equal Opportunity Act 2010. This position is only available to women. For more information about SWACS please see the Family Violence information on our website: httpssalvos. org. au [link removed]. TSA Social Mission embraces diversity and encourages applications from. Aboriginal and Torres Strait Islander people,. people who identify as Lesbian, Gay, Bisexual, Transgender or Intersex. people with a culturally or linguistically diverse background. The Salvation Army is an Equal Opportunity Employer who provides an inclusive work environment and embraces the diverse talent of its people. The Salvation Army is a child safe organisation that is committed to ensuring the wellbeing of children and young people, and protecting them from harm. All child facing roles will require the successful completion of a Working with Children Check. Applicants for all other roles require a mandatory National Police Check. We value Integrity, Compassion, Respect, Diversity, and Collaboration.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148ddb44ca8eb4d9076a4b8::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"The Salvation Army\", \"position\": \"Women & Families Case Manager\", \"notes\": \"\", \"original\": \"<p><strong>Start your career with The Salvation Army today!<\/strong><\/p><p>We are looking for compassionate people who share our mission and values, if you have the passion and drive to commit yourself to a challenging and rewarding role; we invite you to review our current vacancies.<\/p><p><strong>ABOUT US<\/strong><\/p><p><strong>The Salvation Army is a Christian movement and one of Australia's largest and most-loved charities, helping thousands of Australians every year find hope in the midst of all kinds of personal hardship. The Salvation Army offers the opportunity to use your professional skills and expertise to make a real difference in the lives of people who need help most.<\/strong><\/p><p>The Salvation Army Australia's Family Violence Stream provides a wide range of services around the country to support women and women with children impacted by family and domestic violence. We offer refuge, children's and parenting services, counselling, support, men's programs, accommodation and advice to women and children who are experiencing, or who have experienced, family violence.<br \/> <br \/> Samaritan Women and Children Services will work as one team with a person-centred, safe and coordinated approach to service delivery to ensure the best outcome for all who seek our assistance.<br \/> <br \/> We are seeking a values-driven and dedicated Women and Families Case Manager, reporting to the Program Manager. You will assess, refer and ascertain the level of support required and provide case management support to women and families experiencing domestic and family abuse and experiencing homelessness to achieve housing stability, improve social inclusion and be equipped for participation in the wider community.<br \/> <br \/> This is a permanent full-time position based in Surry Hills.<br \/> <br \/> <strong>You will successfully<\/strong><\/p><ul><li>Offer appropriate and high-quality support to individuals experiencing family and domestic abuse or at risk of homelessness<\/li><li>Provide client-centred case management frameworks including relationship building<\/li><li>Manage case loads as allocated by the program manager<\/li><li>Ensure service orientation is conducted at all persons accepted as clients<\/li><li>Adhere to KPI's provided to case managers for the service<\/li><li>Uphold individual's rights providing advocacy on behalf of residents to internal and external organisations<\/li><li>Maintain and develop personal knowledge in the area of expertise as well as Family and Domestic abuse<\/li><\/ul><p><br \/> <strong>You will have<\/strong><\/p><ul><li>Tertiary qualifications (min. Diploma) in Community Services, Social Work or related disciplines<\/li><li>Minimum one (1) year experience in case management role<\/li><li>Demonstrated experience and working knowledge of the community services sector in NSW with a specific emphasis on family\/domestic violence and homelessness<\/li><li>Demonstrated experience building and maintaining collaborative relationships with key service providers<\/li><li>Experience in Trauma-Informed Care and Power threat meaning philosophy and approaches are desired<\/li><li>A valid Working with Children's Check<\/li><li>A current Senior First Aid Certificate<\/li><li>A current Driver's licence<\/li><li>A willingness to undergo a National Police check<br \/><br \/><\/li><\/ul><p><strong>What we offer<\/strong><\/p><ul><li>As a registered not for profit organisation in addition to your remuneration you will enjoy generous tax-free salary packaging benefits<\/li><li>Employee Assistance Program for you and your immediate family members<\/li><li>Corporate Private Health Insurance rates<\/li><li>Supportive and encouraging organisation<br \/><br \/><\/li><\/ul><p><strong>Please Note:<\/strong><br \/><strong>The filling of this employment opportunity is intended to constitute a special measure under the Equal Opportunity Act 2010. This position is only available to women.<\/strong><\/p><p>For more information about SWACS please see the Family Violence information on our website: https:\/\/salvos.org.au [link removed]<\/p><p><strong>TSA Social Mission embraces diversity and encourages applications from<\/strong><\/p><ul><li>Aboriginal and Torres Strait Islander people,<\/li><li>people who identify as Lesbian, Gay, Bisexual, Transgender or Intersex<\/li><li>people with a culturally or linguistically diverse background<\/li><\/ul><p><em>The Salvation Army is an Equal Opportunity Employer who provides an inclusive work environment and embraces the diverse talent of its people.<\/em><\/p><p><em>The Salvation Army is a child safe organisation that is committed to ensuring the wellbeing of children and young people, and protecting them from harm. All child facing roles will require the successful completion of a Working with Children Check. Applicants for all other roles require a mandatory National Police Check.<\/em><\/p><p><em>We value Integrity, Compassion, Respect, Diversity, and Collaboration.<\/em><\/p>\"}"
}