{
    "id":"Kaggle::techmap::61417802a71ddb7305787736::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The role description mentions the position is \"Active and physically demanding\" and \"Physically fit,\" without taking into account that candidates could perform the job with reasonable accommodations.",
    "label_masculine":true,
    "analysis_masculine":"The phrases \"more hands on deck\" and emphasis on a \"physically demanding position,\" along with the suggestion of leisure activities like fishing, diving, and hiking on days off, could introduce a masculine bias, potentially resonating more with male candidates and discouraging female applicants.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"These are the men and women\" introduces sexuality bias by enforcing a binary view of gender, potentially excluding non-binary and gender non-conforming individuals.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Hamilton Island is the Whitsundays Premiere Island resort with 4 resort options, over 15 different dining and restaurant establishments, a championship golf course and a luxury Yacht Club. We have various opportunities for passionate and enthusiastic team members to grow and develop their careers in this premium resort environment. Our back of house Food & Beverage Division consists of are a wonderful group of talented chefs, cooks and kitchen stewards who work together to create delicious meals for our guests. Every role plays an integral part in producing each meal, and it is only as a team that this can happen. These are the men and women who love working in a dynamic environment where they understand what team work, commitment to hygiene standards and pride in their work is crucial every day. Due to unprecedented demand Hamilton Island is experiencing record occupancy which is where you come in! Our restaurants are pumping and we need more hands on deck. Opportunities are now available for hardworking committed Kitchen Stewards to join our kitchen brigade and start building on their hospitality career. Your Benefits. $1500 Qld Government Work in Paradise initiative. Full time permanent role. Competitive wage with the opportunity to earn $ and skills in other departments. Save money with subsidised furnished staff accommodation. Staff perks. discounts on restaurants and activities including $10 per week membership to our sensational gym. Fantastic work culture, supportive community and various career opportunities. Enjoy living and working on the doorstep of the Great Barrier Reef! On your days off go fishing, diving, hiking and exploring our beautiful region. The role: Wash dishes, pots, utensils and appliances. Ensure the kitchen is kept clean and hygienic at all times. Put away deliveries and control stock rotation. Provide support to the Chefs. Adhere to safe work practices and safe food handling procedures. Active and physically demanding position. About You. You are a cup half full kind of person, with a can do attitude, youre organised, friendly, polite and enjoy working in a close-knit team and understand that the role you are performing is critical to our guests enjoyment of the Island. Ideally you will also have: Previous experience as a Kitchen Hand or other physical role preferred. Valid Open Driver Licence. Strong work ethic and good team player. Flexible attitude to changing shift patterns. Physically fit.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61417802a71ddb7305787736::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Hamilton Island Enterprises\", \"position\": \"Kitchen Steward\", \"notes\": \"\", \"original\": \"<p>Hamilton Island is the Whitsunday\\u2019s Premiere Island resort with 4 resort options, over 15 different dining and restaurant establishments, a championship golf course and a luxury Yacht Club. We have various opportunities for passionate and enthusiastic team members to grow and develop their careers in this premium resort environment.<\/p>  <p>Our back of house <strong>Food &amp; Beverage Division <\/strong>consists of are a wonderful group of talented chefs, cooks and kitchen stewards who work together to create delicious meals for our guests.\\u00a0 Every role plays an integral part in producing each meal, and it is only as a team that this can happen.<\/p>  <p>These are the men and women who love working in a dynamic environment where they understand what team work, commitment to hygiene standards and pride in their work is crucial every day.<\/p>  <p>Due to unprecedented demand Hamilton Island is experiencing record occupancy which is where you come in!\\u00a0 Our restaurants are pumping and we need more hands on deck.<\/p>  <p>Opportunities are now available for hardworking committed <strong>Kitchen Stewards<\/strong> to join our kitchen brigade and start building on their hospitality career.\\u00a0<\/p>  <p><strong>Your Benefits<\/strong><\/p> <ul> <li>$1500 Qld Government Work in Paradise initiative*<\/li> <li>Full time permanent role<\/li> <li>Competitive wage with the opportunity to earn $$$ and skills in other departments.<\/li> <li>Save money with subsidised furnished staff accommodation<\/li> <li>Staff perks - discounts on restaurants and activities including $10 per week membership to our sensational gym.<\/li> <li>Fantastic work culture, supportive community and various career opportunities<\/li> <li>Enjoy living and working on the doorstep of the Great Barrier Reef!<\/li> <li>On your days off go fishing, diving, hiking and exploring our beautiful region<\/li><\/ul> <p><strong>The role:<\/strong><\/p> <ul> <li>Wash dishes, pots, utensils and appliances<\/li> <li>Ensure the kitchen is kept clean and hygienic at all times<\/li> <li>Put away deliveries and control stock rotation<\/li> <li>Provide support to the Chefs<\/li> <li>Adhere to safe work practices and safe food handling procedures<\/li> <li>Active and physically demanding position<\/li><\/ul> <p><strong>About You<\/strong><\/p>  <p>You are a cup half full kind of person, with a \\u201ccan do\\u201d attitude, you\\u2019re organised, friendly, polite and enjoy working in a close-knit team and understand that the role you are performing is critical to our guests enjoyment of the Island.<\/p>  <p>Ideally you will also have:<\/p> <ul> <li>Previous experience as a Kitchen Hand or other physical role preferred<\/li> <li>Valid Open Driver Licence\\u00a0<\/li> <li>Strong work ethic and good team player\\u00a0<\/li> <li>Flexible attitude to changing shift patterns<\/li> <li>Physically fit<\/li><\/ul> <p>If you would love to live and work in one of the most beautiful locations in Australia and have relevant experience we would love to speak with you.<\/p>  <p><em><strong>Click \\\"apply\\\" or visit www.hamiltonisland.com.au\/careers<\/strong><\/em><\/p>  <p><strong>Like us on Facebook https:\/\/www.facebook.com\/HIERecruitment<br \/>Follow us on Linkedin www.linkedin.com\/company\/hamilton-island<\/strong><\/p>\"}"
}