{
    "id":"Kaggle::techmap::61487f8fa94a535e48aebf4b::seek_au::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". Reporting into the Head of Credit Risk, Commercial Bank, you will be responsible for the credit quality and control environment supporting credit decisions, credit controls and processes. You will be leading the National credit team to decision all lending for relationship managed commercial customers. The role will require you to driving consistency to risk appetite, credit process and decisioning, You will be also responsible for risk reward, effectiveness together with being part of the Divisions leadership team. Some of your Key Responsibilities will include: Credit Decisioning and Credit Risk Leadership. Credit Policy and Portfolio Management. People and Common Leadership Responsibilities. Controls Management. Cost Management of P&L. To be considered for this challenging and career defining opportunity you will need to demonstrate the following: Proven senior credit & people leadership within commercial\/corporate banking of no less than 10+years. Hold & exercise a high level lending decision authority with experience sitting on risk committees and deal forums. Possess superior level key stakeholder engagement, influencing & problem resolution skills. Experience in dealing with, and presenting to General Managers and executive teams. Proven thought leadership encompassing strategy & market insights. Be collaborative, transparent by nature driving a strong can do credit risk culture. Be a natural change agent. Be tertiary qualified. Graduate or post-graduate (MBA or equivalent) in commerce or business-related discipline, or equivalent. Must hold full Australian working rights. IMPORTANT: By submitting your email address and any other personal information when you APPLY to a job, you consent to such information being collected, held, used and disclosed in accordance with our COLLECTIONS NOTICE and PRIVACY POLICY. http:\/\/www. bluefinresources. com. au\/privacy-policy [link removed].",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61487f8fa94a535e48aebf4b::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Bluefin Resources Pty Limited\", \"position\": \"Senior Credit Leader, Commercial Bank\", \"notes\": \"\", \"original\": \"<p><br \/>Reporting into the Head of Credit Risk, Commercial Bank, you will be responsible for the credit quality and control environment supporting credit decisions, credit controls and processes. You will be leading the National credit team to decision all lending for relationship managed commercial customers. The role will require you to driving consistency to risk appetite, credit process and decisioning, You will be also responsible for risk reward, effectiveness together with being part of the Divisions leadership team. Some of your Key Responsibilities will include:<\/p><ul><li>Credit Decisioning and Credit Risk Leadership<\/li><li>Credit Policy and Portfolio Management<\/li><li>People and Common Leadership Responsibilities<\/li><li>Controls Management<\/li><li>Cost Management of P&amp;L<\/li><\/ul><p>To be considered for this challenging and career defining opportunity you will need to demonstrate the following:<\/p><ul><li>Proven senior credit &amp; people leadership within commercial\/corporate banking of no less than 10+years<\/li><li>Hold &amp; exercise a high level lending decision authority with experience sitting on risk committees and deal forums<\/li><li>Possess superior level key stakeholder engagement, influencing &amp; problem resolution skills<\/li><li>Experience in dealing with, and presenting to General Managers and executive teams<\/li><li>Proven thought leadership encompassing strategy &amp; market insights<\/li><li>Be collaborative, transparent by nature driving a strong can do credit risk culture<\/li><li>Be a natural change agent<\/li><li>Be tertiary qualified...Graduate or post-graduate (MBA or equivalent) in commerce or business-related discipline, or equivalent<\/li><\/ul><p>If this sounds like the role you are looking for then apply now for consideration noting only shortlisted candidates will be contacted. Must hold full Australian working rights<\/p><p>IMPORTANT: By submitting your email address and any other personal information when you APPLY to a job, you consent to such information being collected, held, used and disclosed in accordance with our COLLECTIONS NOTICE and PRIVACY POLICY.<\/p><p>http:\/\/www.bluefinresources.com.au\/privacy-policy [link removed]<\/p>\"}"
}