{
    "id":"Kaggle::techmap::613750a078187b711d60046c::aarp_us::9",
    "label_age":true,
    "analysis_age":"The phrases \"Rapidly scaling environment\" and \"tech-enabled\" might subtly favour younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"This is a unique and exciting opportunity to be the finance and accounting leader of a rapidly growing, entrepreneurial healthcare enterprise on its way to becoming the industry leader in its sector. This company has been on an ambitious growth trajectory since its inception led by an active acquisition strategy. This technology driven healthcare services business is well capitalized and is firmly positioned to take advantage of the favorable market trends and resulting growth opportunities in their space. We're seeking a senior financial executive who will actively partner with the CEO of the enterprise and be a key contributor to the ongoing growth of the business. We require a finance professional with a highly analytical and operationally oriented approach who will identify and track KPI's, thoroughly analyze and understand the key drivers and levers of the business and who will be able to translate and communicate those findings into action. You will be a hands-on leader involved in all growth initiatives and will be responsible for building the finance and accounting function from the ground up. We're seeking someone with prior experience in a rapidly scaling environment and someone who comes from a tech-enabled healthcare services background. Candidates with previous experience leading an offshore finance team are highly attractive for this position. A competitive compensation package including bonus opportunity is offered.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613750a078187b711d60046c::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"TrueNorth Executive Search\", \"position\": \"VP Finance - High Growth Healthcare Services - Private Equity\", \"notes\": \"\", \"original\": \"<p>This is a unique and exciting opportunity to be the finance and accounting leader of a rapidly growing, entrepreneurial healthcare enterprise on its way to becoming the industry leader in its sector. This company has been on an ambitious growth trajectory since its inception led by an active acquisition strategy. This technology driven healthcare services business is well capitalized and is firmly positioned to take advantage of the favorable market trends and resulting growth opportunities in their space.<\/p><p><br \/><\/p><p>We're seeking a senior financial executive who will actively partner with the CEO of the enterprise and be a key contributor to the ongoing growth of the business. We require a finance professional with a highly analytical and operationally oriented approach who will identify and track KPI's, thoroughly analyze and understand the key drivers and levers of the business and who will be able to translate and communicate those findings into action. You will be a hands-on leader involved in all growth initiatives and will be responsible for building the finance and accounting function from the ground up. We're seeking someone with prior experience in a rapidly scaling environment and someone who comes from a tech-enabled healthcare services background. Candidates with previous experience leading an offshore finance team are highly attractive for this position. <\/p><p><br \/><\/p><p>A competitive compensation package including bonus opportunity is offered. <\/p><br \/>\"}"
}