{
    "id":"Kaggle::techmap::61560a63a6740c534abc2572::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The job posting explicitly states that \"Disability-related accommodations during the application process are available upon request,\" demonstrating a commitment to inclusivity and non-discriminatory practices towards individuals with disabilities.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1-3 yearsa€ experience in human resources supporting employee life cycle operations. Experience in non-union and unionized environments. Bi-lingual (English\/French), both fluent in verbal and written, considered an asset. Experience with a Human Resources Information System (HRIS). Intermediate level expertise with MS Word, Excel, Power. Point and Outlook. Competencies. Strong data entry skills and attention to detail. Ability to work independently and collaboratively in a high volume and fast. paced environment with different business\/division needs. Ability to interpret and analyze data related to HR metrics. Has strong analytical, problem solving and judgement skills. Ability to work in a fast-paced environment and quickly adapt to priorities. Confidence to ask questions and seek clarity when required. Demonstrated time management skills and quickly adapt to priorities and meet tight timelines. Excellent verbal and written communication skills. Strong interpersonal and conflict resolution skills. High level of integrity and work ethic. Working Conditions. Office environment with a flexible work schedule, potentially requiring work evenings and weekends based on any work requirements. A Trained, as necessary, in required safety protocols. A fast-paced role with learning opportunities and exposure to different divisions across the organization. Additional Information. WHATS IN IT FOR YOU? A place where people matter, health and welfare benefits start on first day on the job. Be 1 on day 1 by joining an industry leader where you can leave your mark. A fast-paced role with learning opportunities and exposure to different divisions across the organization. Whereas other companies are downsizing, we are growing. Dexterra Group is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteransa€ status, Indigenous status, or any other legally protected factors. Disability-related accommodations during the application process are available upon request.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61560a63a6740c534abc2572::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Dexterra\", \"position\": \"Human Resources Coordinator\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Company Description <br> <br> <p>We've been serving Canadian clients for over 75 years. The companies that began independently and now form Dexterra Group have an outstanding record of supporting the infrastructure and built assets that play a vital role in our society and helping our clients achieve higher performance and productivity. Powered by passionate people, we bring the right teams with the right skills together \\u00e2\\u20ac\\u201c offering both experience and regional expertise so companies can operate their day to day, confidently and successfully.<\/p>Job Description <br> <br> <p><strong>WHATS THE JOB?<\/strong><\/p> <p>The Human Resources Coordinator is a team member of the HR Service Centre, reporting directly to the Director, Shared Services. The HRSC is a centralized point of contact for all employees. The incumbent is responsible for providing transactional and administrative support for employee information changes over the employment life cycle and for delivery of internal human resource services ensuring employee data records are accurate, complete and kept up to date within our HRIS system. The HR Coordinator processes the data in a timely manner, follows the defined protocols and always maintains confidentiality. This role requires excellent data entry skills as well as the ability to work well under timelines.<\/p> <p>Some of the responsibilities include:<br>\\u00e2\\u20ac\\u00a2\\u00c2&nbsp;\\u00c2&nbsp; \\u00c2&nbsp;Ensuring HR administration functions and queries are delivered as per appropriate standards and in a courteous manner<br>\\u00e2\\u20ac\\u00a2\\u00c2&nbsp;\\u00c2&nbsp; \\u00c2&nbsp;Timely processing of HR transactions ensuring payroll is processed on time<br>\\u00e2\\u20ac\\u00a2\\u00c2&nbsp;\\u00c2&nbsp; \\u00c2&nbsp;Processing new hires, terminations, employment changes etc. for all employees in the system<br>\\u00e2\\u20ac\\u00a2\\u00c2&nbsp;\\u00c2&nbsp; \\u00c2&nbsp;Interacting with internal clients or employees around specific work efforts and deliverables<br>\\u00e2\\u20ac\\u00a2\\u00c2&nbsp;\\u00c2&nbsp; \\u00c2&nbsp;Overseeing the HRIS - processing, verifying and maintaining employee data<br>\\u00e2\\u20ac\\u00a2\\u00c2&nbsp;\\u00c2&nbsp; \\u00c2&nbsp;Assisting HR Business partners and HR leads in preparing required letters and on special HR projects as assigned\\u00c2&nbsp;<br>\\u00e2\\u20ac\\u00a2\\u00c2&nbsp; \\u00c2&nbsp;\\u00c2&nbsp;Responsible for benefit enrollment, terminations, and updating benefit coverage based on life changing events<\/p> <ul> <li>Maintains benefit records and administers group benefit plans as per benefit eligibility<\/li> <li>Responds to benefit queries and other HR related queries<\/li> <li>Stays well informed of the human resources policies, procedures and delegation of authority<\/li> <li>Responsible for e-filing documents<\/li> <li>Performs miscellaneous transactional functions and special projects as assigned\\u00c2&nbsp;<\/li> <\/ul>Qualifications <br> <br> <p><strong>WHO ARE WE LOOKING FOR?<\/strong><\/p> <ul> <li>A University or College degree with a specialization in Human Resources Management<\/li> <li>CHRP designation or working toward designation<\/li> <li>1-3 years\\u00e2\\u20ac\\u2122 experience in human resources supporting employee life cycle operations<\/li> <li>Experience in non-union and unionized environments<\/li> <li>Bi-lingual (English\/French), both fluent in verbal and written, considered an asset<\/li> <li>Experience with a Human Resources Information System (HRIS)<\/li> <li>Intermediate level expertise with MS Word, Excel, PowerPoint and Outlook<\/li> <\/ul> <p><strong>Competencies<\/strong><\/p> <ul> <li>Strong data entry skills and attention to detail<\/li> <li>Ability to work independently and collaboratively in a high volume and fast- paced environment with different business\/division needs<\/li> <li>Ability to interpret and analyze data related to HR metrics<\/li> <li>Has strong analytical, problem solving and judgement skills<\/li> <li>Ability to work in a fast-paced environment and quickly adapt to priorities<\/li> <li>Confidence to ask questions and seek clarity when required<\/li> <li>Demonstrated time management skills and quickly adapt to priorities and meet tight timelines<\/li> <li>Excellent verbal and written communication skills.<\/li> <li>Strong interpersonal and conflict resolution skills<\/li> <li>High level of integrity and work ethic<\/li> <\/ul> <p><strong>Working Conditions<\/strong><\/p> <ul> <li>Office environment with a flexible work schedule, potentially requiring work evenings and weekends based on any work requirements.\\u00c2&nbsp; Trained, as necessary, in required safety protocols.<\/li> <li>A fast-paced role with learning opportunities and exposure to different divisions across the organization<\/li> <\/ul> <br> <br>Additional Information <br> <br> <p><strong>WHATS IN IT FOR YOU?<\/strong><\/p> <ul> <li>A place where people matter, health and welfare benefits start on first day on the job<\/li> <li>Be #1 on day 1 by joining an industry leader where you can leave your mark<\/li> <li>A fast-paced role with learning opportunities and exposure to different divisions across the organization<\/li> <li>Whereas other companies are downsizing, we are growing<\/li> <\/ul> <p>Dexterra Group is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans\\u00e2\\u20ac\\u2122 status, Indigenous status, or any other legally protected factors. Disability-related accommodations during the application process are available upon request.<\/p> <\/div>\"}"
}