{
    "id":"Kaggle::techmap::61384b2461fb3d1710faf3a9::reed_uk::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Continued use of gender-specific pronouns might make some feel excluded.",
    "verified":true,
    "synthetic":false,
    "text":"Job Description He\/she has extensive knowledge and experience in at least one module of SAP HR. He\/she is recognized as an authority and trustworthy source in the area of his domain of SAP HR. He is responsible to define, to pursuit and to negotiate the work to be performed in the different phases of project development with the objective to guarantee the correct operation of the applications and a level of optimal performance. He\/she actively participates in the activities of training and knowledge transfer. He\/she works in narrow collaboration with other teams of Alight to determine the optimal solutionResponsibilitiesIn addition to the tasks common to all Alight employees, the specific tasks for this position are: Solve complex problems related to the technical environment of the application, both at the level of technical programming, portal, workflow as creation \/ modification of payroll scheme, times, management of features in SAP, parametrization of legal reports, smart-forms, SAP.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61384b2461fb3d1710faf3a9::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"TopLanguageJobs.com\", \"position\": \"Application Management, Specialist\", \"notes\": \"\", \"original\": \"Job Description He\/she has extensive knowledge and experience in at least one module of SAP HR. He\/she is recognized as an authority and trustworthy source in the area of his domain of SAP HR. He is responsible to define, to pursuit and to negotiate the work to be performed in the different phases of project development with the objective to guarantee the correct operation of the applications and a level of optimal performance. He\/she actively participates in the activities of training and knowledge transfer. He\/she works in narrow collaboration with other teams of Alight to determine the optimal solutionResponsibilitiesIn addition to the tasks common to all Alight employees, the specific tasks for this position are: Solve complex problems related to the technical environment of the application, both at the level of technical programming, portal, workflow as creation \/ modification of payroll scheme, times, management of features in SAP, parametrization of legal reports, smart-forms, SAP - scripts or other application techniques inherent in SAP in line with the assigned tasks of the work centre Collaborates and provides suggestions for the improvement of the service both at the specific customer level, providing added value, and at the level of euHReka or SAP platform in the areas of expertise that they work Collaborate in the development of the organic document of complex applications performed from the functional one Collaborate in the definition of the necessary data structures, on the basis of the data model, as well as diagrams of flow of applications, ensuring that they respond to the requirements of the customer Integrated testing of complex applications Provides the necessary technical support to the other members of the team Provides training on those areas in which they are specialized for experience and knowledge Contributing to the reuse of knowledge Methodological approaches to problem solving and project management Hold certifications in products \/ relevant technologies for his\/her role in the company Offers solutions that help the optimization and performance, improving the quality of the service They are a technical reference and performs tasks of coaching and mentoring They manage the pool of work optimizing the service provided They provide suggestions that increase productivity and the quality of the service at a technical level Ensures the profitability of the assigned tasks, performing a precise monitoring Required Skills: Motivation and desire for improvement Commitment to the customer and the company Work independently and as a part of a team Perseverance and tenacity to difficulties Motivated to achieve excellence Orientation to the process of continuous improvement Orientation to mentoring Encouraging the professional development of team members Positive collaboration and anticipation to the needs of others Capacity for analysis and synthesis Ability to perform the work with quality Capacity to organize, plan and supervise work Ability to make decisions within the own level of competence of the job Ability to delegate and monitor Capacity of anticipation to problems Time management: compliance dates\/deadlines Overview of the application from the technical point of view Capacity to identify risks and develop action plans to mitigate them Ability to understand customer needs and identify new business opportunities Capacity to collaborate on multiple projects simultaneously Knowledge of technical environment of development at an expert level Knowledge of database design at an expert level Knowledge of products of the market for information technology at an advanced level Knowledge of SAP architecture and platform euHReka at an advanced level Knowledge of Human Resources processes Knowledge of various technical platforms Knowledge of various programming languages at an advanced level Knowledge of oral and written English at an expert level\"}"
}