{
    "id":"Kaggle::techmap::61428422488f5c5371263aa0::cvlibrary_uk::3",
    "label_age":true,
    "analysis_age":"The phrase \"An individual with a recent degree\" suggests the employer ideally wants a younger person.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"I am currently working with a great secondary school in Sheffield, South Yorkshire who are looking to appoint a Teaching Assistant. The school is looking for a hard-working candidate to start their journey into teaching or someone looking to progress. You will be supporting teachers in lesson and working with pupils using your specialism and the knowledge you have gained from your degree. The role would be ideal for someone thinking about a career as a teacher in the future. The school itself is located near excellent transport links with free unrestricted parking directly outside the school. Why this role? As a Teaching Assistant you will be supporting a range of pupils. You will experience work in a great secondary school. You will develop skills that you can take on to teaching. You will be provided with excellent training. For the successful teaching assistant support will be provided throughout the year, you will work alongside excellent teachers as well as passionate pupils. The school are looking for. • A passionate graduate looking to work in a great school. An individual with a recent degree. Someone who can enthuse and motivate pupils. An individual with a strong academic background. • A Teaching Assistant who can pass on their outstanding subject knowledge. An individual who can commit to furthering professional development through the bespoke opportunities on offer at the Academy. Please be advised due to the volume of applicants we will only be in touch if you have been successful.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61428422488f5c5371263aa0::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Protocol Education\", \"position\": \"Secondary Teaching Assistant\", \"notes\": \"\", \"original\": \"I am currently working with a great secondary school in Sheffield, South Yorkshire who are looking to appoint a Teaching Assistant.<br><br>The school is looking for a hard-working candidate to start their journey into teaching or someone looking to progress. You will be supporting teachers in lesson and working with pupils using your specialism and the knowledge you have gained from your degree. The role would be ideal for someone thinking about a career as a teacher in the future.<br><br>The school itself is located near excellent transport links with free unrestricted parking directly outside the school<br><br>Why this role?<br><br>&bull; As a Teaching Assistant you will be supporting a range of pupils<br>&bull; You will experience work in a great secondary school.<br>&bull; You will develop skills that you can take on to teaching<br>&bull; You will be provided with excellent training<br>&bull; For the successful teaching assistant support will be provided throughout the year, you will work alongside excellent teachers as well as passionate pupils<br><br>The school are looking for.<br><br>&bull; A passionate graduate looking to work in a great school<br>&bull; An individual with a recent degree<br>&bull; Someone who can enthuse and motivate pupils<br>&bull; An individual with a strong academic background<br>&bull; A Teaching Assistant who can pass on their outstanding subject knowledge<br>&bull; An individual who can commit to furthering professional development through the bespoke opportunities on offer at the Academy<br><br>Please be advised due to the volume of applicants we will only be in touch if you have been successful.\"}"
}