{
    "id":"Kaggle::techmap::63d1b4a1dc85f13850eb9094::simplyhired_ie::2",
    "label_age":false,
    "analysis_age":"This might initially seem to favour certain age groups, but it reflects how retirement age is calculated. For instance, \"If you have commenced employment in the public service as a new entrant or you are a former public servant returning to the public service after a break of more than 26 weeks,\" indicates a specific status concerning public service.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" (a) If you have been continually employed in the public service prior to the 1st April 2004 and you have not had a break in service of more than 26 weeks, you will be included in the Voluntary Hospital Superannuation Scheme (Non-New Entrant) with a Minimum Retirement Age of 60 and a Maximum Retirement Age of 65. (b) If you have been continually employed in the public service post the 1st April 2004 and you have not had a break in service of more than 26 weeks, you will be included in the Voluntary Hospital Superannuation Scheme (New Entrant) with a Minimum Retirement Age of 65. There is no Maximum Retirement Age. (c) If you have commenced employment in the public service as a new entrant or you are a former public servant, returning to the public service after a break of more than 26 weeks, you will be included in the Single Public Service Pension Scheme effective from the 1st January 2013 with a minimum retirement age of 66 (rising to 67 and 68 in line with state pension changes). The maximum retirement age under this scheme will be age 70.4. Duties: The Clinical Facilitator will perform such duties as are outlined in this job description. Hours of work: Normal working hours are 37.5 worked over 5 days. Your contracted hours of work are liable to change between the hours of 8 am to 8 pm over 7 days to meet the requirements for extended day services in accordance with the terms of the Framework Agreement. Probation: The successful candidate will be appointed initially for a probationary period of 6 months. During the probationary period progress or otherwise will be monitored and at the end of the probationary period the service will (a) be certified as satisfactory and confirmed in writing or if not satisfactory, the probationary period may be extended by 3 months. Annual Leave: The annual leave entitlement is 25  28 working days per year. The leave year runs from 1st April to the 31st of March each year. Sick Leave: Payment of salary during illness will be in accordance with arrangements as approved from time to time by the Department of Health and Children.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::63d1b4a1dc85f13850eb9094::simplyhired_ie\", \"source\": \"simplyhired_ie\", \"country\": \"IE\", \"company\": \"Tallaght University Hospital\", \"position\": \"Clinical Facilitator (CNM2) - Nurse Practice Development\", \"notes\": \"\", \"original\": \"JOB DESCRIPTION\\n<br \/><br \/>\\nClinical Facilitator (CNM II)\\n<br \/>Nurse Practice Development Department\\n<br \/>Adult Nursing Service\\n<br \/><br \/>\\nFull-Time Permanent and Specified Purpose positions\\n<br \/><b>Ref:<\/b> 10.026 (2022)\\n<br \/><br \/>\\nQUALIFICATIONS\\n<br \/><br \/>\\n<b>1. Each candidate must :<\/b><br \/>\\nBe registered in the General Division of the active Register held by Nursing and Midwifery Board of Ireland or be entitled to be so registered.\\n<br \/>Have 5 years post registration experience and a minimum of 2 years in the acute hospital setting.\\n<br \/>Have a third level qualification at not less than a level 7 on the NFQ framework.\\n<br \/>Have completed a teaching and assessing course.\\n<br \/>Have the clinical, managerial and administrative capacity to properly discharge the functions of the role.\\n<br \/>Have excellent communication and interpersonal skills.\\n<br \/>Demonstrate evidence of continuing learning and professional development\\n<br \/><br \/>\\n2. Age Restrictions In Relation To Applications\\n<br \/>Age restriction shall only apply to a candidate where he\/she is not classified as a new entrant (within the meaning of the Public Service Superannuation (Miscellaneous Provisions) Act, 2004). A candidate who is not classified as a new entrant must be under 65 years of age on the first day of the month in which the latest date for receiving completed applications for the office occurs.\\n<br \/><br \/>\\n3. Health\\n<br \/>A candidate for and any person holding the office must be fully competent and capable of undertaking the duties attached to the office and be in a state of health as would indicate a reasonable prospect of ability to render regular and efficient service.\\n<br \/><br \/>\\n4. Be of good character.\\n<br \/><br \/>\\n5. Garda Vetting is sought for all employees and prospective employees of Tallaght University Hospital. Given the specialised nature of the services provided, your appointment will be subject to satisfactory Garda Vetting and re-vetting in circumstances where the Hospital deems it appropriate. The Hospital will then process the necessary documentation to endeavour to obtain satisfactory Garda clearance for you. You are obliged to disclose previous and any criminal convictions acquired during the course of your employment. Should the Hospital obtain information from the Garda Vetting Unit to indicate that your Garda clearance report is not satisfactory and \/ or if you have supplied the hospital with false or misleading information in relation to your Garda clearance status, the Hospital reserves the right to withdraw or terminate this contract in accordance with Tallaght University Hospital Garda Vetting policy.\\n<br \/>6. Mandated and Designated Persons under Children First Act 2015 Schedule 2 of the Children First Act 2015 specifies the classes of persons defined as Mandated Persons for the purposes of the Act. This includes a range of disciplines that are employed by the hospital including all medical practitioners, registered nurses, physiotherapists, psychologists, social workers and others. This includes staff working in adult services. All mandated persons have two main legal obligations under the Children First Act 2015. Mandated persons, under the legislation are required to report any knowledge, belief or reasonable suspicion that a child has been harmed, is being harmed, or is at risk of being harmed. The Act defines harm as assault, ill-treatment, neglect or sexual abuse, and covers single and multiple instances. Mandated persons are also required to assist Tusla, if requested, in assessing a concern which has been the subject of a mandated report. Designated Officer are required to receive reports of suspected child abuse or neglect from any person who is of the opinion that (a) a child has been or is being assaulted, ill-treated, neglected or sexually abused, or (b) a child\\u2019s health, development or welfare has been or is being avoidably impaired or neglected. Full detailed list of mandated and designated staff together with details of their roles and responsibilities can be found on https:\/\/www.tusla.ie\/children-first. It is the responsibility of all staff employed by TUH to be aware of their roles and responsibilities under the legislation and to complete mandatory Children First Training.\\n<br \/><br \/>\\nPARTICULARS OF OFFICE\\n<br \/>1. The appointments (2 posts) are full time permanent and pensionable.\\n<br \/><br \/>\\n<b>2. Remuneration:<\/b><br \/>\\nRemuneration is in accordance with the salary scale approved by the Department of Health &amp; Children. Current remuneration with effect from 1st October 2021 is:\\n<br \/>\\u20ac51,422 by x 9 increments to \\u20ac60,792 (Incl. x LSI)\\n<br \/>Salary scales will be updated in line with nationally agreed pay agreements and will be updated accordingly and retrospective payments applied as applicable\\n<br \/><br \/>\\n3. Pension arrangements and retirement age\\n<br \/>There are three superannuation schemes currently in operation for staff in Tallaght University Hospital:\\n<br \/><br \/>\\n(a) Voluntary Hospital Superannuation Scheme (Non-New Entrant)\\n<br \/>(b) Voluntary Hospital Superannuation Scheme (New Entrant)\\n<br \/>(c) Single Public Service Pension Scheme\\n<br \/><br \/>\\nPlease read carefully the summary of the criteria for the three superannuation schemes below. This will assist you in identifying which scheme membership is applicable to your employment circumstances.\\n<br \/><br \/>\\n(a) If you have been continually employed in the public service prior to the 1st April 2004 and you have not had a break in service of more than 26 weeks, you will be included in the Voluntary Hospital Superannuation Scheme (Non-New Entrant) with a Minimum Retirement Age of 60 and a Maximum Retirement Age of 65.\\n<br \/><br \/>\\n(b) If you have been continually employed in the public service post the 1st April 2004 and you have not had a break in service of more than 26 weeks, you will be included in the Voluntary Hospital Superannuation Scheme (New Entrant) with a Minimum Retirement Age of 65. There is no Maximum Retirement Age.\\n<br \/><br \/>\\n(c) If you have commenced employment in the public service as a new entrant or you are a former public servant, returning to the public service after a break of more than 26 weeks, you will be included in the Single Public Service Pension Scheme effective from the 1st January 2013 with a minimum retirement age of 66 (rising to 67 and 68 in line with state pension changes). The maximum retirement age under this scheme will be age 70.\\n<br \/><br \/>\\n<b>4. Duties:<\/b><br \/>\\nThe Clinical Facilitator will perform such duties as are outlined in this job description.\\n<br \/><br \/>\\n<b>5. Hours of work:<\/b><br \/>\\nNormal working hours are 37.5 worked over 5 days. Your contracted hours of work are liable to change between the hours of 8 am to 8 pm over 7 days to meet the requirements for extended day services in accordance with the terms of the Framework Agreement.\\n<br \/><br \/>\\n<b>6. Probation:<\/b><br \/>\\nThe successful candidate will be appointed initially for a probationary period of 6 months. During the probationary period progress or otherwise will be monitored and at the end of the probationary period the service will (a) be certified as satisfactory and confirmed in writing or if not satisfactory, the probationary period may be extended by 3 months.\\n<br \/><br \/>\\n<b>7. Annual Leave:<\/b><br \/>\\nThe annual leave entitlement is 25 \\u2013 28 working days per year. The leave year runs from 1st April to the 31st of March each year.\\n<br \/><br \/>\\n<b>8. Sick Leave:<\/b><br \/>\\nPayment of salary during illness will be in accordance with arrangements as approved from time to time by the Department of Health and Children.\\n<br \/><br \/>\\n<b>9. Termination of Office:<\/b><br \/>\\nThe employment may be terminated at any time by two months\\u2019 notice on either side except where circumstances are dictated by the Minimum Notice and Terms of Employment Act 1973\/91. The Management\\u2019s right under this paragraph shall not be exercised save in circumstances where the Management is of the opinion that the holder of the office has failed to perform satisfactorily the duties of the post or has misconducted himself\/herself in relation to the post or is otherwise unfit to hold the appointment.\\n<br \/><br \/>\\nGENERAL ACCOUNTABILITY\\n<br \/><br \/>\\n<b>The person chosen will:<\/b><br \/>\\nMaintain throughout the Hospital awareness of the primacy of the patient in relation to all Hospital activities.\\n<br \/>Demonstrate behaviour consistent with the Values within Tallaght University Hospital.\\n<br \/>Adhere to and uphold the Professional Code of Conduct for nurses.\\n<br \/>Maintain the primacy of patient care in all activities undertaken.\\n<br \/>The Clinical Facilitator will report directly to the Assistant Director of Nursing Nurse Practice Development in the Adult Nursing Service, and work as part of the wider Nurse Practice Development Team.\\n<br \/>Be professionally accountable to the Director of Nursing.\\n<br \/><br \/>\\nSPECIFIC ACCOUNTABILITY\\n<br \/><br \/>\\nGeneric Leadership Responsibilities\\n<br \/>To model a professional approach in all aspects of work being undertaken.\\n<br \/>Encourage recognition of the patient as an individual, ensuring patients\\u2019 needs and comfort are given priority\\n<br \/>Support all registered nurses and in some cases, multidisciplinary colleagues, in the implementation of Hospital Policies.\\n<br \/>To create and promote open communications, healthy working relations, and stimulate innovation in practice.\\n<br \/>To audit and evaluate all initiatives undertaken.\\n<br \/><br \/>\\nRole and Responsibilities\\n<br \/>The Clinical Facilitator role encompasses both direct and indirect practice. Direct practice involves the delivery of evidence based quality nursing care to patients and their families, whereas indirect practice involves among other activities, working with nursing staff in planning care for their patients and developing practice protocols that are evidence based, as well as supervising staff in critical evaluation of their practice.\\n<br \/>To facilitate the ongoing development of clinical nursing practice in their assigned clinical area (likely to cover several) within the Scope of Nursing and Midwifery Practice Framework\\n<br \/>To facilitate the creation of a professional practice environment that fosters professional growth and development.\\n<br \/>The Clinical Facilitator educator function involves a broad view of education, encompassing development of others including their teaching skills, providing opportunities for others to learn, and establishing a staff development culture.\\n<br \/>To undertake and deliver projects as designated by the Assistant Director of Nursing Nurse Practice Development or the Nurse Practice Development Advisor within agreed timelines.\\n<br \/>Contribute to the development, monitoring of policies, procedures, guidelines and standards as required.\\n<br \/>To plan and deliver education sessions on Corporate Induction, Induction Programme for Adaptation and Assessment Candidates and other programmes as required.\\n<br \/>To support the EPR training group for the implementation of EPR which include providing support for educating nursing staff, identify problem areas and if any additional training is required communicate that to the training lead.\\n<br \/>Actively engage with HCAs to support their development in providing patient care.\\n<br \/><br \/>\\nStaff Development\\n<br \/>To act as a catalyst and assist staff in the development of their skills and where appropriate the expansion of their scope of professional practice. This includes:\\n<br \/>Support newly registered nurses in making the transition from undergraduate student.\\n<br \/>Facilitate a smooth orientation for new nursing staff into the organisation.\\n<br \/>Support registered nurses and HCAs undertaking educational programmes in collaboration with the Centre for Learning and Development.\\n<br \/>Support candidates on Back to Acute Nursing Programmes through clinical placement by working closely in a clinical capacity with the candidates.\\n<br \/>Support candidates on the Return to Nursing Programme through clinical placement by working closely in a clinical capacity with the candidates.\\n<br \/>support the nursing service in implementation of Health Care Assistants skill expansion.\\n<br \/>support nursing management with performance management issues in the clinical areas as required.\\n<br \/><br \/>\\nThe role will also include introduction of practice development initiatives such as expansion of practice, implementing LEAN methodology, monitoring and audit of practice and supporting the CNM with local professional development needs as directed by the Assistant Director of Nursing Nurse Practice Development or Nurse Practice Development Advisor.\\n<br \/><br \/>\\nThe Clinical Facilitator will provide ongoing organisational interdisciplinary education which includes Venepuncture and Cannulation, Management of Actual or Potential Aggression, Basic Life Support and other programmes as required. This education delivery requirement evolves in line with hospital and national policy and best practice.\\n<br \/><br \/>\\nProfessional Practice\\n<br \/>To act as a change agent for staff in introducing change within the clinical environment.\\n<br \/>To facilitate ongoing development of nursing documentation to meet professional standards and legal requirements.\\n<br \/><br \/>\\nStandards of Care and Work\\n<br \/>To act as a role model for the delivery of evidence based quality nursing care in the acute care setting.\\n<br \/>Audit standards of care using the national Quality Care Metrics Audit Tool (QCM).\\n<br \/>Educate clinical staff on the QCMs.\\n<br \/>Assist clinical staff in the implementation of quality improvements through standard setting, auditing, evaluation and improvement plans.\\n<br \/>Participate in development and implementation of patient focused policies, protocols, guidelines and procedures\\n<br \/>Promote awareness and assist in the implementation of local and national policy initiatives and guidelines.\\n<br \/>Self-development\\n<br \/>Develop skills on an ongoing basis as required.\\n<br \/>Maintain own knowledge on both local, national and international professional nursing practice issues.\\n<br \/><br \/>\\nCommunication Role\\n<br \/>To liaise with all registered nurses and HCAs\\n<br \/>To act as an effective role model in promoting healthy professional relationships.\\n<br \/>To promote communication within the nursing profession and the organisation.\\n<br \/>Promote awareness of and participate in nursing research activities.\\n<br \/>To liaise where appropriate with multidisciplinary teams.\\n<br \/>To inspire and disseminate innovative practice.\\n<br \/><br \/>\\nEvaluator Role\\n<br \/>To evaluate all initiatives undertaken according to predetermined criteria as agreed with the Assistant Director of Nursing Nurse Practice Development.\\n<br \/>To provide feedback for nursing staff and HCAs.\\n<br \/>Information Technology &amp; data\\n<br \/>Make the most effective and efficient use of developments in information technology for both patient care and administrative support in a manner which integrates well with systems throughout the organisation.\\n<br \/>Collect, interpret and present data and information on the Department\\u2019s activities, staffing and expenditure, as required.\\n<br \/><br \/>\\nHealth &amp; Safety\\n<br \/>All employees must comply with the Safety, Health and Welfare at Work Act, 2005.\\n<br \/>Comply with relevant Health and Safety responsibilities as outlined in Hospital Polices, Protocols and Procedures relevant to your area.\\n<br \/>Take reasonable care to protect your own safety, health and welfare and that of any other person who may be affected by your acts or omissions at work.\\n<br \/><br \/>\\nHygiene \/ Infection prevention and control\\n<br \/>All employees have responsibility for Hygiene awareness. Hygiene is defined as \\u201cThe practice that serves to keep people and environments clean and prevent infection.\\u201d\\n<br \/>All employees also have a responsibility under their terms of employment to prevent transmission of infection and to follow the hospital infection control policies and guidelines as outlined in the Infection Control Manual.\\n<br \/>All employees must be aware that they work in an area where there is potential for transmission of infection.\\n<br \/>All employees have a responsibility to follow hand hygiene guidelines as this is the single most important intervention to prevent the transmission of infection\\n<br \/><br \/>\\nQuality, safety and risk management\\n<br \/>Support the delivery of the Quality, Safety and Risk Management Programme, including the appropriate identification and management of risks and incidents throughout the hospital.\\n<br \/><br \/>\\nConfidentiality\\n<br \/>You will be aware of the confidential nature of Hospital work and in particular, the right of patients to confidentiality. To this end, you will not discuss workings of the Hospital or its patients or disclose any information of a confidential nature except as required to do so in the course of your work. No records, documents or property of the Hospital may be removed from the premises of the Hospital without prior authorisation. You must return to the Hospital upon request and, in any event, upon the termination of your employment, all documents or other property of the Hospital which are in your possession or under your control.\\n<br \/><br \/>\\nData Management\\n<br \/>Ensure compliance with the obligations required by the Data Protection Act 2018.\\n<br \/><br \/>\\nDevelopment of Hospital Groups\\n<br \/>The Hospital Structure is currently under review and therefore, reporting relationships may change. The development of Hospital Groups may require the post-holder to adopt a different reporting relationship and additional accountabilities. Full consultation will take place in advance of any such change.\\n<br \/><br \/>\\n<b>NOTE:<\/b> The extent and speed of change in the delivery of health care is such that adaptability is essential at this level of appointment. The appointee will be required to maintain, enhance and develop their knowledge, skills and aptitudes necessary to respond to this changing environment. He\/she will also be required to participate in and support the Hospital\\u2019s Digital transformation strategy which may impact work processes and role profiles in the future. The Job Description must therefore be regarded as an outline of the major areas of accountability at the present time, which will be reviewed and assessed on an on-going basis as advancements and developments evolve.\\n<br \/><br \/>\\nGENERAL\\n<br \/><br \/>\\nApplications must be submitted \\u2018on-line\\u2019 at www.tuh.ie\/careers by completing the application form and attaching your CV.\\n<br \/><br \/>\\nCandidates should be aware that, when applying for a post through the &#39;On-Line&#39; Application System (Candidate Manager) they will receive an automated replying acknowledging receipt of their application. Should you for any reason, not receive this automated acknowledgement, you should notify the Human Resources Department, before the closing date, otherwise your application will not be considered.\\n<br \/><br \/>\\n<b>Closing Date:<\/b> Before close of business on: 8th February 2022\\n<br \/><br \/>\\nInformal enquiries to Ms. Cicily Regi, Nurse Practice Development Advisor, Nurse Practice Development, telephone (01) 414 4130 or email cicily.regi&#64;tuh.ie\\n<br \/><br \/>\\nAll candidates should note that, in order to maintain a timely process, the closing date and time for receipt of applications will be strictly adhered to\"}"
}