{
    "id":"Kaggle::techmap::614715fcf3ad9e5d6ef4d98c::headhunter_ru::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  . ,  . Early Career Program (LEAD): Field Engineering. Do you like working in collaborative teams and solving technical problems? Would you like to work in the field with our customers? Join our Field Engineering team. Our Early Career Program in Field Engineering inspires and guides recent graduates through career-shaping experiences. This program takes approximately 36 months to complete and gets you involved in helping clients locate and produce energy more efficiently. Program graduates have the foundations to make innovative contributions to our future. Take your career to the next level. Partner with the best. As a Field Engineer, you will be the key interface between our on-site teams and the client. You will work technically and professionally, leading crews to ensure that equipment is installed, maintained and started properly. By making innovative key contributions to our future, you will also help create reliable, high-quality support for our customers. As part of our Early Career Program as a Field Engineer, you will be responsible for: As part of out Early Career Program in Field Engineering, you will be responsible for: Coordinating with crew member to deploy tools and services, including liaison with customers and shore-based Operations Managers. Participating in finding solutions to complex technical problems through hands-on work at the rig site. Preparing, documenting, and receiving outbound and inbound equipment and products, including products to and from the well site. Providing support for tenders, including data analysis and cost estimates, as well as performing invoicing activities. Engaging in job shadowing opportunities to develop a holistic understanding of the business. Fuel your passion. To be successful in this role you will: Have a Bachelor's degree in Mechanical Engineering (all fields), Engineering Technology, Mathematics, Chemistry, Geosciences or similar. Graduated from your Bachelors or Master's degree within the last 24 months. Average marks 4.0 - 5.0 or the equivalent at your University. Be fluent in English (oral and written) and have effective communication skills. Be geographically mobile due to location availability of the role. Be able to legally work in the country that you are applying in, without company sponsorship or time restriction. Have good interpersonal skills, with an aptitude for teamwork and the ability to guide others. Demonstrate good leadership, critical thinking, and numerical skills as well as data analysis and project management abilities.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614715fcf3ad9e5d6ef4d98c::headhunter_ru\", \"source\": \"headhunter_ru\", \"country\": \"RU\", \"company\": \"\\u0411\\u0415\\u0419\\u041a\\u0415\\u0420 \\u0425\\u042c\\u042e\\u0417\", \"position\": \"Early Career Program (LEAD): Field Engineering\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u043d\\u0435 \\u0442\\u0440\\u0435\\u0431\\u0443\\u0435\\u0442\\u0441\\u044f<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u041f\\u043e\\u043b\\u043d\\u0430\\u044f \\u0437\\u0430\\u043d\\u044f\\u0442\\u043e\\u0441\\u0442\\u044c<!-- -->, <span>\\u043f\\u043e\\u043b\\u043d\\u044b\\u0439 \\u0434\\u0435\\u043d\\u044c<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <p><strong>Early Career Program (LEAD): Field Engineering <\/strong><\/p> \\n  <p><strong>Do you like working in collaborative teams and solving technical problems?<\/strong><\/p> \\n  <p><strong>Would you like to work in the field with our customers? <\/strong><\/p> \\n  <p><strong>Join our Field Engineering team<\/strong><\/p> \\n  <p>Our Early Career Program in Field Engineering inspires and guides recent graduates through career-shaping experiences. This program takes approximately 36 months to complete and gets you involved in helping clients locate and produce energy more efficiently. Program graduates have the foundations to make innovative contributions to our future.<\/p> \\n  <p><strong>Take your career to the next level<\/strong><\/p> \\n  <p>Partner with the best<\/p> \\n  <p>As a Field Engineer, you will be the key interface between our on-site teams and the client. You will work technically and professionally, leading crews to ensure that equipment is installed, maintained and started properly. By making innovative key contributions to our future, you will also help create reliable, high-quality support for our customers. As part of our Early Career Program as a Field Engineer, you will be responsible for:<\/p> \\n  <p>As part of out Early Career Program in Field Engineering, you will be responsible for:<\/p> \\n  <ul> \\n   <li> \\n    <ul> \\n     <li> <p>Coordinating with crew member to deploy tools and services, including liaison with customers and shore-based Operations Managers.<\/p> <\/li> \\n     <li> <p>Participating in finding solutions to complex technical problems through hands-on work at the rig site<\/p> <\/li> \\n     <li> <p>Preparing, documenting, and receiving outbound and inbound equipment and products, including products to and from the well site<\/p> <\/li> \\n    <\/ul> \\n    <ul> \\n     <li> <p>Providing support for tenders, including data analysis and cost estimates, as well as performing invoicing activities<\/p> <\/li> \\n     <li> <p>Engaging in job shadowing opportunities to develop a holistic understanding of the business<\/p> <\/li> \\n    <\/ul> <\/li> \\n  <\/ul> \\n  <p><strong>Fuel your passion<\/strong><\/p> \\n  <p>To be successful in this role you will:<\/p> \\n  <ul> \\n   <li>Have a Bachelor's degree in Mechanical Engineering (all fields), Engineering Technology, Mathematics, Chemistry, Geosciences or similar.<\/li> \\n   <li>Graduated from your Bachelors\\u2019 or Master's degree within the last 24 months<\/li> \\n   <li>Average marks 4.0 - 5.0 or the equivalent at your University<\/li> \\n   <li>Be fluent in English (oral and written) and have effective communication skills<\/li> \\n   <li>Be geographically mobile due to location availability of the role<\/li> \\n   <li>Be able to legally work in the country that you are applying in, without company sponsorship or time restriction<\/li> \\n   <li>Have good interpersonal skills, with an aptitude for teamwork and the ability to guide others.<\/li> \\n   <li>Demonstrate good leadership, critical thinking, and numerical skills as well as data analysis and project management abilities.<\/li> \\n  <\/ul> \\n  <p>Through our early careers program, we will provide you with opportunities to grow, flourish, and achieve great things. You will be working in an international organisation and will learn and develop with collaborative and inspiring colleagues.<\/p> \\n  <p>Benefits offered to our Field Engineer program members include:<\/p> \\n  <ul> \\n   <li> <p>Mentorship<\/p> <\/li> \\n   <li> <p>Career development training<\/p> <\/li> \\n   <li> <p>Visibility to senior leaders<\/p> <\/li> \\n   <li> <p>Working in highly diverse teams<\/p> <\/li> \\n   <li> <p>Access to a wide range of career options post program<\/p> <\/li> \\n  <\/ul> \\n  <p><strong>Working with us<\/strong><\/p> \\n  <p>Our people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.<\/p> \\n  <p>Working at Baker Hughes means being at the forefront of the energy transition. Our people are diverse, ambitious and collaborative. Were on a mission to redefine the energy sector by unlocking the power of engineering, data and science.<\/p> \\n  <p><strong>Working for you<\/strong><\/p> \\n  <p>Our inventions have revolutionized energy for over a century. But to keep going forward tomorrow, we know we have to push the boundaries today. We prioritize rewarding those who embrace change with a package that reflects how much we value their input. Join us, and you can expect:<\/p> \\n  <ul> \\n   <li> <p>Medical care options<\/p> <\/li> \\n   <li> <p>Life insurance<\/p> <\/li> \\n   <li> <p>Additional elected or voluntary benefits<\/p> <\/li> \\n  <\/ul> \\n  <p><strong>About Us<\/strong><\/p> \\n  <p>With operations in over 120 countries, we provide better solutions for our customers and richer opportunities for our people. As a leading partner to the energy industry, were committed to achieving net-zero carbon emissions by 2050 and were always looking for the right people to help us get there. People who are as passionate as we are about making energy safer, cleaner and more efficient.<\/p> \\n  <p><strong>Join us<\/strong><\/p> \\n  <p>Are you seeking an opportunity to make a real difference in a company that values innovation and progress? Join us and become part of a team of people who will challenge and inspire you! Let\\u2019s come together and take energy forward.<\/p> \\n  <p>Please ensure you apply as early as possible and no later than <strong>30<\/strong><strong> September 2021<\/strong> to be considered for this role. Final assessments will be held in <strong>October-November 2021<\/strong> and you will be informed if you have been successful in your application as soon as possible. Start date for this role is <strong>December 2021<\/strong> onwards.<\/p>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\\n<div class=\\\"vacancy-section\\\">\\n <h2 data-qa=\\\"bloko-header-2\\\" class=\\\"bloko-header-2\\\">\\u041a\\u043b\\u044e\\u0447\\u0435\\u0432\\u044b\\u0435 \\u043d\\u0430\\u0432\\u044b\\u043a\\u0438<\/h2>\\n <div class=\\\"bloko-spacing-y-5\\\"><\/div>\\n <div>\\n  <div class=\\\"bloko-tag-list\\\">\\n   <div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">\\u0410\\u043d\\u0433\\u043b\\u0438\\u0439\\u0441\\u043a\\u0438\\u0439&nbsp;\\u2014 B2 \\u2014 \\u0421\\u0440\\u0435\\u0434\\u043d\\u0435-\\u043f\\u0440\\u043e\\u0434\\u0432\\u0438\\u043d\\u0443\\u0442\\u044b\\u0439<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Time management<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">\\u0410\\u043d\\u0433\\u043b\\u0438\\u0439\\u0441\\u043a\\u0438\\u0439 \\u044f\\u0437\\u044b\\u043a<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Leadership Skills<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Engineering<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Analytical skills<\/span>\\n    <\/div>\\n   <\/div>\\n  <\/div>\\n <\/div>\\n<\/div>\"}"
}