{
    "id":"Kaggle::techmap::613f38115788b43c71c21ad2::monsterasia_ph::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Slight masculine bias in \"Seize the freedom\", \"empower you to take risks, experiment and explore.\"",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You are interested in gaining an in-depth understanding of commercial operations. You must be amenable to a work schedule of 2 shifts: Monday. Saturday (8:30am - 5:30pm, 1pm-10pm). What we offer. Our success depends on the men and women who come to work every single day with a sense of purpose and an appetite for progress. Join PMI and you too can: Seize the freedom to define your future and ours. We'll empower you to take risks, experiment and explore. Be part of an inclusive, diverse culture, where everyone's contribution is respected collaborate with some of the world's best people and feel like you belong. Pursue your ambitions and develop your skills with a global business. our staggering and scale provides endless opportunities to progress. Take pride in delivering our promise to society: to improve the lives of a billion smokers.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613f38115788b43c71c21ad2::monsterasia_ph\", \"source\": \"monsterasia_ph\", \"country\": \"PH\", \"company\": \"Philip Morris International\", \"position\": \"Area Planning Assistant - Batangas\", \"notes\": \"\", \"original\": \"<br>Be a part of a revolutionary change<br>At PMI, we've chosen to do something incredible. We're totally transforming our business, and building our future on smoke-free products with the power to improve the lives of a billion smokers worldwide.<br>With huge change, comes huge opportunity. So, wherever you join us, you'll enjoy the freedom to dream up and deliver better, brighter solutions and the space to move your career forward in endlessly different directions.<br>Sales and Marketing at PMI feels like building a new business - but with the accumulated expertise of a global brand behind you. Bring us your curiosity and capacity to engage people and you can be part of the digital, onmi-channel team that's driving our huge commercial transformation.<br>If you're a forecaster and forward-thinker, you can make a huge impact, creating sales strategies across all markets. But, here, your innovation will do more than just improving sales. You're not persuading someone to savings account or try a new drinks brand. You're potentially changing the lives of a billion smokers by helping them switch to a better alternative to smoking.<br>Your \\u00e2\\u20ac\\u02dcday to day<br>PMFTC is seeking talented people who is highly analytical, driven, and inquisitive, who would you like to have a pivotal role in influencing commercial plans and activities and join our Area Commercial Planning Group.<br>You will be part of a team responsible for providing the area management team with timely, insightful, and actionable information, and support commercial plans and strategies through insightful analysis and recommendations based on all available data. Your day to day tasks are the following:<br>- Provide commercial planning support to the Sales Team to ensure efficient operation.<br>- Responsible for overall Compliance to iSMS process, including tasks but not limited to (1) FG reconciliation (2) Stock reconciliation (3) Route Plan Maintenance (4) Journey Generation (5) iPAD rotation (6) iPAD run and support<br>- Provide relevant data and analyses covering sales volumes, targets and brand performance.<br>- In coordination with Field Sales Force and Supervisor, regularly reviews Customer Master Data to ensure data accuracy and completeness of customer records<br>Who we're looking for<br>You must have a bachelor's degree, with relevant work experience is an advantage, but fresh graduates with above average academic performance are welcome to apply. You have strong analytical, communication, presentation, and interpersonal skills. You are interested in gaining an in-depth understanding of commercial operations.<br>You must be amenable to a work schedule of 2 shifts: Monday - Saturday (8:30am - 5:30pm, 1pm-10pm)<br>What we offer<br>Our success depends on the men and women who come to work every single day with a sense of purpose and an appetite for progress. Join PMI and you too can:<br>. Seize the freedom to define your future and ours. We'll empower you to take risks, experiment and explore.<br>. Be part of an inclusive, diverse culture, where everyone's contribution is respected collaborate with some of the world's best people and feel like you belong.<br>. Pursue your ambitions and develop your skills with a global business - our staggering and scale provides endless opportunities to progress.<br>. Take pride in delivering our promise to society: to improve the lives of a billion smokers.<br>\"}"
}