{
    "id":"Kaggle::techmap::614e2734ec48034d89c7d8d3::monster2_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Ability to perform normal lifting of stock up to 50 pounds\" does not mention if it is aided or unaided. This could discourage many who are capable of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" The Opportunity. Delaware North Sportservices is hiring friendly Concessions Stand Attendants to join our team at TIAA Bank Field in Jacksonville, Florida. As a Concessions Stand Attendant you will play an important role in the game day experience for fans and guests. This position includes a $200 Hiring Bonus that will be paid after you have worked 6 stadium events to include the Florida vs Georgia game (you must be in good standing at the time of payment). ResponsibilitiesGreets guests, communicates stand offerings, and answers any guest questions in a friendly manner. Serves food and beverage items in correct proportions, following proper sanitation guidelines. Serves alcoholic beverages responsibly, requests identification, adheres to all alcohol service policies and procedures. Records all waste. Participates in set-up of stand, arranges inventory, notifies Stand Lead of any inventory deficiency or shortages. Performs clean-up duties in the stand to maintain the quality appearance of the work area, including cleaning equipment. Properly records all transactions via the point of sale system and informs guests of the amounts owed. Collects the proper money for food and beverage items. Processes credit card or determines correct change for guests. Accounts for all transactions. Maintains accurate cash count and balance banks at end of shift. Performs other duties as assigned. Physical RequirementsConstant standing, walking, bending, reaching and repetitive motions. Ability to remain stationary for entire length of shift. Ability to perform normal lifting of stock up to 50 pounds. May be exposed to variable temperatures, including extreme hold and cold, depending on season. May be required to work in confined and\/or narrow spaces. Who We Are. At Delaware North, youll love where you work, who you work with, and how your day unfolds. Whether its in sporting venues, casinos, airports, national parks, iconic hotels, or premier restaurants, theres no telling where your career can ultimately take you. We empower you to do great work in a company with 100 years of success, stability and growth. If you have drive and enjoy the thrill of making things happen. share our vision and grow with us. Delaware North Companies, Incorporated and its subsidiaries consider applicants for all positions without regard to race, color, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, or any other legally protected status. Delaware North is an equal opportunity employer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614e2734ec48034d89c7d8d3::monster2_us\", \"source\": \"monster2_us\", \"country\": \"US\", \"company\": \"Delaware North\", \"position\": \"Concessions Setup Team, TIAA Bank Field\", \"notes\": \"\", \"original\": \"The OpportunityDelaware North Sportservices is&nbsp;hiring friendly Concessions Stand Attendants to join our team at TIAA Bank Field in Jacksonville, Florida. As a Concessions Stand Attendant you will play an important role in the game day experience for fans and guests.&nbsp;This position includes a&nbsp;$200 Hiring Bonus&nbsp;that will be paid after you have worked&nbsp;6 stadium events to include the Florida&nbsp;vs Georgia game&nbsp;<em>(you must be in good standing at the time of payment).<\/em>ResponsibilitiesGreets guests, communicates stand offerings, and answers any guest questions in a friendly manner.Serves food and beverage items in correct proportions, following proper sanitation guidelines.Serves alcoholic beverages responsibly, requests identification, adheres to all alcohol service policies and procedures.Records all waste.Participates in set-up of stand, arranges inventory, notifies Stand Lead of any inventory deficiency or shortages.Performs clean-up duties in the stand to maintain the quality appearance of the work area, including cleaning equipment.Properly records all transactions via the point of sale system and informs guests of the amounts owed.Collects the proper money for food and beverage items; processes credit card or determines correct change for guests.Accounts for all transactions; maintains accurate cash count and balance banks at end of shift.Performs other duties as assigned.Physical RequirementsConstant standing, walking, bending, reaching and repetitive motions.&nbsp;Ability to remain stationary for entire length of shift.Ability to perform normal lifting of stock up to 50 pounds.May be exposed to variable temperatures, including extreme hold and cold, depending on season.May be required to work in confined and\/or narrow spaces.Who We AreAt Delaware North, you\\u2019ll love where you work, who you work with, and how your day unfolds. Whether it\\u2019s in sporting venues, casinos, airports, national parks, iconic hotels, or premier restaurants, there\\u2019s no telling where your career can ultimately take you. We empower you to do great work in a company with 100 years of success, stability and growth. If you have drive and enjoy the thrill of making things happen - share our vision and&nbsp;grow with us.Delaware North Companies, Incorporated and its subsidiaries consider applicants for all positions without regard to race, color, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, or any other legally protected status.&nbsp; Delaware North is an equal opportunity employer.&nbsp;&nbsp;\"}"
}