{
    "id":"Kaggle::techmap::614b3c337a36085d14ce95f2::linkedin_us::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"A Lead Teacher at The Goddard School is responsible for establishing and maintaining a safe, healthy and nurturing learning environment. Additionally, a Lead Teacher is responsible to work together with an Assistant Teacher and in conjunction with the entire faculty. General Qualifications. A Lead Teacher must meet the qualifications of his\/her state and those set forth in the National Standards for hiring (see www. bls. gov), including the following: Ability to hear the conversational voice, with or without a hearing aid. Ability to see and read newsprint, with or without corrective lenses. Ability to speak and be understood under normal circumstances. Ability to lift and carry children and other items weighing up to 50 pounds. Ability to use arms, hands, legs, and feet, with or without corrective devices. This includes the ability to evacuate the building during emergencies. Ability to handle crisis situations, especially where children are involved. Ability to respond immediately to emergency situations. Lead Teacher educational requirements are the same as Director educational requirements (see Director educational requirements or one of several other criteria listed below). Educational Qualifications. All candidates, who wish to be considered for the position of Lead Teacher must meet one or more of the following criteria, in addition to any\/all requirements that may be mandated by their state and\/or local licensing authorities: A Bachelor’s degree or higher in Early Childhood Education, Elementary Education, Child Development. A Bachelor’s degree or higher in a related field1, including 18 semester hours of completed coursework related to young children birth to age 8. An Associate’s degree or higher in Early Childhood Education, Elementary Education, Child Development or a related field1. An Associate’s degree or higher in a related field1, including 18 semester hours of completed coursework related to young children birth to age 8. A current CDA or Early Childhood Teaching Credential. Proof of current and active enrollment in a CDA Credentialing Program. Proof of current and active enrollment in an accredited Associate’s or Bachelor’s degree program in Early Childhood Education or a related field. 45 Hour Infant\/Toddler Certification. RN or LPN with emphasis on the young child including at least one class in Child Development or Human Growth Development (For Infant, Toddler, Get Set only). Lead Teacher Responsibilities. A Lead Teacher’s responsibilities may include, but are not limited to, the following: Establish and maintain a safe, healthy and nurturing learning environment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b3c337a36085d14ce95f2::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"The Goddard School\", \"position\": \"Infant\/ToddlerTeacher and Assistant Teachers\", \"notes\": \"\", \"original\": \"A Lead Teacher at The Goddard School is responsible for establishing and maintaining a safe, healthy and nurturing learning environment. Additionally, a Lead Teacher is responsible to work together with an Assistant Teacher and in conjunction with the entire faculty.<br><br><strong><u>General Qualifications<br><br><\/u><\/strong>A Lead Teacher must meet the qualifications of his\/her state and those set forth in the National Standards for hiring (see www.bls.gov), including the following:<br><ul><li> Ability to hear the conversational voice, with or without a hearing aid<\/li><li> Ability to see and read newsprint, with or without corrective lenses<\/li><li> Ability to speak and be understood under normal circumstances<\/li><li> Ability to lift and carry children and other items weighing up to 50 pounds<\/li><li> Ability to use arms, hands, legs, and feet, with or without corrective devices; this includes the ability to evacuate the building during emergencies<\/li><li> Ability to handle crisis situations, especially where children are involved<\/li><li> Ability to respond immediately to emergency situations<\/li><li> Lead Teacher educational requirements are the same as Director educational requirements (see Director educational requirements or one of several other criteria listed below)<br><\/li><\/ul><strong><u>Educational Qualifications<br><br><\/u><\/strong>All candidates, who wish to be considered for the position of Lead Teacher must meet one or more of the following criteria, in addition to any\/all requirements that may be mandated by their state and\/or local licensing authorities:<br><ul><li> A Bachelor\\u2019s degree or higher in Early Childhood Education, Elementary Education, Child Development.<\/li><li> A Bachelor\\u2019s degree or higher in a related field1, including 18 semester hours of completed coursework related to young children birth to age 8.<\/li><li> An Associate\\u2019s degree or higher in Early Childhood Education, Elementary Education, Child Development or a related field1.<\/li><li> An Associate\\u2019s degree or higher in a related field1, including 18 semester hours of completed coursework related to young children birth to age 8.<\/li><li> A current CDA or Early Childhood Teaching Credential.<\/li><li> Proof of current and active enrollment in a CDA Credentialing Program.<\/li><li> Proof of current and active enrollment in an accredited Associate\\u2019s or Bachelor\\u2019s degree program in Early Childhood Education or a related field.<\/li><li> 45 Hour Infant\/Toddler Certification<br><\/li><\/ul>RN or LPN with emphasis on the young child including at least one class in Child Development or Human Growth Development (For Infant, Toddler, Get Set only).<br><br>Lead Teacher Responsibilities<br><br>A Lead Teacher\\u2019s responsibilities may include, but are not limited to, the following:<br><br>Establish and maintain a safe, healthy and nurturing learning environment<br><ul><li> Design an appropriate room arrangement to support the goals and developmental level of the children in the classroom<\/li><li> Develop an appropriate classroom management system to support the goals and developmental level of the children in the classroom<\/li><li> Ensure that classroom equipment is in good repair<\/li><li> Understand and implement The Goddard School\\u00ae emergency procedure(s)<\/li><li> Promote healthy eating practices at lunch and snack times<\/li><li> Ensure that children are always within state ratio requirements<\/li><li> Perform nominal cleaning responsibilities (e.g., spills) immediately<\/li><li> Perform major cleaning during times when children are not present<\/li><li> Post a classroom schedule that meets the needs of the children and includes a routine and learning opportunities<\/li><li> Post and adhere to all GSI Health and Safety policies and procedures<br><\/li><\/ul>Advance children\\u2019s physical and intellectual competence<br><ul><li> Adapt program to meet the individual needs of each child<\/li><li> Create a multi-cultural learning environment<\/li><li> Provide a variety of developmentally appropriate materials<\/li><li> Interact with the children to support play, exploration and learning<\/li><li> Encourage children to talk with each other and with the faculty<\/li><li> Present age- and developmentally-appropriate expectations for all children<\/li><li> Create a print-rich environment in order for children to learn about books, literature and writing<\/li><li> Encourage creativity through art, music, dramatic play and blocks<\/li><li> Provide a reasonable balance between teacher-directed and child-directed activities<\/li><li> Provide opportunities for both active and quiet play<\/li><li> Integrate GSI resources (including Enrichment Programs) into lesson plans<br><\/li><\/ul>Support each child\\u2019s social and emotional development and provide positive guidance<br><ul><li> Understand and adhere to the GSI Behavior Policy<\/li><li> Plan and implement activities to develop children\\u2019s self-esteem and social skills<\/li><li> Plan and implement activities to enable children\\u2019s feeling of security<\/li><li> Encourage empathetic and respectful feelings for others, as well as the environment, through positive modeling<\/li><li> Respect cultural and ethnic diversity<br><\/li><\/ul>Establish positive and effective family relations<br><ul><li> Communicate, in a professional manner, with families and faculty<\/li><li> Encourage families to become an integral part of their children\\u2019s learning experiences<\/li><li> Provide opportunities (e.g., conferences) in which families are made to feel a part of their children\\u2019s learning experiences<\/li><li> Prepare a Daily Activity Report for each child<\/li><li> Maintain a portfolio for each child<\/li><li> Maintain the classroom Parent Board<br><\/li><\/ul>Ensure an effective program, responsive to children\\u2019s needs<br><ul><li> Assess supplies and materials needed to implement activities<\/li><li> Build teamwork<\/li><li> Develop lesson plan books and posted lesson plans<\/li><li> Manage classrooms according to GSI QA Standards<\/li><li> Perform child observations and document in their portfolios<\/li><li> Use assessment tools (e.g., Progress Reports, Children\\u2019s Progress)<br><\/li><\/ul>Maintain professional commitment<br><ul><li> Promote GSI philosophy and educational objectives<\/li><li> Support a code of ethical conduct<\/li><li> Pursue professional development\/continuing education<\/li><li> Attend faculty meetings, in-service days, conferences and professional growth opportunities<br><\/li><\/ul>FOREIGN DEGREES<br><ul><li> All foreign degrees MUST be converted to U.S. credits.<\/li><li> All foreign courses and\/or credit hours must be converted to U.S. standards.<br><\/li><\/ul>Related Degrees Include, But May Not Be Limited To<br><ul><li> Elementary Education<\/li><li> Home Economics<\/li><li> Child Development<\/li><li> Child Life<\/li><li> Psychology or Sociology with a minor in Education<\/li><li> Special Education<\/li><li> Child Psychology<br><\/li><\/ul>Relevant Coursework<br><ul><li> Child Development<\/li><li> Human Growth and Development<\/li><li> Educational Psychology<\/li><li> Child Psychology<\/li><li> Methods: Age Birth to 8 years<\/li><li> Children\\u2019s Literature<\/li><li> Developmental Assessment of Young Children<\/li><li> Measurement and Evaluation<\/li><li> Nutrition<\/li><li> Health and Safety<\/li><li> Child Care Administration<\/li><\/ul>\"}"
}