{
    "id":"Kaggle::techmap::61549a3318d1697280f55b2a::linkedin_cn::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"S\/He\" can be seen as excluding those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Support grant audits, in coordination with Regional Controller. Support Country Programs in understanding WCS grant management processes, systems, tools and donor compliance requirements. Provide training and on-going capacity building to country program staff. Engage as part of the WCS grants management team, including NY compliance managers and grants managers from other WCS regions, sharing and drawing from lessons learned. Maintain accurate records in WCS databases of regional project funding, including contracts, project budgets, and donor-specific procedures and regulations. Ensure the same is done at the country program level by the country finance teams. Qualification Requirements. Excellent written and oral communication skills and comfort participating as both an effective contributor, leader and listener in group settings. S\/He must be well organized, self-motivated, resourceful, effective, and efficient at coordinating multiple resources to get things done, with exemplary attention to detail. Can work on multiple tasks at multiple levels and switch between them. Can foresee and plan around obstacles. Proven grant and financial management experience in an international organization (5 years) in a multi-funder environment required. Experience in managing substantial (USD 1million) USAID, EU, UNDP and\/or other bilateral\/multilateral grants. Able to exhibit superb professional judgment and willing to make informed compliance decisions. Ability to work on multiple tasks at multiple levels in a fast-paced environment is a necessity. Effective roll up the sleeves work ethic. Demonstrated ability to work with diverse, multi-cultural teams. Must be solution-oriented, and have strong problem solving and analytical skills and the ability to creatively contribute to thinking on regional issues. Self-motivated and organized with attention to detail. Superb professional judgment in ambiguous situations. Excellent leadership and interpersonal skills, with attention to mentorship and professional development of finance staff. Ability to work in challenging environments. Bachelor degree required, MBA or CPA preferred. Related program of study such as finance, accounting, economics or business highly preferred. Ability to work after normal business hours as necessary, in order to meet deadlines and \/ or communicate with New York-based groups. Available to travel as needed to NY and throughout the Temperate Asia region. Language requirement: English fluency required. Excellent computer and systems skills required with respect to MS Office applications (advanced skills in MS Excel required) and major financial accounting and reporting software (SAP or equivalent). EOE\/AA\/M\/F\/Vets\/Disabled. Please note that only shortlisted candidates will be contacted for interview.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61549a3318d1697280f55b2a::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"Wildlife Conservation Society\", \"position\": \"Regional Grants Manager \\u2013 Temperate Asia region\", \"notes\": \"\", \"original\": \"<strong><u>Job Description<br><br><\/u><\/strong><strong>Reports to<\/strong>: Regional Business Manager \\u2013 Temperate Asia region Temperate Asia region<br><br><strong>Location:<\/strong> To be based at the WCS office in Beijing, China<br><br><strong>Country Program\/Sector:<\/strong> Global Conservation Program, Asia Conservation Program<br><br><strong>Position Type:<\/strong> Full-Time<br><br><strong><u>Background<br><br><\/u><\/strong>The Wildlife Conservation Society (WCS) is an international conservation NGO headquartered at the Bronx Zoo in New York City working to save wildlife and wild lands and to meet global conservation challenges in over 60 countries in Africa, Asia, and the Americas.<br><br>To support the Asia Conservation program\\u2019s Temperate Asia region, WCS seeks a detail-oriented, dynamic, well-organized, hard-working, and committed team player to oversee the administration, reporting, compliance and finances of grants in the region.<br><br>This position reports to the Regional Business Manager for the Temperate Asia region. This position will liaise closely with country program staff and the country office finance\/administrative staff located in China, Russia, Afghanistan and Mongolia. The position will also liaise closely with departments at WCS HQ in the Bronx including Office of the General Counsel, Finance Operations, Compliance and Program Development, and Global Resources \/ Fundraising. Communication with donors on grant management issues and financial report submission will also be required.<br><br><strong><u>Primary Responsibilities<br><\/u><\/strong><ul><li>Oversee the administration and finances of grants in the assigned region.<\/li><li>Review country and regional-level grant and contract proposal budgets as requested, ensuring that budgets comply with WCS and donor policies, cover program costs and contribute to strengthening the Country and Regional Program(s). Noting that in some cases the Grants Manager will lead budget development; ensure that budgets are in line with long-term financial plan for the Country and Regional Program; and undergo appropriate reviews. <\/li><li>Coordinate\/prepare financial reports for regional grants, and review and approve grant financial reports prepared by Country Programs, which includes verifying the reports to the WCS Financial System and checking for compliance with WCS and donor policies.<\/li><li>Review all grant agreements and contracts within the region and work with NY departments to support negotiation and final signature. <\/li><li>Ensure regional grant administration is on track and support country-level grant administration.<\/li><li>Responsible for tracking compliance to donor requirements, such as financial and procurement regulations, visibility and branding, etc., from proposal through grant close out.<\/li><li>Coordinate sub-grant compliance in the region, working with the country programs and the sub-grant manager in NY to provide support in the assessment, monitoring, and closeout of sub grantees.<\/li><li>Support grant audits, in coordination with Regional Controller.<\/li><li>Support Country Programs in understanding WCS grant management processes, systems, tools and donor compliance requirements. Provide training and on-going capacity building to country program staff.<\/li><li>Engage as part of the WCS grants management team, including NY compliance managers and grants managers from other WCS regions, sharing and drawing from lessons learned.<\/li><li>Maintain accurate records in WCS databases of regional project funding, including contracts, project budgets, and donor-specific procedures and regulations; ensure the same is done at the country program level by the country finance teams.<br><\/li><\/ul><strong><u>Qualification Requirements<br><br><\/u><\/strong>Excellent written and oral communication skills and comfort participating as both an effective contributor, leader and listener in group settings. S\/He must be well organized, self-motivated, resourceful, effective, and efficient at coordinating multiple resources to get things done, with exemplary attention to detail; can work on multiple tasks at multiple levels and switch between them; can foresee and plan around obstacles.<br><ul><li>Proven grant and financial management experience in an international organization (5+ years) in a multi-funder environment required.<\/li><li>Experience in managing substantial (&gt;USD 1million) USAID, EU, UNDP and\/or other bilateral\/multilateral grants.<\/li><li>Able to exhibit superb professional judgment and willing to make informed compliance decisions. <\/li><li>Ability to work on multiple tasks at multiple levels in a fast-paced environment is a necessity.<\/li><li>Effective \\u201croll up the sleeves\\u201d work ethic; Demonstrated ability to work with diverse, multi-cultural teams. Must be solution-oriented, and have strong problem solving and analytical skills and the ability to creatively contribute to thinking on regional issues.<\/li><li>Self-motivated and organized with attention to detail; superb professional judgment in ambiguous situations.<\/li><li>Excellent leadership and interpersonal skills, with attention to mentorship and professional development of finance staff.<\/li><li>Ability to work in challenging environments.<\/li><li>Bachelor degree required, MBA or CPA preferred. Related program of study such as finance, accounting, economics or business highly preferred.<\/li><li>Ability to work after normal business hours as necessary, in order to meet deadlines and \/ or communicate with New York-based groups.<\/li><li>Available to travel as needed to NY and throughout the Temperate Asia region. <\/li><li>Language requirement: English fluency required.<\/li><li>Excellent computer and systems skills required with respect to MS Office applications (advanced skills in MS Excel required) and major financial accounting and reporting software (SAP or equivalent).<br><\/li><\/ul>EOE\/AA\/M\/F\/Vets\/Disabled<br><br><strong>Please note that only shortlisted candidates will be contacted for interview.<br><br><\/strong>\"}"
}