{
    "id":"Kaggle::techmap::615f5ea6e9bb475bf005e4de::cvlibrary_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". Recruitment | Training | Business Advice & Consultancy. Vacancy profile. Job Title: Area Resourcing Consultant. Location: South West Region (Covering Bridgwater, Taunton and Somerset). Salary: £25, 000. monthly car allowance. An exciting opportunity has arisen to work as an Area Resourcing Consultant covering the South West specifically Bridgwater, Taunton and Somerset. Day to Day Responsibilities: Sourcing candidates for live vacancies using a variety of different sources such as searching job boards, referrals, website applications, job fairs and networking via social media. Conducting in-depth telephone screenings to evaluate the skill set and competency of candidates as well as their culture fit. Booking in candidates for interview. Ensuring the Recruiting Manager has all of the relevant interview documentation. Conducting face to face interviews as and when needed. Delivering feedback to candidates post interview. Verbally offering candidates and updating the in-house system. Tracking weekly activity within recruitment such as leavers, new starters and agency usage. Chasing of references to be completed alongside other support. Keeping in touch regularly with candidates who are in process. The Candidate. You will have excellent customer service skills. Previous experience of interviewing candidates would be advantageous. Working in a similar resourcing role again would be ideal. Car Driver. Previous experience within Health Care would be advantageous.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615f5ea6e9bb475bf005e4de::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Optima UK Inc Ltd\", \"position\": \"Area Resourcing Consultant\", \"notes\": \"\", \"original\": \"<br><br>Recruitment | Training | Business Advice &amp; Consultancy<br><br>Vacancy profile<br><br>Job Title: Area Resourcing Consultant<br><br>Location: South West Region (Covering Bridgwater, Taunton and Somerset)<br><br>Salary: &pound;25,000 + monthly car allowance<br><br>An exciting opportunity has arisen to work as an Area Resourcing Consultant covering the South West specifically Bridgwater, Taunton and Somerset.<br><br>Day to Day Responsibilities:<br><br>Sourcing candidates for live vacancies using a variety of different sources such as searching job boards, referrals, website applications, job fairs and networking via social media<br><br>Conducting in-depth telephone screenings to evaluate the skill set and competency of candidates as well as their culture fit<br><br>Booking in candidates for interview<br><br>Ensuring the Recruiting Manager has all of the relevant interview documentation<br><br>Conducting face to face interviews as and when needed<br><br>Delivering feedback to candidates post interview<br><br>Verbally offering candidates and updating the in-house system<br><br>Tracking weekly activity within recruitment such as leavers, new starters and agency usage<br><br>Chasing of references to be completed alongside other support<br><br>Keeping in touch regularly with candidates who are in process<br><br>The Candidate<br><br>You will have excellent customer service skills<br><br>Previous experience of interviewing candidates would be advantageous<br><br>Working in a similar resourcing role again would be ideal<br><br>Car Driver<br><br>Previous experience within Health Care would be advantageous<br><br>\"}"
}