{
    "id":"Kaggle::techmap::614a798e287b955e077cff75::monsterasia_my::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 5-7 years of relevant workexperience. Excellent verbal and written communication skills. Outgoing and proactive personality. Ideally, you also have Good knowledge of how accounting systems (e. g. SAP, etc) are set-up and used to generate data and compliance. Understanding of databases. Experience in development with SharePoint. A background in IT. Verbal and written communication skillsin Mandarin. Experience working in public accounting firms and accreditation by SIATP. What we look for. Highly motivated individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in a rapidly changing industry. An effective communicator, you'll be a confident team player that collaborates with people from various teams while looking to develop your career in a dynamic organization. What working at EY offers. EY offers a competitive remuneration package where you'll be rewarded for your individual and team performance. We are committed to being an inclusive employer and are happy to consider flexible working arrangements. Plus, we offer: Continuous learning: You'll develop the mindset and skills to navigate whatever comes next. Success as defined by you: We'll provide the tools and flexibility, so you can make a meaningful impact, your way. Transformative leadership:We'll give you the insights, coaching and confidence to be the leader the world needs. Diverse and inclusive culture: You'll be embraced for who you are and empowered to use your voice to help others find theirs. If you can demonstrate that you meet the criteria above, please contact us as soon as possible. The exceptional EY experience. It's yours to build. EY  Building a better working world. EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614a798e287b955e077cff75::monsterasia_my\", \"source\": \"monsterasia_my\", \"country\": \"MY\", \"company\": \"EYA GTH Manila Inc\", \"position\": \"Technology and Transformation (Tax\/Finance) , Manager\", \"notes\": \"\", \"original\": \"<br>Our Tax Technology and Transformation practice provides a wide range of services around various tax operational challenges that our clients face with respect to technology, data, process and people. As part of a global team of tax and technology professionals in 150 countries, you will get plenty of opportunities to use and build upon your experience in strategy and process consulting, data management, implementation of tax software solutions and designing and building tax requirements for various systems to help our clients improve the performance of tax functions.<br><b>The opportunity<\/b><br>As a member of the Tax Technology & Transformation practice, you will be the trusted advisor with a deep understanding of systems, tools and practices across the tax\/finance function with a business oriented mindset. You will lead end-to-end delivery of a range of exciting projects that will have significant impact on our clients businesses. You will advise our clients on the strategic and operational challenges facing their tax\/finance functions by delivering technology enabled transformation advice.<br><b>Your key responsibilities<\/b><ul><li>Data and Systems Effectiveness: Embed the needs of Tax\/Finance intoIT systems to increase automation and data quality throughout tax\/finance processes automate tax\/finance processing, tax compliance and reporting through various tax\/finance technologies<\/li><li>Define project objectives and scope utilizing expert knowledge of project management practices and procedures <\/li><li>Responsible for the Project Management Plan, which includes areas such as a business case, work plan, schedule, budget, resource plan, communication plan, change plan, and risk plan. Translate key implications from business strategy into execution and act as strategic partner of business<\/li><li>Process and Controls Enhancement: Re-design and deploy streamlined tax processes including new technology solutions with clear roles and responsibilities, standardized work processes, proper controls embedded to manage risks<\/li><li>Risk Management: Assess and prioritize tax risks to establish a proper control environment that takes if into account the various regulatory regimes<\/li><\/ul><br><b>Skills and attributes for success <\/b><ul><li>To be an empowered partner who will drive results, proactively identify and resolve problems<\/li><li>Ability to keep up with project management technology, trends and best practices<\/li><li>A keen interest and experience in improving the performance of tax functions <\/li><li>Demonstrated ability to team with and motivate others <\/li><li>Willingness to develop meaningful and influential relationships with clients and colleagues<\/li><li>Strong leadership, attention to detail, problem-solving skills and analytical abilities<\/li><\/ul><br><b>To qualify for the role you must have<\/b><ul><li>A degree in Tax, Accounting or Business <\/li><li>5-7 years of relevant workexperience<\/li><li>Excellent verbal and written communication skills<\/li><li>Outgoing and proactive personality<\/li><\/ul><br><b>Ideally, you also have<\/b><ul><li>Good knowledge of how accounting systems (e.g. SAP, etc) are set-up and used to generate data and compliance<\/li><li>Understanding of databases<\/li><li>Experience in development with SharePoint<\/li><li>A background in IT<\/li><li>Verbal and written communication skillsin Mandarin<\/li><li>Experience working in public accounting firms and accreditation by SIATP<\/li><\/ul><br><b>What we look for<\/b><br>Highly motivated individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in a rapidly changing industry. An effective communicator, you'll be a confident team player that collaborates with people from various teams while looking to develop your career in a dynamic organization.<br><b>What working at EY offers<\/b><br>EY offers a competitive remuneration package where you'll be rewarded for your individual and team performance. We are committed to being an inclusive employer and are happy to consider flexible working arrangements. Plus, we offer: <ul><li><b>Continuous learning:<\/b> You'll develop the mindset and skills to navigate whatever comes next.<\/li><li><b>Success as defined by you:<\/b> We'll provide the tools and flexibility, so you can make a meaningful impact, your way.<\/li><li><b>Transformative leadership: <\/b>We'll give you the insights, coaching and confidence to be the leader the world needs.<\/li><li><b>Diverse and inclusive culture:<\/b> You'll be embraced for who you are and empowered to use your voice to help others find theirs.<\/li><\/ul><br><b>If you can demonstrate that you meet the criteria above, please contact us as soon as possible.<\/b><br><b>The exceptional EY experience. It's yours to build. <\/b><br><b>EY | Building a better working world<\/b><br>EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.<br>Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.<br>Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\"}"
}