{
    "id":"Kaggle::techmap::61432d737ea9bc0ff350fd4a::seek_au::10",
    "label_age":true,
    "analysis_age":"\" recent graduate\" is biased against older graduates",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Graduate level role. Supportive & inclusive team. Maddocks is committed to making a difference for our clients, our people and the communities in which we operate. About the role. The Maddocks Business Development, Communications and Marketing (BCM) team works with the firm’s partners and legal teams to connect with our clients, win work and position the Maddocks brand in the market. Due to growth, a fantastic opportunity has arisen in our BCM team for an energetic and enthusiastic Marketing Advisor, with a ‘can do’ attitude. This is an exciting and varied role for someone who is looking for their initial step into professional services marketing and will provide the candidate with ongoing opportunities to learn and develop their marketing skills. This important role is the glue that binds the team. Providing support to our 4 senior BD team members in Sydney and the wider BCM team, you will be involved in all aspects of our go-to-market strategy, from event management and thought leadership distribution and reporting through to digital, design and proposal requirements. Your responsibilities will include but are not limited to: Co-ordination and project management of a wide range of internal and external events and seminars (including virtual event management). Producing and distributing client marketing communications campaigns. Utilising the firm’s CRM system and e. Dm platform to maintain and produce mailing and event lists and to produce campaign analysis. Activation of agreed sponsorships. Client research and market analysis. Developing and maintaining a range of branded marketing materials. Assisting with the preparation of marketing materials including proposal content. General administrative duties including invoicing, budget management, scheduling, and other administrative tasks. We work flexibly at Maddocks, whether that's hours, place of work, the leave you take or the everyday flexibility that we all need from time to time. We welcome the opportunity to talk to you about working flexibly. About you. You will be either a recent graduate or someone with up to 3 years professional experience, preferably with a degree qualification in Marketing, Business or Communications. As this is an entry level position, previous marketing experience in a professional services environment is advantageous but is not essential. To be successful in this role, you will have: Excellent written and verbal communication skills including the ability to communicate with stakeholders at all levels.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61432d737ea9bc0ff350fd4a::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Maddocks\", \"position\": \"Marketing Advisor - Business Development, Communications and Marketing\", \"notes\": \"\", \"original\": \"<br \/><ul><li><strong>Graduate level role<\/strong><\/li><li><strong>Supportive &amp; inclusive team<\/strong><\/li><\/ul><p>Maddocks is committed to making a difference for our clients, our people and the communities in which we operate.<\/p><p><strong>About the role<\/strong><\/p><p>The Maddocks Business Development, Communications and Marketing (BCM) team works with the firm\\u2019s partners and legal teams to connect with our clients, win work and position the Maddocks brand in the market.<\/p><p>Due to growth, a fantastic opportunity has arisen in our BCM team for an energetic and enthusiastic Marketing Advisor, with a \\u2018can do\\u2019 attitude. This is an exciting and varied role for someone who is looking for their initial step into professional services marketing and will provide the candidate with ongoing opportunities to learn and develop their marketing skills.\\u00a0<\/p><p>This important role is the glue that binds the team. Providing support to our 4 senior BD team members in Sydney and the wider BCM team, you will be involved in all aspects of our go-to-market strategy, from event management and thought leadership distribution and reporting through to digital, design and proposal requirements.<\/p><p>Your responsibilities will include but are not limited to:<\/p><ul><li>Co-ordination and project management of a wide range of internal and external events and seminars (including virtual event management)<\/li><li>Producing and distributing client marketing communications campaigns<\/li><li>Utilising the firm\\u2019s CRM system and eDm platform to maintain and produce mailing and event lists and to produce campaign analysis<\/li><li>Activation of agreed sponsorships<\/li><li>Involvement in digital channels (social media, website, intranet)<\/li><li>Client research and market analysis<\/li><li>Developing and maintaining a range of branded marketing materials<\/li><li>Assisting with the preparation of marketing materials including proposal content<\/li><li>General administrative duties including invoicing, budget management, scheduling, and other administrative tasks.<\/li><\/ul><p>We work flexibly at Maddocks, whether that's hours, place of work, the leave you take or the everyday flexibility that we all need from time to time. We welcome the opportunity to talk to you about working flexibly.\\u00a0<\/p><p><strong>About you<\/strong><\/p><p>You will be either a recent graduate or someone with up to 3 years professional experience, preferably with a degree qualification in Marketing, Business or Communications. As this is an entry level position, previous marketing experience in a professional services environment is advantageous but is not essential.<\/p><p>To be successful in this role, you will have:<\/p><ul><li>Excellent written and verbal communication skills including the ability to communicate with stakeholders at all levels<\/li><li>Competency to produce polished &amp; quality content and correspondence as demonstrated through your strong attention to detail and proofreading skills<\/li><li>The ability to prioritise work and coordinate other resources as needed<\/li><li>A proactive and collaborative approach to work<\/li><li>Willingness to learn, a \\u2018can do\\u2019 attitude, a continuous growth mindset and client focused approach.<\/li><\/ul><p><strong>About us<\/strong><\/p><p>We are a proudly independent Australian law firm that works closely with corporations, businesses and governments throughout Australia and internationally. We have a particular focus on the built environment, education, government, healthcare and technology sectors.<\/p><p><strong>What makes us unique<\/strong><\/p><p>We understand that our people are our greatest asset and we invest heavily in attracting and retaining the best. We value collaboration, knowledge sharing and high standards of professionalism. We look for diversity of experience and background and then provide the tools and training for career success.<\/p><p>We are proud leaders of the legal profession when it comes to promoting a diverse workforce. We have been an Employer of Choice for Gender Equality by the Workforce Gender Equality Agency every year since 2004. We promote diversity internally through our Maddocks Women and Maddocks Pride groups and we are committed to sustainability, through our membership of the Australian Legal Sector Alliance (AusLSA).<\/p><p><strong>Interested?<\/strong><\/p><p>We prefer to deal with you directly. Please submit your CV and covering letter to Laura George, P&amp;C Advisor, by clicking on the 'Apply' button. For further information, please refer to our website www.maddocks.com.au\\u00a0<\/p><p>As part of the recruitment process we request that the preferred applicant participates in a National Police Check, prior to offer of employment at Maddocks. Please note that people with criminal records are not automatically barred from applying for this position and each application will be considered on its merits.<\/p><p><em>To be eligible for this role you must be legally permitted to work in Australia. Please note that unsolicited applications from agencies will not be considered at this time.\\u00a0<\/em><\/p>\"}"
}