{
    "id":"Kaggle::techmap::61688062ecf81565dd7990f0::monster_us::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The requirement to stand for up to 90 minutes and supervise students in various settings could implicitly exclude candidates with certain physical disabilities. Being in a wheelchair, for instance, does not hinder the ability to impart knowledge.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description ACCEL Schools is seeking a highly-qualified High School Social Studies Teachers for Eastland Preparatory Academy in Columbus, OH dedicated to providing a superior education for all students in our upcoming 2021-2022 school year! We are seeking teachers who are excited to create a rigorous and nurturing classroom environment that prioritizes student learning and social-emotional development. With a network of 50 charter schools and growing, ACCEL Schools employs a diverse staff of passionate administrators and educators who value research-based practices and a desire to grow as professionals. We work tirelessly to raise student achievement, regardless of historical barriers, while committed to participating in ongoing professional development, job embedded instructional coaching, and embracing a growth mindset. Responsibilities: Relentlessly work to meet all goals related to student achievement and culture as well as Adequate Yearly Progress (AYP) goals. Deliver highly effective daily lessons based on student need, rooted in research-based instructional practices. Differentiate instruction to meet the needs of all students. Utilize research-based best practices in daily planning and classroom instruction. Create a joyful, caring, and loving classroom environment for all students. Integrate culturally responsive teaching practices into daily lessons and interactions with students, parents, and colleagues. Implement school-wide culture expectations and norms, inside the classroom and beyond. Communicate regularly with families regarding the academic and social-emotional growth of their child. Incorporate 21st century technology skills into daily classroom practice and team settings. Collaborate and communicate effectively, humbly, and respectfully with all colleagues. Perform other duties as assigned. Qualifications: Current state teaching license in appropriate content area. Knowledge of State Standards and Common Core Standards. Preferred two years’ experience teaching. High level of comfort working in a growth-focused coaching environment based on frequent observations, debriefs, action planning, and progress monitoring. High quality written and verbal communication skills. High proficiency in Microsoft Office products including Word and Outlook. Ability to properly manage confidential information. Ability to stand for up to 90 minutes at a time. Ability to supervise students in all school settings, including in a classroom, on playground or in another play setting, in a meal room, and\/or transitioning between any of these settings. Ability to pass federal and state criminal background checks. Experience working in a multi-cultural setting preferred. EQUAL EMPLOYMENT OPPORTUNITY.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61688062ecf81565dd7990f0::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"ACCEL Schools\", \"position\": \"High School Social Studies Teacher\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>ACCEL Schools is seeking a highly-qualified <strong>High School Social Studies Teachers for Eastland Preparatory Academy in Columbus, OH<\/strong> dedicated to providing a superior education for all students in our upcoming 2021-2022 school year!&nbsp; We are seeking teachers who are excited to create a rigorous and nurturing classroom environment that prioritizes student learning and social-emotional development.&nbsp;<\/p> <p>With a network of 50 charter schools and growing, ACCEL Schools employs a diverse staff of passionate administrators and educators who value research-based practices and a desire to grow as professionals. We work tirelessly to raise student achievement, regardless of historical barriers, while committed to participating in ongoing professional development, job embedded instructional coaching, and embracing a growth mindset.<\/p> <p><strong>Responsibilities:<\/strong><\/p> <ul> <li>Relentlessly work to meet all goals related to student achievement and culture as well as Adequate Yearly Progress (AYP) goals.<\/li> <li>Deliver highly effective daily lessons based on student need, rooted in research-based instructional practices.<\/li> <li>Differentiate instruction to meet the needs of all students.<\/li> <li>Utilize research-based best practices in daily planning and classroom instruction.<\/li> <li>Create a joyful, caring, and loving classroom environment for all students.<\/li> <li>Integrate culturally responsive teaching practices into daily lessons and interactions with students, parents, and colleagues.<\/li> <li>Implement school-wide culture expectations and norms, inside the classroom and beyond.<\/li> <li>Communicate regularly with families regarding the academic and social-emotional growth of their child.<\/li> <li>Incorporate 21st century technology skills into daily classroom practice and team settings.<\/li> <li>Participate in the planning and implementation of non-instructional activities such as social events and field trips<\/li> <li>Collaborate and communicate effectively, humbly, and respectfully with all colleagues.<\/li> <li>Perform other duties as assigned<\/li> <\/ul> <p><strong>Qualifications:<\/strong><\/p> <ul> <li>Current state teaching license in appropriate content area<\/li> <li>Knowledge of State Standards and Common Core Standards<\/li> <li>Preferred two years\\u2019 experience teaching<\/li> <li>High level of comfort working in a growth-focused coaching environment based on frequent observations, debriefs, action planning, and progress monitoring.<\/li> <li>High quality written and verbal communication skills<\/li> <li>High proficiency in Microsoft Office products including Word and Outlook<\/li> <li>Ability to properly manage confidential information<\/li> <li>Ability to stand for up to 90 minutes at a time<\/li> <li>Ability to supervise students in all school settings, including in a classroom, on playground or in another play setting, in a meal room, and\/or transitioning between any of these settings<\/li> <li>Ability to pass federal and state criminal background checks&nbsp;<\/li> <li>Experience working in a multi-cultural setting preferred<\/li> <\/ul> <p><strong>EQUAL EMPLOYMENT OPPORTUNITY<\/strong><\/p> <p>It is our policy to abide by all federal, state and local laws prohibiting employment discrimination based solely on a person\\u2019s race, color, religious creed, sex, national origin, ancestry, citizenship status, pregnancy, childbirth, physical disability, mental and\/or intellectual disability, age, military status, veteran status (including protected veterans), marital status, registered domestic partner or civil union status, familial status, gender (including sex stereotyping and gender identity or expression), medical condition, genetic information, sexual orientation, or any other protected status except where a reasonable, bonafide occupational qualification exists.<\/p> <\/div>\"}"
}