{
    "id":"Kaggle::techmap::613aa939a198c30759ce01c8::monsterasia_ph::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Description : Background. UN Women, grounded in the vision of equality enshrined in the Charter of the United Nations, works for the elimination of discrimination against women and girls the empowerment of women and the achievement of equality between women and men as partners and beneficiaries of development, human rights, humanitarian action, and peace and security. The Project \"Enhancing Access to Justice for Women in Asia and the Pacific: Bridging the gap between formal and informal systems through women's empowerment\" (2018-2023) is generously supported by the Government of Sweden. The overall goal of the project is to enhance access to justice for women in formal and informal systems in Asia and the Pacific, bridging the gap between these systems through women's empowerment and reduction of gender biases. In realizing this goal, the project partners - UN Women, International Commission of Jurists (ICJ) and OHCHR. focus on achieving the following outputs: (1) Domestic laws are adopted and court decisions are consistent with international human rights law and standards, including CEDAW (2) Gender discriminatory attitudes and stereotyped behaviours towards women by formal and informal justice providers are addressed and (3) Grassroots women's organizations and community-based women's organizations are empowered and well-positioned to facilitate, document, and monitor interactions with formal and informal justice providers, and their resilience is enhanced to build a just and sustainable future. The Access to Justice (A2J) Programme in the Philippines focuses on women in conflict with the law. As part of a community-based approach to gender justice, A2J works with communities to increase women's legal literacy enhance the gender-responsiveness of community-based justice mechanisms and involve the whole community to change social norms, leading to prevention of discrimination and to active participation of women. Reporting to the Programme Analyst of the Access to Justice (A2J) Programme, and in close collaboration with the Regional A2J Strategic Planning and Communication Consultant, the A2J Communications and Advocacy Consultant (PH) is responsible for building the capacity of the implementing partner organizations (in Metro Manila, Cebu, and Davao) on communication and advocacy related to the A2J programme, supporting the development of the communication and advocacy materials, and aligning their work with the national\/regional campaign of the programme. Services Required.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613aa939a198c30759ce01c8::monsterasia_ph\", \"source\": \"monsterasia_ph\", \"country\": \"PH\", \"company\": \"United Nations Development Programme\", \"position\": \"Access to Justice Communications and Advocacy Consultant\", \"notes\": \"\", \"original\": \"<br>Job Description :<br><strong>Background<\/strong><br>UN Women, grounded in the vision of equality enshrined in the Charter of the United Nations, works for the elimination of discrimination against women and girls the empowerment of women and the achievement of equality between women and men as partners and beneficiaries of development, human rights, humanitarian action, and peace and security.<br>The Project \\\"Enhancing Access to Justice for Women in Asia and the Pacific: Bridging the gap between formal and informal systems through women's empowerment\\\" (2018-2023) is generously supported by the Government of Sweden. The overall goal of the project is to enhance access to justice for women in formal and informal systems in Asia and the Pacific, bridging the gap between these systems through women's empowerment and reduction of gender biases. In realizing this goal, the project partners - UN Women, International Commission of Jurists (ICJ) and OHCHR - focus on achieving the following outputs: (1) Domestic laws are adopted and court decisions are consistent with international human rights law and standards, including CEDAW (2) Gender discriminatory attitudes and stereotyped behaviours towards women by formal and informal justice providers are addressed and (3) Grassroots women's organizations and community-based women's organizations are empowered and well-positioned to facilitate, document, and monitor interactions with formal and informal justice providers, and their resilience is enhanced to build a just and sustainable future.<br>The Access to Justice (A2J) Programme in the Philippines focuses on women in conflict with the law. As part of a community-based approach to gender justice, A2J works with communities to increase women's legal literacy enhance the gender-responsiveness of community-based justice mechanisms and involve the whole community to change social norms, leading to prevention of discrimination and to active participation of women.<br>Reporting to the Programme Analyst of the Access to Justice (A2J) Programme, and in close collaboration with the Regional A2J Strategic Planning and Communication Consultant, the A2J Communications and Advocacy Consultant (PH) is responsible for building the capacity of the implementing partner organizations (in Metro Manila, Cebu, and Davao) on communication and advocacy related to the A2J programme, supporting the development of the communication and advocacy materials, and aligning their work with the national\/regional campaign of the programme.<br><strong>Services Required<\/strong><br>The <strong>A2J Communications and Advocacy Consultant<\/strong> shall work with the Programme Analyst and Regional Strategic Planning and Communication Consultant, implementing partners, and the UN Women Regional Office for Asia and the Pacific (ROAP) to support the development of communication and advocacy materials in order to engage project beneficiaries and various stakeholders. The consultant will perform the following tasks:<ul><li>Support implementing partner organizations in developing communication\/advocacy materials related to the A2J Programme in the Philippines<ul><li>Development and design of Information, Education and Communication (IEC) materials for the project, including obtaining appropriate sign-offs<\/li><li>Identification and development of human interest stories for the programme<\/li><li>Use of media and social media software, applications, and communications tools to create social media content targeting project beneficiaries and stakeholders<\/li><li>Communications and advocacy planning<\/li><li>Drafting of opinion-editorials and articles, as well as disseminating to the media<\/li><\/ul><\/li><li>Conduct brainstorming meetings to develop and implement campaign ideas for:<ul><li>National Prison Awareness Week<\/li><li>18-Day Campaign to End Violence Against Women<\/li><li>International Day of Solidarity with Political Prisoners<\/li><li>Human Rights Day<\/li><li>International Women's Day (IWD) 2022<\/li><\/ul><\/li><li>Support the establishment of the Women's Access to Justice Strategy and overall positioning of the programme in the Access to Justice sector by ensuring the alignment of national and regional messaging, as well as the amplification of the national communication\/advocacy campaign<\/li><\/ul><br>Duties and Responsibilities<br><strong>Expected Deliverables and Target Dates<\/strong><br>The consultant is expected to deliver the following outputs within a 6-month period, from 27 September 2021 to 31 March 2022:<br><strong>No.<\/strong><br><strong>Tasks<\/strong><br><strong>Deliverables<\/strong><br><strong>Target Dates<\/strong><br>1<ul><li>Support implementing partner organizations on communications\/advocacy initiatives, based on the regional A2J Communication Strategy and inputs from the Programme Analyst and Regional Strategic Planning and Communication Consultant<ul><li>Hold bilateral meetings with the implementing partners and report on recommendations for supporting each partner on communications\/advocacy work<\/li><li>Draft and finalize communications and advocacy plans for all project partners<\/li><\/ul><\/li><\/ul><br>Workplan for entire consultancy<br>08 October 2021<br><ul><li>Communications and advocacy plans for each project partner organization in line with programme priorities in the Philippines and the regional A2J Communication Strategy<\/li><li>List of focal points for communications\/advocacy for each partner<\/li><\/ul><br>11 October 2021<br>2\\t<ul><li>In partnership with the Programme Analyst and the Regional Strategic Planning and Communication Consultant, conduct brainstorming meetings to develop and implement campaign ideas for:<ul><li>October 18-24 - National Prison Awareness Week<\/li><\/ul><\/li><\/ul><ul><li>Communications and advocacy plan for:<ul><li>National Prison Awareness Week<\/li><\/ul><\/li><\/ul><br>14 October 2021<br>(20% of contract price)<br>3\\t<ul><li>Coordinate with the implementing partner organizations and gather necessary information and material (photos, videos, etc.) to produce communications\/advocacy resources on project activities<\/li><\/ul><ul><li>Minimum 2 social media posts for each partner<\/li><li>2 articles on the UN Women Philippines website and ROAP website<\/li><\/ul><br>31 October 2021<br>4\\t<ul><li>Support the Regional Strategic Planning and Communication Consultant with the development of communication\/advocacy materials related to the A2J Programme in the Philippines<\/li><\/ul><ul><li>Background documents and draft Country Programme brief (2-4 pages)<\/li><\/ul><br>12 November 2021<br>(20% of contract price)<br>5\\t<ul><li>In partnership with the Programme Analyst and the Regional Strategic Planning and Communication Consultant, conduct brainstorming meetings to develop and implement campaign ideas for:<ul><li>November 25 to December 12 - 18-Day Campaign to End Violence Against Women<\/li><li>December 3 - International Day of Solidarity with Political Prisoners<\/li><li>December 10 - Human Rights Day<\/li><\/ul><\/li><\/ul><ul><li>Communications and advocacy plans for:<ul><li>18-Day Campaign to End VAW<\/li><li>International Day of Solidarity with Political Prisoners<\/li><li>Human Rights Day<\/li><\/ul><\/li><\/ul><br>17 November 2021<br>6\\t<ul><li>Support the Programme Analyst in developing and disseminating an opinion-editorial on women's access to justice, as well as project\/donor reporting (i.e. on outputs related to communications\/advocacy)<\/li><\/ul><ul><li>2 opinion-editorials or articles<\/li><\/ul><br>08 December 2021<br>7\\t<ul><li>Support the partners on IEC development, communications planning, and social media post creation<\/li><\/ul><ul><li>Minimum 2 social media posts related to Women's Access to Justice<\/li><li>Minimum of 2 social media posts related to the A2J project in the Philippines<\/li><li>Minimum 2 human interest stories for the UN Women Philippines website<\/li><li>Brief of policy research on women in conflict with the law and launching event for the policy research<\/li><li>Progress report on partner communications\/advocacy work and outputs<\/li><\/ul><br>17 December 2021<br>(20% of contract price, with 5% for Task #5-6 deliverables and 3% for each of the Task #7 deliverables)<br>8\\t<ul><li>In collaboration with the Programme Analyst and the Regional Strategic Planning and Communication Consultant, and in consultation with programme partners, conduct brainstorming meetings on ideas for International Women's Day (IWD) 2022 for the Philippines<\/li><li>Implement the IWD 2022 campaign<\/li><\/ul><ul><li>Communications and advocacy plan for IWD 2022<\/li><li>Minimum of 2 initiatives for programme communication for IWD 2022<\/li><li>Minimum 3 social media posts related to Women's Access to Justice<\/li><li>Minimum 2 human interest stories for the UN Women Philippines website<\/li><li>2 articles on the UN Women Philippines and ROAP website<\/li><\/ul><br>14 January 2022<br>9\\t<ul><li>In collaboration with the Programme Analyst, Regional Strategic Planning and Communication Consultant, and A2J Communications Officers, support the establishment of the Women's Access to Justice Strategy and overall positioning of the programme in the Access to Justice sector by:<ul><li>Coordinating the sharing of local social media posts\/events updates<\/li><li>Coordinating the uploading of visual assets (e.g. photos, videos) to the UN Women ROAP Flickr<\/li><li>Joining the monthly brief meetings with the A2J country focal point<\/li><li>Maintaining and sharing e-mail distribution lists of key stakeholders and donor audiences in the regional template<\/li><li>Connecting with locally based journalists from the regional A2J Journalist course<\/li><li>Supporting the regional CSO women's movement campaign<\/li><\/ul><\/li><\/ul><ul><li>Communication materials featuring the impact of the programme resources (e.g. publications, human interest stories, and research) uploaded to the A2J UN Women webpage *<\/li><li>Updated audio-visual library in the UN Women ROAP Flickr<\/li><li>Inputs for the Women's Access to Justice quarterly brief<\/li><li>Email distribution list of partners\/stakeholders in the Philippines<\/li><li>Inputs to the collaborative advocacy and social change campaign with local journalists and CSOs<\/li><\/ul><br>*as listed in the previous deliverables<br>18 February 2022<br>(20% of contract price, with 2% per deliverable in Tasks #8-9)<br>10\\t<ul><li>In partnership with the Programme Analyst and the Regional Strategic Planning and Communication Consultant, plan and implement an initiative engaging key stakeholders (donors, government, CSOs, etc.) of the A2J project in the Philippines<\/li><\/ul><ul><li>Action points and recommendations from the A2J initiative with stakeholders<\/li><li>Final report on key messaging and accomplishments of A2J communications\/advocacy initiatives in the Philippines, as aligned with regional A2J strategy<\/li><\/ul><br>14 March 2022<br>(20% of contract price)<br><strong>Working Arrangements and Payment<\/strong><br>This home-based consultancy involves communication with the Programme Analyst and project partners\/stakeholders through Zoom, e-mail, or phone. However, should the consultant be asked to report to the office or attend in-person meetings, she\/he will be reimbursed for transportation expenses by the office. Work laptop, office supplies, and other related costs will be covered by the consultant.<br>Payments for this consultancy will be based on the achievement of each deliverable and certification that each has been satisfactorily completed. Payments will not be based on the number of days worked but on the completion of each stated deliverable within the indicated timeframes.<br>Competencies<br><strong>Core Values and Competencies<\/strong><br>The consultant should share the following core values and competencies of the organization:<br>Core Values<br>Core Competencies<br><ul><li>Respect for Diversity<\/li><li>Integrity<\/li><li>Professionalism<\/li><\/ul><ul><li>Awareness and Sensitivity Regarding Gender Issues<\/li><li>Accountability<\/li><li>Creative Problem Solving<\/li><li>Effective Communication<\/li><li>Inclusive Collaboration<\/li><li>Stakeholder Engagement<\/li><li>Leading by Example<\/li><\/ul><br>Please visit this link for more information on UN Women's Core Values and Competencies:<br>Required Skills and Experience<br><strong>Key Qualifications<\/strong><ul><li>At least a Bachelor's degree in Journalism, Public Relations, Communications, International Development\/Relations, Gender\/Women's Studies, or other relevant area <\/li><li>At least 4 years of relevant national\/international working experience in development communications and\/or advocacy<\/li><li>Background on gender and law\/justice is desirable<\/li><li>Experience in working with civil society organizations and community-based organizations<\/li><li>Proven ability to identify good story ideas and to gather, consolidate, and process information for effective communication<\/li><li>Proficiency and experience with a range of social media platforms<\/li><li>Photography skills, proficiency in multimedia design tools, and experience in data analysis are desirable<\/li><li>Previous working experience with UN agencies, civil society organizations, and\/or women's rights organizations in the Philippines is an asset<\/li><li>Strong analytical and writing skills<\/li><li>Fluency in Tagalog and English is required knowledge of Bisaya and UN languages an asset.<\/li><\/ul><br><strong>Submission of Application<\/strong><br>Submission package<ul><li>Application Letter and Curriculum Vitae<\/li><li>Personal History Form (P11) <\/li><li>Financial proposal which shall specify a total lump sum amount in PhP based on deliverables<\/li><li>Sample work (communications and advocacy plans and outputs, sample designs of IECs, stories, articles, research, reports, etc.)<\/li><\/ul><br>The system only allows one attachment per application so please combine all files into one. Interested candidates are encouraged to submit their electronic application to with cc to , not later than 14September 2021. Please provide a brief explanation for suitability to this consultancy and cite relevant experience. Incomplete applications will not be considered.<br><strong>Evaluation<\/strong><br>Applications will be evaluated based on the cumulative analysis:<ul><li>Technical Qualification (100 points) weight [70%]<\/li><li>Financial Proposal (100 points) weight [30%]<\/li><\/ul><br>A two-stage procedure is utilized in evaluating the applications, with evaluation of the technical application being completed prior to any price proposal being compared. Only the price proposal of the candidates who passed the minimum technical score of 70% of the obtainable score of 100 points in the technical qualification evaluation will be evaluated.<br><strong>Technical evaluation criteria<\/strong><br>The total number of points allocated for the technical qualification component is 100. The technical qualification of the individual is evaluated based on the following technical qualification evaluation criteria:<br><strong>Technical evaluation criteria<\/strong><br><strong>Obtainable Score<\/strong><br><ol><li>Education<ul><li>At least a Bachelor's degree in Journalism, Public Relations, Communications, International Development\/Relations, Gender\/Women's Studies, or other relevant area <\/li><\/ul><\/li><\/ol><br>20%<br><ol><li>Experience and Skills<ul><li>At least 4 years of relevant national\/international working experience in development communications and\/or advocacy<\/li><li>Background on gender and law\/justice is desirable<\/li><li>Experience in working with civil society organizations and community-based organizations<\/li><li>Proven ability to identify good story ideas and to gather, consolidate, and process information for effective communication<\/li><li>Proficiency and experience with a range of social media platforms<\/li><li>Photography skills, proficiency in multimedia design tools, and experience in data analysis are desirable<\/li><li>Previous working experience with UN agencies, civil society organizations, and\/or women's rights organizations in the Philippines is an asset<\/li><\/ul><\/li><\/ol><br>60%<br><ol><li>Language and Report Writing Skills<ul><li>Proven ability to identify good story ideas and to gather, consolidate, and process information for effective communication<\/li><li>Strong analytical and writing skills<\/li><li>Fluency in Tagalog and English is required knowledge of Bisaya and UN languages an asset<\/li><\/ul><\/li><\/ol><br>20%<br><strong>Total Obtainable Score<\/strong><br><strong>100%<\/strong><br><strong>Financial\/Price Proposal evaluation<\/strong><ul><li>Only the financial proposal of candidates who have attained a minimum of 70% score in the technical evaluation will be considered and evaluated.<\/li><li>The total number of points allocated for the price component is 100. The maximum number of points will be allotted to the lowest price proposal that is opened\/evaluated and compared among those technically qualified candidates who have attained a minimum of 70% score in the technical evaluation. All other price proposals will receive points in inverse proportion to the lowest price.<\/li><\/ul><br>\"}"
}