{
    "id":"Kaggle::techmap::613ae8cdee2b71767d250ea3::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" REPORTS TO: General Manager and Corporate Director of Finance. Benefits\/Perks of Working With Us: Upon joining Real Hospitality Group, associates are offered competitive compensation, career growth opportunities, flexible access to wages, holiday, sick and vacation pay, health, dental and vision insurance, employer paid life, accidental death, and dismemberment insurance, an employee assistance program, a 401k, and many associate discount options. Purpose for the Position: The Accounting Clerk will coordinate, verify, and balance revenues and receipts on a daily basis. Administer all property level accounts receivable and accounts payable functions. Completes all other reports as assigned. Accounting Clerk Essential Responsibilities: Accurately enters all daily revenues, receipts and ledger balances into daily report. Reconciles daily cash deposits and credit card transmissions. Bills A\/R accounts daily, and follows up on any accounts within 3 days to ensure customer has received the invoice and does not have any questions. Follow up 30 days after the initial billing if payment has not been received. Enters invoices into accounts payable system weekly after verifying a purchase order was received from ordering department head and obtaining General Manager's approval. Reconciles taxes daily and verifies all tax-exempt backup is on file. Any other duties as assigned by the General Manager or Corporate Director of Finance. To do this kind of work, you must be able to: Understand and use math concepts. Interpret technical information presented in mathematical or diagram form. Work math problems quickly and accurately. Understand and use computers and related equipment. Speak and write clearly to report financial information. Be available for work evenings, weekends, and holidays. Physical Demands: Lifting 10 lbs. maximum and occasionally lifting and\/or carrying such articles as dockets, ledgers, and small tools. Walking and standing are required only occasionally. Reaching, handling, feeling, talking, hearing, and seeing. Environmental Conditions: Inside: Protection from weather conditions but not necessarily from temperature changes. A job is considered \"inside\" if the worker spends approximately 75% or more of the time inside. Math Skills: Requires mathematical development sufficient to be able to: Apply mathematical operations to frequency distributions, reliability and validity tests, normal curve of variance, correlation techniques, etc. Language Skills: Must have developed language skills to the point to be able to: Read newspapers, periodicals, journals, and manuals. Write business letters, summaries and reports using prescribed format and conforming to all rules of punctuation, grammar, diction and style.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613ae8cdee2b71767d250ea3::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Real Hospitality Group\", \"position\": \"Accounting Clerk - Holiday Inn Express Bushwick - Brooklyn, NY\", \"notes\": \"\", \"original\": \"<div>\\n    <p><strong>REPORTS TO:<\/strong>\\u00a0 General Manager and Corporate Director of Finance<\/p>\\n<p><strong>Benefits\/Perks of Working With Us:<\/strong><\/p>\\n<p>Upon joining Real Hospitality Group, associates are offered competitive compensation, career growth opportunities, flexible access to wages, holiday, sick and vacation pay, health, dental and vision insurance, employer paid life, accidental death, and dismemberment insurance, an employee assistance program, a 401k, and many associate discount options.<\/p>\\n<p><strong>Purpose for the Position:<\/strong>\\u00a0 The Accounting Clerk will coordinate, verify, and balance revenues and receipts on a daily basis.\\u00a0 Administer all property level accounts receivable and accounts payable functions.\\u00a0 Completes all other reports as assigned.<\/p>\\n<p><strong>Accounting Clerk Essential Responsibilities:<\/strong><\/p>\\n<ol><li>Accurately enters all daily revenues, receipts and ledger balances into daily report.<\/li>\\n<li>Reconciles daily cash deposits and credit card transmissions.<\/li>\\n<li>Bills A\/R accounts daily, and follows up on any accounts within 3 days to ensure customer has received the invoice and does not have any questions. Follow up 30 days after the initial billing if payment has not been received.<\/li>\\n<li>Enters invoices into accounts payable system weekly after verifying a purchase order was received from ordering department head and obtaining General Manager's approval.<\/li>\\n<li>Reconciles taxes daily and verifies all tax-exempt backup is on file.<\/li>\\n<li>Any other duties as assigned by the General Manager or Corporate Director of Finance.<\/li>\\n<\/ol><p><strong>To do this kind of work, you must be able to:<\/strong><\/p>\\n<ul><li>Understand and use math concepts.<\/li>\\n<li>Interpret technical information presented in mathematical or diagram form.<\/li>\\n<li>Work math problems quickly and accurately.<\/li>\\n<li>Understand and use computers and related equipment.<\/li>\\n<li>Speak and write clearly to report financial information.<\/li>\\n<li>Be available for work evenings, weekends, and holidays.<\/li>\\n<\/ul><p><strong>Physical Demands:\\u00a0\\u00a0<\/strong>Lifting 10 lbs. maximum and occasionally lifting and\/or carrying such articles as dockets, ledgers, and small tools.\\u00a0 Walking and standing are required only occasionally.\\u00a0 Reaching, handling, feeling, talking, hearing, and seeing.<\/p>\\n<p><strong>Environmental Conditions:\\u00a0\\u00a0<\/strong>Inside:\\u00a0 Protection from weather conditions but not necessarily from temperature changes.\\u00a0 A job is considered \\\"inside\\\" if the worker spends approximately 75% or more of the time inside.<\/p>\\n<p><strong>Math Skills:\\u00a0\\u00a0<\/strong>Requires mathematical development sufficient to be able to:\\u00a0 Apply mathematical operations to frequency distributions, reliability and validity tests, normal curve of variance, correlation techniques, etc.<\/p>\\n<p><strong>Language Skills:\\u00a0\\u00a0<\/strong>Must have developed language skills to the point to be able to:\\u00a0 Read newspapers, periodicals, journals, and manuals.\\u00a0 Write business letters, summaries and reports using prescribed format and conforming to all rules of punctuation, grammar, diction and style.\\u00a0 Participate in discussions and debates.\\u00a0 Speak extemporaneously on a variety of subjects.<\/p>\\n<p><strong>Relationships to Data, People and Things:<\/strong><\/p>\\n<p><strong>Data:\\u00a0\\u00a0<\/strong>Coordinating:\\u00a0 Determining time, place, and sequence of operations or action to be taken on the basis of analysis of data; executing determination and\/or reporting on events.<\/p>\\n<p><strong>People:\\u00a0\\u00a0<\/strong>Negotiating:\\u00a0 Exchanging ideas, information, and opinions with others to formulate policies and programs and\/or arrive jointly at decisions, conclusions or solutions.<\/p>\\n<p><strong>Things:\\u00a0\\u00a0<\/strong>Using body members, hand tools, and\/or special devices to work, move, or carry objects or materials.\\u00a0 Involves little or no latitude for judgment with regard to attainment of standards or in selecting appropriate tools, objects or materials.<\/p>\\n  <\/div>\"}"
}