{
    "id":"Kaggle::techmap::61449deb50e4846e1bb59e44::linkedin_jp::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Ensure a smooth implementation and continuum of care, develop and maintain knowledge of referral sources, collaborate and coordinate with other internal departments, outside agencies, and commanders (if indicated) to ensure that client is receiving the most appropriate services. Must be able to serve in an on call duty status outside of normal work hours that includes: remaining in a reasonable call back radius, carrying a cell phone, or regularly checking email to respond to emergencies, remaining in a state of readiness to perform work with limitations on pursuing outside leisure activities, and\/or reporting to a designated post of duty to be ready to or to perform work. Working knowledge of Microsoft Office products is required and knowledge of electronic case management system is preferred. Knowledge of the military structure and the military environment is preferred. In accordance with Department of Defense Instruction (DoDI) 1402.5, FAP personnel who provide services to children under 18 years of age will be subject to a favorable National Agency Check (NAC) Backgrounds and Security Investigation every five years in order to protect the health, safety, and well-being of children. Personnel must undergo an installation records check (IRC), be subject to the additional requirements of the Child Care National Agency Check and Inquiries (CNACI) and the criteria presumptive and automatic disqualification as specified in section 3 of DoDI 1402.5. Bilingual skills including knowledge of Japanese language and culture which reflects accurate understanding of complex facts and abstractions and clear expression of them in spoken and written word highly preferred. Education. Additional information. GENERAL INFORMATION: Applicants are assured of equal consideration regardless of race, age, color, religion, national origin, gender, GINA, political affiliation, membership or non-membership in an employee organization, marital status, physical handicap which has no bearing on the ability to perform the duties of the position. This agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please notify the agency. The decision on granting reasonable accommodation will be on a case-by-case basis. It is Department of Navy (DON) policy to provide a workplace free of discrimination and retaliation. The DON No Fear Act policy link is provided for your review: httpswww. donhr. navy. mil\/NoFearAct. asp. As part of the employment process, Human Resources Division may obtain a Criminal Record Check and\/or an Investigative Consumer Report.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61449deb50e4846e1bb59e44::linkedin_jp\", \"source\": \"linkedin_jp\", \"country\": \"JP\", \"company\": \"Marine Corps Community Services\", \"position\": \"FAP CLINICAL COUNSELOR (BILINGUAL - JAPANESE), NF-04\/RFT, CAMP BUTLER\", \"notes\": \"\", \"original\": \"<ul><li>Duties<br><\/li><\/ul><strong><u>Summary<br><br><\/u><\/strong>Marine Corps Community Services (MCCS) is looking for the best and brightest to join our Team! MCCS is a comprehensive program that supports and enhances the quality of life for Marines, their families, and others in the Marine Corps Community. We offer a team oriented environment comprised of military personnel, civilian employees, contractors and volunteers who keep the organization functioning smoothly and effectively.<br><br><strong><u>Responsibilities<br><br><\/u><\/strong><strong><u>NONAPPROPRIATED FUND POSITION DESCRIPTION<br><br><\/u><\/strong><strong>JOB TITLE: FAP CLINICAL COUNSELOR <br><br><\/strong><strong>BUSINESS TITLE: FAP CLINICAL COUNSELOR (BILINGUAL)<br><br><\/strong><strong>JOB CODE: 093008 JOB SERIES: 0101 GRADE: NF-4 <br><br><\/strong><strong>FLSA STATUS: EXEMPT<br><br><\/strong>The primary duties of the Family Advocacy Program (FAP) Clinical Counselor are to:<br><ul><li>Deliver comprehensive FAP services to active duty Marines, their family members, and others as authorized by Department of Defense (DoD) policy.<\/li><li>Provide non-medical counseling, screening, assessment, evidence-based and informed interventions, service planning, and clinical case management services. Comprehensive <\/li><li>non-medical counseling services consists of individual, couple, family and group sessions.<\/li><li>Provide services to clients that address emotional problems, behavioral problems, life stressors, domestic abuse, child abuse, and problematic sexual behaviors in children and youth (PSB-CY).<\/li><li>Conduct psychosocial assessments with individuals, couples and families and make recommendations for services. Include client in service plan development. Exercise clinical judgment to apply expertise in conducting initial assessments to match the client\\u2019s needs to the most appropriate resources. Conduct ongoing risk assessment and conduct immediate safety planning. Report any suspected child abuse and\/or domestic abuse as required by policy and mandated by law.<\/li><li>Facilitate psycho-educational groups, classes, and workshops that focus on both prevention and intervention with child abuse, domestic abuse, and PSB-CY. Topics may include: anger management, relationship skill-building, effective and healthy communication, and understanding and eliminating power and control.<\/li><li>Plan, develop, and implement services and initiatives designed to foster positive healthy relationships within the family structure. Develop and maintain professional standards of service, community referral resources, and maintain a close network with the clinical staff and other service providers.<\/li><li>Complete and maintain appropriate documentation related to: intake paperwork, screening tools, risk assessments, safety plans, clinical counseling notes, individualized service plans, clinical case management, collateral notes, contact details, and other documentation as required by FAP policy.<\/li><li>Participate in the confidential Clinical Case Staff Meeting (CCSM), which provides clinical recommendations for supportive services, non-medical counseling for victims of child abuse, domestic abuse, or PSB-CY, coordinated case management including risk assessment, ongoing monitoring of child abuse and domestic abuse victims\\u2019 safety, clinical intervention, and appropriate service delivery for alleged abusers who are eligible for services at the military treatment facility.<\/li><li>Prepare and participate in the administrative process of the Incident Determination<\/li><li>Committee (IDC). Communicate the IDC incident status determination to commanders and others who have a \\u201cneed to know\\u201d status.<\/li><li>Provide direct services to include screening, assessment, non-medical counseling, safety planning, and referrals with children exhibiting and those impacted by PSB-CY as well as to the family members. Participate in and provide input to the PSB-CY multi- disciplinary team and attend monthly case review meetings. Maintain case records and track statistical data in accordance with Limits of Confidentiality, Privacy Act, and higher headquarters policy.<\/li><li>Establish and maintain command and military community relationships. Collaborate with other military agencies to support and meet client needs. Coordinate with military investigative agencies, military and local civilian law enforcement agencies, and civilian child welfare agencies in response to reports of child abuse incidents.<\/li><li>Provide World Class Customer Service with an emphasis on courtesy. Assist customers and communicate positively in a friendly manner. Take action to solve problems quickly. Alert the higher-level supervisor or proper point of contact for help when problems arise.<\/li><li>Adhere to safety regulations and standards. Use required safety equipment and observe safe work procedures. Promptly report any observed workplace hazards, and any injury, occupational illness, and\/or property damage resulting from workplace mishaps to the immediate supervisor.<\/li><li>Adhere to established standards of actively supporting the principles of the Equal Employment Opportunity (EEO) program and prevention of sexual harassment.<\/li><li>Perform other related duties as assigned.<br><\/li><\/ul>This position may require a fluctuating work schedule to complete work assignments outside of the typical work week and work hours (to include weekends as necessary).<br><br>This is a white-collar position where occasional lifting up to 20 lbs may be required.<br><br>Travel Required<br><br>25% or less - Varies<br><br>Supervisory status<br><br>No<br><br>Promotion Potential<br><br>NA <ul><li>Job family (Series)<br><\/li><\/ul>Similar jobs<ul><li>Requirements<br><\/li><\/ul>Conditions of Employment<br><ul><li>See Duties and Qualifications<br><\/li><\/ul><strong><u>Evaluations<br><br><\/u><\/strong>Qualifications<br><br><strong><u>MINIMUM QUALIFICATIONS FOR TIER II And III<br><\/u><\/strong><ul><li>A Master\\u2019s or Doctoral-level degree from a college or university with a program nationally accredited in: social work, marriage and family therapy, counseling, psychology, or other appropriate human service and\/or mental health professional degree.<\/li><li>Highest licensure by a State or National regulatory board that authorizes independent clinical practice that is current, valid, unrestricted and in good standing in at least one of the following: clinical social work, licensed marriage and family therapist, licensed professional counselor, or clinical psychologist that meet the DoD requirements. Must provide a photocopy of licensure with their application.<\/li><li>Tier III Clinician must have engaged in at least two years post licensure, that includes at least 2,000 hours post licensure or 4,000 hours post graduate degree, full-time clinical experience in a clinical setting.<\/li><li>At least two years\\u2019 experience working in the field of child and domestic abuse counseling or treatment. Must be able to work effectively with representatives of local, county, state, and federal social services agencies.<\/li><li>One year experience in or ability to obtain, within 1 year of employment, training in all of the following: PSB-CY, child and adolescent development, and trauma-informed care. <\/li><li>Experience counseling a wide range of persons in stressful and potentially high-risk<\/li><li>situations. Skills to provide non-medical clinical counseling services to victims of child abuse, domestic abuse, and alleged abusers. Must be skilled in conducting client intake to include; informed consent, psychosocial assessments, risk assessments, safety planning, development of a service plan, and clinical note taking. Experience in providing services to both military and civilians preferred.<\/li><li>Must have knowledge of family structure, dynamics, needs and problems, economic, social, cultural, environmental, and psychological factors in relation to social patterns. Must have training in child and adolescent development, problematic sexual behavior in children and youth, and trauma-informed care. Diagnostic skills in areas of psychological pathology and psychosocial dynamics.<\/li><li>Must have knowledge of civilian and military legal information pertaining to family relationships and laws protecting children and elders. Must have knowledge of the professional ethics when working with individuals, couples, groups, children, and families. Working knowledge of the Uniform Code of Military Justice as related to domestic abuse and child abuse is preferred.<\/li><li>Must have strong case management skills to include: maintain accurate and timely documentation of records and case files. Ensure a smooth implementation and continuum of care, develop and maintain knowledge of referral sources, collaborate and coordinate with other internal departments, outside agencies, and commanders (if indicated) to ensure that client is receiving the most appropriate services.<\/li><li>Must be able to serve in an \\u201con call\\u201d duty status outside of normal work hours that includes: remaining in a reasonable call back radius, carrying a cell phone, or regularly checking email to respond to emergencies, remaining in a state of readiness to perform work with limitations on pursuing outside leisure activities, and\/or reporting to a designated post of duty to be ready to or to perform work.<\/li><li>Working knowledge of Microsoft Office products is required and knowledge of electronic case management system is preferred.<\/li><li>Knowledge of the military structure and the military environment is preferred.<\/li><li>In accordance with Department of Defense Instruction (DoDI) 1402.5, FAP personnel who provide services to children under 18 years of age will be subject to a favorable National Agency Check (NAC) Backgrounds and Security Investigation every five years in order to protect the health, safety, and well-being of children. Personnel must undergo an installation records check (IRC), be subject to the additional requirements of the Child Care National Agency Check and Inquiries (CNACI) and the criteria presumptive and automatic disqualification as specified in section 3 of DoDI 1402.5.<\/li><li>Bilingual skills including knowledge of Japanese language and culture which reflects accurate understanding of complex facts and abstractions and clear expression of them in spoken and written word highly preferred.<br><\/li><\/ul>Education<br><br>Additional information<br><br><strong>GENERAL INFORMATION:<\/strong> Applicants are assured of equal consideration regardless of race, age, color, religion, national origin, gender, GINA, political affiliation, membership or non-membership in an employee organization, marital status, physical handicap which has no bearing on the ability to perform the duties of the position. This agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please notify the agency. The decision on granting reasonable accommodation will be on a case-by-case basis.<br><br>It is Department of Navy (DON) policy to provide a workplace free of discrimination and retaliation. The DON No Fear Act policy link is provided for your review: https:\/\/www.donhr.navy.mil\/NoFearAct.asp.<br><br>As part of the employment process, Human Resources Division may obtain a Criminal Record Check and\/or an Investigative Consumer Report. Employment is contingent upon the successful completion of a National Agency Check and Inquiries (NACI). For all positions requiring access to firearms or ammunition, the Federal Government is prohibited from employing individuals in these positions who have ever been convicted of a misdemeanor crime of domestic violence, or a felony crime of domestic violence adjudged on or after 27 November 2002. Selectees for such positions must submit a completed DD Form 2760, Qualification to Possess Firearms or Ammunition, before a final job offer can be made.<br><br>Direct Deposit of total NET pay is mandatory as a condition of employment for all appointments to positions within MCCS.<br><br><strong><u>Required Documents<br><\/u><\/strong><ul><li>Education\/certification certificate(s), if applicable.<\/li><li>If prior military, DD214 Member Copy<br><\/li><\/ul>This activity is a Drug-free workplace. The use of illegal drugs by NAF employees, whether on or off duty, cannot and will not be tolerated. Federal employees have a right to a safe and secure workplace, and Marines, sailors, and their family members have a right to a reliable and productive Federal workforce.<br><br>Involuntarily separated members of the armed forces and eligible family members applying through the Transition Assistance Program must submit a written request\/statement (may be obtained from the MCCS Human Resources Office) and present ID card with \\\"TA\\\" stamped in red on front of card.<br><br><strong>INDIVIDUALS SELECTED FROM THIS ANNOUNCEMENT MAY BE CHANGED TO PART-TIME OR FULL-TIME AT MANAGEMENT'S DISCRETION WITHOUT FURTHER COMPETITION.<br><br><\/strong><strong>ALL ONLINE APPLICATIONS MUST BE RECEIVED BY 1159PM EASTERN STANDARD TIME (EST) ON THE CLOSING DATE LISTED IN THE JOB POSTING.<br><br><\/strong>How You Will Be Evaluated<br><br>You will be evaluated for this job based on how well you meet the qualifications above.<br><br>Your application\/resume and supporting documentation will be used to determine whether you meet the job qualifications listed on this announcement. This vacancy will be filled by the best qualified applicant as determined by the selecting official.<br><br>Background checks and security clearance<br><br>Security clearance<br><br>Drug test required<br><br>No <ul><li>Required Documents<br><\/li><\/ul>Varies - Review \\\"OTHER INFORMATION\\\"<br><br>If you are relying on your education to meet qualification requirements:<br><br>Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and\/or degrees from<br><br>Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating. <ul><li>Benefits<br><\/li><\/ul>A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding.<br><br><strong><u>Benefits<br><br><\/u><\/strong>Benefits you get to enjoy while working at MCCS include but are not limited to<br><br>The Federal government offers a number of exceptional benefits to its employees.<br><ul><li> Stability of Federal Civilian Service<\/li><li> People with passion for doing work that matters<\/li><li> Quality of Work Life Balance<\/li><li> Competitive Pay<\/li><li> Comprehensive Benefit Packages<\/li><li> Marine Corps Exchange and Base Facility Privileges<br><\/li><\/ul>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered.<ul><li>How to Apply<br><\/li><\/ul>All applications <em>must<\/em> be submitted online via the MCCS Careers website:<br><br>Resumes\/applications emailed or mailed will not be considered for this vacancy announcement. To be considered for employment, the application or resume must be submitted online by 11:59 PM (EST) on the closing date of the announcement.<br><br><strong>Note:<\/strong> To check the status of your application or return to a previous or incomplete application, log into your MCCS user account and review your application status.<br><br>Agency contact information<br><br>CAMP BUTLER MCCS<br><br>Phone<br><br>Email<br><br>Address<br><br>CAMP BUTLER MCCS<br><br>MARINE CORPS COMMUNITY SERVICES<br><br>ATTN: NAF PERSONNEL OFFICER<br><br>FPO AP, 963735023<br><br>JPN<br><br>Next steps<br><br>All applicants who submit an application via our Careers page at https:\/\/careers.usmc-mccs.org will be able to view their application status online. <ul><li>Fair &amp; Transparent<br><\/li><\/ul>The Federal hiring process is setup to be fair and transparent. Please read the following guidance.<br><br>Equal Employment Opportunity Policy<br><br>The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.<br><br>Reasonable Accommodation Policy<br><br>Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application process should follow the instructions in the job opportunity announcement. For any part of the remaining hiring process, applicants should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.<br><br>A reasonable accommodation is any change to a job, the work environment, or the way things are usually done that enables an individual with a disability to apply for a job, perform job duties or receive equal access to job benefits.<br><br>Under the Rehabilitation Act of 1973, federal agencies must provide reasonable accommodations when:<br><ul><li>An applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.<\/li><li>An employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.<\/li><li>An employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events.<br><\/li><\/ul>You can request a reasonable accommodation at any time during the application or hiring process or while on the job. Requests are considered on a case-by-case basis.<br><br>Learn more about<br><br>Legal and regulatory guidance<br><br>This job originated on\"}"
}