{
    "id":"Kaggle::techmap::6136863b63cfe7419615e719::linkedin_us::10",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"At Corporate Consulting we have found a lot of growth opportunities despite these crazy times. We are currently in the process of expanding to two new offices by the end of this quarter! Due to this growth, we are looking for an Entry Level Team Lead with experience in the restaurant, hospitality, and retail industries. Ideally, the Entry Level Team Lead has exceptional interpersonal and communication skills and is a self-starter. Each Entry Level Team Lead will get personalized training in various areas of business, including, but not limited to: leadership development. organizational skills. customer relations, including sales and marketing with face to face presentations. our business will give you a leg-up on your level of experience with advancement opportunities. you will have access to industry leaders. unbeatable team environment. Initial responsibilities: work directly with customers to discuss and support their needs in a service-based industry. utilize the best technology the industry can offer, Sales. Force for better customer service and sales presentations. work directly with the management team on individual training and development in the sales and marketing department. Job Requirements: Bachelor's degree is preferred. Impeccable interpersonal and communication skills. Self-starter. Experience in customer service, retail, restaurant, or hospitality is preferred. Team-oriented. Leadership experience. Problem-solving skills. For immediate consideration, send us your application for review. We look forward to hearing from you!..... If you have any experience\/interest in the following, please apply: GPA, dean’s list, associate’s, bachelor’s, graduated, honors, honor roll, scholarship, fraternity, sorority, Greek, club, recent grad, collegiate, athlete, study abroad, work study, fundraising, donations, ticket sales, advertising, marketing, marketing & sales, general business, communications, business, salesforce, representative, public relations, psychology, market research, sales, outside sales, business to business, direct marketing, entry level, customer service, restaurant, hospitality, management, business administration, full time, sports, sports marketing, training, coaching, team, retail, server, bartender, clerk, club, charity, leadership, service, food, or team work is a PLUS!.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6136863b63cfe7419615e719::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Corporate Concepts Consulting\", \"position\": \"Team Lead (Entry Level Sales)\", \"notes\": \"\", \"original\": \"<p>At Corporate Consulting we have found a lot of growth opportunities despite these crazy times. We are currently in the process of expanding to two new offices by the end of this quarter!<\/p><p><br><\/p><p>Due to this growth, we are looking for an Entry Level Team Lead with experience in the restaurant, hospitality, and retail industries. Ideally, the Entry Level Team Lead has exceptional interpersonal and communication skills and is a self-starter.<\/p><p><br><\/p><p>Each Entry Level Team Lead will get personalized training in various areas of business, including, but not limited to:<\/p><ul><li>leadership development<\/li><li>organizational skills<\/li><li>customer relations, including sales and marketing with face to face presentations<\/li><li>our business will give you a leg-up on your level of experience with advancement opportunities<\/li><li>you will have access to industry leaders<\/li><li>unbeatable team environment<\/li><\/ul><p><strong>&nbsp;<\/strong><\/p><p><strong>Initial responsibilities:<\/strong><\/p><ul><li>work directly with customers to discuss and support their needs in a service-based industry<\/li><li>utilize the best technology the industry can offer, SalesForce for better customer service and sales presentations<\/li><li>work directly with the management team on individual training and development in the sales and marketing department<\/li><\/ul><p><strong>&nbsp;<\/strong><\/p><p><strong>Job Requirements:<\/strong><\/p><ul><li>Bachelor's degree is preferred<\/li><li>Impeccable interpersonal and communication skills<\/li><li>Self-starter<\/li><li>Experience in customer service, retail, restaurant, or hospitality is preferred<\/li><li>Team-oriented<\/li><li>Leadership experience<\/li><li>Problem-solving skills<\/li><li>Weekly pay for this position varies throughout training but is discussed thoroughly in the hiring process<\/li><\/ul><p>&nbsp;<\/p><p>For immediate consideration, send us your application for review. We look forward to hearing from you!<\/p><p><br><\/p><p><br><\/p><p><br><\/p><p><br><\/p><p><br><\/p><p>If you have any experience\/interest in the following, please apply:&nbsp;GPA, dean\\u2019s list, associate\\u2019s, bachelor\\u2019s, graduated, honors, honor roll, scholarship, fraternity, sorority, Greek, club, recent grad, collegiate, athlete, study abroad, work study, fundraising, donations, ticket sales, advertising, marketing, marketing &amp; sales, general business, communications, business, salesforce, representative, public relations, psychology, market research, sales, outside sales, business to business, direct marketing, entry level, customer service, restaurant, hospitality, management, business administration, full time, sports, sports marketing, training, coaching, team, retail, server, bartender, clerk, club, charity,&nbsp;leadership, service, food, or team work is a PLUS!<\/p>\"}"
}