{
    "id":"Kaggle::techmap::6154e921b0589e6843d76790::careerbuilder_ca::10",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Billing Administrator. On behalf of our client in the Consulting Sector, PROCOM is looking for a Billing Administrator. Billing Administrator – Job Description. Accountable to define, plan, orchestrate and deliver on strategic initiatives. Lead project stakeholders such as sponsors, clients, vendors, outsourcers\/offshore resources (where applicable) and project team members to accomplish project objectives. Manage scope to ensure that the solution implemented fully meets the requirements, costs, time, quality and quantifiable business benefit\/criteria expectations of the sponsor. Develops the project charter, integrated project plan, staffing resource plan, contingency plan and other project management artifacts such as RAID logs. Proactively works with workstream leaders to resolve issues and remove roadblocks Identifies potential issues before they negatively impact the project. Tracks project expenses and validates financial forecasts with project sponsor. Ensures all project documentation repository is up to date for all project documentation, business\/technology documents related to any initiative, projects or programs. Tracks and sets up deliverable process (sign-off, documentation). Reports on the project and develops project status communications to management and firm leadership. Gathers input and facilitates lessons learned and post implementation review meetings M&A. Project Management accountabilities (in addition to above): Prepare integration and separation plans in collaboration with key stakeholders that meet timelines set in pre-merger phase. Support the implementation phase and capture lessons learned and untapped value in post close phase. Ensures that post acquisition strategy is aligned to strategic rationale for merger or acquisition. Leverage your business acumen and collaborative engagement approach to drive continuous improvements and best practices to deliver better outcomes and continuous improvements to the integration and separation lifecycle. Billing Administrator – Mandatory Skills. 3. years working in a similar role with full cycle billing activities. Experience working with Google Suite (Must Have). Strong technical skills in Excel, Word and Adobe. Must be tech savvy with an interest in continually upskilling. Strong written and oral communication skills incorporating effective listening skills. Ability to communicate with all levels of staff including Partners. Proven interpersonal, organizational, analytical and problem-solving skills. Strong understanding of end-to-end financial processes including a numerical aptitude. Demonstrates a commitment to providing excellent client service, by building and maintaining. productive relationships with both internal and external clients. Demonstrates professionalism at all times. Ability to negotiate and influence effectively, and to challenge in a constructive. manner.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6154e921b0589e6843d76790::careerbuilder_ca\", \"source\": \"careerbuilder_ca\", \"country\": \"CA\", \"company\": \"Procom\", \"position\": \"Billing Administrator\", \"notes\": \"\", \"original\": \"<div><p><strong>Billing Administrator<\/strong><\/p><p>On behalf of our client in the Consulting Sector, PROCOM is looking for a Billing Administrator.<\/p><p><strong>Billing Administrator \\u2013 Job Description<\/strong><\/p><ul><li>Accountable to define, plan, orchestrate and deliver on strategic initiatives<\/li><li>Lead project stakeholders such as sponsors, clients, vendors, outsourcers\/offshore resources (where applicable) and project team members to accomplish project objectives<\/li><li>Manage scope to ensure that the solution implemented fully meets the requirements, costs, time, quality and quantifiable business benefit\/criteria expectations of the sponsor<\/li><li>Develops the project charter, integrated project plan, staffing resource plan, contingency plan and other project management artifacts such as RAID logs<\/li><li>Proactively works with workstream leaders to resolve issues and remove roadblocks Identifies potential issues before they negatively impact the project<\/li><li>Tracks project expenses and validates financial forecasts with project sponsor<\/li><li>Ensures all project documentation repository is up to date for all project documentation, business\/technology documents related to any initiative, projects or programs; tracks and sets up deliverable process (sign-off, documentation)<\/li><li>Reports on the project and develops project status communications to management and firm leadership<\/li><li>Gathers input and facilitates lessons learned and post implementation review meetings M&A<\/li><li>Project Management accountabilities (in addition to above):<\/li><li>Prepare integration and separation plans in collaboration with key stakeholders that meet timelines set in pre-merger phase<\/li><li>Support the implementation phase and capture lessons learned and untapped value in post close phase<\/li><li>Ensures that post acquisition strategy is aligned to strategic rationale for merger or acquisition<\/li><li>Leverage your business acumen and collaborative engagement approach to drive continuous improvements and best practices to deliver better outcomes and continuous improvements to the integration and separation lifecycle<\/li><\/ul><p><strong>Billing Administrator \\u2013 Mandatory Skills<\/strong><\/p><ul><li>3+ years working in a similar role with full cycle billing activities<\/li><li>Experience working with Google Suite (Must Have)<\/li><li>Strong technical skills in Excel, Word and Adobe<\/li><li>Must be tech savvy with an interest in continually upskilling<\/li><li>Strong knowledge of internal billing systems (Must have)<\/li><li>Strong written and oral communication skills incorporating effective listening skills<\/li><li>Ability to communicate with all levels of staff including Partners.<\/li><li>Proven interpersonal, organizational, analytical and problem-solving skills<\/li><li>Strong understanding of end-to-end financial processes including a numerical aptitude<\/li><li>Demonstrates a commitment to providing excellent client service, by building and maintaining <\/li><li>productive relationships with both internal and external clients <\/li><li>Demonstrates professionalism at all times<\/li><li>Ability to negotiate and influence effectively, and to challenge in a constructive <\/li><li>manner<\/li><li>Leads and contributes to the team success by motivating and following up with practice staff to <\/li><li>ensure review of invoices is a priority<\/li><li>Works well independently, with minimal direction, and in a team environment; continuously <\/li><li>strives to acquire and develop related business knowledge<\/li><li>Self-starter with the ability to work in a multi-tasked, fast-paced, constantly <\/li><li>changing environment while meeting deadlines<\/li><li>Willingness and ability to learn and adapt to technology changes<\/li><\/ul><p><strong>Billing Administrator \\u2013 Nice to Have Skills<\/strong><\/p><ul><li>Previous experience in a Professional Services Firm as a Billing Administrator would be a strong asset<\/li><\/ul><p><strong>Billing Administrator - Assignment Start Date<\/strong><\/p><p>ASAP \\u2013 12 months to start <\/p><p><strong>Billing Administrator - Assignment Location<\/strong><\/p><p>Toronto, ON \\u2013 Work Remotely<\/p><\/div>&nbsp;\"}"
}