{
    "id":"Kaggle::techmap::613fae6f2eea2d54fa2b9ce8::monster2_ca::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" The GSOC Operator is responsible for providing primary and secondary security service support by following pre-defined actions to handle both normal course of business activities and critical events, including escalation to key parties within the operations centre and other support groups within the company. The GSOC Operator uses a variety of tools that can range from enterprise access control and alarm monitoring systems to various business intelligence sources, open source media, internet, and in-house tools to respond and alert personnel regarding any adverse conditions that may affect the client, its employees, facilities, and\/or properties. Associate's degree in Criminal Justice, Communications or related field and\/or 2 years of relevant work experience. Must be able to pass any Provincial-required training or other qualifications for employment. Must possess a valid drivers license. ASSET QUALIFICATIONS:Professional training and\/or education in one or more of the following:Customer service. Phone and communications etiquette. Dispatch operationsNo specific licenses\/certifications required, but professional security certifications such as the Certified Protection Officer (CPO), Certified Protection Professional (CPP), or a communications certification strongly encouraged. Experience in a modern 911 Call Centre, Central Station Alarm Monitoring and Dispatch Operation, Technical Security Control Room, or similar environment is a plus. Prior military or law enforcement experience is a plus. ADGA commits to putting diversity into action to build a stronger, more representative team and help our customers and communities thrive. We are a proudly Canadian and woman-led company, striving to further diversity, equity, and inclusion in the workplace and provide every individual with the opportunities and resources to help them reach their full potential. ADGA s'engage a mettre la diversite en action pour batir une equipe plus forte et plus representative et aider nos clients et nos communautes a prosperer. Nous sommes une entreprise fierement canadienne, dirigee par une femme. Nous nous engageons pour promouvoir la diversite, l'equite et l'inclusion dans le milieu de travail et d'offrir a chaque personne les possibilites et les ressources qui lui permettront de realiser son plein potentiel.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613fae6f2eea2d54fa2b9ce8::monster2_ca\", \"source\": \"monster2_ca\", \"country\": \"CA\", \"company\": \"ADGA Group\", \"position\": \"Operator - Security Operations Centre\", \"notes\": \"\", \"original\": \"The GSOC Operator is responsible for providing primary and secondary security service support by following pre-defined actions to handle both normal course of business activities and critical events, including escalation to key parties within the operations centre and other support groups within the company.The GSOC Operator uses a variety of tools that can range from enterprise access control and alarm monitoring systems to various business intelligence sources, open source media, internet, and in-house tools to respond and alert personnel regarding any adverse conditions that may affect the client, its employees, facilities, and\/or properties.Associate's degree in Criminal Justice, Communications or related field and\/or 2 years of relevant work experience.Must be able to pass any Provincial-required training or other qualifications for employment.Must possess a valid driver\\u2019s license.ASSET QUALIFICATIONS:Professional training and\/or education in one or more of the following:Customer servicePhone and communications etiquetteDispatch operationsNo specific licenses\/certifications required, but professional security certifications such as the Certified Protection Officer (CPO), Certified Protection Professional (CPP), or a communications certification strongly encouraged.Experience in a modern 911 Call Centre, Central Station Alarm Monitoring and Dispatch Operation, Technical Security Control Room, or similar environment is a plus.Prior military or law enforcement experience is a plus.ADGA commits to putting diversity into action to build a stronger, more representative team and help our customers and communities thrive. We are a proudly Canadian and woman-led company, striving to further diversity, equity, and inclusion in the workplace and provide every individual with the opportunities and resources to help them reach their full potential.ADGA s'engage \\u00e0 mettre la diversit\\u00e9 en action pour b\\u00e2tir une \\u00e9quipe plus forte et plus repr\\u00e9sentative et aider nos clients et nos communaut\\u00e9s \\u00e0 prosp\\u00e9rer. Nous sommes une entreprise fi\\u00e8rement canadienne, dirig\\u00e9e par une femme. Nous nous engageons pour promouvoir la diversit\\u00e9, l'\\u00e9quit\\u00e9 et l'inclusion dans le milieu de travail et d'offrir \\u00e0 chaque personne les possibilit\\u00e9s et les ressources qui lui permettront de r\\u00e9aliser son plein potentiel.\"}"
}