{
    "id":"Kaggle::techmap::615bd4bb34538e557c0bdbb4::linkedin_it::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The job description includes gender-coded phrases such as \"self-confident, creative, sensual, unconventional,\" which subtly favour female candidates by resonating more with traditionally feminine traits and qualities.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"She\/he\" can be seen as excluding those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Summary. Pomellato is the first global luxury Italian fashion fine jeweler, unconventional, colourful. Established in Milan in 1967, Pomellato stands out on the international scene for its unique design, blending impeccable craftsmanship and contemporary spirit. Timeless and fashionable, the brand was the first to introduce the pret-a-porter vision into the world of jewellery, infusing classic tradition with a new twist. Crafted by the hands of expert goldsmiths, its creations heighten colorful gems through innovative stone cutting and setting techniques, which over time have come to define a consistent, unmistakable and iconic style. The mission to bring the jewel out of the safe and wear it every day embodies the attitude and personality of the women who inspire the brand: self-confident, creative, sensual, unconventional. Today Pomellato is a global luxury jewellery brand with over 60 flagship boutiques and corners around the world. Job Description. Our Mission. The candidate will join the Pomellato and Dodo Trade Marketing & Visual Merchandising team based in Milan. She\/he will help out with visual\/window project developing, research and rendering activities. How you will contribute. Seasonal Thematic Window: Conception, implementation, organization, and production management of the identified proposals for windows using 3D modeling and rendering software on a global level. Special project, visual tools and product display: Conception, implementation, organization, and production management of the identified proposals for windows using 3D modeling and rendering software on a global level. Collaboration with the Visual team in researching new window display solutions. Maintain and develop a consistent level of VM across the network. Support the stores for the installation of new windows concept (2\/4 each year) and in store rotation. Support the organization of store openings. Support for specific in-store events of the assigned area. Work on specific adaptation\/personalization of the wholesale network supporting the relevant area manager. Manage VM booklet and guidelines graphic layout. Realize retail and wholesale rendering for specific project. Key Requirements. University Degree or similar in Visual Arts\/Design\/Architecture or similar. years of professional experience gained in a similar role, in luxury retail companies. Very good knowledge of Adobe Creative Suite, Autocad and a 3D program (Rhino or similar). Organizational skills, ability to handle multiple tasks and meet deadlines and flexibility. Spirit of initiative and curiosity for fashion trends. Creative abilities, eye for details.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615bd4bb34538e557c0bdbb4::linkedin_it\", \"source\": \"linkedin_it\", \"country\": \"IT\", \"company\": \"Pomellato\", \"position\": \"Pomellato Visual Designer\", \"notes\": \"\", \"original\": \"<br><br><strong>Summary<br><br><\/strong>Pomellato is the first global luxury Italian fashion fine jeweler, unconventional, colourful. Established in Milan in 1967, Pomellato stands out on the international scene for its unique design, blending impeccable craftsmanship and contemporary spirit. Timeless and fashionable, the brand was the first to introduce the pr\\u00eat-\\u00e0-porter vision into the world of jewellery, infusing classic tradition with a new twist. Crafted by the hands of expert goldsmiths, its creations heighten colorful gems through innovative stone cutting and setting techniques, which over time have come to define a consistent, unmistakable and iconic style. The mission to bring the jewel out of the safe and wear it every day embodies the attitude and personality of the women who inspire the brand: self-confident, creative, sensual, unconventional. Today Pomellato is a global luxury jewellery brand with over 60 flagship boutiques and corners around the world.<br><br><strong>Job Description<br><br><\/strong><strong>Our Mission <br><br><\/strong>The candidate will join the Pomellato and Dodo Trade Marketing &amp; Visual Merchandising team based in Milan. She\/he will help out with visual\/window project developing, research and rendering activities.<br><br><strong>How you will contribute<br><br><\/strong><ul><li><p>Seasonal Thematic Window: Conception, implementation, organization, and production management of the identified proposals for windows using 3D modeling and rendering software on a global level<br><br><\/p><\/li><li><p>Special project, visual tools and product display: Conception, implementation, organization, and production management of the identified proposals for windows using 3D modeling and rendering software on a global level<br><br><\/p><\/li><li><p>Collaboration with the Visual team in researching new window display solutions <br><br><\/p><\/li><li><p>Maintain and develop a consistent level of VM across the network<br><br><\/p><\/li><li><p>Support the stores for the installation of new windows concept (2\/4 each year) and in store rotation<br><br><\/p><\/li><li><p>Support the organization of store openings<br><br><\/p><\/li><li><p>Support for specific in-store events of the assigned area<br><br><\/p><\/li><li><p>Work on specific adaptation\/personalization of the wholesale network supporting the relevant area manager<br><br><\/p><\/li><li><p>Manage VM booklet and guidelines graphic layout<br><br><\/p><\/li><li><p>Realize retail and wholesale rendering for specific project.<br><br><br><br><\/p><\/li><\/ul><strong>Key Requirements<br><br><\/strong><ul><li><p>University Degree or similar in Visual Arts\/Design\/Architecture or similar<br><br><\/p><\/li><li><p>2+ years of professional experience gained in a similar role, in luxury retail companies<br><br><\/p><\/li><li><p>Very good knowledge of Adobe Creative Suite, Autocad and a 3D program (Rhino or similar)<br><br><\/p><\/li><li><p>Organizational skills, ability to handle multiple tasks and meet deadlines and flexibility<br><br><\/p><\/li><li><p>Spirit of initiative and curiosity for fashion trends; creative abilities, eye for details<br><br><\/p><\/li><li><p>Ability to work in a fast-paced environment on multiple projects at the same time and be able to shift from design creativity to admin management<br><br><\/p><\/li><li><p>Great relational skills; ability to work independently as well as in team<br><br><\/p><\/li><li><p>Fluent in English and Italian \\u2013 both written and spoken. Knowledge of any other foreign language would be greatly appreciated<br><br><\/p><\/li><li><p>Willing to travel<br><br><br><br><\/p><\/li><\/ul><strong>Job Type<br><br><\/strong>Regular<br><br><strong>Start Date<br><br><\/strong>2021-11-02<br><br><strong>Schedule<br><br><\/strong>Full time<br><br><strong>Organization<br><br><\/strong>POMELLATO S.P.A.\"}"
}