{
    "id":"Kaggle::techmap::6149f381f04ffe48df1fb540::headhunter_kz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  6 . ,  . Job Description: Identify inherent hazards to a process or facility to achieve a managed level of risk in operations and design. A key priority is the identification of potential LOC events and the ability to influence design of facilities to mitigate and prevent LOC events. This skill set includes a wide variety of engineering topics, including but not limited to hazard identification, design limitations, human factors engineering, extreme operating envelope phenomena, etc. Job Specification and requirements: Republic of Kazakhstan Citizenship. University degree in engineering meeting the expectations of FEANI (European Federation of National Engineering Associations) or other similar guiding bodies for higher education or direct equivalent. 5 or more years work experience in Engineering or Process Risk Management related discipline. Fluency in Kazakh, Russian and English. Must understand the concept of risk. Must be able to: Independently facilitate medium complexity Process Hazards Analyses (PHAs). Coordinate efforts of multiple disciplines. Collect, summarize and structure information. Develop problem resolution alternatives within the framework of professional duties. Work independently with minimal supervision. Write and speak in a clear and convincing manner using relevant arguments, style and language to a wide range of stakeholders. Promote teamwork approach through his\/her own conduct and communication style. Conduct daily business in English. Must be familiar with: Legal and regulatory acts covering industrial hazardous facilities. Engineering standards and industry best practices. Oil and gas facility operating principles. Critical barriers against major accident hazards. Basic understanding of Risk Management principles. Application of multiple forms of critical Process Safety Information. Safe Operating limits and design ranges for equipment and materials. Abnormal process conditions and operating scenarios. Facility design intent, limitations and risk of process plant to workforce. Basic understanding of High consequence scenarios and mitigation strategies.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6149f381f04ffe48df1fb540::headhunter_kz\", \"source\": \"headhunter_kz\", \"country\": \"KZ\", \"company\": \"Air Energi Caspian LLP trading as Airswift\", \"position\": \"Process Risk Engineer-II-Senior Process Risk Engineer\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u0431\\u043e\\u043b\\u0435\\u0435 6 \\u043b\\u0435\\u0442<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u041f\\u043e\\u043b\\u043d\\u0430\\u044f \\u0437\\u0430\\u043d\\u044f\\u0442\\u043e\\u0441\\u0442\\u044c<!-- -->, <span>\\u0412\\u0430\\u0445\\u0442\\u043e\\u0432\\u044b\\u0439 \\u043c\\u0435\\u0442\\u043e\\u0434<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <p><strong><em>Job Description: <\/em><\/strong><\/p> \\n  <p>Identify inherent hazards to a process or facility to achieve a managed level of risk in operations and design. A key priority is the identification of potential LOC events and the ability to influence design of facilities to mitigate and prevent LOC events. This skill set includes a wide variety of engineering topics, including but not limited to hazard identification, design limitations, human factors engineering, extreme operating envelope phenomena, etc.<\/p> \\n  <p><strong><em>Job Specification and requirements: <\/em><\/strong><\/p> \\n  <p>Republic of Kazakhstan Citizenship<\/p> \\n  <p><strong>University degree in engineering meeting the expectations of FEANI (European Federation of National Engineering Associations) or other similar guiding bodies for higher education or direct equivalent<\/strong><\/p> \\n  <p>5 or more years work experience in Engineering or Process Risk Management related discipline<\/p> \\n  <p>Fluency in Kazakh, Russian and English<\/p> \\n  <p>Must understand the concept of risk<\/p> \\n  <p>Must be able to:<\/p> \\n  <p>Independently facilitate medium complexity Process Hazards Analyses (PHAs)<\/p> \\n  <p>Coordinate efforts of multiple disciplines<\/p> \\n  <p>Collect, summarize and structure information<\/p> \\n  <p>Develop problem resolution alternatives within the framework of professional duties<\/p> \\n  <p>Work independently with minimal supervision <\/p> \\n  <p>Write and speak in a clear and convincing manner using relevant arguments, style and language to a wide range of stakeholders<\/p> \\n  <p>Promote teamwork approach through his\/her own conduct and communication style<\/p> \\n  <p>Conduct daily business in English<\/p> \\n  <p>Must be familiar with: Legal and regulatory acts covering industrial hazardous facilities; Engineering standards and industry best practices; Oil and gas facility operating principles; Critical barriers against major accident hazards; Basic understanding of Risk Management principles; application of multiple forms of critical Process Safety Information; Safe Operating limits and design ranges for equipment and materials; Abnormal process conditions and operating scenarios; Facility design intent, limitations and risk of process plant to workforce; Basic understanding of High consequence scenarios and mitigation strategies.<\/p>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\"}"
}