{
    "id":"Kaggle::techmap::614a02ab76d9892f9b89c550::linkedin_no::1",
    "label_age":true,
    "analysis_age":"The phrase \"Ability to travel very frequently (when ready for the big challenge)\" implies a preference for younger candidates more open to frequent travel, and the phrase \"media tech savvy\" also suggests younger candidates. Additionally, the phrase \"you should love not just watching Netflix\" is unnecessary for the job requirements and further favours younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The term \"A born hunter\" implies a preference for aggressive, competitive traits typically associated with masculinity.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The phrase \"when ready for the big challenge\" can be vague, potentially discouraging candidates who may interpret this as an unnecessarily high-pressure environment or who may have varying interpretations of what constitutes a \"big challenge.\"",
    "verified":true,
    "synthetic":false,
    "text":" 1-2 years experience in B2B Tech products sales and business development in Europe. A born hunter. You are not scared of mailing and calling. Social and eloquent for presentations and engaging with colleagues, partners and customer prospects. A demonstrable and successful track record in business development. Extremely target\/commercial oriented and able to work closely with the rest of the team. Ability to work with multiple projects and share resources in a small, matrix environment. Ability to travel very frequently (when ready for the big challenge). Excellent English language skills. Other European languages are a huge plus. Excellent Excel and PPT\/ Keynote skills. Preferred: Experienced and comfortable with value-based selling and and a can do mentality. Good understanding of solution sales. Media tech savvy and you should love not just watching Netflix, but all the technology where it comes from. Experience with developing B2B propositions and business models with Mobile Operators\/ Broadcast companies. Experience or passion for working across many foreign cultures. Sales experience within the broader areas of Media (TV, Telecom solutions or multimedia) or Solution Sales. Sophisticated communication and negotiation abilities in introducing new business concepts to major organizations internationally. Offer: A chance to be working in a medium sized business with amazing customers and multitask to improve on all-round development. To grow as a sales professional. To become a part of an internationally growing TV Tech company and community. A job that works across all levels of the organisation with delivery teams and the management. A very international workplace with great projects and people. Lunch & Coffee. Regular sales training and coaching. Socially active work environment with fun colleagues, including table tennis. Opportunity to grow your skills and contribute to our Norigin tech blog. Be part of our social events within the company and meet people from all disciplines. And other little sweeteners like mobile, home internet, insurances, pensions. Don't worry if you feel like you don't \"tick all the boxes\", you may have enough for us to find a place for you in our team! If you have managed to read this far leave a unique funny emoji at the bottom of your cover letter.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614a02ab76d9892f9b89c550::linkedin_no\", \"source\": \"linkedin_no\", \"country\": \"NO\", \"company\": \"Norigin Media\", \"position\": \"International Sales Associate\", \"notes\": \"\", \"original\": \"<p>We are looking for a charming, business savvy person who is looking for a full-time career in the commercial and media-tech space, where the world is an opportunity. We are looking for a sales person who understands the B2B sales processes and marketing activities who can work in multiple countries and cultures. The role is entry level within this field, but we expect some work experience in selling and presentations.<\/p><p><br><\/p><p>The role is located in our HQ, Oslo, Norway. We require the person to be based in Oslo to be close to our tech and product colleagues so we understand what we sell directly. The sales team is also an internal community building and social team.<\/p><p><br><\/p><p>The staff in Oslo consists of men and women, from across the world. We are around 35 persons in our Oslo offices from around 15 countries! We speak English at work. The company is a flat organization with self-running individuals who have a good place for both personal and professional development.<\/p><p><br><\/p><p>The candidate should be an enthusiastic, passionate about B2B business development, networking, marketing and conferencing within the Telecom, Media and broadcast industries in the beginning of the candidates career. The candidate will be selling TV technology related to streaming services. We have a need to expand our reach within some key markets in Europe and any previous experience will be great! <strong>The ideal candidate is eager to learn and want to become the best sales person in the world. Norigin Media will train the candidate from scratch to get fully ready to manage international sales activities.<\/strong><\/p><p><br><\/p><p><strong>Role<\/strong>:<\/p><ul><li>Create and maintain a target list of potential customers B2B<\/li><li>Build a database and sales pipeline<\/li><li>Find new business opportunities for the solutions offered by the company<\/li><li>Work across an allocated region (Europe is the initial requirement) with Pay-TV Operators and Broadcasters\/TV Companies<\/li><li>Manage a portfolio of potential customers, initiate appointments, analyze needs, set up demos and propose solutions<\/li><li>Business development and hunting opportunities to create meetings and opportunities<\/li><li>Work with and support marketing activities<\/li><li>Attend networking events &amp; relevant tradeshows to promote Norigin Media solutions across Europe<\/li><li>Reporting of activities including sales projections, customer databases and other sales reports<\/li><li>Customer satisfaction and management of accounts including up-sales<\/li><li>Reach team, general and revenue targets<\/li><li>Multifaceted role in an SME<\/li><\/ul><p><br><\/p><p><strong>Profile<\/strong>:<\/p><p><br><\/p><p>Mandatory:<\/p><ul><li>University degree<\/li><li>1-2 year\\u2019s experience in B2B Tech products sales and business development in Europe<\/li><li>A born hunter. You are not scared of mailing and calling<\/li><li>Social and eloquent for presentations and engaging with colleagues, partners and customer prospects<\/li><li>A demonstrable and successful track record in business development<\/li><li>Extremely target\/commercial oriented and able to work closely with the rest of the team<\/li><li>Ability to work with multiple projects and share resources in a small, matrix environment<\/li><li>Ability to travel very frequently (when ready for the big challenge)<\/li><li>Excellent English language skills. Other European languages are&nbsp;a huge plus<\/li><li>Excellent Excel and PPT\/ Keynote skills<\/li><\/ul><p><br><\/p><p>Preferred:<\/p><ul><li>Experienced and comfortable with value-based selling and and a \\u201ccan do\\u201d mentality<\/li><li>Good understanding of solution sales<\/li><li>Media tech savvy and you should love not just watching Netflix, but all the technology where it comes from<\/li><li>Experience with developing B2B propositions and business models with Mobile Operators\/ Broadcast companies<\/li><li>Experience or passion for working across many foreign cultures<\/li><li>Sales experience within the broader areas of Media (TV, Telecom solutions or multimedia) or Solution Sales<\/li><li>Sophisticated communication and negotiation abilities in introducing new business concepts to major organizations internationally<\/li><\/ul><p><br><\/p><p><strong>Offer<\/strong>:<\/p><ul><li>A chance to be working in a medium sized business with amazing customers and multitask to improve on all-round development<\/li><li>To grow as a sales professional<\/li><li>To become a part of an internationally growing TV Tech company and community<\/li><li>A job that works across all levels of the organisation with delivery teams and the management<\/li><li>A very international workplace with great projects and people<\/li><li>Lunch &amp; Coffee<\/li><li>Regular sales training and coaching<\/li><li>Socially active work environment with fun colleagues, including table tennis.<\/li><li>Opportunity to grow your skills and contribute to our Norigin tech blog<\/li><li>Be part of our social events within the company and meet people from all disciplines<\/li><li>And other little sweeteners like mobile, home internet, insurances, pensions<\/li><\/ul><p><br><\/p><p>Don't worry if you feel like you don't \\\"tick all the boxes\\\", you may have enough for us to find a place for you in our team! If you have managed to read this far leave a unique funny emoji at the bottom of your cover letter. For your application to be considered please let us know when you can start and that you are willing to move to Oslo (mandatory) and that you are eligible for work and residence permit (candidates with existing permits or EU\/EEA citizenship prioritized).<\/p><p><br><\/p><p>Please send your cover note and CV to careers@noriginmedia.com. Please state the position of \\u201cSales Associate\\u201d in the subject field.<\/p>\"}"
}