{
    "id":"Kaggle::techmap::614c31a0fce9ea265d5716b8::linkedin_pa::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" project and\/or team management experience, ideally in the industry. Wir bieten. continuous education & training. work-life balance. flexible working hours & time off in lieu. 30 days annual leave. on-site health management service. home office options. on-site nursery. elder care. company pension scheme. discounted public transport ticket. Munich, with its numerous lakes and its vicinity to the Alps, is considered to be one of the cities with the best quality of life worldwide. With its first-class universities and world-leading institutes, it offers an scientifically inspiring environment. Your scientific career is important to us, thats why this position provides the opportunity for you to build specialist knowledge and gather significant professional experience. Remuneration and social benefits are based on the collective wage agreement for public sector employees at federal level (TV EntgO Bund). The position is initially limited to two years. To promote diversity, we welcome applications from talented people regardless of cultural background, nationality, ethnicity, gender, and sexual identity, physical abilities, religion, and age until September 29th, 2021. Qualified applicants with physical disabilities will be given preference. Mostrar mas Mostrar menos.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c31a0fce9ea265d5716b8::linkedin_pa\", \"source\": \"linkedin_pa\", \"country\": \"PA\", \"company\": \"Helmholtz Zentrum M\\u00fcnchen\", \"position\": \"Helmholtz Zentrum M\\u00fcnchen busca personas para el cargo de Helmholtz AI consultants (Health) en Amelia e Icaza, Panam\\u00e1, Panam\\u00e1\", \"notes\": \"\", \"original\": \"<section class=\\\"show-more-less-html\\\" data-max-lines=\\\"5\\\"> \\n <div class=\\\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\\\"> <strong>Helmholtz Zentrum M\\u00fcnchen is a research center with the mission to discover personalized medical solutions for the prevention and therapy of environmentally triggered diseases and promote a healthier society in a rapidly changing world. <br><br><\/strong>Germany\\u2019s largest research organization, the Helmholtz Association, launched Helmholtz AI: This dedicated, interdisciplinary platform develops and promotes applied Artificial Intelligence (AI) methods for all Helmholtz centers in collaboration with its external and university partners. Its central unit is implemented at the Helmholtz Zentrum in Munich.\\n  <br>\\n  <br>Our mission is to enable research scientists to leverage AI methods optimally. The Munich consultant team is focussing on Health and collaborates with researchers from the whole Association on projects on cancer and infection research, molecular medicine, as well as neurodegenerative and environmental diseases. We offer you the unique opportunity to use your data analysis expertise to answer questions of great societal importance in a vibrant international environment.\\n  <br>\\n  <br>To join our growing team, we are inviting applications for\\n  <br>\\n  <br><strong>Helmholtz AI consultants (f\/m\/x) (Health) <br><br><\/strong><strong>101060<br><br><\/strong>(close to) full time\\n  <br>\\n  <br>Neuherberg near Munich\\n  <br>\\n  <br>Young Professionals, Professionals\\n  <br>\\n  <br><strong>Aufgaben<br><br><\/strong>You will develop AI-based analytics for the unique data sets generated by renowned researchers, with a focus on health applications. You will also play a crucial role in achieving our long-term goal of facilitating open access to data science expertise through interdisciplinary collaborations and dissemination.\\n  <br>\\n  <br>You will\\n  <br>\\n  <ul>\\n   <li>be a foundational and fundamental part of one of the largest AI initiatives in Europe<\/li>\\n   <li>apply, adapt, and disseminate emerging AI methods to solve concrete research questions<\/li>\\n   <li>network with AI experts and within the Helmholtz AI initiative<\/li>\\n   <li>regularly participate in international conferences to present your own work, and learn about state-of-the-art AI methods and their applications<br><\/li>\\n  <\/ul><strong>Profil<br><\/strong>\\n  <ul>\\n   <li>a master or PhD degree in computer science, engineering, mathematics, physics, bioinformatics, or another field related to data science<\/li>\\n   <li>a track record in AI and applied machine learning, ideally combined with a specific background in healthcare or biology<\/li>\\n   <li>experience implementing data science projects in Python or R<\/li>\\n   <li>a systematic way of working, preferably with experience in multidisciplinary projects<\/li>\\n   <li>an open and curious mindset with a strong team spirit<br><\/li>\\n  <\/ul><strong><u>Additional Preferred Competences<br><br><\/u><\/strong>To strengthen our team, we are looking for applicants, who could bring one of the following bonus expertise:\\n  <br>\\n  <ul>\\n   <li>software development experience and an eye for software quality<\/li>\\n   <li>training, education, and\/or science communication experience<\/li>\\n   <li>project and\/or team management experience, ideally in the industry<br><\/li>\\n  <\/ul><strong>Wir bieten<br><\/strong>\\n  <ul>\\n   <li>continuous education &amp; training<\/li>\\n   <li>work-life balance<\/li>\\n   <li> flexible working hours &amp; time off in lieu<\/li>\\n   <li>30 days annual leave<\/li>\\n   <li> on-site health management service<\/li>\\n   <li> home office options <\/li>\\n   <li>on-site nursery<\/li>\\n   <li>elder care <\/li>\\n   <li>company pension scheme<\/li>\\n   <li>discounted public transport ticket<br><\/li>\\n  <\/ul>Munich, with its numerous lakes and its vicinity to the Alps, is con\\u00adsidered to be one of the cities with the best quality of life world\\u00adwide. With its first-class universities and world-leading institutes, it offers an scientifically inspiring environment.\\n  <br>\\n  <br>Your scientific career is important to us, that\\u2019s why this position provides the opportunity for you to build specialist knowledge and gather significant professional experience.\\n  <br>\\n  <br>Remuneration and social benefits are based on the collective wage agreement for public sector employees at federal level (TV EntgO Bund). The position is initially limited to two years.\\n  <br>\\n  <br>To promote diversity, we wel\\u00adcome applications from talented people regardless of cultural back\\u00adground, nationality, ethnicity, gender, and sexual identity, physical abilities, religion, and age until <strong>September 29th, 2021<\/strong>. Qualified appli\\u00adcants with physical disabili\\u00adties will be given preference. \\n <\/div> <button class=\\\"show-more-less-html__button show-more-less-html__button--more\\\" data-tracking-control-name=\\\"public_jobs_show-more-html-btn\\\" aria-label=\\\"Mostrar m\\u00e1s, se ampl\\u00eda visualmente el contenido de lectura arriba de este bot\\u00f3n\\\" aria-expanded=\\\"false\\\"> Mostrar m\\u00e1s \\n  <icon class=\\\"show-more-less-html__button-icon\\\" data-delayed-url=\\\"https:\/\/static-exp1.licdn.com\/sc\/h\/cyolgscd0imw2ldqppkrb84vo\\\"><\/icon> <\/button> <button class=\\\"show-more-less-html__button show-more-less-html__button--less\\\" data-tracking-control-name=\\\"public_jobs_show-less-html-btn\\\" aria-label=\\\"Mostrar menos\\\" aria-expanded=\\\"true\\\"> Mostrar menos \\n  <icon class=\\\"show-more-less-html__button-icon\\\" data-delayed-url=\\\"https:\/\/static-exp1.licdn.com\/sc\/h\/4chtt12k98xwnba1nimld2oyg\\\"><\/icon> <\/button> \\n<\/section>\"}"
}