{
    "id":"Kaggle::techmap::612f0a8ce9f4017c1de64589::linkedin_ch::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Proven capability in negotiation, conflict resolution and stakeholder management. Flexibility to work outside of normal working hours to support global projects. If this role excites you, and you feel you could take this next challenge in your career, then I look forward to receiving your application today. Please note that we are only considering applications from Swiss and EU-27\/EFTA nationals or Swiss work permit holders for our open positions in Switzerland.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::612f0a8ce9f4017c1de64589::linkedin_ch\", \"source\": \"linkedin_ch\", \"country\": \"CH\", \"company\": \"Randstad Switzerland\", \"position\": \"Senior Test Manager (Pharma)\", \"notes\": \"\", \"original\": \"For our customer, one of the world's leading pharmaceutical company in Kanton Basel, Switzerland, we are looking for a committed and reliable personality as a Senior Test Manager.<br><br>To support our client in the area of a global procurement cloud-based solution, we are looking for an experienced and strategic test professional with relevant experience in the Life Science industry. The ideal candidate will support the implementation and deployment efforts regarding a sustainable test strategy and solution quality approach.<br><br>Tasks and Responsibilities<br><ul><li>Define the approach for the test preparation, planning, execution and coordination in close collaboration with Test Manager \/ Coordinators, Project and Deployment Leads<\/li><li>Drive continuous improvements and efficiencies of the test management strategy, approaches, tools and foster integrated ways of working (e.g. with scrum and deployment teams) in close alignment with Project Leads, Program Test Lead and Implementation Partner<\/li><li>Enabling a team of Test Managers and Coordinators who execute the testing and report progress.<\/li><li>Define appropriate education needs \/ prerequisites for all teams involved in the testing<\/li><li>Advocating the appropriate level of quality by defining and implementing a holistic test strategy incorporating all aspect of the solution and implementation (e.g. product development\/enhancement, data and configuration, localization, regression and E2E Testing)<\/li><li>Define KPIs &amp; SLAs for the test preparation, execution and defect management across all areas involved in the myBuy Program (scrum and deployment teams)<\/li><li>Define template(s) to track the test readiness &amp; progress (E2E) Plan &amp; Forecast testing activities across the mid-level and deployment plans aligned with our partner systems<\/li><li>Analyse and implement management improvement processes in alignment with the project leads<br><\/li><\/ul><strong><u>Must Haves<br><\/u><\/strong><ul><li>5+ years of experience as a Test Manager, including definition and implementation of a test strategy for a global solution <\/li><li>Experience in a regulated environment, preferred in the pharmaceutical or medical device industry <\/li><li>10+ years of relevant experience in global and complex system implementation projects as a core team member<\/li><li>Strong Project management and Planning skills in waterfall and agile approaches<\/li><li>Experience in working with SAP Solution Manager and JIRA<\/li><li>Familiar with CSV practices (no certification required)<\/li><li>Business level fluency in English both written and verbal, German is an advantage<\/li><li>Strong communication skills is a must<\/li><li>Strategic and system thinking with a view to long-term sustainability<\/li><li>Strong listening, facilitation and collaboration skills<\/li><li>Requires excellent problem solving and analytical skills to resolve a variety of routine and complex issues and challenges<\/li><li>Proven capability in negotiation, conflict resolution and stakeholder management<\/li><li>Flexibility to work outside of normal working hours to support global projects<br><\/li><\/ul>If this role excites you, and you feel you could take this next challenge in your career, then I look forward to receiving your application today.<br><br>Please note that we are only considering applications from Swiss and EU-27\/EFTA nationals or Swiss work permit holders for our open positions in Switzerland.\"}"
}