{
    "id":"Kaggle::techmap::615624ff73464a18e5d5494a::rabota_ua::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Know how to scale the demands generation. Launch and optimize digital marketing campaigns (FB, Google) according to our general marketing strategy. Generate and test different creative campaigns for digital outreach. Perform the Data Analysis. Have hands-on experience launching PPC, Email Marketing. Have strong experience with Google Analytics. Have experience running Facebook Ad campaigns. You are familiar with Google Search Console, Google Tag Manager. Have an understanding of SEO processes to be able to control SEO-agency performance. Personal qualities: We are looking for a courageous and responsible person ready for new challenges, willing to learn a new exciting industry and move it forward. For this position, its crucial to be self-motivated, proactive, and fully autonomous. We are sure that any hard skill can be learned, and it's normal not to know something. As for soft skills, it is essential for us that the people in the team share the following values: Trust. is the foundation of any relationship. It is vital to remain honest in any situation. Passion. work should be fun. Otherwise, what's the point? We believe a person is most effective in position when its done with joy and love. Courage. we are pioneers. We have to be bold and brave, daring to create outstanding solutions and set up new standards in the XR industry. It Will be a plus: Understanding of AR\/ VR technologies, their types, specifics, hardware. Experience with PR activities. What's on us? The absolute freedom and full responsibility for the companys whole marketing process, you can experiment with the most prompt actions, having total support from the Founders. Youll be challenged to work with the early staged and at the same time highly trending XR industry, where there are still no standards or best practices, so you can become that very person. a pioneer who sets it all up for the whole global industry! Fantastic team. we are passionate about what we do, we are known in the global AR\/VR community, we are in the Top 10 AR\/ VR developers globally, we have strong expertise in the XR industry. Exciting projects that you will be proud of. Since we work with clients worldwide from different industries, projects are always very diverse, throwing up new challenges and growth opportunities.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615624ff73464a18e5d5494a::rabota_ua\", \"source\": \"rabota_ua\", \"country\": \"UA\", \"company\": \"WeAR Studio, LLC\", \"position\": \"Lead Marketing manager\", \"notes\": \"\", \"original\": \"<p id=\\\"isPasted\\\">WeAR Studio is an AR\/VR development company. We create XR solutions to solve specific business challenges of our clients across various industries. For example, AR applications for marketing activations, VR simulations for training and education, applications on Hololens for data visualization, and many other tasks.<\/p><p>&nbsp;We're shaping the AR\/VR industry right now, and we need like-minded people to help us grow the projects and boost AR\/VR culture worldwide.<\/p><p>&nbsp;We are looking for you, our <strong>Marketing Manager.<\/strong> You will be our absolute marketing sovereign fully responsible for the whole marketing process in our company, cross-functionally working with strategy, coordinating and launching campaigns, managing the content team, and closely interacting with the Business Development team.&nbsp;<\/p><p>&nbsp;And it\\u2019s all for demand generation, increasing sales and brand awareness, growing XR culture, and, for the sheer excitement, for sure. &nbsp;&nbsp;<\/p><p><br><\/p><p>?? <strong>Main responsibilities:<\/strong><\/p><ul><li>Develop and execute Marketing Strategy roadmap to achieve pipeline goals<\/li><li>Work cross-functionally with content production<\/li><li>Cooperate with the sales team&nbsp;<\/li><li>Launch and optimize campaigns, leveraging content, emails, ads, partners<\/li><li>Manage content strategy and the content team<\/li><li>Coordinate SEO &amp; Digital Ads\\u2019 contractors: controlling, optimizing, result tracking, coordination<\/li><li>Work on company\\u2019s branding and PR&nbsp;<\/li><li>Interact with the business development team on such points: goals, budgets, campaigns, lead nurturing, lead management&nbsp;<\/li><li>Set up metrics and track marketing performance&nbsp;<\/li><li>Report the critical criteria and rates to the founders&nbsp;<\/li><li>Set up HubSpot and all the reporting in it&nbsp;<\/li><li>Coordinate the integration of various marketing tools in one digital ecosystem&nbsp;<\/li><li>Improve the website, working with the web dev subcontractors<\/li><li>Participate in ideation and creative sessions for both WeAR Studio and our customers<\/li><li>Track the engagement with every piece of content to analyze the performance per each TA segmentation<\/li><li>Analyze the interactions with all marketing interfaces using analytical tools<\/li><li>Consult our Clients on how to make the most out of their marketing campaigns that would involve AR\/VR solutions<\/li><\/ul><p><br><\/p><p>&nbsp;<strong>Important skills.<\/strong> You will thrive as a Marketing Manager in our company if you possess such proven skills or experience:<\/p><ul><li>Your English <strong>MUST<\/strong> be at an Advanced level (!)<\/li><li>2+ years of experience in a similar position in a <strong>B2B IT service company<\/strong><\/li><li>Experience in creating and performing marketing strategy<\/li><li>Experience in B2B marketing campaigns with the focus on middle-market and enterprise sales&nbsp;<\/li><li>Experience with marketing automation and CRM tools like HubSpot<\/li><li>Have a clear understanding of how marketing influences company\\u2019s profit&nbsp;<\/li><li>Know how to scale the demand\\u2019s generation&nbsp;<\/li><li>Launch and optimize digital marketing campaigns (FB, Google) according to our general marketing strategy<\/li><li>Generate and test different creative campaigns for digital outreach<\/li><li>Perform the Data Analysis<\/li><li>Have hands-on experience launching PPC, Email Marketing<\/li><li>Have strong experience with Google Analytics<\/li><li>Have experience running Facebook Ad campaigns<\/li><li>You are familiar with Google Search Console, Google Tag Manager<\/li><li>Have an understanding of SEO processes to be able to control SEO-agency performance<\/li><\/ul><p><br><\/p><p><strong>&nbsp;<\/strong> <strong>Personal qualities:<\/strong><\/p><p>&nbsp;We are looking for a courageous and responsible person ready for new challenges, willing to learn a new exciting industry and move it forward. For this position, it\\u2019s crucial to be self-motivated, proactive, and fully autonomous.<\/p><p>&nbsp;We are sure that any hard skill can be learned, and it's normal not to know something. As for soft skills, it is essential for us that the people in the team share the following values:&nbsp;<\/p><ul><li>Trust - is the foundation of any relationship; it is vital to remain honest in any situation.<\/li><li>Passion - work should be fun; otherwise, what's the point? We believe a person is most effective in position when it\\u2019s done with joy and love.<\/li><li>Courage - we are pioneers; we have to be bold and brave, daring to create outstanding solutions and set up new standards in the XR industry.<\/li><\/ul><p><br><\/p><p>&nbsp;<strong>It Will be a plus:<\/strong><\/p><ul><li>Understanding of AR\/ VR technologies, their types, specifics, hardware<\/li><li>Experience with PR activities<\/li><\/ul><p><br><\/p><p>? <strong>What's on us?&nbsp;<\/strong><\/p><ul><li>The absolute freedom and full responsibility for the company\\u2019s whole marketing process, you can experiment with the most prompt actions, having total support from the Founders.<\/li><li>You\\u2019ll be challenged to work with the early staged and at the same time highly trending XR industry, where there are still no standards or best practices, so you can become that very person - a pioneer who sets it all up for the whole global industry!<\/li><li>Fantastic team - we are passionate about what we do, we are known in the global AR\/VR community, we are in the Top 10 AR\/ VR developers globally, we have strong expertise in the XR industry. &nbsp;<\/li><li>Exciting projects that you will be proud of. Since we work with clients worldwide from different industries, projects are always very diverse, throwing up new challenges and growth opportunities.<\/li><li>Flexible terms of cooperation, no matter how trite it may sound, but the conditions are really flexible, especially in the current world\\u2019s situation. We agree on them within the person\/ team.&nbsp;<\/li><li>100% compensation for professional events.<\/li><li>90% compensation of corporate medical insurance&nbsp;<\/li><li>50% compensation of the cost of training events on professional topics.<\/li><li>Participation in corporate events and internal events of the company.<\/li><\/ul><p><br><\/p><p>&nbsp;Our office is on the Pochaininska str., which is a 10 minutes walk from the T.Shevchenka and Kontraktova metro stations. &nbsp;<\/p><p>&nbsp;You\\u2019ll get the priority among other candidates if you apply together with a short intro video of no more than 1 minute. We are so excited to meet you!&nbsp;<\/p><p>&nbsp;Submit your resume and a link to your portfolio (or other materials that you consider necessary to share); we look forward to meeting you!&nbsp;<\/p>\"}"
}