{
    "id":"Kaggle::techmap::614c18d2855b7b7cb16f3b44::linkedin_sv::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Must be able to lift up to 20 pounds\". Does not clarify if this is aided or unaided and whether reasonable accommodations are offered.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Trainers may be asked to participate in special projects, training room inspections, controlled copy review, document updates, and other miscellaneous activities. Trainers will need to learn some aspects of both SAP and PEPs computer systems. Some computer support of operations personnel will also be required. Work is performed in strict compliance with manufacturing standards and all regulatory requirements. Additional Duties and Responsibilities Include: Functional\/Technical Knowledge: Previous experience as an Inspection Operator and\/or Line Coordinator is desired. Limited knowledge of industry practices and standards. Computer skills are desired. Problem Solving and Innovation: Develop solutions to routine problems following established Pfizer policies and procedures. Discretion, Latitude, Level of Independence: The Trainer position often works independently of close supervision. Follows specific, detailed instructions. Impact and Organizational Contribution: Contributes to the completion of routine tasks. Failure to achieve results may have a significant impact on departmental objectives. Teamwork\/Influence: Contacts are primarily within an immediate work group or within a normal process-related workflow, but interactions with other units will also be required. Time Span of Work: Daily tasks and deliverables. Results can usually be measured on a daily or weekly basis. Qualifications. Must-Have. Education: High school diploma \/ general education degree (GED) or Associates Degree. Experience: Previous experience as an Inspection Operator or Line Coordinator is desired. Certificates, Licenses, or Registrations: None. Mathematical Skills: Basic Mathematical Skills are required. Reasoning Ability: The colleague must have an acceptable level of reasoning ability. Nice-to-Have. Bachelor's Degree. Previous experience in cGMPs (current Good Manufacturing Practices) environment. Physical\/Mental Requirements. Must be able to lift up to 20 pounds. May be required to stand for long periods of time. Use of hearing and eye protection may be required. Non-standard Work Schedule, Travel Or Environment Requirements. Weekend work is required. Other Job Details: Last Date to Apply for Job: September 30, 2021. Eligible for Relocation Package: No. Eligible for Employee Referral Bonus: Yes. Pfizer requires all U. S. new hires to be fully vaccinated for COVID-19 prior to the first date of employment. As required by applicable law, Pfizer will consider requests for Reasonable Accommodations. Sunshine Act. Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c18d2855b7b7cb16f3b44::linkedin_sv\", \"source\": \"linkedin_sv\", \"country\": \"SV\", \"company\": \"Pfizer\", \"position\": \"Inspection Trainer I - 2nd Shift (3:00pm - 11:15 pm)\", \"notes\": \"\", \"original\": \"Why Patients Need You<br><br>Our breakthroughs would not make it to the hands of patients without our pharmaceutical manufacturing team. We rely on a team of dedicated and agile members, who understand the importance and impact of their role in Pfizer\\u2019s mission. Patients need colleagues like you who take pride in their work and always look to improve outcomes. You will help to ensure that patients and physicians have the medicines they need when they need them.<br><br>What You Will Achieve<br><br>As part of technical operations, you will be a team member who is relied upon to have a good understanding of procedures, techniques, tools, materials, and equipment. Your decision-making will help you prioritize workflows based on the available resources. You will follow standard procedures to complete tasks, some of which may vary in scope, sequence, complexity, and timing. You will contribute to the team\\u2019s success by sharing your previously acquired knowledge.<br><br>It is your hard work and focus that will help in making Pfizer ready to achieve new milestones and help patients across the globe.<br><br>Role Summary<br><br>The Sterile Inspection Trainer position supports the Sterile Inspection unit with training and support activities. Trainers develop and conduct training and qualification activities for all new and established Sterile Inspection Operators.<br><br>Role Responsibilities<br><br>Trainers are expected to be fully trained on all Inspection procedures. Trainers will perform both Tray and Procedure audits on operators. These audits may have a direct impact on individual colleague performance. A high level of people skills is important in the Trainer position, as trainers will be expected to interact and possibly correct individual colleague behavior and practices. The Trainer will also conduct defect classification on completed products which may include quality calls that may impact overall product disposition. The Trainers will conduct AQL and TAQL inspections on the lines. Trainers may also be asked to make quality calls on product defects in other units such as Injectable Bulk Filling and Sterile Packaging. Inspection trainers will train and\/or re-qualify Injectable Bulk Filling personnel on an annual basis. Trainers will be expected to hand off information at shift meetings and may be asked to communicate information with other units and shifts. Trainers will also oversee all aspects of training documentation in PLS as well as maintain and update operator curricula. They will be expected to update and maintain the OJT training report and training database. Trainers may be asked to participate in special projects, training room inspections, controlled copy review, document updates, and other miscellaneous activities. Trainers will need to learn some aspects of both SAP and PEPs computer systems. Some computer support of operations personnel will also be required. Work is performed in strict compliance with manufacturing standards and all regulatory requirements.<br><br>Additional Duties and Responsibilities Include:<br><ul><li>Functional\/Technical Knowledge: Previous experience as an Inspection Operator and\/or Line Coordinator is desired. Limited knowledge of industry practices and standards. Computer skills are desired.<\/li><li>Problem Solving and Innovation: Develop solutions to routine problems following established Pfizer policies and procedures.<\/li><li>Discretion, Latitude, Level of Independence: The Trainer position often works independently of close supervision. Follows specific, detailed instructions.<\/li><li>Impact and Organizational Contribution: Contributes to the completion of routine tasks. Failure to achieve results may have a significant impact on departmental objectives.<\/li><li>Teamwork\/Influence: Contacts are primarily within an immediate work group or within a normal process-related workflow, but interactions with other units will also be required.<\/li><li>Time Span of Work: Daily tasks and deliverables. Results can usually be measured on a daily or weekly basis.<br><\/li><\/ul><strong><u>Qualifications<br><br><\/u><\/strong>Must-Have<br><ul><li>Education: High school diploma \/ general education degree (GED) or Associates Degree<\/li><li>Experience: Previous experience as an Inspection Operator or Line Coordinator is desired.<\/li><li>Certificates, Licenses, or Registrations: None<\/li><li>Mathematical Skills: Basic Mathematical Skills are required.<\/li><li>Reasoning Ability: The colleague must have an acceptable level of reasoning ability.<br><\/li><\/ul>Nice-to-Have<br><ul><li>Bachelor's Degree<\/li><li>Previous experience in cGMPs (current Good Manufacturing Practices) environment<br><\/li><\/ul><strong><u>Physical\/Mental Requirements<br><br><\/u><\/strong>Must be able to lift up to 20 pounds. May be required to stand for long periods of time. Use of hearing and eye protection may be required.<br><br><strong><u>Non-standard Work Schedule, Travel Or Environment Requirements<br><br><\/u><\/strong>Weekend work is required.<br><br><strong>Other Job Details:<br><\/strong><ul><li>Last Date to Apply for Job: September 30, 2021<\/li><li>Eligible for Relocation Package: No<\/li><li>Eligible for Employee Referral Bonus: Yes<br><\/li><\/ul><strong>Pfizer requires all U.S. new hires to be fully vaccinated for COVID-19 prior to the first date of employment. As required by applicable law, Pfizer will consider requests for Reasonable Accommodations.<br><br><\/strong><strong>Sunshine Act<br><br><\/strong>Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider\\u2019s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.<br><br><strong>EEO &amp; Employment Eligibility<br><br><\/strong>Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.<br><br>Manufacturing<br><br>\"}"
}