{
    "id":"Kaggle::techmap::6131e0473434af41ecbbd537::linkedin_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Summary: The Order to Cash (OTC) team supports the OTC process and enhancements for the company’s financial systems including SAP and various Front of House, web applications, and payment systems. The Senior Financial Systems Analyst will play a key role to provide support and leadership, as needed, in various payment initiatives impacting multiple system applications throughout the segment\/Enterprise. The Senior Financial Systems Analyst (Project Hire through March 31st 2022) will support project initiatives impacting multiple system applications throughout the segment & Enterprise. The position will play a key role as new technologies emerge and are placed into operation, ensuring planning and implementation considers the correct processing and accounting of financial data across multiple systems. This position will also focus on ensuring changes to processing financial data are properly documented and integrated within financial systems. Additional responsibilities include working with finance partners for approval, performing testing efforts to validate financial and functional requirements, and working with IT and business partners to ensure that critical financial needs are covered. This will include supporting change management efforts through testing, documentation and training. This role will primarily support an enterprise project including system integrations with payment processing, accounting postings, reporting, as well as testing and coordination efforts. A strong knowledge base in SAP will assist as the project is foundational to recording transactions correctly in SAP. The ideal candidate should have extensive experience with process improvement, the ability to learn new systems, and with projects at the Enterprise, Segment or Business Unit level. This candidate should be familiar with current best practices, the ability to work with multiple business units to understand issues, and partner with IT for a resolution. Basic Qualifications: Minimum of 4 – 6 years of demonstrated high-level professional knowledge and skills in finance and\/or supply chain systems and processes. Minimum of 4. 6 years leading change management efforts at the Enterprise, Segment and Business Unit levels of the organization. Experience working for large company and within a matrix organization. Passion for and knowledge of emerging technologies to deliver best practice ensuring financial systems integrity and controls. Expert knowledge\/experience in Financial Systems and area for business and technical audiences. Experience supporting change for large projects that encompass front of house and back of house finance\/accounting and integration to SAP ensuring financial integrity. Demonstrate multi-tasking and project management skills to manage workload from logistics to strategic efforts, while adhering to deadlines and high quality.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6131e0473434af41ecbbd537::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"The Walt Disney Company\", \"position\": \"Senior Financial Systems Analyst - Project Hire\", \"notes\": \"\", \"original\": \"Job Summary:<br><br>The Order to Cash (OTC) team supports the OTC process and enhancements for the company\\u2019s financial systems including SAP and various Front of House, web applications, and payment systems. The Senior Financial Systems Analyst will play a key role to provide support and leadership, as needed, in various payment initiatives impacting multiple system applications throughout the segment\/Enterprise.<br><br>The Senior Financial Systems Analyst (Project Hire through March 31st 2022) will support project initiatives impacting multiple system applications throughout the segment &amp; Enterprise. The position will play a key role as new technologies emerge and are placed into operation, ensuring planning and implementation considers the correct processing and accounting of financial data across multiple systems. This position will also focus on ensuring changes to processing financial data are properly documented and integrated within financial systems. Additional responsibilities include working with finance partners for approval, performing testing efforts to validate financial and functional requirements, and working with IT and business partners to ensure that critical financial needs are covered. This will include supporting change management efforts through testing, documentation and training.<br><br>This role will primarily support an enterprise project including system integrations with payment processing, accounting postings, reporting, as well as testing and coordination efforts. A strong knowledge base in SAP will assist as the project is foundational to recording transactions correctly in SAP.<br><br>The ideal candidate should have extensive experience with process improvement, the ability to learn new systems, and with projects at the Enterprise, Segment or Business Unit level. This candidate should be familiar with current best practices, the ability to work with multiple business units to understand issues, and partner with IT for a resolution<br><br>This person will report to the Financial Systems Manager, in support of the Project(s).<br><br><strong>Basic Qualifications:<br><br><\/strong><ul><li>Minimum of 4 \\u2013 6 years of demonstrated high-level professional knowledge and skills in finance and\/or supply chain systems and processes.<\/li><li>Minimum of 4 - 6 years leading change management efforts at the Enterprise, Segment and Business Unit levels of the organization<\/li><li>Experience working for large company and within a matrix organization<\/li><li>Passion for and knowledge of emerging technologies to deliver best practice ensuring financial systems integrity and controls<\/li><li>Expert knowledge\/experience in Financial Systems and area for business and technical audiences.<\/li><li>Experience supporting change for large projects that encompass front of house and back of house finance\/accounting and integration to SAP ensuring financial integrity<\/li><li>Demonstrate multi-tasking and project management skills to manage workload from logistics to strategic efforts, while adhering to deadlines and high quality.<\/li><li>Experienced in using the Microsoft Office applications (e.g., Access, Word, Excel, PowerPoint, Visio, Project)<\/li><li>Excellent written and verbal communications skills<\/li><li>Ability to develop a logical and persuasive approach and outline for a \\u201cdeck\\u201d<\/li><li>Demonstrated ability to build credibility with internal clients and to navigate organizational structures.<\/li><li>Proven ability to collaborate, establish relationships, and build credibility with employees and teams<\/li><li>Demonstrated self-starter<\/li><li>Ability to understand and adapt to different audiences and clients<\/li><li>Experience with small to medium projects that encompass front of house and back of house finance\/accounting with integration to SAP ensuring financial integrity<\/li><li>Demonstrate multi-tasking skills to manage workload while adhering to deadlines and high quality.<br><br><\/li><\/ul>Preferred Qualifications:<br><br><ul><li>Experienced in using the Microsoft Office applications (e.g., Word, Excel, PowerPoint, Visio, Project)<\/li><li>Experience in using SAP or another ERP<\/li><li>Experience in using Business Warehouse, Business Objects and\/or Cognos reporting tools<\/li><li>Ability to demonstrate a strong business acumen<\/li><li>Experience implementing financial processes and systems<\/li><li>Experience using systems designed to manage issues, changes and testing (e.g. Service Manager, Rational Team Concert, ALM)<\/li><li>CPA or CMA license, or equivalent<\/li><li>PMP or other professional project management certification<br><br><\/li><\/ul>Required Education<br><br><ul><li>Bachelor's Degree, or equivalent in an Accounting, Finance, Information Technology, Business, or related field<\/li><li>Graduate Degree<\/li><li>CPA a plus<\/li><li>Experienced in using the Microsoft Office applications (e.g., Word, Excel, PowerPoint, Visio, Project)<\/li><li>Experience in using SAP or another ERP<\/li><li>Experience in using Business Warehouse, Business Objects and\/or Cognos reporting tools<\/li><li>Ability to demonstrate a strong business acumen<\/li><li>Experience implementing financial processes and systems<\/li><li>Experience using systems designed to manage issues, changes and testing (e.g. Service Manager, Rational Team Concert, ALM)<br><br><\/li><\/ul>854757BR\"}"
}