{
    "id":"Kaggle::techmap::6155c27ed198905e9e6165f7::monster_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Medical Assisting diploma from an accredited vocational institution, a community college program in medical assisting preferred. Minimum one year of recent experience working in a medical facility as a medical assistant and or scribe preferred. Current CPR certification. About Us: Praxis Health is a family of medical groups providing high quality healthcare throughout the state of Oregon. Our community-based clinics are the DNA of our business, providing better medicine, advocacy for our patients, and a satisfying and collaborative culture for our providers and staff. The Praxis family approach is dynamically different than other healthcare companies in Oregon. We are not a€big boxa€ health care, but rather a company of small groups and clinics, of nimble micro-cultures that can quickly adapt to industry changes, as well as patient needs. We have been serving communities across the beautiful and adventurous state of Oregon for over 50 years! And we are pioneers and thought leaders in the industry. Our commitment to innovative and operational excellence has allowed us to create healthcare solutions that are both cost-efficient and cutting edge. We are excited to share with you a short video that shows why the Praxis Health family is so special. Please click here: httpsyoutu. be\/MrNWtn42prY. Come see how healthcare is done right! General Physical Requirements: Physical Demands: While performing the duties of this Job, the employee is regularly required to stand. Walk. Use hands to finger, handle, or feel. Reach with hands and arms and talk or hear. The employee is occasionally required to sit and stoop, kneel, crouch. The employee must regularly lift and \/or move up to 10 pounds, frequently lift and\/or move up to 25 pounds and occasionally lift and\/or move up to 50 pounds. Work Environment: Scribes work in a fast-paced clinic. Physical requirements include but are not limited to continuous standing during shift, repeated sitting, listening, fluorescent lighting, repetitive typing and key entry work, computer work, and other normal and typical hospital\/clinic conditions. Ability to push and maneuver equipment. The position may require some lifting up to 20 pounds. Scribes will interact with patients, families, ancillary staff, nurses, physician assistants, physicians, and others. This is a full-time or part-time position, as determined at the beginning of employment. Employees are expected to work as scheduled. Equipment\/Software\/Systems Used: Hospital-specific dictation and charting software, Copiers, fax machines, computers.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155c27ed198905e9e6165f7::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Praxis Health\", \"position\": \"Medical Transcriptionist (Scribe), Cascade Gastroenterology\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Job Description: <p style=\\\"margin:0px\\\"><strong>Cascade Gastroenterology<\/strong>, part of Praxis Health, is searching for a <strong>Medical Transcriptionist\/ Scribe<\/strong> with exceptional data entry skills, knowledge of medical terminology and a friendly demeanor. <\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">In this role, you will accurately document the events and decision-making in a manner that results in appropriate medical charting, correct submission of orders for tests and medications, etc., to facilitate physician-patient encounters so that physicians can spend more focused time with patients. Duties will also include fulfilling patient care and medical scribe responsibilities as assigned that may include checking schedules and organizing patient flow; accompanying patients to exam\/procedure room; assisting patients as needed with walking transfers, dressing, collecting specimens, preparing for exam, etc.; collecting patient history; performing screening per provider guidelines; assisting providers\/nurses with various procedures; charting; relaying instructions to patients\/families; answering calls, and providing pertinent information.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>Schedule: <\/strong>M-F, 8am-5pm<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>Benefits<\/strong><\/p> <p style=\\\"margin:0px\\\">We offer a competitive wage and benefits package, and on top of this, you will work with a talented group of providers, professionals and co-workers who are dedicated to the highest standards of quality care. The family of providers within the Praxis Health values those we provide for and we value our employees.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0in 0in 0pt\\\"><strong>Essential Job Functions<\/strong><\/p> <ul> <li>Accurate, timely charting of patient encounters, including but not limited to patient history, physical exams, diagnostic findings, lab and test results, consultations with other providers, treatment course, diagnoses, discharge instructions, and prescriptions. <\/li> <li>Learn and appropriately apply basic medical terminologies and techniques taught and used on the job.<\/li> <li>Observe and to draft a narrative account of events accurately and cogently, in grammatically-correct English.<\/li> <li>Professional, non-intrusive interaction with patients (the scribe does not directly assist with patient care), physicians, hospital staff and other co-workers. <\/li> <li>Compliance with clinic policies, including those relating to confidentiality of patient information. <\/li> <li>Other duties as assigned, including but not limited to training other Scribes and staff.<\/li> <\/ul> <p style=\\\"margin:0px\\\">Candidate must comply with all state, local and federal rules, guidelines and requirements with respect to safety and health. This includes, but is not limited to any mandates with respect to the COVID-19 virus, such as PPE, testing, or vaccination rules, absent a legally recognized need for accommodation. Such accommodation requests should be promptly submitted to HR and will be reviewed and approved based on the circumstances presented.<\/p>Minimum Qualifications: <p style=\\\"margin:0px\\\"><strong>Minimum Qualifications<\/strong><\/p> <ul> <li style=\\\"margin-left:0.25in\\\">High School diploma or general equivalency diploma (GED),<\/li> <li style=\\\"margin-left:0.25in\\\">Medical Assisting diploma from an accredited vocational institution, a community college program in medical assisting preferred.<\/li> <li style=\\\"margin-left:0.25in\\\">Minimum one year of recent experience working in a medical facility as a medical assistant and or scribe preferred.<\/li> <li style=\\\"margin-left:0.25in\\\">Current CPR certification<\/li> <\/ul>About Us: <p style=\\\"margin:0px\\\">Praxis Health is a family of medical groups providing high quality healthcare throughout the state of Oregon. Our community-based clinics are the DNA of our business, providing better medicine, advocacy for our patients, and a satisfying and collaborative culture for our providers and staff.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">The Praxis family approach is dynamically different than other healthcare companies in Oregon. We are not \\u00e2\\u20ac\\u0153big box\\u00e2\\u20ac health care, but rather a company of small groups and clinics, of nimble micro-cultures that can quickly adapt to industry changes, as well as patient needs.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">We have been serving communities across the beautiful and adventurous state of Oregon for over 50 years! And we are pioneers and thought leaders in the industry. Our commitment to innovative and operational excellence has allowed us to create healthcare solutions that are both cost-efficient and cutting edge.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">We are excited to share with you a short video that shows why the Praxis Health family is so special. Please click here: <a href=\\\"https:\/\/youtu.be\/MrNWtn42prY\\\" rel=\\\"noopener nofollow noopener noreferrer\\\" target=\\\"_blank\\\">https:\/\/youtu.be\/MrNWtn42prY<\/a><\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">Come see how healthcare is done right!<\/p>General Physical Requirements: <p style=\\\"margin:0px\\\"><strong>Physical Demands:<\/strong><\/p> <p style=\\\"margin:0in 0in 0pt\\\"> &nbsp;<\/p> <p style=\\\"margin:0in 0in 0pt\\\">While performing the duties of this Job, the employee is regularly required to stand; walk; use hands to finger, handle, or feel; reach with hands and arms and talk or hear. The employee is occasionally required to sit and stoop, kneel, crouch. The employee must regularly lift and \/or move up to 10 pounds, frequently lift and\/or move up to 25 pounds and occasionally lift and\/or move up to 50 pounds. <\/p> <p style=\\\"margin:0in 0in 0pt\\\"> &nbsp;<\/p> <p style=\\\"margin:0in 0in 0pt\\\"><strong>Work Environment:<\/strong><\/p> <p style=\\\"margin:0in 0in 0pt\\\"> &nbsp;<\/p> <p style=\\\"margin:0in 0in 0pt\\\">Scribes work in a fast-paced clinic. Physical requirements include but are not limited to continuous standing during shift, repeated sitting, listening, fluorescent lighting, repetitive typing and key entry work, computer work, and other normal and typical hospital\/clinic conditions. Ability to push and maneuver equipment. The position may require some lifting up to 20 pounds. Scribes will interact with patients, families, ancillary staff, nurses, physician assistants, physicians, and others. This is a full-time or part-time position, as determined at the beginning of employment. Employees are expected to work as scheduled.<\/p> <p style=\\\"margin:0in 0in 0pt\\\"> &nbsp;<\/p> <p style=\\\"margin:0in 0in 0pt\\\">Equipment\/Software\/Systems Used: Hospital-specific dictation and charting software, Copiers, fax machines, computers.<\/p>Equal Opportunity Statement: <p style=\\\"margin:0px\\\"><strong>EOE Disabled\/Veteran<\/strong><\/p> <p style=\\\"margin:0px\\\">Praxis Health is an Equal Opportunity Employer and provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.<\/p> <\/div>\"}"
}