{
    "id":"Kaggle::techmap::6146148b31be1976c077a43f::careerbuilder_gr::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" SG Digital leads the global gaming market, providing innovative software that powers the worlds most successful operators. We pride ourselves on product innovation and technical excellence and are constantly adding new applications and new functionality to our product suite, used by billions of end users. And, while many other companies have been downsizing, we continue to see growth across our business. Want to be part of our story? The primary responsibility of the role is to lead, coach, train and help a number of Scrum Teams in Scrum adoption and Agile mindset. The ADL is the agile process advocate and mentor for the teams and their members. Assuming scrum adoption, she\/he is responsible for promoting and supporting Scrum framework by helping everyone within a team understand scrum theory, practices, rules, and values as defined in scrum guide and implemented by Open. Sports organization. The ADL is a servant-leader for the team helping external parties understand the way they should interact with the team and helping the team in removing impediments to the normal flow of work. The ADL also provides feedback and reporting for the teams status and work progress back to the organization. ADLs also collaborate as members of the Agile Delivery Department so as to identify patterns in impediments, resolve issues and formulate improvement steps and best practices in a unified and common approach. As members of the Agile Delivery Department they contribute in creating, rolling out and facilitating scaling process, activities, and ceremonies. Assuming scrum adoption, the ADL is acting as a full-time scrum master. The candidate must have: University or College Degree in Computer Science or relevant field. At least 3 years of experience as a Scrum Master, Project Manager in an agile software. Development environment or a similar role. Good leadership skills. Able to motivate, support and drive change at a team level. Excellent communication and presentation skills, both verbal and written. Ability to work in a fast-paced environment, embracing the change and driving improvement. Working effectively without comfort zone boundaries. Good understanding of Software Development Lifecycle and Software Development Processes. Qualified scrum master from a recognized certification body would be an asset. Working knowledge of JIRA or similar tools. Prior experience in software engineering is preferred. Good understanding of risks, issues, and the triple constraint. Why would you enjoy working with us at SG Digital?",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6146148b31be1976c077a43f::careerbuilder_gr\", \"source\": \"careerbuilder_gr\", \"country\": \"GR\", \"company\": \"SG Digital\", \"position\": \"Agile Delivery Lead \/ Scrum Master\", \"notes\": \"\", \"original\": \"<strong>SG Digital <\/strong>leads the global gaming market, providing innovative software that powers the world\\u2019s most successful operators.<br \/>\\r<br \/>\\rWe pride ourselves on product innovation and technical excellence and are constantly adding new applications and new functionality to our product suite, used by billions of end users. And, while many other companies have been downsizing, we continue to see growth across our business.<br \/>\\r<br \/>\\r<strong>Want to be part of our story?<\/strong><br \/>\\r<br \/>\\r<p style=\\\"\\\">The primary responsibility of the role is to lead, coach, train and help a number of Scrum Teams in Scrum adoption and Agile mindset. The <strong>ADL<\/strong> is the agile process advocate and mentor for the teams and their members. Assuming scrum adoption, she\/he is responsible for promoting and supporting Scrum framework by helping everyone within a team understand scrum theory, practices, rules, and values as defined in scrum guide and implemented by <strong>OpenSports <\/strong>organization.<\/p>\\r<p style=\\\"\\\">The <strong>ADL<\/strong> is a servant-leader for the team helping external parties understand the way they should interact with the team and helping the team in removing impediments to the normal flow of work. The ADL also provides feedback and reporting for the team\\u2019s status and work progress back to the organization.<\/p>\\r<p style=\\\"\\\"><strong>ADLs <\/strong>also collaborate as members of the Agile Delivery Department so as to identify patterns in impediments, resolve issues and formulate improvement steps and best practices in a unified and common approach. As members of the Agile Delivery Department they contribute in creating, rolling out and facilitating scaling process, activities, and ceremonies.<\/p>\\r<p  style=\\\"box-sizing: border-box; font-size: 14px; line-height: 1.5; padding-bottom: 16px; color: rgb(70, 64, 72); overflow-wrap: break-word; font-family: &quot;Open Sans&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, Oxygen, Ubuntu, Cantarell, &quot;Helvetica Neue&quot;, sans-serif; background-color: rgb(255, 255, 255);\\\">Assuming scrum adoption, the ADL is acting as a full-time scrum master.<\/p>\\r<p><br \/><\/p>\\r<ul>\\r<\/ul><div>\\r<p><strong>The candidate must have:<br \/>\\r<br \/>\\r<\/strong><\/p>\\r<ul>\\r    <li>University or College Degree in Computer Science or relevant field;<\/li>\\r    <li>At least 3 years of experience as a Scrum Master, Project Manager in an agile software; development environment or a similar role<\/li>\\r    <li>Good leadership skills. Able to motivate, support and drive change at a team level;<\/li>\\r    <li>Excellent communication and presentation skills, both verbal and written;<\/li>\\r    <li>Ability to work in a fast-paced environment, embracing the change and driving improvement. Working effectively without comfort zone boundaries;<\/li>\\r    <li>Good understanding of Software Development Lifecycle and Software Development Processes;<\/li>\\r    <li>Qualified scrum master from a recognized certification body would be an asset;<\/li>\\r    <li>Working knowledge of JIRA or similar tools;<\/li>\\r    <li>Prior experience in software engineering is preferred;<\/li>\\r    <li>Good understanding of risks, issues, and the triple constraint.<\/li>\\r<\/ul>\\r<div><br \/><\/div>\\r<div><\/div>\\r<\/div>\\r<div>\\r<p><strong>Why would you enjoy working with us at SG Digital?<\/strong><\/p>\\r<ul>\\r    <li>\\r    <p>Competitive benefits, an open and supportive environment as well as a modern and exciting workplace<\/p>\\r    <\/li>\\r    <li>\\r    <p>The opportunity to interact with global teams on a regular basis and the possibility to switch teams and projects as you and our business continues to develop and grow<\/p>\\r    <\/li>\\r    <li>\\r    <p>Tangible and genuine development - at OpenBet\/SG Digital, you can take your career where you want it to go!<\/p>\\r    <\/li>\\r    <li>\\r    <p>Exposure to real work, business-critical projects and the chance to develop some of the world\\u2019s leading e-commerce sportsbooks whilst working on exciting client projects and interact with lots of code!<\/p>\\r    <\/li>\\r<\/ul>\\r<div><br \/><\/div>\\r<p>And if that\\u2019s not enough;\\u00a0you will get to enjoy\\u00a0flexible\\u00a0working\\u00a0whilst we provide you with the\\u00a0guidance\\u00a0and\\u00a0development\\u00a0skills\\u00a0you need to progress quickly and\\u00a0enhance your career.<\/p>\\r<\/div>\"}"
}