{
    "id":"Kaggle::techmap::613a96bc1fd110014763808b::aarp_us::0",
    "label_age":true,
    "analysis_age":"The job posting's emphasis on adventure, physical activity, and competitive spirit may implicitly favour younger\/male candidates. Terms like \"new adventure every day,\" \"EPIC events,\" and the physical requirement of regularly lifting 50 lbs may suggest a preference for younger, more physically active individuals.",
    "label_disability":true,
    "analysis_disability":"\"regularly lifting 50 lbs\" doesn't clarify if this is aided\/unaided thereby discouraging many who may be capable.",
    "label_masculine":true,
    "analysis_masculine":"The job posting's emphasis on adventure, physical activity, and competitive spirit may implicitly favour younger\/male candidates. Terms like \"new adventure every day,\" \"EPIC events,\" and the physical requirement of regularly lifting 50 lbs may suggest a preference for younger, more physically active individuals.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Are you one of the 60% of people who dread going to work every day? At 1-800-GOT-JUNK? we get it. You want your work to make an impact. You want a path for growth You want to go on adventures. You want to be able to support you and your family (and then some). But most of all, you want to actually enjoy going to work each day What does your dream job really look like? Does it involve a new adventure everyday, and finding treasures that you can claim for yourself? How about improving the lives of the people you meet, and working with your best friends? How about learning to run your own business, or EPIC events like paintballing, go. Karting, or even a deep sea fishing adventure with your team? If you answered yes then apply todayDetails: Earn $15-20\/hr all-in with tips and bonuses and Weekly Pay. Our top employees made over $21\/hr last month. Medical, Vision, and Dental available after 90 days. Full-time, Part-time. Hiring Immediately Sundays and Holidays off. Keep some of the awesome treasures you find Here's a clip of what we do Requirements: Comfortable regularly lifting 50 lbs. Must have valid drivers license and 3 years of clean driving experience You must want more out of life than a desk job. Have a Competitive Spirit Be a team player1-800-GOT-JUNK? Is proud to be a drug free workplace. Applicants and employees may be required to submit to drug testing before and after being hired. Truck Team Member. General Labor & Customer ServicePart-Time or Full-TimeEarn $15-20\/hour (all in with base, bonuses & tips).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613a96bc1fd110014763808b::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"1 800 GOT JUNK?\", \"position\": \"General Labor\", \"notes\": \"\", \"original\": \"Are you one of the 60% of people who dread going to work every day? At 1-800-GOT-JUNK? we get it. You want your work to make an impact. You want a path for growth You want to go on adventures. You want to be able to support you and your family (and then some). But most of all, you want to actually enjoy going to work each day What does your dream job really look like? Does it involve a new adventure everyday, and finding treasures that you can claim for yourself? How about improving the lives of the people you meet, and working with your best friends? How about learning to run your own business, or EPIC events like paintballing, goKarting, or even a deep sea fishing adventure with your team?If you answered yes then apply todayDetails: Earn $15-20\/hr all-in with tips and bonuses and Weekly PayOur top employees made over $21\/hr last monthMedical, Vision, and Dental available after 90 daysFull-time, Part-time. Hiring Immediately Sundays and Holidays off.Keep some of the awesome treasures you find Here's a clip of what we do Requirements: Comfortable regularly lifting 50 lbs.Must have valid drivers license and 3 years of clean driving experience You must want more out of life than a desk jobHave a Competitive Spirit Be a team player1-800-GOT-JUNK? Is proud to be a drug free workplace. Applicants and employees may be required to submit to drug testing before and after being hired.Truck Team Member - General Labor &amp; Customer ServicePart-Time or Full-TimeEarn $15-20\/hour (all in with base, bonuses &amp; tips).<br \/>\"}"
}