{
    "id":"Kaggle::techmap::615e790f177c9668cd9ef16b::linkedin_kr::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The terms \"self-starters\" \"drive to achieve\" and \"capacity to assume increasing responsibility\" subtly favour masculine-coded traits such as independence and assertiveness and may deter female applicants.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"Requiring \"native or near-native Korean language proficiency\" can disadvantage those from different racial backgrounds, potentially excluding candidates with adequate levels of proficiency.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2007 Land Acquisition & Real Estate Manager. Location: Seoul or Jeolla-do, Korea. At Ecoplexus (www. ecoplexus. com), we are seeking individuals who have a passion to be part of the renewable energy industry and the change it is bringing, are self starters, creative thinkers, possess the drive to achieve, and have the capacity to assume increasing responsibility in a dynamic growth environment. We are looking for talented self-starters with imagination, creativity and vision. We are a rapidly-growing developer of large solar, wind and energy storage projects serving corporate and utility energy purchasers. We design, build, finance, own and operate projects across the US, Mexico and Asia. Headquartered in San Francisco, Ecoplexus has grown at an annual rate of over 50% per year since its founding in 2009. NOTE: Native or near-native Korean language proficiency is required, so non-Korean speakers need not apply for this role. Responsibilities: Manage site assessment, site control, and acquisition efforts for land and potentially other facilities to host renewable energy system installation. Specific duties include prospecting, site identification and assessment, information gathering with local government, viability analysis, outreach and property owner relationship building and relationship management. Develop targeting strategy to secure land for renewable energy projects in collaboration with management, internal staff, and external consultants. Collaborate with permitting, technical, legal, and financial teams to support the project development process. Manage and maintain data rooms, project summary and tracking tools, and project files. Manage basic local satellite office during land lease and purchase process. Compile and maintain update reports as required by management. Other development and support activities as may be required by the Company. Experience: Minimum BA\/BS degree required. Knowledge of the Korean renewable energy market preferred. years experience in real estate industry, with 5. years working in rural areas. Strong track record of working cooperatively with provincial and local governments. Strong background working with internal and external stakeholders. Multinational company experience a plus. Qualifications:. Ability to work independently and creatively solve problems . High level of professionalism with attention to detail. Excellent oral and written communication and presentation skills. Superior time management and interpersonal skills. Expert using MS Word, Excel, PowerPoint. Driver's License Required. Native or near-native proficiency in Korean required. English: Intermediate or above. Travel: frequent (primarily domestic). Completed courses in renewable energy will be considered positively. Reporting line: Director of Development.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615e790f177c9668cd9ef16b::linkedin_kr\", \"source\": \"linkedin_kr\", \"country\": \"KR\", \"company\": \"Ecoplexus Inc.\", \"position\": \"Land Acquisition & Real Estate Manager, Korea\", \"notes\": \"\", \"original\": \"<p><strong>2007 Land Acquisition &amp; Real Estate Manager<\/strong><\/p><p><strong>Location: Seoul or Jeolla-do, Korea<\/strong><\/p><p>\\u3000 <\/p><p>At Ecoplexus (www.ecoplexus.com), we are seeking individuals who have a passion to be part of the renewable energy industry and the change it is bringing, are self starters, creative thinkers, possess the drive to achieve, and have the capacity to assume increasing responsibility in a dynamic growth environment. We are looking for talented self-starters with imagination, creativity and vision. We are a rapidly-growing developer of large solar, wind and energy storage projects serving corporate and utility energy purchasers. We design, build, finance, own and operate projects across the US, Mexico and Asia. Headquartered in San Francisco, Ecoplexus has grown at an annual rate of over 50% per year since its founding in 2009.&nbsp;<\/p><p><br><\/p><p><strong>NOTE: Native or near-native Korean language proficiency is required, so non-Korean speakers need not apply for this role. <\/strong><\/p><p><br><\/p><p><br><\/p><p><strong>Responsibilities: <\/strong><\/p><p>*Manage site assessment, site control, and acquisition efforts for land and potentially other facilities to host renewable energy system installation. Specific duties include prospecting, site identification and assessment, information gathering with local government, viability analysis, outreach and property owner relationship building and relationship management.<\/p><p>*Develop targeting strategy to secure land for renewable energy projects in collaboration with management, internal staff, and external consultants.<\/p><p>*Collaborate with permitting, technical, legal, and financial teams to support the project development process. <\/p><p>*Manage and maintain data rooms, project summary and tracking tools, and project files.<\/p><p>*Manage basic local satellite office during land lease and purchase process. <\/p><p>*Compile and maintain update reports as required by management. <\/p><p>*Other development and support activities as may be required by the Company. <\/p><p><br><\/p><p><strong>Experience: <\/strong><\/p><p>*Minimum BA\/BS degree required <\/p><p>*Knowledge of the Korean renewable energy market preferred<\/p><p>*8+ years experience in real estate industry, with 5+ years working in rural areas<\/p><p>*Strong track record of working cooperatively with provincial and local governments<\/p><p>*Strong background working with internal and external stakeholders<\/p><p>*Multinational company experience a plus <\/p><p><br><\/p><p><strong>Qualifications: &nbsp;<\/strong><\/p><p><br><\/p><p>*Ability to work independently and creatively solve problems \\u3000<\/p><p>*High level of professionalism with attention to detail<\/p><p>*Excellent oral and written communication and presentation skills <\/p><p>*Superior time management and interpersonal skills<\/p><p>*Expert using MS Word, Excel, PowerPoint <\/p><p>*Driver's License Required<\/p><p>*Native or near-native proficiency in Korean required.<\/p><p>*English: Intermediate or above<\/p><p>*Travel: frequent (primarily domestic)<\/p><p>*Completed courses in renewable energy will be considered positively<\/p><p><br><\/p><p>Reporting line: Director of Development<\/p><p><br><\/p><p>Please send MS Word resume and cover letter in English AND Korean to: rpark@ecoplexus.com<\/p><p><br><\/p><p>Ecoplexus Inc. is an Equal Opportunity Employer (EOE). Qualified applicants are considered for employment without regard to age, race, color, religion, sex, national origin, sexual orientation, disability, or veteran status.<\/p><p><br><\/p><p>Check us out at:&nbsp;http:\/\/www.ecoplexus.com\/about-us\/Re<\/p><p><\/p>\"}"
}