{
    "id":"Kaggle::techmap::614cbec8f25d0607057a7bd1::britishjobs_uk::6",
    "label_age":true,
    "analysis_age":"Describing prior experience as \"idolised\" suggests a strong preference that may discourage newcomers lacking direct experience. A better alternative would be \"valued,\" which acknowledges the benefit of experience without excluding those looking to enter the field.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The emphasis on traits like \"caring\" may implicitly favour candidates fitting traditional, nurturing stereotypes, potentially leading to gender bias. This could deter individuals who do not see themselves in these roles but are equally capable. A more inclusive phrasing could be \"effective communication and emotional resilience,\" which broadens the appeal to a diverse set of applicants.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Describing prior experience as \"idolised\" suggests a strong preference that may discourage career switchers lacking direct experience. A better alternative would be \"valued,\" which acknowledges the benefit of experience without excluding those looking to enter the field.",
    "verified":true,
    "synthetic":false,
    "text":"Do you enjoy caring for others? If so then a support worker role is perfect for you! We are currently recruiting in the Abertillery location for Full time support workers for £9. 81 per hour. Typical duties include helping with household tasks, personal care, medication management, mobility and overall support. Benefits. The role is ideal for people who are looking for variety in a job as you will be working with a wide range of individuals. The career prospects are great, with plenty of opportunities to train and develop your skills, move into more senior roles, and specialise in different areas. Requirements. The key skills required to be a support worker include literacy, numeracy, communication, time management skills. While preferred personality traits include being caring, calm and composed at all times. Being a support worker doesn't require specific qualifications however prior experience is idolised. With regards to the next step in the application process, the successful candidates will be contacted and informed of further steps. If this position interests you then apply now. Randstad Care acts as an employment business when supplying temporary staff and as an employment agency when introducing candidates for permanent employment with a client. Randstad Care is an equal opportunities employer and decisions are made on merits alone. Did you know that Randstad Care have been awarded a place on the National Clinical Staffing Framework for the NHS?",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614cbec8f25d0607057a7bd1::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Randstad Care\", \"position\": \"Support Worker\", \"notes\": \"\", \"original\": \"Do you enjoy caring for others?<br><br>If so then a support worker role is perfect for you!<br><br>We are currently recruiting in the Abertillery location for Full time support workers for &pound;9.81 per hour. Typical duties include helping with household tasks, personal care, medication management, mobility and overall support.<br><br>Benefits<br><br>The role is ideal for people who are looking for variety in a job as you will be working with a wide range of individuals.<br>The career prospects are great, with plenty of opportunities to train and develop your skills, move into more senior roles, and specialise in different areas.Requirements<br><br>The key skills required to be a support worker include literacy, numeracy, communication, time management skills; while preferred personality traits include being caring, calm and composed at all times.<br>Being a support worker doesn&#39;t require specific qualifications however prior experience is idolised. <br><br>With regards to the next step in the application process, the successful candidates will be contacted and informed of further steps.<br><br>If this position interests you then apply now.<br><br>Randstad Care acts as an employment business when supplying temporary staff and as an employment agency when introducing candidates for permanent employment with a client. Randstad Care is an equal opportunities employer and decisions are made on merits alone.<br><br>Did you know that Randstad Care have been awarded a place on the National Clinical Staffing Framework for the NHS? This means we will be able to bring you more opportunities within nursing &amp; midwifery and clinical staffing.<br><br>\"}"
}