{
    "id":"Kaggle::techmap::614dd84f9862192c71d1406e::reed_uk::2",
    "label_age":true,
    "analysis_age":"\"Psychology graduate\" suggests the company is looking for someone recently graduated.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"\"Bubbly\", \"show empathy\", \"approachable\", \"alongside a caring department\"  - these are stereotypically feminine traits.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Psychology Graduate - SEN Teaching Assistant | Croydon. Psychology Graduate - SEN Teaching Assistant | Croydon. * SEN Teaching Assistant Post. Fantastic School! Outstanding Spcial School in Croydon - SEN Teaching Assistant Post. * Immediate\/September start. Long term full-time SEN Teaching Assistant Post. * SEN Teaching Assistant Post Supporting ASD, Down Syndrome and Pupils with Mental Helth disorders- SEN Teaching Assistant. The school want to meet a reliable, Bubbly SEN Teaching Assistant who has previous experience working with SEN\/ young students either in a volunteer or paid role or even personal experience. You must show the ability to work comfortably with special needs and show respect to both staff, and pupils. The school needs a new graduate who has the determination to show Empaty in all of their pupils, no matter how hard that may be. You should have an approachable character that will allow you to form lasting relationships with both pupils and teachers in order to be a success in the role of SEN Teaching Assistant. In this SEN Teaching Assistant position, you will be working in a 1:1 and within small groups to support the academic and social progression and development of a pupil who has been identified as on the Autism Spectrum. You will also assist across the full class. Part of your role will include working alongside a more caring department and supporting a Special Educational Needs Coordinator, Drama therspist, Occupational therpist and Psychologust! Click 'Apply Now' and Apply to Emma @ Academics today! Psychology Graduate - SEN Teaching Assistant | Croydon.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614dd84f9862192c71d1406e::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Academics\", \"position\": \"Psychology Graduate - SEN Teaching Assistant Croydon\", \"notes\": \"\", \"original\": \"<p>Psychology Graduate - SEN Teaching Assistant | Croydon<\/p> <p>Psychology Graduate - SEN Teaching Assistant | Croydon<\/p> <p>* SEN Teaching Assistant Post - Fantastic School!<br>* Outstanding Spcial School in Croydon - SEN Teaching Assistant Post<br>* Immediate\/September start - Long term full-time SEN Teaching Assistant Post <br>* SEN Teaching Assistant Post Supporting ASD, Down Syndrome and Pupils with Mental Helth disorders- SEN Teaching Assistant<\/p> <p>The school want to meet a reliable, Bubbly SEN Teaching Assistant who has previous experience working with SEN\/ young students either in a volunteer or paid role or even personal experience. You must show the ability to work comfortably with special needs and show respect to both staff, and pupils.<\/p> <p>The school needs a new graduate who has the determination to show Empaty in all of their pupils, no matter how hard that may be. You should have an approachable character that will allow you to form lasting relationships with both pupils and teachers in order to be a success in the role of SEN Teaching Assistant.<\/p> <p>In this SEN Teaching Assistant position, you will be working in a 1:1 and within small groups to support the academic and social progression and development of a pupil who has been identified as on the Autism Spectrum. You will also assist across the full class.<\/p> <p>Part of your role will include working alongside a more caring department and supporting a Special Educational Needs Coordinator, Drama therspist, Occupational therpist and Psychologust!<\/p> <p>Click 'Apply Now' and Apply to Emma @ Academics today!<\/p> <p>Psychology Graduate - SEN Teaching Assistant | Croydon<\/p>\"}"
}