{
    "id":"Kaggle::techmap::613278281e0a6224948364a2::reed_uk::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Support Worker - Female. Weymouth Part-time. 20 hours Full driving licence is essential for this role. We are looking for people to join our team to work with a young lady we support in her own flat, the young lady is in her 30s, she has cerebral palsy and epilepsy, and is unable to communicate verbally. She enjoys a variety of activities. swimming, carriage riding, sailing, going out for coffee, and watching films. The young lady has 2:1 staffing throughout the day with a waking night member of staff. This role does require full personal care and manual handling. Shifts are 7\/7. 30am - 2\/2. 30pm, 2\/2. 30pm - 9\/9. 30pm, 9\/9. 30pm - 8\/8. 30 Waking Night. If you think this is the right role for you, come and make a difference to people’s lives, every working day! \"Gender is considered to be a genuine occupational requirement in accordance with paragraph 1 of Schedule 9 of the Equality Act 2010. \". If you have any questions and would like to discuss the role in more detail, please contact Leon Larkings on or email your CV to. Dimensions is proud to be one of very few social care organisations that are members of the Great Places To Work programme 2019, 2020, 2021. Your rewards. A full list of rewards can be found in the job description attached. Apply now. If being a Support Worker sounds like you, we’d love to hear from you. The attached job description, person specification and additional information will provide you with lots of information on the role and Dimensions. To apply it couldn’t be simpler. An enhanced DBS disclosure will be required for this role, the cost of which will be incurred by Dimensions. We welcome applications from everyone and value diversity in our workforce. As Disability Confident Leaders, we guarantee to interview all disabled applicants who meet the minimum criteria for the vacancy. Dimensions has been awarded this symbol by Jobcentre Plus to recognise our commitment towards the employment, retention, training and career development of disabled employees. We now have British Sign Language (BSL) translated videos for all of our recruitment communications.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613278281e0a6224948364a2::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Dimensions UK Ltd\", \"position\": \"Support Worker - Female\", \"notes\": \"\", \"original\": \"<p>Support Worker - FemaleWeymouth&nbsp;Part-time - 20 hours&nbsp;Full driving licence is essential for this role&nbsp;<\/p> <p>We are looking for people to join our team to work with a&nbsp;young lady we support in her own flat, the young lady is in her 30s, she has cerebral palsy and epilepsy, and is unable to communicate verbally. She enjoys a variety of activities - swimming, carriage riding, sailing, going out for coffee, and watching films.&nbsp;<\/p> <p>The young lady has 2:1 staffing throughout the day with a waking night member of staff. This role does require full personal care and manual handling. Shifts are 7\/7.30am - 2\/2.30pm, 2\/2.30pm - 9\/9.30pm, 9\/9.30pm - 8\/8.30 Waking Night.<\/p> <p>If you think this is the right role for you, come and make a difference to people\\u2019s lives, every working day!<\/p> <p>\\\"Gender is considered to be a genuine occupational requirement in accordance with paragraph 1 of Schedule 9 of the Equality Act 2010.\\\"&nbsp;<\/p> <p>If you have any questions and would like to discuss the role in more detail, please contact Leon Larkings on or email your CV to .<\/p> <p>Dimensions is proud to be one of very few social care organisations that are members of the Great Places To Work programme 2019,2020,2021.<\/p> <p>Your rewards<\/p> <p>A full list of rewards can be found in the job description attached&nbsp;<\/p> <p>Apply now<\/p> <p>If being a Support Worker sounds like you, we\\u2019d love to hear from you. The attached job description, person specification and additional information will provide you with lots of information on the role and Dimensions. To apply it couldn\\u2019t be simpler - just click on the button below to complete the application process.<\/p> \\n<ul> \\n <li>An enhanced DBS disclosure will be required for this role, the cost of which will be incurred by Dimensions.<\/li>\\n <li>We welcome applications from everyone and value diversity in our workforce<\/li>\\n <li>As Disability Confident Leaders , we guarantee to interview all disabled applicants who meet the minimum criteria for the vacancy - Dimensions has been awarded this symbol by Jobcentre Plus to recognise our commitment towards the employment, retention, training and career development of disabled employees<\/li>\\n <li>We now have British Sign Language (BSL) translated videos for all of our recruitment communications. <\/li>\\n<\/ul>\"}"
}