{
    "id":"Kaggle::techmap::614334177f1138237d31fda7::linkedin_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"extend unwavering Christian compassion\" could discourage those from other faiths and no faiths.",
    "verified":true,
    "synthetic":false,
    "text":" Business relationships are conducted in the best interest of Tabitha, free of gifts, cash inducements, gratuities, favors, or other perceived improper inducements. Willingly takes on additional duties and\/or assignments, assisting with projects and responding to requests as assigned or as necessary. Tabithas. Core Values. As a member of the Tabitha team, I will. CARE. extend unwavering Christian compassion. CONNECT. build relationships rooted in love, because love matters. CUSTOMER CENTRIC. identify, clarify and anticipate needs to exceed expectations. COLLABORATE. create an atmosphere of teamwork. CULTIVATE. nurture an environment of innovation and growth. COURAGE. demonstrate confidence, boldness and determination. COMMIT. devote our time, talent and treasures. CELEBRATE. recognize and encourage all accomplishments big and small. COMMUNICATION Must be able to speak, read, write, and understand the English language as well as terminology and jargon specific to the job. Must have strong organizational and oral\/written communication skills. Understands written and verbal instructions. Sufficient fluency to be able to train TEAMembers, explain complex problems to vendors, hold a conversation, conduct or participate in meetings, compose professional e-mails or other written communication, complete documentation requirements of the job and interact with management, vendors, state officials, TEAMembers, peer coworkers, customers, volunteers and managers effectively. Ability to recognize and interpret non-verbal cues. Ability to respond calmly and clearly to emergencies and emotional situations. Able to communicate expectations with those he\/she supervises, including the ability to conduct performance appraisals and establish performance improvement plans. Facilitates departmental meetings as needed to keep employees informed of business and department changes. WORKSITE CONDITIONS Works indoors in a facility maintained by Tabitha that will typically be in good repair, clean, well ventilated and well lit. Work is performed in a standard office setting. Works under daily and hourly deadlines, requiring uninterrupted periods of intense activity. Frequent exposure to interruptions and changes in priorities. Works beyond normal scheduled hours and on weekends and holidays when assigned. Is subject to extended hours or callback during emergency conditions or based upon needs of the organization. PHYSICAL REQUIREMENTS Ability to gain access to the work area and then safely perform the duties of the job while utilizing standard and specialized equipment, including but not limited to the equipment described below. Ability to move about the work area. Ability to work at a computer for hours at a time. Frequent periods of intense activity, but rare need for physical strength or physical exertion.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614334177f1138237d31fda7::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Tabitha Health\", \"position\": \"Marketing Manager\", \"notes\": \"\", \"original\": \"<strong>TABITHA\\u2019S PURPOSE <\/strong>We empower people to live joyfully, age gratefully.<br><br><strong>Position Summary<br><br><\/strong>The Marketing Manager is responsible for overseeing plans and execution as well as customer, partner-facing and TEAMember focused internal and external communications. This TEAMember will contribute to the total effectiveness of the department, communicating openly, solving problems proactively, offering creative ideas and working as a positive, engaged TEAMember focused on furthering Tabitha\\u2019s purpose. This position is vitally important to Tabitha\\u2019s ability to meet the goal of providing optimum care to Tabitha\\u2019s Senior\/residents\/clients (hereinafter, \\u201cSeniors\/clients\\u201d). This TEAMember strives to uphold Tabitha\\u2019s LIVE2Care Culture and actively embraces Tabitha\\u2019s Core Values. As a result, the TEAMember supports Tabitha goals related to dignity, respect, independence, competence, autonomy, personal comfort, safety and security of Seniors\/clients. In addition, the employee contributes to the success of Tabitha through ongoing collaboration with coworkers, management, volunteers and others in the organization.<br><br><strong>Essential Functions<\/strong><ul><li>Brand Stewardship - Ensure both public and internal facing messaging emulates Tabitha\\u2019s brand style, voice and image.<\/li><ul><li>Maintain Brand Identify Guidelines book.<\/li><li>Develop content aligning with brand standards.<\/li><li>Ensure TEAMember\\u2019s work incorporating templates and presentations are within brand standards.<\/li><\/ul><li>Internal Client Account Management - Serve as marketing and communication point-person for assigned internal departments, service lines and living communities to support all messaging needs.<\/li><ul><li>Build and execute marketing and communication strategy.<\/li><li>Draft and implement communication plans centered on key initiatives and focusing on target audiences per each area.<\/li><li>Build digital, video, print content and collateral.<\/li><\/ul><li>Copywriting - drafting copy for all internal and external touchpoints<\/li><ul><li>Developing content<\/li><li>Fact-based and technical Health\/Senior Care information<\/li><li>Creative ad and collateral campaigns<\/li><li>Engaging digital and social media messaging<\/li><li>Weaving stories from data-mining<\/li><\/ul><li>Media &amp; Advertising Placement - Places client media through Marketing and Communications Manager via Tabitha\\u2019s paid advertising as determined by corporate marketing plan(s)<\/li><li>Assist with Social Media strategy, content and oversight.<\/li><li>Monthly Reporting - Will include but not be limited to reporting on the status of prioritized marketing and communication activities both historical and forward looking.<\/li><li>Event Support for events that required some before\/after standard office hours assistance with flow, set-up and tear-down.<\/li><li>General Support for the department across marketing, advertising responsibilities.<\/li><li>Performs other duties and special projects as determined in department.<\/li><li>Acts appropriately as a key member of team, informing appropriate parties of problems or circumstances which may impact Tabitha, and maintaining confidentiality regarding such issues. <\/li><li>Maintains a cooperative attitude with members of management at Tabitha in achieving common objectives. <\/li><li>Serves on appropriate boards and committees within the community. Works independently in identifying and resolving issues, concerns and problems. Acquires subject matter expertise in the functions and activities of the department.<\/li><li>Fosters and maintains an effective working relationship with coworkers, TEAMembers , managers, vendors and others who contribute to the success of Tabitha. Acts as a representative of Tabitha\\u2014being professional at all times. This TEAMember identifies and studies problems and needs, develops solutions, and implements solutions to assist in providing outstanding service to each TEAMember and department at Tabitha. Maintains courteous relationship with members of management, direct reports, peers, TEAMembers of other departments and volunteers, providing leadership, support and assistance as needed to ensure achievement of departmental and corporate goals. Volunteers to assist others and seeks opportunities to serve Tabitha. Ensures that all direct reports do so as well.<\/li><li>Prioritizes work load to ensure that all essential functions are addressed effectively, making appropriate adjustments throughout each shift and each work week to meet changing and\/or competing priorities when necessary. Utilizes strength and stamina to carry out all essential functions safely and effectively. <\/li><li>Uses good judgement, discretion and integrity to review, research and resolve problems or complaints in area of expertise. <\/li><li>Assures reports of all broken and malfunctioning equipment are made in a timely manner. <\/li><li>Follows disaster plans and uses strength and agility during participation in preparedness drills and actual emergencies. Maintains a safe work environment. Assures that all direct reports do so as well.<\/li><li>Complies with HIPAA regulations regarding privacy by insuring that Protected Health Information (PHI) is safeguarded at all times. In addition, maintains a high level of confidentiality regarding any matter pertaining to any Tabitha Seniors\/clients, as well as Tabitha TEAMembers and TEAMember records. Takes steps to ensure that all direct reports do so as well. <\/li><li>Considers all factors and takes appropriate action, making good decisions that contribute to the welfare of the Marketing &amp; Communication department, the success of Tabitha TEAMembers, and the achievement of Tabitha objectives. Make decision regarding matters of importance, including decisions regarding complex issues that have been elevated by direct reports.<\/li><li>Prepares for, participates in and\/or conducts meetings, both on a departmental level and on a company level. Participates in and\/or conducts educational in-services as well as formal and informal training sessions for TEAMembers. Ensures that all direct reports attend and participate in such meetings.<\/li><li>Completes required training and in-services promptly. Demonstrates understanding of the course content and implements training in daily activities. Takes steps to ensure that all direct reports do so as well.<\/li><li>Is a role model for staff by maintaining an exemplary record of attendance and punctuality as defined by Tabitha\\u2019s policy pertaining to attendance and punctuality. Records all time worked accurately and consistently using the timekeeping method provided by Tabitha. Ensures that all direct reports meet Tabitha standards in this area as well.<\/li><li>Consistently uses strength, agility and good body mechanics when performing essential functions, develops, implement and follows appropriate safety and infection control policies and procedures of Tabitha and\/or community and regulatory agencies. Ensures that all direct reports do so as well.<\/li><li>Complies with Tabitha policies and procedures as published by Tabitha and which may be modified at Tabitha\\u2019s discretion. Contributes to quality assurance and performance improvement activities by identifying instances of non-compliance and taking appropriate action, including reporting violations of Tabitha policy or regulations as appropriate. Ensures that all direct reports do so as well.<\/li><li>Controls preventable TEAMember turnover related to supervisory responsibilities. <\/li><li>Follows Tabitha protocol for submission of completed documentation as it pertains to TEAMember time records, performance evaluation, performance improvement, attendance records, etc. with particular attention to accuracy and timeliness. <\/li><li>Carefully and consistently ensures that department protocol is followed regarding documentation pertaining to on-boarding, transfers and terminations. This includes completing TEAMember change forms promptly so that equipment can be issued, badges can be created, orientation can begin, and paychecks can be prepared. <\/li><li>Behaves as a leader, fostering staff satisfaction through effective and consistent leadership. Establishes good relationships with TEAMembers, listens to TEAMember concerns, takes appropriate action, communicates expectations, holds TEAMembers accountable, and manages consistently, identifying and removing barriers to TEAMember success. Contributes to the success of Tabitha TEAMembers by coaching, developing, encouraging, nurturing, mentoring, challenging, and setting an example for direct reports. This will include working with TEAMembers on correcting performance deficiencies, policy violations, or any other area of concern. <\/li><li>Responds appropriately to emergencies. Implements appropriate safety and disaster measures for the protection of Seniors\/clients, visitors and TEAMembers. Ensures that all direct reports do so as well.<\/li><li>Makes decisions regarding matters of importance. Acts with integrity and in the best interest of Tabitha. Business relationships are conducted in the best interest of Tabitha, free of gifts, cash inducements, gratuities, favors, or other perceived improper inducements.<\/li><li>Willingly takes on additional duties and\/or assignments, assisting with projects and responding to requests as assigned or as necessary.<br><\/li><\/ul><strong>Tabitha\\u2019s<br><br>Core Values<br><br>As a member of the Tabitha team, I will\\u2026<br><br><\/strong><strong>CARE<br><br><\/strong>\\u2026extend unwavering Christian compassion<br><br><strong>CONNECT<br><br><\/strong>\\u2026build relationships rooted in love, because love matters<br><br><strong>CUSTOMER CENTRIC<br><br><\/strong>\\u2026identify, clarify and anticipate needs to exceed expectations<br><br><strong>COLLABORATE<br><br><\/strong>\\u2026create an atmosphere of teamwork<br><br><strong>CULTIVATE<br><br><\/strong>\\u2026nurture an environment of innovation and growth<br><br><strong>COURAGE<br><br><\/strong>\\u2026demonstrate confidence, boldness and determination<br><br><strong>COMMIT<br><br><\/strong>\\u2026devote our time, talent and treasures<br><br><strong>CELEBRATE<br><br><\/strong>\\u2026recognize and encourage all accomplishments big and small<br><br><strong>COMMUNICATION<\/strong> Must be able to speak, read, write, and understand the English language as well as terminology and jargon specific to the job. Must have strong organizational and oral\/written communication skills. Understands written and verbal instructions. Sufficient fluency to be able to train TEAMembers, explain complex problems to vendors, hold a conversation, conduct or participate in meetings, compose professional e-mails or other written communication, complete documentation requirements of the job and interact with management, vendors, state officials, TEAMembers, peer coworkers, customers, volunteers and managers effectively. Ability to recognize and interpret non-verbal cues. Ability to respond calmly and clearly to emergencies and emotional situations. Able to communicate expectations with those he\/she supervises, including the ability to conduct performance appraisals and establish performance improvement plans. Facilitates departmental meetings as needed to keep employees informed of business and department changes.<br><br><strong>WORKSITE CONDITIONS<\/strong> Works indoors in a facility maintained by Tabitha that will typically be in good repair, clean, well ventilated and well lit. Work is performed in a standard office setting. Works under daily and hourly deadlines, requiring uninterrupted periods of intense activity. Frequent exposure to interruptions and changes in priorities. Works beyond normal scheduled hours and on weekends and holidays when assigned. Is subject to extended hours or callback during emergency conditions or based upon needs of the organization.<br><br><strong>PHYSICAL REQUIREMENTS<\/strong> Ability to gain access to the work area and then safely perform the duties of the job while utilizing standard and specialized equipment, including but not limited to the equipment described below. Ability to move about the work area. Ability to work at a computer for hours at a time. Frequent periods of intense activity, but rare need for physical strength or physical exertion. Must have the ability to spot errors or to sense when data output contains an error. Vision and hearing within normal limits (with or without correction). Must have unrestricted lift\/push\/pull ability and pass a 25 - pound physical exam demonstrating strength and agility prior to employment and at Tabitha\\u2019s discretion.<br><br><strong>EQUIPMENT USAGE<\/strong> Standard and specialized equipment including laptop, PC, tablet, photocopier, scanner, fax machine, elevator, projector, telephone, and television.<br><br><strong>AGE REQUIREMENT <\/strong>At least age 18.<br><br><strong>EDUCATION <\/strong>Bachelor of Arts degree in Marketing or Communications<br><br><strong>Experience<br><\/strong><ul><li>7-10 years of Marketing Communications Experience <\/li><li>Strong copywriting skills <\/li><li>Experience working with digital and social media platforms<\/li><li>Deep experience with Microsoft Office including Microsoft Word, PowerPoint and Outlook<\/li><li>Advanced copywriting and proofing skills, AP style knowledge<\/li><li>Ability to maximize relationships with team members and strategic external partnerships<\/li><li>Demonstrated understanding of best practices in marketing and advertising (both traditional and digital)<\/li><li>Keen attention to detail<\/li><li>Demonstrated cross group collaboration skills (across functional areas)<\/li><li>Ability to work through ambiguous situations<\/li><li>Strong interpersonal awareness <br><\/li><\/ul><strong>CREDENTIALS<\/strong> Valid Nebraska Driver\\u2019s license (unless otherwise allowed by law) and a good driving record required. Must possess auto insurance at or above Nebraska statutory requirements. Must meet Tabitha's vaccination requirements<br><br><strong>STATEMENT OF EQUAL EMPLOYMENT OPPORTUNITY AND AFFIRMATIVE ACTION<br><br><\/strong>Tabitha Health Care Services is an equal employment opportunity employer and does not discriminate in employment on the basis of race, religion, color, national origin, citizenship, creed, gender, sexual orientation, age, veteran status, mental or physical disability, genetic information, or any other characteristic protected by federal, state, or local law. This policy applies to all employment practices and decisions including recruitment, selection, hiring, training, transfer, promotion, compensation, benefits, and the termination of employment.<br><br>Furthermore, Tabitha Health Care Services will make reasonable accommodations for qualified individuals with known disabilities unless doing so would result in an undue hardship, safety, and\/or health risk. Please contact Tabitha Health Care Services Human Resources Department to request an accommodation.<br><br>As a government contractor, the organization has adopted written Affirmative Action Plans for women and minorities, protected veterans and individuals with disabilities. These plans will be revised on an annual basis. Tabitha Health Care Services is committed to making a good-faith effort toward achieving the objectives of the Plans. Any employee who would like to review the Plans may do so by scheduling an appointment with the Human Resources Department during normal business hours.\"}"
}