{
    "id":"Kaggle::techmap::61448b1700be8502b30696ef::linkedin_iq::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The job description uses predominantly female pronouns (\"She will be responsible...\") which suggests a preference for female candidates and may discourage male candidates from applying.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Monitoring and Evaluation and streamlining M&E tools, approaches, and reporting across all WPE program sites and implementing partners. She will be responsible for setting up and managing an efficient program monitoring system, oversee qualitative and quantitative data collection of program activities, support in the analysis of WPE program data, and ensure harmonized monitoring and reporting of program activities across all WPE program sites. To achieve this the WPE Senior Manager will be required to travel to all. IRC field sites in Iraq for at least 50% of the time. Major Responsibilities. Technical Quality and Implementation. The Senior Manager will ensure quality WPE program implementation and will ensure that IRC's response is meeting acute and emerging needs of the affected women and girls and is complementary to ongoing support through other humanitarian partners. Frequent contact with all WPE Managers and WPE Coordinator is required to support case management supervision and quality of case management service delivery. Provide technical support to WPE teams and quality oversight during implementation of the program including: case management services, psychosocial support, emergency GBV mobile teams, community-based GBV prevention and response, and data collection in line with GBV guiding principles and international standards. Contribute to continuous analysis of the achievements of each project and facilitate better understanding among staff about program progress through progress reporting. Document lessons learned for program review and planning, advocacy and information sharing. Ensure that monitoring and evaluation reports are made useful to the WPE staff and contribute to learning. Develop, implement, and review a data base that all WPE teams will use to track beneficiary information to use for donor reporting and proposal writing. Lead WPE teams in conducting rapid GBV needs assessments and in coordination with other GBV emergency response partners and produce a report of the main findings. Prepare monthly program updates in close collaboration with WPE senior staff to identify key achievements and challenges in program implementation. Support participatory appraisal, monitoring and evaluation in collaboration with the M&E unit. Undertake field monitoring visits to assess progress and identify technical quality and implementation issues, provide solutions and implement modifications and improvement plans as required. Lead the design, review, piloting, and implementation of all research and GBV Monitoring and Evaluation tools and systems, including GBVIMS\/Primero and PDA-based questionnaires.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61448b1700be8502b30696ef::linkedin_iq\", \"source\": \"linkedin_iq\", \"country\": \"IQ\", \"company\": \"International Rescue Committee\", \"position\": \"WPE Senior Manager - Quality Assurance - Erbil or Baghdad\", \"notes\": \"\", \"original\": \"<strong>Requisition ID: <\/strong> req20115<br><br><strong>Job Title: <\/strong>WPE Senior Manager - Quality Assurance - Erbil or Baghdad<br><br><strong>Sector: <\/strong>Women Protection &amp; Empowerment<br><br><strong>Employment Category:<\/strong> Regular<br><br><strong>Employment Type:<\/strong> Full-Time<br><br><strong>Open to Expatriates:<\/strong> No<br><br><strong>Location:<\/strong> Erbil, Iraq<br><br><strong><u>Background<br><br><\/u><\/strong><strong> Job Description <br><br><\/strong>The International Rescue Committee responds to the world\\u2019s worst humanitarian crises and helps people to survive and rebuild their lives. Founded in 1933 at the request of Albert Einstein, IRC offers life-saving care and life-changing assistance to refugees forced to flee from war or disaster. At work today in more than 40 countries and in 22 U.S. cities, IRC restores safety, dignity and hope to millions who are uprooted by conflict or disaster. IRC leads the way from harm to home.<br><br><strong><u>Contextual Background<br><br><\/u><\/strong>The IRC established programs in Iraq in 2003 to address the overwhelming needs of displaced people in Iraq and the neighboring countries. Since re-establishing its presence in Iraq in November 2007, the IRC has been assisting thousands of internally displaced families in the northern, central and southern governorates in the sectors of protection, gender-based violence (GBV), education, economic recovery, child Protection and emergency humanitarian assistance. Working in coordination with the humanitarian community in Iraq, the IRC's assistance and emergency programs address the needs of war-affected Iraqi internally displaced persons (IDPs) and include both camp-based and urban-based assistance. IRC operates throughout Iraq, with the main office in Erbil and field offices in, Baghdad, SAD, Kirkuk, Anbar and Mosul.<br><br>The IRC is one of only a few international non-governmental organizations (INGO) active in the Gender Based Violence (GBV) sector in Iraq. The IRC's expanding Women's Protection and Empowerment (WPE) program provides both direct service provision (through women's and girls' centers and mobile teams) and technical support to local partner organizations to implement safe spaces and deliver services to women and girls as well as capacity building of local NGOs, government service providers, and other protection actors on GBV related topics. The WPE program is also conducting RSA assessments as needed, in close coordination with other GBV actors and humanitarian agencies.<br><br><strong><u>Job Overview\/Summary<br><br><\/u><\/strong>The WPE Senior Manager with focus on quality assurance and will ensure high quality WPE program implementation. This will include rapid and effective WPE emergency response and monitoring of WPE activities\\u2019 quality through capacity building of WPE team in GBV technical principles and tools; Monitoring and Evaluation and streamlining M&amp;E tools, approaches, and reporting across all WPE program sites and implementing partners. She will be responsible for setting up and managing an efficient program monitoring system, oversee qualitative and quantitative data collection of program activities, support in the analysis of WPE program data, and ensure harmonized monitoring and reporting of program activities across all WPE program sites. To achieve this the WPE Senior Manager will be required to travel to all<br><br>IRC field sites in Iraq for at least 50% of the time.<br><br><strong><u>Major Responsibilities<br><\/u><\/strong><ul><li> <u> Technical Quality and Implementation <li> The Senior Manager will ensure quality WPE program implementation and will ensure that IRC's response is meeting acute and emerging needs of the affected women and girls and is complementary to ongoing support through other humanitarian partners. <\/li><li> Frequent contact with all WPE Managers and WPE Coordinator is required to support case management supervision and quality of case management service delivery <\/li><li> Provide technical support to WPE teams and quality oversight during implementation of the program including: case management services, psychosocial support, emergency GBV mobile teams, community-based GBV prevention and response, and data collection in line with GBV guiding principles and international standards. <\/li><li> Contribute to continuous analysis of the achievements of each project and facilitate better understanding among staff about program progress through progress reporting. Document lessons learned for program review and planning, advocacy and information sharing. Ensure that monitoring and evaluation reports are made useful to the WPE staff and contribute to learning. Develop, implement, and review a data base that all WPE teams will use to track beneficiary information to use for donor reporting and proposal writing. <\/li><li> Lead WPE teams in conducting rapid GBV needs assessments and in coordination with other GBV emergency response partners and produce a report of the main findings. <\/li><li> Prepare monthly program updates in close collaboration with WPE senior staff to identify key achievements and challenges in program implementation. <\/li><li> Support participatory appraisal, monitoring and evaluation in collaboration with the M&amp;E unit. <\/li><li> Undertake field monitoring visits to assess progress and identify technical quality and implementation issues, provide solutions and implement modifications and improvement plans as required. <\/li><li> Lead the design, review, piloting, and implementation of all research and GBV Monitoring and Evaluation tools and systems, including GBVIMS\/Primero and PDA-based questionnaires. <\/li><li> Support regular analysis of program and service delivery data to identify GBV trends and gaps in WPE response and identify and propose appropriate responses. <\/li><li> <u> Grant Management and Reporting <li> Contribute to and support the development of the WPE program strategic direction and provide evidence-based input in development of new proposals. <\/li><li> Ensure reporting is streamlined across all WPE program sites and implementing partners. <\/li><li> Liaise regularly with other program staff to prepare high quality, analytical internal and external reports within agreed deadlines. This includes collating program data and information and compiling GBVIMS and narrative reports from all program sites. <\/li><li> Ensure that WPE program implementation is in line with the technical proposals, project timelines and budgets. <\/li><li> <u> Staff Management and Development <li> Provide ongoing support to WPE staff to ensure programming meets best practice standards for GBV programming in emergencies. <\/li><li> Develop training and capacity building plans for WPE teams based on identified needs; support capacity building of staff in GBV prevention and response, and in using M&amp;E systems and tools. Build WPE team's capacity to document outcome measures and utilize this evidence for program improvement. <\/li><li> Coach, train, and mentor staff with the aim of strengthening their technical capacity, exchanging knowledge within the team and providing professional development guidance <\/li><li> Supervise and mentor direct-report staff, including communicating clear expectations, setting performance objectives, providing regular and timely performance feedback, and providing documented semi-annual performance reviews. <\/li><li> Provide constructive feedback and counsel on appropriate career paths and professional development. <\/li><li> Promote and monitor staff care and well-being; approve and manage all leave requests to ensure adequate coverage. <\/li><li> Offer leadership support for successful adherence by staff to IRC\\u2019s Global HR Operating Policies and Procedures. <\/li><li> <u> Coordination <li> Participate in internal coordination meetings as required and liaise with IRC's other programs as needed to ensure effective collaboration, program integration, and mainstreaming of GBV risk mitigation for the best possible outcome for the client. <\/li><li> Represent the IRC at relevant interagency coordination meetings and task forces as required. <\/li><li> Coordinate and follow-up with partner organizations and other project stakeholders as required. <br><\/li><strong><u>Key Working Relationships<br><\/u><\/strong><ul><li> Position Reports to: WPE Coordinator.<\/li><li> Position directly supervises: Senior WPE Officer- Data &amp; information management.<\/li><li> Indirect Reporting: this position indirectly reports to M&amp;ECoordinator<\/li><li> Other Internal and\/or external contacts: <\/li><li> Internal: close collaboration with other WPE staff particularly field-based WPE Managers and Senior Managers, other IRC Iraq programs (Economic Recovery and Development (ERD), Children and Youth, Protection and Development (CYPD), and Protection\/Rule of Law), Grants, Supply Chain, HR and Finance Departments<br><\/li><\/ul><strong><em> External <\/em><\/strong> : close collaboration with other humanitarian actors and GBV Working Group, local implementing partners, UN agencies, government, and service providers<br><br><strong><u>Qualifications<br><br><\/u><\/strong><strong> JOB REQUIREMENTS: <br><br><\/strong><strong><u>Education<br><br><\/u><\/strong>Bachelor degree in Social Work, Gender Studies, Public Health, Human Rights, or another appropriate field.<br><br><strong><u>Work Experience<br><\/u><\/strong><ul><li> At least 4\\u2013 5 years of program management experience in humanitarian sector, preferably working with refugees or internally displaced populations; at least 3 of which must be in the field of GBV prevention and response preferably in complex emergencies. <\/li><li> Experience providing case management or psychosocial support and\/or supervising case workers. <\/li><li> In-depth understanding of GBV prevention and response, related international standards and guidelines. <\/li><li> Knowledge of GBVIMS and related incident data collection and management tools is a plus. <br><\/li><\/ul><strong><u>Demonstrated Skills And Competencies<br><\/u><\/strong><ul><li> Advanced knowledge of MS Word, Excel, PowerPoint and email\/internet software. <\/li><li> Demonstrated qualitative and quantitative analysis skills, and experience with setting up M&amp;E systems and frameworks <\/li><li> Experience managing projects and budget management skills <\/li><li> Strong writing skills and experience in writing donor reports and proposals <\/li><li> Proven leadership, program and staff management skills and capacity building <\/li><li> Demonstrated capacity and experience in developing assessment tools (e.g. questionnaires, focus group discussions) and in conducting field-level data collection <\/li><li> Strong analytical skills and ability to distill data into important, relevant insights and learnings to improve program quality and inform future programming priorities <br><\/li><\/ul><strong><em>Language Skills<\/em><\/strong>: Fluency in spoken\/written English &amp; Arabic is required.<br><br><strong><em> Certificates or Licenses: <\/em><\/strong> NA<br><br><strong><u>Working Environment<br><\/u><\/strong><ul><li> Frequent and mandatory travel (50% of the time) to field sites of Anbar, Kirkuk &amp; Mosul. <\/li><li> Female candidates are strongly encouraged to apply for this position. <br><\/li><\/ul><strong><u>Standards Of Professional Conduct<br><br><\/u><\/strong>The IRC and IRC workers must adhere to the values and principles outlined in IRC Way - Standards for Professional Conduct. These are Integrity, Service, and Accountability. In accordance with these values, the IRC operates and enforces policies on Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Anti Workplace Harassment, Fiscal Integrity, and Anti-Retaliation.<br><br><strong><u>Gender Equality<br><br><\/u><\/strong>IRC is committed to narrowing the gender gap in leadership positions. We offer benefits that provide an enabling environment for women to participate in our workforce including maternity leave, gender-sensitive security protocols and other supportive benefits and allowances. Qualified female candidates are strongly encouraged to apply.<br><br><strong><u>Attention Returning National Candidates<br><br><\/u><\/strong>IRC strives to attract, motivate and retain qualified national staff in our programs. We strongly encourage national or returning national candidates to apply for this position. If you are a national of the country in which this position is based and are currently located outside of your home country and possess over two years of international work experience, IRC has introduced an attractive remuneration package. The package includes competitive compensation, return flight to post, shipping allowance, temporary housing and a relocation allowance. Certain restrictions may apply.<br><br><strong><u> Notice to all Job Seekers <br><br><\/u><\/strong><strong> IRC implements an equal employment opportunity policy and our recruitment process is based on merit. <br><br><\/strong><strong> Applicants and\/or successful interview candidates (both internal and external) are not required to pay any fees at any stage of the recruitment process. <br><br><\/strong><strong> If anyone asks you for any financial or non-financial favors to help you secure a job at IRC, kindly report to <\/strong><strong><u> iraq.hr@rescue.org <\/u><\/strong><strong> . <br><br><\/strong><strong><u> \\u0645\\u0644\\u0627\\u062d\\u0638\\u0629 \\u0644\\u0643\\u0644 \\u0627\\u0644\\u0628\\u0627\\u062d\\u062b\\u064a\\u0646 \\u0639\\u0646 \\u0648\\u0638\\u064a\\u0641\\u0629 <br><br><\/u><\/strong><strong> \\u062a\\u0639\\u062a\\u0645\\u062f \\u0644\\u062c\\u0646\\u0629 \\u0627\\u0644\\u0627\\u0646\\u0642\\u0627\\u0630 \\u0627\\u0644\\u062f\\u0648\\u0644\\u064a\\u0629 \\u0633\\u064a\\u0627\\u0633\\u0629 \\u0641\\u0631\\u0635 \\u0639\\u0645\\u0644 \\u0645\\u062a\\u0633\\u0627\\u0648\\u064a\\u0629\\u060c \\u0648\\u0627\\u0646 \\u0639\\u0645\\u0644\\u064a\\u0629 \\u0627\\u0644\\u062a\\u0648\\u0638\\u064a\\u0641 \\u0644\\u062f\\u064a\\u0646\\u0627 \\u062a\\u0639\\u062a\\u0645\\u062f \\u0639\\u0644\\u0649 \\u0627\\u0644\\u062c\\u062f\\u0627\\u0631\\u0629. <br><br><\/strong><strong> \\u0644\\u0627 \\u064a\\u062a\\u0648\\u062c\\u0628 \\u0639\\u0644\\u0649 \\u0627\\u0644\\u0645\\u062a\\u0642\\u062f\\u0645\\u064a\\u0646 \\u0644\\u0623\\u064a \\u0648\\u0638\\u064a\\u0641\\u0629 \\u0623\\u0648 \\u0627\\u0644\\u0645\\u0624\\u0647\\u0644\\u064a\\u0646 \\u0644\\u0644\\u0645\\u0642\\u0627\\u0628\\u0644\\u0627\\u062a (\\u0633\\u0648\\u0627\\u0621 \\u0643\\u0627\\u0646\\u0648\\u0627 \\u0645\\u0648\\u0638\\u0641\\u064a\\u064a\\u0646 \\u062d\\u0627\\u0644\\u064a\\u0646 \\u0623\\u0648 \\u0645\\u062a\\u0642\\u062f\\u0645\\u064a\\u0646 \\u0645\\u0646 \\u062e\\u0627\\u0631\\u062c \\u0627\\u0644\\u0645\\u0646\\u0638\\u0645\\u0629) \\u062f\\u0641\\u0639 \\u0623\\u064a \\u0645\\u0628\\u0644\\u063a \\u0645\\u0627\\u0644\\u064a \\u062e\\u0644\\u0627\\u0644 \\u0623\\u064a \\u0645\\u0631\\u062d\\u0644\\u0629 \\u0645\\u0646 \\u0645\\u0631\\u0627\\u062d\\u0644 \\u0627\\u0644\\u062a\\u0648\\u0638\\u064a\\u0641. <br><br><\/strong><strong> \\u0625\\u0630\\u0627 \\u0642\\u0627\\u0645 \\u0623\\u064a \\u0634\\u062e\\u0635 \\u0628\\u0637\\u0644\\u0628 \\u0623\\u064a \\u062e\\u062f\\u0645\\u0629 \\u0645\\u0627\\u0644\\u064a\\u0629 \\u0623\\u0648 \\u063a\\u064a\\u0631 \\u0645\\u0627\\u0644\\u064a\\u0629 \\u0644\\u0642\\u0627\\u0621 \\u0645\\u0633\\u0627\\u0639\\u062f\\u062a\\u0643\\u0645 \\u0641\\u064a \\u062a\\u0623\\u0645\\u064a\\u0646 \\u0641\\u0631\\u0635\\u0629 \\u0639\\u0645\\u0644 \\u062f\\u0627\\u062e\\u0644 \\u0627\\u0644\\u0645\\u0646\\u0638\\u0645\\u0629\\u060c \\u064a\\u0631\\u062c\\u0649 \\u0627\\u0644\\u0625\\u0628\\u0644\\u0627\\u063a \\u0639\\u0646 \\u0630\\u0644\\u0643 \\u0627\\u0644\\u0649 \\u0627\\u0644\\u0628\\u0631\\u064a\\u062f \\u0627\\u0644\\u0625\\u0644\\u0643\\u062a\\u0631\\u0648\\u0646\\u064a: <\/strong><strong><u> iraq.hr@rescue.org<\/u><\/strong><\/u><\/li><\/u><\/li><\/u><\/li><\/u><\/li><\/ul>\"}"
}