{
    "id":"Kaggle::techmap::61413ab9a973d70733cf47cb::britishjobs_uk::4",
    "label_age":true,
    "analysis_age":"Specifically targets recent graduates in accounting and finance, which may unintentionally deter older applicants or career switchers.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Associate Accounting Assistant. Ruilsip. £22k plus study support!! AND company bonus £££. Are you looking for a local role with a company providing a fantastic opportunity for a long standing career? Do you want a company that will actively encourage you to continue to study AND pay for you to do so.?? This job may sound too good to be true, but it has just hit the market and the company are actively interviewing to start a candidate ASAP. This role would suit a recent graduate who has a real flair for numbers, it would be ideal if you have finished your studies in accounting and finance and now looking for your first office based accounts role. That's right, no previous office experience is needed for this role. What my client is asking for is a hard working, mature and dedicated individual who is ready to roll their sleeves up and learn from a very experienced team. Duties include: Assisting with the book keeping department. Processing VAT returns to trial balance. Liaising with clients. Reporting. Supporting senior accountants with duties. Using Xero software",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61413ab9a973d70733cf47cb::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Sheridan Ward Recruitment Services\", \"position\": \"Associate Accounting Assistant\", \"notes\": \"\", \"original\": \"Associate Accounting Assistant <br><br> Ruilsip<br><br> &pound;22k plus study support!! AND company bonus &pound;&pound;&pound;<br><br> Are you looking for a local role with a company providing a fantastic opportunity for a long standing career? <br><br> Do you want a company that will actively encourage you to continue to study AND pay for you to do so...?? <br><br> This job may sound too good to be true, but it has just hit the market and the company are actively interviewing to start a candidate ASAP. This role would suit a recent graduate who has a real flair for numbers, it would be ideal if you have finished your studies in accounting and finance and now looking for your first office based accounts role. <br><br> That&#39;s right, no previous office experience is needed for this role. What my client is asking for is a hard working, mature and dedicated individual who is ready to roll their sleeves up and learn from a very experienced team. <br><br> Duties include:<br><br>Assisting with the book keeping department <br>Processing VAT returns to trial balance <br>Liaising with clients <br>Reporting <br>Supporting senior accountants with duties <br>Using Xero software\"}"
}