{
    "id":"Kaggle::techmap::615d6c5eeefd6733f693fcba::linkedin_sv::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"\"Qualified candidates from El Salvador or the Central American region are preferred\" this is biased in favour of candidates from a specific origin",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Facilitating country-level partnerships, capacity strengthening, and knowledge sharing by placing national partners at the center of project design. Representing the project with in-country stakeholders, including Government of El Salvador focal points, local authorities, and other key actors. Responsibilities for Technical Leadership Roles (DCOP-Technical and Thematic Leads) include: Overseeing, supporting, and mentoring Safeguarding and Protection, Womens Empowerment, Systems and Policy Change, Health, Advocacy and Social Behavior Change, and MEAL teams to achieve project goals. Leading the development and implementation of the projects overall approach in each of its components and thematic areas in coordination with partners and advisors. Leading or supporting the development of MEAL plans and approaches. Ensuring linkages between relevant national actors in evidence generation and dissemination, and driving improvements to implementation based upon lessons learned and best practices. Guiding discussions of policy change and implementation with diverse stakeholders, specifically around advancing the protection framework. Qualifications. A strong track record of leading the management or technical delivery of large and\/or complex USAID-funded projects and managing a diverse team of professionals and consortium partners. Ability to perform at a senior management level, including managing staff in a matrixed system with a focus on adaptive management and consortium-based implementation. Extensive experience working in the Central America region is required. El Salvador is preferred. Experience delivering USAID programs that further womens rights and address violence against women and girls (VAWG) in Central America, including domestic violence, and other protection issues. Strong skills in program design, implementation, advocacy, and networking with national institutions and agencies which promote access to high quality, holistic protection, health, and legal services. Understanding of integrated protection programming, including context-specific barriers to access of support and services faced by domestic violence survivors, as well as policy reform strategies. Familiarity with current global and regional debates about preventing and responding to VAGW, including USAIDs thinking and emerging priorities. Experience engaging diverse stakeholders in policy implementation and reform, preferably related to womens rights and\/or protection. Fluency in English required. Fluency in Spanish preferred. Qualified candidates from El Salvador or the Central American region are preferred. Application Requirements. To apply please submit your CV and a cover letter specifying the position you are applying for and how your skills and experience make you a suitable candidate for the role.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615d6c5eeefd6733f693fcba::linkedin_sv\", \"source\": \"linkedin_sv\", \"country\": \"SV\", \"company\": \"International Rescue Committee\", \"position\": \"Call for Experts \\u2013 USAID\/El Salvador: Countering Gender-based Violence\", \"notes\": \"\", \"original\": \"<strong>Requisition ID: <\/strong> req16153<br><br><strong>Job Title: <\/strong>Call for Experts \\u2013 USAID\/El Salvador: Countering Gender-based Violence<br><br><strong>Sector: <\/strong>Program Administration<br><br><strong>Employment Category:<\/strong> Proposal<br><br><strong>Employment Type:<\/strong> Full-Time<br><br><strong>Open to Expatriates:<\/strong> Not Applicable<br><br><strong>Location:<\/strong> San Salvador, El Salvador<br><br><strong><u>Job Description<br><br><\/u><\/strong>The IRC began working in El Salvador in 1984 during the civil war, and has since expanded its programming to support national partners in developing lasting solutions to challenges in countering gender-based violence, displacement, shelter and safety, health care, sanitation, emergency assistance, improved government services, and livelihoods. Prioritizing sustainability and long-term impact, the IRC engages civil society organizations, government, and other key stakeholders in partnerships and capacity strengthening.<br><br><strong><u>Objective<br><br><\/u><\/strong>The International Rescue Committee is looking for strategic leaders, technical specialists, and project managers to work on a USAID-funded countering gender-based violence (GBV) activity in El Salvador. The project will design and deliver activities to prevent GBV, improve and expand survivors\\u2019 assistance services, and increase judicial accountability for perpetrators. Programming interventions will focus on strengthening national organizations, civil society actors, and key stakeholders to implement social behavior change strategies and, ultimately, improve their capacity to deliver grass-roots solutions that are resilient and impactful.<br><br><strong><u>Role<br><br><\/u><\/strong>The IRC is seeking candidates to fill the following roles in the project-specific leadership structure<br><br>This project will be delivered by a project-specific leadership structure working closely with IRC El Salvador country program teams and global technical advisors.<br><ul><li>Deputy Chief of Party \\u2013 Technical<\/li><li>Deputy Chief of Party \\u2013 Operations<\/li><li>Grants and Compliance Manager<\/li><li>Partnerships Manager<\/li><li>Safeguarding and Protection, Women\\u2019s Empowerment, Systems and Policy Change, Health, Advocacy and Social Behavior Change, and Monitoring, Evaluation and Learning (MEAL) leads<br><\/li><\/ul>These are senior positions which require outstanding leadership, strategic thinking, and organizational, team-building and representational skills. They will be responsible for the oversight of the project in El Salvador. They are envisaged to be full-time and will be based in El Salvador; travel to the areas of implementation may be required, subject to COVID-19 restrictions. We encourage open applications for roles in the project from qualified candidates.<br><br><strong><u>Job Responsibilities<br><br><\/u><\/strong>Responsibilities for Project Management Roles (Deputy Chief of Party \\u2013 Operations; Grants and Compliance Manager; and Partnerships Manager) include:<br><ul><li>Overseeing, supporting, and mentoring operations staff working in a complex operating environment.<\/li><li>Oversight of day-to-day project activities, project finances, operations, staffing, grants management and compliance, work planning, reporting, and overall operational delivery.<\/li><li>Facilitating country-level partnerships, capacity strengthening, and knowledge sharing by placing national partners at the center of project design.<\/li><li>Representing the project with in-country stakeholders, including Government of El Salvador focal points, local authorities, and other key actors.<br><\/li><\/ul>Responsibilities for Technical Leadership Roles (DCOP-Technical and Thematic Leads) include:<br><ul><li>Overseeing, supporting, and mentoring Safeguarding and Protection, Women\\u2019s Empowerment, Systems and Policy Change, Health, Advocacy and Social Behavior Change, and MEAL teams to achieve project goals.<\/li><li>Leading the development and implementation of the project\\u2019s overall approach in each of its components and thematic areas in coordination with partners and advisors.<\/li><li>Leading or supporting the development of MEAL plans and approaches<\/li><li>Ensuring linkages between relevant national actors in evidence generation and dissemination, and driving improvements to implementation based upon lessons learned and best practices.<\/li><li>Guiding discussions of policy change and implementation with diverse stakeholders, specifically around advancing the protection framework.<br><\/li><\/ul><strong><u>Qualifications<br><\/u><\/strong><ul><li>A strong track record of leading the management or technical delivery of large and\/or complex USAID-funded projects and managing a diverse team of professionals and consortium partners.<\/li><li>Ability to perform at a senior management level, including managing staff in a matrixed system with a focus on adaptive management and consortium-based implementation.<\/li><li>Extensive experience working in the Central America region is required; El Salvador is preferred.<\/li><li>Experience delivering USAID programs that further women\\u2019s rights and address violence against women and girls (VAWG) in Central America, including domestic violence, and other protection issues.<\/li><li>Strong skills in program design, implementation, advocacy, and networking with national institutions and agencies which promote access to high quality, holistic protection, health, and legal services.<\/li><li>Understanding of integrated protection programming, including context-specific barriers to access of support and services faced by domestic violence survivors, as well as policy reform strategies.<\/li><li>Familiarity with current global and regional debates about preventing and responding to VAGW, including USAID\\u2019s thinking and emerging priorities.<\/li><li>Experience engaging diverse stakeholders in policy implementation and reform, preferably related to women\\u2019s rights and\/or protection.<\/li><li>Fluency in English required; fluency in Spanish preferred.<\/li><li>Qualified candidates from El Salvador or the Central American region are preferred.<br><\/li><\/ul><strong><u>Application Requirements<br><br><\/u><\/strong>To apply please submit your CV and a cover letter specifying the position you are applying for and how your skills and experience make you a suitable candidate for the role.<br><br>Please note the scope of the work is high level and may be subject to change once the proposal is released. Recruitment of these positions is contingent upon successful award of the project to the IRC.<br><br>The IRC and IRC workers must adhere to the values and principles outlined in IRC Way - Standards for Professional Conduct. These are Integrity, Service, and Accountability. In accordance with these values, the IRC operates and enforces policies on Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Anti Workplace Harassment, Fiscal Integrity, and Anti-Retaliation.\"}"
}