{
    "id":"Kaggle::techmap::615946de20f4e54ef9aa946c::linkedin_be::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The use of terms like \"leading,\" \"guide,\" \"supporting program teams,\" and \"accountable\" can subtly favour male candidates by aligning with traditionally masculine-coded traits such as leadership, responsibility, and technical expertise.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"he \/she\" can be seen as excluding those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" To strengthen our new Gene Therapy Process Sciences Development Department, based in Braine-lAlleud, Belgium we are looking for a talented individual to fill the position of: Gene Therapy Process Sciences Innovation & Partnership Leader. The Gene Therapy (GT) Process Sciences Innovation & Partnership Leader will guide the establishment and improvement of recombinant adeno-associated virus (rAAV) platforms. He\/she will also help the Upstream, Downstream and Drug Product Process Sciences Development teams to translate those processes through internal and external development and manufacturing partnerships. This role will be a key point of contact for the interface of the GT Process Sciences Development team and our network of multi-national internal and external process development and clinical manufacturing activities. This includes supporting program teams to define work scope and to ensure execution to plan for UCBs external Gene Therapy process development and manufacturing needs. He\/she will also help to promote a culture of innovation in the GT Process Sciences Development team and will be accountable for establishment, documentation, and evolution of the UCB rAAV platform production process in collaboration with the GT Process Sciences Development teams. The Gene Therapy Process Sciences Innovation & Partnership Leader will function primarily remotely during the design and build of the new Gene Therapy laboratories and then will move onsite to support facility startup. You will more precisely contribute by: Coordinating contract development and manufacturing work statements and operational execution in collaboration with Program teams, Alliance Management, Quality, Regulatory & Process Engineering teams. Developing relationships with key product and service providers to support UCBs Gene Therapy Portfolio. Tracking, reporting and ensuring on time, in full delivery of GT Process Sciences Development external activities. Defining and document UCBs GT Process Platform Technologies. Promoting a culture of innovation in the GT Process Sciences Development and UCB GT Program teams. Supporting process development teams from pre-clinical through commercial-stage development as required to deliver UCBs Gene Therapy Portfolio. Interested? For this position youll need the following education, experience and skills: PhD (Chemical Engineering, Bioengineering, Biology, Biochemistry, Virology, or related fields) with 5. years of experience. Strong knowledges in Biologics Process Sciences Development including: Upstream  flasks, stirred tank bioreactors, perfusion, primary clarification. Downstream  chromatography, filtration (normal\/tangential flow). In depth understanding of technology transfer approaches for internal manufacturing and CDMOs. Demonstrated experience in operating in a highly matrixed environment to deliver project\/program goals.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615946de20f4e54ef9aa946c::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"UCB\", \"position\": \"Gene Therapy Process Sciences Innovation & Partnership Leader\", \"notes\": \"\", \"original\": \"<p>To strengthen our new&nbsp;<strong>Gene Therapy Process Sciences Development Department<\/strong>, based in&nbsp;<strong>Braine-l\\u2019Alleud, Belgium<\/strong>&nbsp;we are looking for a talented individual to fill the position of:&nbsp;<strong>Gene Therapy Process Sciences Innovation &amp; Partnership Leader<\/strong>.<\/p><p>&nbsp;<\/p><p>The Gene Therapy (GT) Process Sciences Innovation &amp; Partnership Leader will&nbsp;<strong>guide the establishment and improvement of recombinant adeno-associated virus (rAAV) platforms<\/strong>. He\/she will also help the Upstream, Downstream and Drug Product Process Sciences Development teams to translate those processes through internal and external development and manufacturing partnerships.<\/p><p><br><\/p><p>This role will&nbsp;<strong>be a key point of contact for the interface of the GT Process Sciences Development team and our network&nbsp;<\/strong>of multi-national internal and external process development and clinical manufacturing activities. This includes supporting program teams to define work scope and to ensure execution to plan for UCB\\u2019s external Gene Therapy process development and manufacturing needs.<\/p><p><br><\/p><p>He\/she will also&nbsp;<strong>help to promote a culture of innovation in the GT Process Sciences Development team<\/strong>&nbsp;and will be accountable for establishment, documentation, and evolution of the UCB rAAV platform production process in collaboration with the GT Process Sciences Development teams.<\/p><p><br><\/p><p>The Gene Therapy Process Sciences Innovation &amp; Partnership Leader will function primarily remotely during the design and build of the new Gene Therapy laboratories and then will move onsite to support facility startup.<\/p><p><br><\/p><p><strong>You will more precisely contribute by:<\/strong><\/p><p>&nbsp;<\/p><ul><li>Coordinating contract development and manufacturing work statements and operational execution in collaboration with Program teams, Alliance Management, Quality, Regulatory &amp; Process Engineering teams.<\/li><li>Developing relationships with key product and service providers to support UCB\\u2019s Gene Therapy Portfolio.<\/li><li>Tracking, reporting and ensuring on time, in full delivery of GT Process Sciences Development external activities.<\/li><li>Defining and document UCB\\u2019s GT Process Platform Technologies.<\/li><li>Promoting a culture of innovation in the GT Process Sciences Development and UCB GT Program teams.<\/li><li>Supporting process development teams from pre-clinical through commercial-stage development as required to deliver UCB\\u2019s Gene Therapy Portfolio.<\/li><\/ul><p>&nbsp;<\/p><p><strong>Interested? For this position you\\u2019ll need the following education, experience and skills:<\/strong><\/p><ul><li>PhD (Chemical Engineering, Bioengineering, Biology, Biochemistry, Virology, or related fields) with 5+ years of experience.<\/li><li>Strong knowledges in Biologics Process Sciences Development including:<\/li><li>Upstream \\u2013 flasks, stirred tank bioreactors, perfusion, primary clarification.<\/li><li>Downstream \\u2013 chromatography, filtration (normal\/tangential flow).<\/li><li>In depth understanding of technology transfer approaches for internal manufacturing and CDMOs.<\/li><li>Demonstrated experience in operating in a highly matrixed environment to deliver project\/program goals.<\/li><li>Experience with cGMP manufacturing principles, biologics regulatory guidances, and technical investigations including root cause analysis.<\/li><li>Excellent interpersonal skills to communicate and maintain good working relationship with internal and external customers.<\/li><li>Very good command in English &amp; French (both written and spoken).<\/li><\/ul><p>&nbsp;<\/p><p><strong>Why you should apply<\/strong><\/p><p>At UCB, we strive to attract passionate and outstanding talents who thrive on change and are ready to bring real value to patients. Working for us you\\u2019ll discover a place where you can grow and express your full potential. We place an emphasis on innovation, collaboration and impact. Through meaningful recognition and a motivating work atmosphere, we aim to provide an optimal experience by caring about and valuing our employees \\u2013 just as we do for the patients we serve.<\/p><p>&nbsp;<\/p><p>If you believe you are the perfect match to join us on our pioneering adventure, then we invite you to apply and tell us more about your profile and motivation.<\/p>\"}"
}