{
    "id":"Kaggle::techmap::614148838be8df1fa24c3f57::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" The individual in this position must be capable of performing within the scope of the primary accountabilities with or without a reasonable accommodation. Requirements: Knowledge and Skills: (The following minimum requirements are normal guidelines and should not constrain the advancement of otherwise qualified personnel). A high school diploma or equivalent is required. Generally prefer 2-5 years of experience in related field. Must have solid analytical and problem solving skills. Proficient computer skills are required for this position. Ability to challenge the status quo and drive improvements. In depth knowledge and experience within a WMS (Warehouse Management System), preferably Red Prairie, is required. Must demonstrate strong written and oral communication skills. Proven ability to multitask on a daily basis. Ability to demonstrate problem solving and leadership skills. At DB Schenker, you are part of a global logistics network that connects the world. A network that allows you to shape your career by encouraging you to contribute and truly make a difference. With more than 76, 000 colleagues worldwide, we welcome diversity and thrive on individual backgrounds, perspectives and skills. Together as one team, we are Here to move. Equal Opportunity Employer-minorities\/females\/veterans\/individuals with disabilities\/sexual orientation\/gender identity.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614148838be8df1fa24c3f57::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Schenker, Inc.\", \"position\": \"Warehouse Production Coordinator- 2nd shift\", \"notes\": \"\", \"original\": \"<p>Principal Accountabilities:<br \/> (The following is intended to describe the general nature and level of work being performed.<br \/> It is not an exhaustive list of all expectations)<br \/> <\/p><ul><li>Systematically operate within the WMS system to allocate and manage work flow by job function for the entire distribution warehouse to include but not limited to allocation of orders, releasing tasks for directed work, managing tasks within the work flow and resolving discrepancies.<br \/><\/li><li>Create strategic operational plan by gathering information and communicating to senior leadership on a daily basis.<br \/><\/li><li>Ensure the daily operational plan is timely and cost-effective to meet productivity demands while maintaining quality standards as defined in the distribution warehouse SOPs.<br \/><\/li><li>Continuously manage and monitor the daily work flow queue and have a clear understanding of interleaving processes used to set priorities within the queue.<br \/><\/li><li>Access door recommendations within the WMS system to assign inbound and outbound loads to appropriate staging lanes and\/or door locations.<br \/><\/li><li>Oversee the timely and accurate trailer movements for the site's drop lot.<br \/><\/li><li>By means of super user access within the WMS system ensure work flow is allocated properly and timely.<br \/><\/li><li>Create and manage an audit process to ensure appropriate progress is made daily to meet production needs.<br \/><\/li><li>Comprehensive understanding of labor allocation to ensure decision making aligns with the required shipment schedule demands.<br \/><\/li><li>Troubleshoot undirected work to ensure the proper corrections are made prior to releasing it to directed work status.<br \/><\/li><li>Maintain a broad understanding of the WMS system(s) and provide support to the onsite user community.<br \/><\/li><li>Serve as a liaison between IT and the site team on WMS system related barriers to include but not limited to un-assigning trailers, cuts, substitutions, shuttle moves, regenerating orders, out of service locations, etc.<br \/><\/li><li>As defined by the site KPI's (Key Performance Indicators), responsible for the management of timely shipments and ensures late ship dates are met.<br \/><\/li><li>Manages system compliance and ensures accurate records are maintained in accordance with the WMS SOP (Standard Operating Procedure).<br \/><\/li><li>Responsible for providing a daily turnover report to the next scheduled shift to guarantee continuous movement of production.<br \/><\/li><li>Regularly identify and recommend opportunities for improvement related to the warehouse management system processes.<br \/> Essential Functions:<br \/> Must be able to pass any federal\/state\/local government, airport, or company-required background checks, clearances, and\/or drug and alcohol tests.<br \/> The individual in this position must be capable of performing within the scope of the primary accountabilities with or without a reasonable accommodation.<br \/>Requirements:<br \/>Knowledge and Skills:<br \/> (The following minimum requirements are normal guidelines and should not constrain the advancement of otherwise qualified personnel) <br \/>* A high school diploma or equivalent is required.<br \/> <br \/>* Generally prefer 2-5 years of experience in related field.<br \/> <br \/>* Must have solid analytical and problem solving skills.<br \/> <br \/>* Proficient computer skills are required for this position.<br \/> <br \/>* Ability to challenge the status quo and drive improvements.<br \/> <br \/>* In depth knowledge and experience within a WMS (Warehouse Management System), preferably Red Prairie, is required.<br \/> <br \/>* Must demonstrate strong written and oral communication skills.<br \/> <br \/>* Proven ability to multitask on a daily basis.<br \/> <br \/>* Ability to demonstrate problem solving and leadership skills.<br \/> At DB Schenker, you are part of a global logistics network that connects the world.<br \/> A network that allows you to shape your career by encouraging you to contribute and truly make a difference.<br \/> With more than 76,000 colleagues worldwide, we welcome diversity and thrive on individual backgrounds, perspectives and skills.<br \/> Together as one team, we are Here to move.<br \/> Equal Opportunity Employer-minorities\/females\/veterans\/individuals with disabilities\/sexual orientation\/gender identity <div\"}"
}