{
    "id":"Kaggle::techmap::6136b13918e520633201b55b::reed_uk::1",
    "label_age":true,
    "analysis_age":"Despite saying \" open to both graduates and experienced cover supervisors\" it later seeks \"recent graduate\". Therefore it is not balanced and contains implicit age bias.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Cover Supervisor. Flexible Working. West London - ASAP START. Prospero Teaching are seeking Cover supervisors who are looking to join schools that I work with located within the West London Area. You would be required to support a classroom for the duration of a teachers' absence. This can either be Day to Day work or Long-term depending on what you're looking for and the needs of the School. This type of work enables you to be completely flexible and allows you to only work when you are available. The schools you will be required to cover are large mainstream Secondary Schools with a supportive cover team and teaching staff. The schools that Prospero teaching are working with are going from strength to strength and provide CPD training throughout the year, as well as Prospero teachings' very own CPD Training held at our headquarters in London. This position is open to both graduates and experienced cover supervisors. Depending on performance, the school would look at either extending the contract or offering a permanent position. EXPERIENCE, TRAINING AND QUALIFICATIONS. Recent Graduate, with a 2:1 or higher. Previous experience working within a UK secondary school. Safeguarding training issued within the last year. Be confident covering a secondary level lesson. TO BE ELIGIBLE FOR THIS ROLE THROUGH PROSPERO TEACHING, YOU MUST: Hold Right to Work in the UK. Hold an enhanced child barred list DBS certificate registered with the online update service or be willing to process a new application. Provide two professional child related references. WHAT SUPPORT WILL I BE GIVEN AS A COVER SUPERVISOR? Training and CPD sessions are also offered. The school, ahead of time, will provide you with extended information, resources and strategies for supporting learners, behaviour management guidance, group and 1:1 training from qualified and experienced passionate staff. OTHER. If you would like to be considered for this role, please apply with a copy of your up to date CV. Unfortunately, only shortlisted candidates will be contacted. Prospero Teaching are acting as an employment business\/education recruitment agency in relation to this vacancy. The successful candidate will be required to register with Prospero Teaching in order to fill this vacancy. Prospero Teaching are able to offer the successful candidate: Free, accredited continued professional development courses including safeguarding and behaviour management.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6136b13918e520633201b55b::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Prospero Teaching\", \"position\": \"Cover Supervisor - West London - ASAP START\", \"notes\": \"\", \"original\": \"<p><strong>Cover Supervisor - Flexible Working - West London - ASAP START <\/strong> <\/p> <p>Prospero Teaching are seeking Cover supervisors who are looking to join schools that I work with located within the West London Area. You would be required to support a classroom for the duration of a teachers' absence. This can either be Day to Day work or Long-term depending on what you're looking for and the needs of the School.<\/p> <p>This type of work enables you to be completely flexible and allows you to only work when you are available.<\/p> <p>The schools you will be required to cover are large mainstream Secondary Schools with a supportive cover team and teaching staff. The schools that Prospero teaching are working with are going from strength to strength and provide CPD training throughout the year, as well as Prospero teachings' very own CPD Training held at our headquarters in London.<\/p> <p>This position is open to both graduates and experienced cover supervisors. Depending on performance, the school would look at either extending the contract or offering a permanent position.<\/p> <p><strong>EXPERIENCE, TRAINING AND QUALIFICATIONS<\/strong><\/p> \\n<ul> \\n <li>Recent Graduate, with a 2:1 or higher<\/li>\\n <li>Previous experience working within a UK secondary school<\/li>\\n <li>Safeguarding training issued within the last year<\/li>\\n <li>Be confident covering a secondary level lesson<\/li>\\n<\/ul> <p><strong>TO BE ELIGIBLE FOR THIS ROLE THROUGH PROSPERO TEACHING, YOU MUST:<\/strong><\/p> \\n<ul> \\n <li>Hold Right to Work in the UK<\/li>\\n <li>Hold an enhanced child barred list DBS certificate registered with the online update service or be willing to process a new application<\/li>\\n <li>Provide two professional child related references<\/li>\\n<\/ul> <p><strong>WHAT SUPPORT WILL I BE GIVEN AS A COVER SUPERVISOR? <\/strong><\/p> <p>You'll be given training, guidance and support by an experienced consultant at Prospero, our Training and Development Team as well as from the school. Training and CPD sessions are also offered. The school, ahead of time, will provide you with extended information, resources and strategies for supporting learners, behaviour management guidance, group and 1:1 training from qualified and experienced passionate staff.<\/p> <p><strong>OTHER<\/strong><\/p> <p>If you would like to be considered for this role, please apply with a copy of your up to date CV. Unfortunately, only shortlisted candidates will be contacted.<\/p> <p>Prospero Teaching are acting as an employment business\/education recruitment agency in relation to this vacancy. The successful candidate will be required to register with Prospero Teaching in order to fill this vacancy.<\/p> <p>Prospero Teaching are able to offer the successful candidate:<\/p> \\n<ul> \\n <li>Free, accredited continued professional development courses including safeguarding and behaviour management<\/li>\\n <li>In-house Training and Development Team<\/li>\\n<\/ul>\"}"
}