{
    "id":"Kaggle::techmap::61444514a5224e6280f6c225::careerbuilder_us::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Looking to get into warehouse work? People. Share is hiring for a warehouse associate. Overtime available! Details for Production Associate: Schedule: Monday-Saturday 1st and 2nd Shift Available. Pay Rate: $13. 25-$14. 75\/HR. Job Responsibilities & Description for Production Associate: Use good manufacturing practices for food handling. Maintain a clean and sanitary workplace. Perform other related duties and assignments as required by Supervisor and or Crew Leader. All production workers are expected to be available to work in all areas of production. Job Requirements for Production Associate: Capability to stand in one place for 80% of the shift (8. hours per day). Capability to walk throughout the department for 20% of the shift (8. hours per day). Capability to lift up to 60 lbs. on a frequent basis. Requires the frequent use of both hands and arms. Requires the ability to lift overhead using both arms. Capability to bend, twist, and squat as needed throughout the shift (8. hours per day). Ability to work in 28 degrees (F) and 34 degrees (F). People. Share is the leading Staffing Agency in the region and has temporary to hire and permanent jobs in Maryland (MD) throughout. Baltimore, Baltimore City, Halethorpe, Dundalk, Essex, Brooklyn, Pikesville, Towson, Catonsville, Federal Hill, Hampden, Canton, Fells Point, Roland Park, Woodberry, Charles Village, Highlandtown, Morrell Park, Woodlawn, Lochearn, Rosedale, Parkville, Pimlico, Hopkins Bayview, Williamsport, Clear Spring, and Hagerstown. People. Share provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category or class under federal, state, and\/or local laws.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61444514a5224e6280f6c225::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"PeopleShare Inc\", \"position\": \"Production Associate\", \"notes\": \"\", \"original\": \"<p style=\\\"text-align: center\\\"><em><strong>Looking to get into warehouse work? PeopleShare is hiring for a warehouse associate. <\/strong><\/em><\/p><p style=\\\"text-align: center\\\"><em><strong>Overtime available!<\/strong><\/em><\/p><p><\/p><p><strong>Details for Production Associate: <\/strong><\/p><ul><li>Schedule: Monday-Saturday 1st and 2nd Shift Available<\/li><li>Pay Rate: $13.25-$14.75\/HR<\/li><\/ul><p><\/p><p><strong>Job Responsibilities & Description for Production Associate:<\/strong><\/p><ul><li>Use good manufacturing practices for food handling<\/li><li>Maintain a clean and sanitary workplace<\/li><li>Perform other related duties and assignments as required by Supervisor and or Crew Leader<\/li><li>All production workers are expected to be available to work in all areas of production<\/li><\/ul><p><strong>Job Requirements for Production Associate:<\/strong><\/p><ul><li>Capability to stand in one place for 80% of the shift (8+ hours per day)<\/li><li>Capability to walk throughout the department for 20% of the shift (8+ hours per day)<\/li><li>Capability to lift up to 60 lbs. on a frequent basis<\/li><li>Requires the frequent use of both hands and arms<\/li><li>Requires the ability to lift overhead using both arms<\/li><li>Capability to bend, twist, and squat as needed throughout the shift (8+ hours per day)<\/li><li>Ability to work in 28 degrees (F) and 34 degrees (F)<\/li><\/ul><p><\/p><p><\/p><p style=\\\"text-align: justify\\\">PeopleShare is the leading Staffing Agency in the region and has temporary to hire and permanent jobs in Maryland (MD) throughout - Baltimore, Baltimore City, Halethorpe, Dundalk, Essex, Brooklyn, Pikesville, Towson, Catonsville, Federal Hill, Hampden, Canton, Fells Point, Roland Park, Woodberry, Charles Village, Highlandtown, Morrell Park, Woodlawn, Lochearn, Rosedale, Parkville, Pimlico, Hopkins Bayview, Williamsport, Clear Spring, and Hagerstown. We have openings for receptionist, data entry, customer service, collections, office managers, call center, administrative assistant, accounts payable clerk, accounts receivable clerk, file clerk, warehouse, assembly, production, pickers, packers, forklift, machine operators, and maintenance mechanics.<\/p><p style=\\\"text-align: justify\\\"><\/p><p style=\\\"text-align: justify\\\">PeopleShare provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category or class under federal, state, and\/or local laws. This policy applies to all locations and all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<\/p><p style=\\\"text-align: justify\\\"><\/p><p style=\\\"text-align: justify\\\"><\/p><p style=\\\"text-align: justify\\\"><\/p>&nbsp;\"}"
}