{
    "id":"Kaggle::techmap::6155ba4e4db0014f79b759b8::monster_ie::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement to \"Ensure a high standard of personal hygiene and appearance\" without clear guidelines might imply a subjective bias, potentially discriminating against candidates based on personal grooming choices, cultural or religious attire, or physical characteristics.",
    "verified":true,
    "synthetic":false,
    "text":" Description Main Responsibilities Have full knowledge of all areas with regards to building fabric and maintenance. Full clean drivers licence. Ensure all areas are maintained to the standard required as per contractual requirement schedule 10: full on-going training will be provided. Report any safety hazards or inappropriate compromises to the FM Manager e. g. locked fire door, lifting flooring, lights not working etc. Complete daily\/weekly checks and report any issues. Report any equipment which is faulty, mark as faulty and do not use. Ensure that the specified safety signage is always used, e. g., wet floor signs and warn\/advise customers where possible. Ensure that all storage areas are kept clean and tidy, and equipment always stored safely. Ensure a high standard of personal hygiene and appearance and general cleanliness to comply with statutory and Company regulations, wearing company uniform as specified. Inform your FM manager \/supervisor of low levels of material stocks where appropriate so that new supplies can be re-ordered. Attend training courses and meetings as is necessary to maintain standards in the contract and assist in carrying out the job role efficiently (Some of which may occur outside normal working hours). Provide cover in other areas in times of sickness and holidays. Ensure all tools and equipment is kept clean & maintained in safe working order. Report any defects to the FM Manager immediately. Comply with all Company policies procedures and client site rules and regulations. Comply with all Company & client policies and statutory regulations relating to Health & Safety, safe working practices, hygiene, cleanliness, fire and chemical safety. This will include your awareness of any specific hazards in your workplace. Carry out all other reasonable tasks as directed by FM Manager. To attend meetings and training courses as may be necessary from time to time. Some of which may occur outside normal working hours. To carry out reasonable periods of overtime as may be required from time to time. Flexible working hours to comply with school functions and additional tasks required to be complete outside school hours.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155ba4e4db0014f79b759b8::monster_ie\", \"source\": \"monster_ie\", \"country\": \"IE\", \"company\": \"Sodexo\", \"position\": \"School Cleaner Temporary\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Main Responsibilities <ul> <li>Have full knowledge of all areas with regards to building fabric and maintenance.&nbsp;&nbsp;&nbsp;<\/li> <li>Full clean drivers\\u2019 licence<\/li> <li>Ensure all areas are maintained to the standard required as per contractual requirement schedule 10: full on-going training will be provided.<\/li> <li>Report any safety hazards or inappropriate compromises to the FM Manager e.g.&nbsp; locked fire door, lifting flooring, lights not working etc<\/li> <li>Complete daily\/weekly checks and report any issues&nbsp;<\/li> <li>Report any equipment which is faulty, mark as faulty and do not use.<\/li> <li>Ensure that the specified safety signage is always used, e.g., wet floor signs and \\u201cwarn\/advise\\u201d customers where possible.<\/li> <li>Ensure that all storage areas are kept clean and tidy, and equipment always stored safely.<\/li> <li>Ensure a high standard of personal hygiene and appearance and general cleanliness to comply with statutory and Company regulations, wearing company uniform as specified.<\/li> <li>Inform your FM manager \/supervisor of low levels of material stocks where appropriate so that new supplies can be re-ordered<\/li> <li>Attend training courses and meetings as is necessary to maintain standards in the contract and assist in carrying out the job role efficiently (Some of which may occur outside normal working hours)<\/li> <li>Provide cover in other areas in times of sickness and holidays.<\/li> <li>Ensure all tools and equipment is kept clean &amp; maintained in safe working order.&nbsp; Report any defects to the FM Manager immediately.<\/li> <li>Comply with all Company policies procedures and client site rules and regulations<\/li> <li>Comply with all Company &amp; client policies and statutory regulations relating to Health &amp; Safety, safe working practices, hygiene, cleanliness, fire and chemical safety. This will include your awareness of any specific hazards in your workplace<\/li> <li>Carry out all other reasonable tasks as directed by FM Manager<\/li> <li>To attend meetings and training courses as may be necessary from time to time.&nbsp; Some of which may occur outside normal working hours.<\/li> <li>19. To carry out reasonable periods of overtime as may be required from time to time.<\/li> <li>20.&nbsp; Flexible working hours to comply with school functions and additional tasks required to be complete outside school hours.<\/li> <\/ul> <\/div>\"}"
}