{
    "id":"Kaggle::techmap::61429a5b41808b3c50bd9f2c::monster_cz::0",
    "label_age":true,
    "analysis_age":"The term \"young and unconventional software company\" suggests a preference for younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Requiring a \"clean criminal record\" can unfairly exclude candidates with minor offences that do not impact their ability to perform the role. This requirement may also introduce racial or class bias, disproportionately affecting people of colour and those from low-income communities.",
    "verified":true,
    "synthetic":false,
    "text":" We are a young and unconventional software company created in 2011 by experienced pricing software and pricing consulting professionals. As the first pureplay, native Cloud and SaaS provider in our industry, Pricefx became and intends to stay the leading SaaS Pricing (Price Optimisation & Management) and CPQ (Configure-Price-Quote) vendor. We are an agile company that brings good ideas to life quickly and is committed to market-driven innovation. Our flexibility means our customers come from diverse industries and sizes with brands like Michelin, Sonoco, Solenis, Dana, Avery Dennison, Robert Bosch, etc. We are a solid and sustainable company which is and will be strongly growing globally for the years ahead. Its a great time to join us and grow with us worldwide. You can find out more about us: httpwww. pricefx. com. Your mission? You will be part of the new team responsible for aninfrastructure, where Pricefx application is running. The team is prepared to jump in, when issues occur, is proactive to avoid future problems whenever possible and plans for growth and new demands. You will be in charge of Investigation of issues in HW, Linux, Networks, Databases. Performance tuning. Installations, configurations, deployments. Automatization. Work on standards and documentation. What should you have to succeed? Linux administration ideally Debian. MariaDB\/MySQL, PostgreSQL administration, tuning, replications. At least basic networking knowledge, DNS, VPN, firewall. Apache, HAProxy. ELK stack. Prometheus. Salt Stack. AWS. Ability to speak English fluently (written and communication skills at B2 level or higher is a must). This would make it easier Pricing knowledge and an IT background. CPQ experience. SaaS experience. Other job specifics. After fully completed training, we will expect you to help us with the weekend standby duties. The rotation basis is approx. once a month including other Site Reliability Engineers. Applicants need to have permission to live and work in the Czech Republic (we do not provide any assistance with work permit transcript). We offer full-time employment contract (part-time or freelance cooperation is not possible for this role). We are looking for people to work on-site after a lift of current restrictions (under normal circumstances, this role is not a remote one, although the home office is possible upon agreement). We require a clean criminal record. Location Czech Republic  Prague \/ Hradec Kralove \/ Ostrava. What will you love about us? Your opinion matters here.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61429a5b41808b3c50bd9f2c::monster_cz\", \"source\": \"monster_cz\", \"country\": \"CZ\", \"company\": \"Pricefx\", \"position\": \"Site Reliability Engineer - Pricefx\", \"notes\": \"\", \"original\": \"<p>We are a <strong>young<\/strong> and <strong>unconventional<\/strong> software company created in 2011 by experienced pricing software and pricing consulting professionals. <strong>As the first pureplay, native Cloud and SaaS provider<\/strong> in our industry,<strong><\/strong>Pricefx became and intends to <strong>stay the leading SaaS Pricing (Price Optimisation &amp; Management) and CPQ (Configure-Price-Quote) vendor<\/strong>.<\/p> <p>We are an <strong>agile<\/strong> company that brings good ideas to life quickly and is committed to <strong>market-driven innovation<\/strong>. Our flexibility means our customers come from diverse industries and sizes with brands like Michelin, Sonoco, Solenis, Dana, Avery Dennison, Robert Bosch, etc. We are a solid and sustainable company <strong>which is and will be strongly growing globally<\/strong> for the years ahead. It\\u2019s a great time to join us and grow with us worldwide.<\/p> <p>You can find out more about us: <a href=\\\"http%3A%2F%2Fwww.pricefx.com%2F\\\" target=\\\"_blank\\\">http:\/\/www.pricefx.com<\/a><\/p> <h4><strong>Your mission?<\/strong><\/h4> <p>You will be part of the new team responsible for an\\u202finfrastructure, where Pricefx application is running. The team is prepared to jump in, when issues occur, is proactive to avoid future problems whenever possible and plans for growth and new demands.<\/p> <h4><strong>You will be in charge of\\u2026 <\/strong><\/h4> <ul> <li><p>Investigation of issues in HW, Linux, Networks, Databases<\/p><\/li> <li><p>Performance tuning<\/p><\/li> <li><p>Installations, configurations, deployments<\/p><\/li> <li><p>Automatization<\/p><\/li> <li><p>Work on standards and documentation<\/p><\/li> <\/ul> <h4><strong>What should you have to succeed?<\/strong><\/h4> <ul> <li><p>Linux administration ideally Debian<\/p><\/li> <li><p>MariaDB\/MySQL, PostgreSQL administration, tuning, replications<\/p><\/li> <li><p>At least basic networking knowledge, DNS, VPN, firewall<\/p><\/li> <li><p>Apache, HAProxy<\/p><\/li> <li><p>ELK stack<\/p><\/li> <li><p>Prometheus<\/p><\/li> <li><p>Salt Stack<\/p><\/li> <li><p>AWS<\/p><\/li> <li><p>Ability to speak English fluently (written and communication skills at B2 level or higher is a must)<\/p><\/li> <\/ul> <h4><strong>This would make it easier\\u2026<\/strong><\/h4> <ul> <li><p>Pricing knowledge and an IT background<\/p><\/li> <li><p>CPQ experience<\/p><\/li> <li><p>SaaS experience<\/p><\/li> <\/ul> <h4><strong>Other job specifics...<\/strong><\/h4> <ul> <li><p>After fully completed training, we will expect you to help us with the weekend standby duties. The rotation basis is approx. once a month including other Site Reliability Engineers<\/p><\/li> <li><p>Applicants need to have permission to live and work in the Czech Republic (we do not provide any assistance with work permit transcript)\\u202f<\/p><\/li> <li><p>We offer full-time employment contract (part-time or freelance cooperation is not possible for this role)\\u202f<\/p><\/li> <li><p>We are looking for people to work on-site after a lift of current restrictions (under normal circumstances, this role is not a remote one, although the home office is possible upon agreement)\\u202f<\/p><\/li> <li><p>We require a clean criminal record<\/p><\/li> <\/ul> <h4><strong>Location<\/strong><\/h4> <ul> <li><p>Czech Republic \\u2013 Prague \/ Hradec Kr\\u00e1lov\\u00e9 \/ Ostrava<\/p><\/li> <\/ul> <h4><strong>What will you love about us?<\/strong><\/h4> <ul> <li>Your opinion matters here. You can build something new together with our cooperative worldwide team.<\/li> <li>You will be given your space and a chance to bring your ideas to life while working within a flexible environment.<\/li> <li>We will allow you to bring your own working equipment by providing an <strong>option of a monthly allowance<\/strong> instead of pre-selected working tools (notebook, cell phone)<\/li> <li>Bring your ideas to life while working within a flexible environment. We value collaboration, teamwork, and inspiration.<\/li> <li>Once a year, Pricefx-ers from around the globe gather in another Country to celebrate. We work (and play) hard throughout the year. So, our All Hands is the perfect time to meet face to face with disjointed voices you've had many meetings with over the phone, plan for the year ahead, but most importantly get to know each other better in a fun and relaxing atmosphere.<\/li> <li>We now offer an additional day off during your birthday month and on your anniversary month at years 3, 5, 8, 10. In your anniversary years, we also provide a special token of our Pricefx appreciation.<\/li> <li>Our offices are exceptional in the look and the atmosphere, but <strong>you can also work from home or in a park<\/strong>.<\/li> <li>And you do get over-standard benefits, holidays, sick days etc.<\/li> <\/ul> <p><strong>IN CASE YOU ARE INTERESTED, PLEASE MAKE SURE TO SEND US YOUR <u>CV IN ENGLISH LANGUAGE<\/u>.\\u202f<\/strong><\/p> <p>By applying, I confirm that I acknowledge and understand howPricefxprocesses my personal data as per information in\\u202f<a href=\\\"https%3A%2F%2Fpricefx.atlassian.net%2Fwiki%2Fspaces%2FUNI%2Fpages%2F589561897%2FGDPR%2BInformation%2Bfor%2BCandidates%2B-%2BJobScore\\\" target=\\\"_blank\\\">GDPR for Candidates<\/a>.<\/p>\"}"
}