{
    "id":"Kaggle::techmap::6155e550c3a99e7015a50f99::linkedin_ro::0",
    "label_age":true,
    "analysis_age":"\" a young professional. recently graduated\" introduces bias against older candidates",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Requirements. Are you passionate about finance? Do you want to learn and grow alongside a team of professionals? You could be a perfect fit for METRO Cash & Carry Romania as an Intern. Finance Department. To Be Successful In This Role, You Will Need. To enjoy your morning coffee with great colleagues. Strong analytical and communication skills. Solution and result-oriented mindset. Eagerness to learn business form the best professionals. To be a young professional. recently graduated with a master's degree from university or student in the final year, preferably in the field of Economics. Fluency in English (preferably). Computer literacy (MS Office: Excel, Word, PowerPoint). Project based extracurricular activities are a plus. Responsibilities. Join us as and you will: Offer support on specific activities related to the department processes with prior clear guidance from our experienced colleagues (updating data, managing contracts & documents normal flow, etc. ). Manage small projects based on your skills, experience and knowledge. Collaborate with the other departments within the company in order to collect the necessary information. What do you get in return? You'll be supported by a professional and driven team. Paid internship. Flexible contract (part-time\/full-time). Training-on-the-job opportunities, learn business from the best. Experience the real multinational business environment. Opportunities to use your knowledge and deep dive in business practice. Opportunities, based on performance, to be invited to join our team. Cross-function and close interaction with other departments. Network with key people of an employer of choice, discover inspirational pathways open by role models. Friday is a half work day (ends at around 14:30).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155e550c3a99e7015a50f99::linkedin_ro\", \"source\": \"linkedin_ro\", \"country\": \"RO\", \"company\": \"METRO Romania\", \"position\": \"Internship - Finance Department\", \"notes\": \"\", \"original\": \"<strong><u>Requirements<br><br><\/u><\/strong>Are you passionate about finance? Do you want to learn and grow alongside a team of professionals? You could be a perfect fit for METRO Cash &amp; Carry Romania as an Intern - Finance Department.<br><br><strong><u>To Be Successful In This Role, You Will Need<br><\/u><\/strong><ul><li>To enjoy your morning coffee with great colleagues<\/li><li>Strong analytical and communication skills<\/li><li>Solution and result-oriented mindset<\/li><li>Eagerness to learn business form the best professionals<\/li><li>To be a young professional - recently graduated with a master's degree from university or student in the final year, preferably in the field of Economics<\/li><li>Fluency in English (preferably)<\/li><li>Computer literacy (MS Office: Excel, Word, PowerPoint)<\/li><li>Project based extracurricular activities are a plus<br><\/li><\/ul><strong><u>Responsibilities<br><br><\/u><\/strong>Join us as and you will:<br><ul><li>Offer support on specific activities related to the department processes with prior clear guidance from our experienced colleagues (updating data, managing contracts &amp; documents normal flow, etc.)<\/li><li>Manage small projects based on your skills, experience and knowledge<\/li><li>Collaborate with the other departments within the company in order to collect the necessary information<br><\/li><\/ul>What do you get in return?<br><ul><li>You'll be supported by a professional and driven team<\/li><li>Paid internship<\/li><li>Flexible contract (part-time\/full-time)<\/li><li>Training-on-the-job opportunities, learn business from the best<\/li><li>Experience the real multinational business environment<\/li><li>Opportunities to use your knowledge and deep dive in business practice<\/li><li>Opportunities, based on performance, to be invited to join our team<\/li><li>Cross-function and close interaction with other departments<\/li><li>Network with key people of an employer of choice, discover inspirational pathways open by role models<\/li><li>Friday is a half work day (ends at around 14:30)<\/li><\/ul>\"}"
}