{
    "id":"Kaggle::techmap::6137999e5516797c4451f665::reed_uk::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Operations Manager EU\/UK. €120, 000 - €150, 000. Germany or Amsterdam. The Role. Our Client is looking for an Operations Manager who will can start-up, operate and monitor different hydrogen production and refuelling facilities in Europe. As part of a small team the Operations Manager will roll out the heavy-duty network whilst also managing the ever-changing market conditions and range of stakeholders. Responsibilities include: Operations and maintenance. Operational excellence. Customer facing. Support operations in Europe. Trouble shooting and root cause analysis. Implementation of monitoring tools and technical monitoring. Management of team. Plan, prepare, coordinate, supervise and close out maintenance activities and temporary repairs. Occasionally execute corrective and preventive maintenance tasks according to HSSE requirements and procedures for mechanical defects as assigned. Support flawless handover process from projects to operation particularly during commissioning. Operational engineering. Support delivery of HSE audits of operational assets. Support evaluation of vendor documentation, identify gaps and drive improvement process. Support development Process control diagrams & factory acceptance tests. The Person. Essential: Must have extensive experience in an operational role. Must have extensive experience in either chemicals or refineries. Skill in operational day to day support and troubleshooting. Asset framework. Development of process control. Cradle to grave project management. Maintenance planning and execution. Management and change process experience. Pressure Systems Safety experience. ESP process experience including operation and maintenance. Excellent report writing skills. Excellent communication skills with stakeholders of all levels. Self-starter who can come in and hit the ground running. Out of the box thinking. Ambitious, driven. Desirable: Extensive hydrogen experience. Multilingual (English, German & Dutch). Cooling systems and rotating equipment experience. The Package. €120, 000 - €150, 000. Bonus. 25 days holiday + banks. Pension.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137999e5516797c4451f665::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Go Green Recruitment\", \"position\": \"Operations Manager\", \"notes\": \"\", \"original\": \"<p><strong>Operations Manager EU\/UK<\/strong><\/p> <p><strong>\\u20ac120,000 - <\/strong><strong>\\u20ac150,000<\/strong><\/p> <p><strong>Germany or Amsterdam<\/strong><\/p> <p><strong>The Role<\/strong><\/p> <p>Our Client is looking for an Operations Manager who will can start-up, operate and monitor different hydrogen production and refuelling facilities in Europe. As part of a small team the Operations Manager will roll out the heavy-duty network whilst also managing the ever-changing market conditions and range of stakeholders. Responsibilities include:<\/p> \\n<ul> \\n <li>Operations and maintenance<\/li>\\n <li>Operational excellence<\/li>\\n <li>Customer facing<\/li>\\n <li>Support operations in Europe<\/li>\\n <li>Trouble shooting and root cause analysis<\/li>\\n <li>Implementation of monitoring tools and technical monitoring<\/li>\\n <li>Management of team<\/li>\\n <li>Plan, prepare, coordinate, supervise and close out maintenance activities and temporary repairs<\/li>\\n <li>Occasionally execute corrective and preventive maintenance tasks according to HSSE requirements and procedures for mechanical defects as assigned<\/li>\\n <li>Support flawless handover process from projects to operation particularly during commissioning<\/li>\\n <li>Operational engineering<\/li>\\n <li>Support delivery of HSE audits of operational assets<\/li>\\n <li>Support evaluation of vendor documentation, identify gaps and drive improvement process<\/li>\\n <li>Support development Process control diagrams &amp; factory acceptance tests<\/li>\\n<\/ul> <p><strong>The Person<\/strong><\/p> <p>Essential:<\/p> \\n<ul> \\n <li>Must have extensive experience in an operational role<\/li>\\n <li>Must have extensive experience in either chemicals or refineries<\/li>\\n <li>Skill in operational day to day support and troubleshooting<\/li>\\n <li>Asset framework<\/li>\\n <li>Development of process control<\/li>\\n <li>Cradle to grave project management<\/li>\\n <li>Maintenance planning and execution<\/li>\\n <li>Management and change process experience<\/li>\\n <li>Pressure Systems Safety experience<\/li>\\n <li>ESP process experience including operation and maintenance<\/li>\\n <li>Excellent report writing skills<\/li>\\n <li>Excellent communication skills with stakeholders of all levels<\/li>\\n <li>Self-starter who can come in and hit the ground running<\/li>\\n <li>Out of the box thinking<\/li>\\n <li>Ambitious, driven<\/li>\\n<\/ul> <p>Desirable:<\/p> \\n<ul> \\n <li>Extensive hydrogen experience<\/li>\\n <li>Multilingual (English, German &amp; Dutch)<\/li>\\n <li>Cooling systems and rotating equipment experience<\/li>\\n<\/ul> <p><strong>The Package<\/strong><\/p> \\n<ul> \\n <li>\\u20ac120,000 - \\u20ac150,000<\/li>\\n <li>Bonus<\/li>\\n <li>25 days holiday + banks<\/li>\\n <li>Pension<\/li>\\n<\/ul>\"}"
}