{
    "id":"Kaggle::techmap::61439887ba4e357d50001f52::seek_au::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":"The mention of the employee group \"EAGLE (Employees at Alcoa for Gay, Lesbian, bisexual and transgender Equality)\" demonstrates inclusivity and support for LGBTQ+ employees, which is a positive aspect of the job description.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Performance related bonus (variable). Industry leading superannuation. Industry leading parental leave scheme. Paid annual volunteer hours. Employee Assistance Program. Novated car lease scheme. Employee groups including the Social Club, Alcoa Womens Network and EAGLE (Employees at Alcoa for Gay, Lesbian, bisexual and transgender Equality). Applications close. Wednesday 22nd September 2021. Please note that no agency applications will be accepted at this time. Additional information. You will only be contacted if you are shortlisted for an interview, this process can take up to four weeks from the closing date. This position is available only to permanent Australian residents or applicants who hold the relevant Visa with authority to work in Australia. Please ensure this information is clearly stated on your application. LI-CW1.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61439887ba4e357d50001f52::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Alcoa\", \"position\": \"Occupational Hygiene Technician\", \"notes\": \"\", \"original\": \"<p>Just as aluminium is the element of possibility, so too, are our current and future employees. When you join Alcoa, you have the opportunity to help define what it means to be a sustainable aluminum company. Our 135-year legacy gives you the systems and tools to thrive. We invented the industry and today we are redefining what it means to be a sustainable aluminum company from mines to metal. We are open, honest, accountable and do what we say we\\u2019ll do. We relentlessly pursue outstanding and sustainable results and creatively transform ideas into value. We treat all people with dignity and provide a diverse, inclusive work culture. We work safely, promote wellness, and protect the environment. Come grow your career, collaborate on a global scale and deliver materials essential to the world. Learn more about the endless career possibilities for you at Alcoa!\\u00a0<\/p><p>Alcoa Australia, seeks to employ talented, enthusiastic and diverse people. We want curious minds and aspiring change-makers to work with us to create the future. We provide some of the most unique technical challenges in our industry and we are committed to achieving world\\u2019s best practice through our values - Act with Integrity, Operate with Excellence, and Care for People. And with our operations located near major metropolitan and regional centres, our employees travel home after every shift. We respect work-life balance.<\/p><p>Alcoa\\u2019s Australian operations represent one of the world\\u2019s largest integrated bauxite mining, alumina refining and aluminium smelting systems and add value to Australia\\u2019s local, state and national economies at every stage. Our Australian operations support approximately 4,370 direct jobs including multiple entry talent pathways\/programs, predominantly in regional Western Australia. Operations include: our world-class Technology Development Centre of Excellence (COE), two bauxite mines in Western Australia (Huntly and Willowdale); three alumina refineries in Western Australia (Kwinana, Pinjarra and Wagerup); one aluminium smelter in Victoria (Portland); two dedicated port facilities in Western Australia (Kwinana and Bunbury); and two Alcoa Farmlands sites in Western Australia (Pinjarra and Wagerup).<\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><strong>About the opportunity<\/strong><\/p><p>An exciting opportunity exists at Alcoa's Kwinana Refinery for an Occupational Hygiene Technician to join the WA Operations, Health &amp; Safety team. The Occupational Hygiene Technician works under the direction of the site Hygienist and is responsible for carrying out the site exposure monitoring and assessment program to enable effective identification, evaluation and control of work-place exposures.<\/p><p><\/p><p>You will be required to produce reports and communicate your findings based on the sampling, analysis and interpretation of the results that you've acquired. The data collected and information prepared is used to uphold Alcoa's values in the area of environment, health and safety and to comply with corporate EHS policies, standards and legislation.<\/p><p><\/p><p><strong>About you<\/strong><\/p><p>To play a part in our ongoing success we are seeking someone with:<\/p><ul><li><p>Experience within a heavy industrial\/mining environment<\/p><\/li><li><p>Occupational exposure monitoring experience across a wide range of stressors<\/p><\/li><li><p>Ability to complete structured work within the requisite time frames<\/p><\/li><li><p>Capability to self-manage Occupational Hygiene and Health related projects when required<\/p><\/li><li><p>Experience within in a NATA accredited Laboratory<\/p><\/li><li><p>WA DMIRS CONTAM Registered Sampler<\/p><\/li><li><p>WA Registered Noise Officer<\/p><\/li><li><p>Membership with the Australian Institute of Occupational Hygiene<\/p><\/li><li><p>Tertiary qualification in science or health related field is favourable, but not essential<\/p><\/li><\/ul><p><\/p><p>Ideally, we are looking for a self-starter with excellent interpersonal skills and the ability to communicate to all levels of the business. We are looking for a motivated individual with excellent analytical and problem-solving skills with proven ability to interpret complex technical information and data.<\/p><p><\/p><p><strong>Why Alcoa?<\/strong><\/p><p>Our values \\u2013 act with integrity, operate with excellence, care for people \\u2013 are at the foundation of everything we do.<\/p><p><\/p><p>At Alcoa we strive to create an inclusive workplace where employees can bring their whole selves to work regardless of their background.\\u00a0We know it starts and finishes with you, which is why our value \\u2018care for people\\u2019 is so important to us. It\\u00a0ensures\\u00a0not only your physical safety but also provides\\u00a0an inclusive and welcoming workplace for people from all walks of life, encouraging\\u00a0diversity of thought from each and every person.<\/p><p><\/p><p>We embrace change, new ideas and promote a culture of respect and equal opportunity. Our employment programs are underpinned by diversity and equality and continue to be recognised and rewarded. We encourage applications from Aboriginal and Torres Strait Islander peoples, women and LGBTIQ+ job seekers. \\u00a0<\/p><p><\/p><p>As an Alcoa employee, you will embark on growth opportunities and can truly make a difference being part of an organisation that respects and considers flexibility while empowering you with stimulating and challenging work.<\/p><p>Flexible work arrangements may be considered, please let us know when you apply if this is something you are seeking.<\/p><p><\/p><p><strong>What\\u2019s on offer?<\/strong><\/p><ul><li><p>Excellent remuneration package<\/p><\/li><li><p>Monthly Leisure Day<\/p><\/li><li><p>Benefits allowance<\/p><\/li><li><p>Performance related bonus (variable)<\/p><\/li><li><p>Industry leading superannuation<\/p><\/li><li><p>Industry leading parental leave scheme<\/p><\/li><li><p>Paid annual volunteer hours<\/p><\/li><li><p>Employee Assistance Program<\/p><\/li><li><p>Novated car lease scheme<\/p><\/li><li><p>Employee groups including the Social Club, Alcoa Women\\u2019s Network and EAGLE (Employees at Alcoa for Gay, Lesbian, bisexual and transgender Equality)<\/p><\/li><\/ul><p><\/p><p><strong>Applications close<\/strong><br \/>Wednesday 22nd September 2021<\/p><p><\/p><p><em>Please note that no agency applications will be accepted at this time.<\/em><\/p><p><\/p><p><strong>Additional information<\/strong><\/p><ul><li><p>You will only be contacted if you are shortlisted for an interview, this process can take up to four weeks from the closing date.<\/p><\/li><li><p>This position is available only to permanent Australian residents or applicants who hold the relevant Visa with authority to work in Australia. Please ensure this information is clearly stated on your application.<\/p><\/li><\/ul><p><\/p><p>#LI-CW1<\/p>\"}"
}