{
    "id":"Kaggle::techmap::615642757aa49c40310db015::monster_uk::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase 'driven, hungry' suggests a masculine bias",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Production Manager. Permanent. Circa £50, 000. Southampton, Hampshire. Our high technology client in Southampton are seeking a Production Manager from a mid-high-volume manufacturing industry with strong lean manufacturing experience. They require someone with an ability to demonstrate an understanding of technology\/engineering to adapt to being a Production Manager of the Fiber Manufacturing side of their business. Which involves chemical processing (this will be trained) and so this may come from an Engineering \/ Chemical or Science Degree or from working in a similar environment. The business is going through growth with strong investment and this is an area of the business which will grow. They therefore, need a someone with the right attitude. Someone with passion for growth \/ change and Improvement and is able to inspires and drive a team, taking them to new levels and improvement. You will therefore, be a driven, hungry, enthusiastic production manager looking for growth yourself and able to support succession planning, making improvements, recruiting good engineers as well as being a hands-on involved manager. This could be a step up to management or someone who wants a new challenge but, is likely to be someone with more than 5 years strong manufacturing engineering \/ management experience and able to implement change. The role has 12 reports across 2 shifts of which there are 2 Cell Leaders (one for each shift) whom help manage the team of which you are responsible for all. Summary of Responsibilities:.. Lead the Fiber team in a fast-paced high energy environment and demonstrate a sense of urgency and take total ownership for all demands of the section. Be the first line of communication in dealing with all fiber related departmental enquiries, queries and escalations. • Deliver\/exceed the planned departmental metrics, identify future capacity requirements and take full ownership to find resolution. Accountabilities for role include: Fiber production and departmental management:. Safety & Housekeeping. Ensuring the Fiber area runs safely, as safety is a priority within the business. Set, communicate and ensure departmental goals & objectives are met and exceeded safely. Challenge the existing KPI’s and develop new KPI’s to include but not be limited to, Fiber that is supplied to third party businesses..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615642757aa49c40310db015::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"GERRELL & HARD LIMITED\", \"position\": \"Production Manager\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Production Manager <br>Permanent <br>Circa \\u00a350,000 <br>Southampton, Hampshire <br> <br>Our high technology client in Southampton are seeking a Production Manager from a mid-high-volume manufacturing industry with strong lean manufacturing experience. They require someone with an ability to demonstrate an understanding of technology\/engineering to adapt to being a Production Manager of the Fiber Manufacturing side of their business; which involves chemical processing (this will be trained) and so this may come from an Engineering \/ Chemical or Science Degree or from working in a similar environment. <br> <br>The business is going through growth with strong investment and this is an area of the business which will grow. They therefore, need a someone with the right attitude; someone with passion for growth \/ change and Improvement and is able to inspires and drive a team, taking them to new levels and improvement. You will therefore, be a driven, hungry, enthusiastic production manager looking for growth yourself and able to support succession planning, making improvements, recruiting good engineers as well as being a hands-on involved manager. <br> <br>This could be a step up to management or someone who wants a new challenge but, is likely to be someone with more than 5 years strong manufacturing engineering \/ management experience and able to implement change. <br> <br>The role has 12 reports across 2 shifts of which there are 2 Cell Leaders (one for each shift) whom help manage the team of which you are responsible for all. <br> <br>Summary of Responsibilities: <br>\\u2022 Provide strategic leadership to achieve key operational objectives in safety, quality, environmental compliance, reliability, production, and cost, in support of our global customer base. <br>\\u2022 Lead the Fiber team in a fast-paced high energy environment and demonstrate a sense of urgency and take total ownership for all demands of the section. Be the first line of communication in dealing with all fiber related departmental enquiries, queries and escalations. <br>\\u2022 Deliver\/exceed the planned departmental metrics, identify future capacity requirements and take full ownership to find resolution. <br> <br>Accountabilities for role include: <br>Fiber production and departmental management: <br>\\u2022 Safety &amp; Housekeeping - Ensuring the Fiber area runs safely, as safety is a priority within the business. <br>\\u2022 Set, communicate and ensure departmental goals &amp; objectives are met and exceeded safely. Challenge the existing KPI\\u2019s and develop new KPI\\u2019s to include but not be limited to, Fiber that is supplied to third party businesses. <br>\\u2022 Clearly set and manage expectations for all reports, meeting and surpassing established Fiber and departmental goals and objectives. <br>\\u2022 Training, development, and management of all Fiber personnel. <br>\\u2022 Monitor and manage the fiber quality through all build stages to ensure the highest sustained fiber yield. <br>\\u2022 Responsible for identification and project management of programs to enhance quality, capacity increases \/ decreases or technical improvements and sustain supply on an agile footing. <br>\\u2022 Lead and be able to raise Capex documentation to support capital development needs specific to fiber improvements or initiatives both inside operations and with Group as necessary. <br>\\u2022 Maintain routine communications with Management of stakeholders within the business. <br>\\u2022 Perform other duties as assigned. <br> <br>Customer &amp; Internal Relationships <br>\\u2022 Develop and maintain effective relationships with all levels of teams through the business. <br>\\u2022 Be accountable for performance against KPI\\u2019s and review weekly with the relevant managers. <br>\\u2022 Handle ad-hoc Fiber demand issues efficiently and effectively. <br> <br>Key Relationships <br>\\u2022 Internal: Heads of Departments; Planning, Engineering, Operations, shipping, IT, Finance, supply chain. <br> <br>Required Experience: <br>\\u2022 The successful candidate will have strong production manager experience within a Lean manufacturing environment. <br>\\u2022 Broad knowledge of the entire Operations Chain with a minimum of 5 years Manufacturing experience. <br>\\u2022 Experience of working closely with commercial functions. <br>\\u2022 Proficient in the use of spreadsheets, word processing software and email <br>\\u2022 Track record of clear man management regarding individuals and teams. <br> <br>Qualifications: <br>\\u2022 Ideally a degree in an Engineering \/ Manufacturing environment. <br>\\u2022 Lean manufacturing experience \/ qualification of relevance. <br> <br>Personal Profile: <br>\\u2022 Excellent communication skills, both verbal and written, with the ability to communicate with external customers, suppliers and staff at all levels. <br>\\u2022 Driven, assertive and demonstrates a strong proactive growth mind set. <br>\\u2022 Capable of discussing and assisting with the resolution of complex issues with a strong analytical approach. <br>\\u2022 Strong man management and coaching skills. <br>\\u2022 Self-motivated, able to work independently and as part of a team. <br>\\u2022 Thorough attention to detail <br>\\u2022 Innovative and proactive self-starter <br>\\u2022 Possess a structured and methodical ability to organize themselves <br>\\u2022 Able to work within a multi-disciplinary team environment. <br>\\u2022 Able to work under pressure <br>\\u2022 Ability to handle multiple tasks methodically and efficiently and meet committed timescales <br>\\u2022 Happy to work in a dynamic environment and adaptable to changes in priorities <br> <br>To apply please send an MS Word formatted version of your CV across for my review and consideration and I will come back to you. <\/div>\"}"
}