{
    "id":"Kaggle::techmap::617168bcbd9bec69a95f2134::monster_ie::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Does not clarify is the weight to lift is aided or unaided. The job description explicitly states that reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. However, it also details physical demands such as climbing ladders, wearing sterile cleanroom garb, and using protective equipment, which could inadvertently exclude individuals with certain physical disabilities from consideration.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Highly motivated with ability to work effectively with multidisciplinary teams or independently. Strong team player. Good proactive approach & manner. Education Required: Bachelors Degree in Engineering, Pharmaceutical Sciences, or related Science discipline. Further qualification (Masters) in related discipline ideal. Experience Required: At least 5 years relevant experience in a pharmaceutical manufacturing environment, with at least 3 years experience in a comparable process engineering\/technical services role. Must have experience working in a sterile manufacturing environment. Ophthalmic manufacturing experience a plus. Experience with many of the following processes: Product introduction and transfer. Cycle time and yield improvement initiatives. Continuous improvement projects. Equipment engineering runs, cycle development, PQ, Eng Runs, Media Fills and PV. Regulatory audit preparation and follow-up. Equipment and component specification. Component preparation. autoclaves, etc. Vial or bottle filling of sterile solutions. Cleaning (CIP\/SIP) and sterilisation technologies. Isolator technology incl. VHP. Compounding. dispensing, formulation, sterile filtration, etc. Primary container closure components. Work Environment\/Hazards and Physical Demands: The physical demands include those required of a normal office position and engineering shop floor support in a cleanroom environment. While performing the duties of this job, the employee is regularly required to use hands to manipulate objects or controls and to sit, talk, see, and hear. The employee is frequently required to reach with hands and arms, stand, walk, and lift or move up to 5kg. The employee is occasionally required to crouch. The employee is occasionally required to climb ladders to access technical areas. The employee must be capable of wearing sterile cleanroom garb in a grade B environment. The employee must be capable of wearing protective and\/or safety equipment as needed. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skills and\/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Travel: The role will typically require infrequent, off site national and international travel, for business or equipment\/project review meetings, including overnight stays, up to 10% of the time. Source: Aerie Pharmaceuticals.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::617168bcbd9bec69a95f2134::monster_ie\", \"source\": \"monster_ie\", \"country\": \"IE\", \"company\": \"Aerie Pharmaceuticals\", \"position\": \"Process Engineer - Tech Transfer - Contract role\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div><\/div> <div> <p><strong>Process Engineer&nbsp;<\/strong><\/p> <div> <br> <\/div> <\/div> <div> The Process Engineer provides technical support and expertise in the build-out, equipment procurement, commissioning, validation, and tech-transfer activities associated with the operation of the Aerie Ireland manufacturing facility. &nbsp; The Process Engineer will provide key technical support in the areas of process control, manufacturing process troubleshooting, process optimization, process development, and product transfer. &nbsp;The Process Engineer will report to the Technical Services Manager. &nbsp;&nbsp; <\/div> <div> <br> <\/div> <div> <strong><u>Essential Duties, Functions and Responsibilities:<\/u><\/strong> <\/div> <ul> <li>Works with manufacturing and quality colleagues as part of an Operations team whose shared goal is to realise the safety, quality, delivery and cost objectives of the site.<\/li> <li>Prioritises safety and is diligent in the use of all appropriate safety tools and permits when maintaining equipment - champions safe working always.<\/li> <li>Will program manage and technically lead receiving site activities necessary for the successful transfer of Aerie's new products onto the Athlone site via a structured and compliant NPI (new product introduction) process.<\/li> <li>Will prepare site process descriptions by developing a PCS (process control strategy) for the processes and in identifying and agreed with Quality the process CPPs (Critical Process Attributes) and CQA (Critical Quality Attributes) for Aerie's products.<\/li> <li>Provides technical support for product PPRs (Periodic Product Review)<\/li> <li>Is the process SME for the compounding and filling process and supports manufacturing and maintenance in the operation and maintenance of these systems.<\/li> <li>Supports manufacturing by leading\/supporting deviation investigations, and is familiar with structured problem solving and root cause analysis<\/li> <li>Supports validation activity in process manufacturing areas.<\/li> <li>Leads continuous improvement projects and initiatives and is owner of yield performance and cycle time improvement.<\/li> <li>Provides training and mentoring to build technical capabilities among teams.&nbsp;<\/li> <li>Supports capital projects throughout equipment lifecycle.<\/li> <\/ul> <div> <br> <\/div> <div> Aerie Pharmaceuticals is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. <\/div> <br> <br> <div> <strong><u>Skills\/Knowledge Required:<\/u><\/strong> &nbsp; <\/div> <ul> <li>Strong technical knowledge of aseptic manufacturing techniques, procedures and theory.<\/li> <li>Knowledge of best practices in pharmaceutical product development, scale-up and technology transfer.<\/li> <li>Specific knowledge of sterile pharmaceutical manufacturing processes and technologies.<\/li> <li>Strong analytical skills, documentation skills and research skills.<\/li> <li>Very strong problem-solving skills, ideally using formal tools e.g. FMEA.<\/li> <li>Strong understanding of pharmaceutical industry regulatory requirements.<\/li> <li>Clear understanding of the needs of cGMP and validation (DQ-PQ).<\/li> <li>DoE knowledge desirable.<\/li> <li>Knowledge of sterilization principles and practices<\/li> <li>Strong communication and interpersonal skills.&nbsp;Highly motivated with ability to work effectively with multidisciplinary teams or independently<\/li> <li>Strong team player.&nbsp;<\/li> <li>Good proactive approach &amp; manner<\/li> <\/ul> <div> <br> <\/div> <div> <strong><u>Education Required<\/u><\/strong><strong>:<\/strong>&nbsp; <\/div> <ul> <li>Bachelors Degree in Engineering, Pharmaceutical Sciences, or related Science discipline.&nbsp;<\/li> <li>Further qualification (Masters) in related discipline ideal.<\/li> <\/ul> <div> <br> <\/div> <div> <strong><u>Experience Required:<\/u><\/strong> <\/div> <ul> <li>At least 5 years relevant experience in a pharmaceutical manufacturing environment, with at least 3 years experience in a comparable process engineering\/technical services role.<\/li> <li>Must have experience working in a sterile manufacturing environment. Ophthalmic manufacturing experience a plus.&nbsp;<\/li> <li>Experience with many of the following processes: <ol> <li>Product introduction and transfer<\/li> <li>Cycle time and yield improvement initiatives<\/li> <li>Continuous improvement projects&nbsp;<\/li> <li>Equipment engineering runs, cycle development, PQ, Eng Runs, Media Fills and PV.&nbsp;<\/li> <li>Regulatory audit preparation and follow-up<\/li> <li>Equipment and component specification<\/li> <li>Component preparation - autoclaves, etc.<\/li> <li>Vial or bottle filling of sterile solutions<\/li> <li>Cleaning (CIP\/SIP) and sterilisation technologies<\/li> <li>Isolator technology incl. VHP<\/li> <li>Compounding - dispensing, formulation, sterile filtration, etc.<\/li> <li>Primary container closure components<\/li> <\/ol><\/li> <\/ul> <div> <br> <\/div> <div> <strong>Work Environment\/Hazards and Physical Demands:<\/strong> <\/div> <div> The physical demands include those required of a normal office position and engineering shop floor support in a cleanroom environment. &nbsp;While performing the duties of this job, the employee is regularly required to use hands to manipulate objects or controls and to sit, talk, see, and hear. &nbsp;The employee is frequently required to reach with hands and arms, stand, walk, and lift or move up to 5kg. &nbsp;The employee is occasionally required to crouch. The employee is occasionally required to climb ladders to access technical areas. The employee must be capable of wearing sterile cleanroom garb in a grade B environment. The employee must be capable of wearing protective and\/or safety equipment as needed. <\/div> <div> <br> <\/div> <div> To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. &nbsp;The requirements listed above are representative of the knowledge, skills and\/or ability required. &nbsp;Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. <\/div> <div> <br> <\/div> <div> <strong>Travel:<\/strong> <\/div> <div> The role will typically require infrequent, off site national and international travel, for business or equipment\/project review meetings, including overnight stays, up to 10% of the time.&nbsp; <\/div> <\/div> <div aria-label=\\\"Aggregated Job Source\\\" class=\\\"descriptionstyles__SourceHolder-sc-13ve12b-9 hkVglg\\\"> <!-- -->Source<!-- -->: <!-- -->Aerie Pharmaceuticals <\/div>\"}"
}