{
    "id":"Kaggle::techmap::6137a79061fb3d1710fad589::reed_uk::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Interim Treasury and Banking Specialist - Ascot. Are you able to offer recent experience of working in a senior Treasury or Banking role, and ready to seek a new challenge? We are delighted to be supporting our International IT client, near Ascot, with the recruitment of an Interim Treasury and Banking Specialist, to support the finance team with a period of transformation, change and recent systems implementation for 3-6 months. You will ideally have recent, and varied experience within the Treasury\/Banking field, and be able to work independently in a fast-paced environment. This is an exceptional role, where you will add value from day 1, to work on a backlog of transactions and support this hard-working International finance team through an exceptionally busy time. The successful Interim Treasury and Banking Specialist, will support the wider Treasury and Banking team of 4, and you will be responsible for:. Identifying areas that need additional support and resource and advising where needed. Extensive cash allocations and Multi-currency bank reconciliations daily. Identifying any errors or discrepancies and resolving these swiftly and effectively. Perform daily banking transactions within both Sterling and Euro's and US Dollars. Providing month-end reports for senior managers. Support the wider finance team with all cash allocations. Daily banking activities and identifying any issues as and when required. Performing daily bank reconciliations. The successful Treasury and Banking Assistant will offer:.. Recent experience of working in a similar role, but ready for the next step up. The ability to work in an ever-changing, complex, International business. Strong communication skills as well as superb IT skills (Excel, Word, and SAP preferably). This is an exceptional opportunity to join an award-winning, recognisable brand, based in Ascot as an Interim Treasury and Banking Specialist. where currently they are all working in the office 5 days per week, so ideally you will be happy to be office based for some of the contract. Please do get in touch for further details of this superb interim Treasury and Banking role for a leading International organisation. By applying you will be registered as a candidate with Gleeson Recruitment Limited. Our Privacy Policy is available on our website and explains how we will use your data.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137a79061fb3d1710fad589::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Gleeson Recruitment Group\", \"position\": \"Interim Treasury and Banking Specialist\", \"notes\": \"\", \"original\": \"<p><strong>Interim Treasury and Banking Specialist - Ascot<\/strong><\/p> <p>Are you able to offer recent experience of working in a senior Treasury or Banking role, and ready to seek a new challenge? We are delighted to be supporting our International IT client, near Ascot, with the recruitment of an Interim Treasury and Banking Specialist, to support the finance team with a period of transformation, change and recent systems implementation for 3-6 months.<\/p> <p>You will ideally have recent, and varied experience within the Treasury\/Banking field, and be able to work independently in a fast-paced environment. This is an exceptional role, where you will add value from day 1, to work on a backlog of transactions and support this hard-working International finance team through an exceptionally busy time.<\/p> <p>The successful Interim Treasury and Banking Specialist, will support the wider Treasury and Banking team of 4, and you will be responsible for:<\/p> <p>- Identifying areas that need additional support and resource and advising where needed<\/p> <p>- Extensive cash allocations and Multi-currency bank reconciliations daily<\/p> <p>- Identifying any errors or discrepancies and resolving these swiftly and effectively<\/p> <p>- Perform daily banking transactions within both Sterling and Euro's and US Dollars<\/p> <p>- Providing month-end reports for senior managers<\/p> <p>- Support the wider finance team with all cash allocations<\/p> <p>- Daily banking activities and identifying any issues as and when required<\/p> <p>- Performing daily bank reconciliations<\/p> <p>The successful Treasury and Banking Assistant will offer:<\/p> <p>- Recent experience of working in a larger, corporate organisation<\/p> <p>- Recent experience of working in a similar role, but ready for the next step up<\/p> <p>- The ability to work in an ever-changing, complex, International business<\/p> <p>- Strong communication skills as well as superb IT skills (Excel, Word, and SAP preferably)<\/p> <p>This is an exceptional opportunity to join an award-winning, recognisable brand, based in Ascot as an Interim Treasury and Banking Specialist - where currently they are all working in the office 5 days per week, so ideally you will be happy to be office based for some of the contract. Please do get in touch for further details of this superb interim Treasury and Banking role for a leading International organisation.<\/p> <p>By applying you will be registered as a candidate with Gleeson Recruitment Limited. Our Privacy Policy is available on our website and explains how we will use your data.<\/p>\"}"
}