{
    "id":"Kaggle::techmap::61450d50728f7f05735fe25e::simplyhired_uk::11",
    "label_age":true,
    "analysis_age":"The emphasis on 'recent graduates or students' is biased against older people.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"We are seeking Civil Engineers and Technicians at all levels in each of our offices in BRISTOL, LONDON AND EXETER who enjoy: Being part of a small, friendly, and sociable team and working with colleagues across disciplines. Working for a manager who supports their development and overall wellbeing. Working on a wide range of projects across various sectors from small to flagship projects in the UK and internationally. A blend of home and office working to allow for good work\/life balance. A competitive salary. A range of benefits including pension scheme, life assurance, shopping discounts, subsidised social events, and option to purchase additional holidays. In particular for or recent graduates or junior technicians. exposure to a broad range of projects and at all stages from inception through to completion, allowing swift development of a commercial and client focused mindset. Our range of public and private sector projects includes residential housing schemes, waste facilities and general civil engineering projects. Our requirements: Civil Engineering Masters or Bachelors degree OR qualified through experience OR currently studying towards qualification. Working knowledge of Civils 3d, WINDES and AutoCAD. Experience of drainage design, highway horizontal and vertical alignment design, highway materials and specification, ground conditions, earthworks, and specification. Experience in gaining consents, planning application and approvals processes (S278, S38, S104, etc). Able to communicate effectively with clients, architects, contractors, and regulatory \/ statutory authorities to deliver detailed designs. More experienced Engineers will also enjoy encouraging and guiding more junior members of staff as we continue to grow. And working collaboratively across engineering disciplines. Recent graduates or students should keen to benefit from working in a multi-disciplinary environment and to assume responsibility as experience develops. Our annual staff survey has shown year on year improvements in management and wellbeing, which we believe reflects our ‘family’ culture. We’re proud that employees often choose to return to work with us again, having worked elsewhere. If this sounds like you, please forward your CV and covering letter. Clarkebond are committed to equal opportunities in employment. At Clarkebond we want candidates to feel confident to ask about the flexibility they need. Any candidate who applies for a job with us can ask us about the flexibility at interview. In return, we’ll explore what’s possible.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61450d50728f7f05735fe25e::simplyhired_uk\", \"source\": \"simplyhired_uk\", \"country\": \"UK\", \"company\": \"Clarkebond UK limited\", \"position\": \"Civil Engineers and Technicians\", \"notes\": \"\", \"original\": \"<p>We are seeking Civil Engineers and Technicians at all levels in each of our offices in BRISTOL, LONDON AND EXETER who enjoy:<\/p><ul><li>Being part of a small, friendly, and sociable team and working with colleagues across disciplines<\/li><li>Working for a manager who supports their development and overall wellbeing<\/li><li>Working on a wide range of projects across various sectors from small to flagship projects in the UK and internationally<\/li><li>A blend of home and office working to allow for good work\/life balance<\/li><li>A competitive salary<\/li><li>A range of benefits including pension scheme, life assurance, shopping discounts, subsidised social events, and option to purchase additional holidays.<\/li><li>In particular for or recent graduates or junior technicians - exposure to a broad range of projects and at all stages from inception through to completion, allowing swift development of a commercial and client focused mindset. Our range of public and private sector projects includes residential housing schemes, waste facilities and general civil engineering projects.<\/li><\/ul><p>Our requirements:<\/p><ul><li>Civil Engineering Masters or Bachelors degree OR qualified through experience OR currently studying towards qualification<\/li><li>Working knowledge of Civils 3d, WINDES and AutoCAD<\/li><li>Experience of drainage design, highway horizontal and vertical alignment design, highway materials and specification, ground conditions, earthworks, and specification<\/li><li>Experience in gaining consents, planning application and approvals processes (S278, S38, S104, etc).<\/li><li>Able to communicate effectively with clients, architects, contractors, and regulatory \/ statutory authorities to deliver detailed designs.<\/li><\/ul><p>More experienced Engineers will also enjoy encouraging and guiding more junior members of staff as we continue to grow; and working collaboratively across engineering disciplines.<\/p><p>Recent graduates or students should keen to benefit from working in a multi-disciplinary environment and to assume responsibility as experience develops. We also support apprenticeships up to Degree Apprenticeship level and may consider support towards continued studies for the right candidate.<\/p><p>Our annual staff survey has shown year on year improvements in management and wellbeing, which we believe reflects our \\u2018family\\u2019 culture. We\\u2019re proud that employees often choose to return to work with us again, having worked elsewhere.<\/p><p>If this sounds like you, please forward your CV and covering letter.<\/p><p>Clarkebond are committed to equal opportunities in employment.<\/p><p>At Clarkebond we want candidates to feel confident to ask about the flexibility they need. Any candidate who applies for a job with us can ask us about the flexibility at interview. In return, we\\u2019ll explore what\\u2019s possible. Flexible working will vary depending on a number of factors including the role within the company, however, guiding principles are based on 60\/40 split between office\/home.<\/p><p>Reference ID: CIVILSALL<\/p><p>Part-time hours: 20-37.5 per week<\/p><p>Job Types: Full-time, Part-time, Permanent<\/p><p>Salary: \\u00a323,500.00-\\u00a345,000.00 per year<\/p><p>Benefits:<\/p><ul><li>Additional leave<\/li><li>Casual dress<\/li><li>Company pension<\/li><li>Flexible schedule<\/li><li>Life insurance<\/li><li>On-site parking<\/li><li>Referral programme<\/li><li>Sick pay<\/li><li>Store discounts<\/li><li>Wellness programmes<\/li><li>Work from home<\/li><\/ul><p>Schedule:<\/p><ul><li>Monday to Friday<\/li><\/ul><p>COVID-19 considerations:<br \/>COVID working guidelines are in place in our offices (social distancing, mask wearing when moving around, hand washing, ventilation) as well as a blended approach allowing 60\/40 split between office and home working.<\/p><p>Work remotely:<\/p><ul><li>No<\/li><\/ul>\"}"
}