{
    "id":"Kaggle::techmap::6149bc6f5a239b13176c617f::monster2_es::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"Specifically targeting native speakers will exclude those with a sufficiently high level of the language but from a different background",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"Competitive salary\" - this has been shown to decrease diversity in the candidate pool.",
    "verified":true,
    "synthetic":false,
    "text":" You will be a pro-active self-starter with a naturally engaging demeanor and confidence in communicating with clients at senior levels. A We are looking for a native Spanish and\/or Portuguese speaker, or you have strong bilingual skills in those languages plus a professional level of English. Furthermore, you are willing to work during Mexican\/Brazilian business hours, What Snow can offer:At Snow we have Spirit! Snow Spirit to be exact a€ the values that enable us to Delivery Brilliance and be All In For The Win! A At Snow, we can offer you a competitive base salary with an attractive commission structure, ticket restaurant, private health insurance, flexible working hours, and great career development opportunities. This is a permanent position within our dynamic and multicultural sales team, based in Barcelona. Additional InformationCome and be part of Snowa€s journey delivering the first fully integrated SAM as a Service Platform in collaboration with our Partners. This is a chance for you to join a challenging and inspiring environment where you will have the possibility to make a daily impact. Every day you will work alongside helpful and down-to-earth colleagues who are dedicated and ambitious. Together we create an innovative environment that drives Snow forward. We are looking forward to your application.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6149bc6f5a239b13176c617f::monster2_es\", \"source\": \"monster2_es\", \"country\": \"ES\", \"company\": \"Snow Software\", \"position\": \"Business Development Representative\", \"notes\": \"\", \"original\": \"Company Description<em>Snow\\u00e2\\u20ac\\u2122s mission is to stop organizations overpaying for the software they use, today and tomorrow. We help organizations optimize software availability, compliance and cost savings through delivery of on premise and cloud-based Software Asset Management solutions. Today we are the largest and most successful dedicated developer of SAM solutions with staff all over the world in regional locations. To sustain our explosive growth, we are looking for the brightest, and most highly-skilled people who have their best work ahead of them. Now is the right time to join Snow.<\/em>Job DescriptionWhat you\\u00e2\\u20ac\\u2122ll be doingIn this role, you have responsibility for driving top funnel sales activities for the Latam sales team.The primary focus of a Business Development Representative is to identify potential new customers and sales opportunities in new accounts and identify cross-sell opportunities in existing accounts.You will be reporting to the Business Development Manager.Key responsibilities:Utilizing tools at your disposal to identify and target qualified leads. Finding the right person within the right business, with the right interest.Follow up on market leads \\u00e2\\u20ac\\u201c proactively calling, emailing and connecting with prospects to arrange sales meetings.Often being the first voice of Snow Software a customer will hear- you will build rapport with C-Level executives offering an engaging consultative approach to your selling.Work closely with the field sales team to meet and exceed metrics and targets.Continually develop your knowledge and skills to become subject matter experts.QualificationsMore about you:Are you a natural superstar with passion and fire in your belly?\\u00c2&nbsp; Do you have grit and tenacity and are just looking for the right role to get your teeth into? Here at Snow, we are recruiting for an energetic Business Development Representative to join our internationally focused sales team based in Spain. Dedicated to the Latin American (LATAM) market and connecting with prospects at the C level, you will be responsible for driving top-funnel new business for the field sales team across Enterprise, Corporate, and Territory accounts.Using your natural gift for problem-solving, information gathering, and market research you will identify potential new customers and sales opportunities, as well as cross-selling and upselling on existing accounts.You will have passion, drive, and the discipline to succeed in your DNA! You will be a pro-active self-starter with a naturally engaging demeanor and confidence in communicating with clients at senior levels.\\u00c2&nbsp;We are looking for a native Spanish and\/or Portuguese speaker, or you have strong bilingual skills in those languages plus a professional level of English. Furthermore, you are willing to work during Mexican\/Brazilian business hours,What Snow can offer:At Snow we have Spirit! Snow Spirit to be exact \\u00e2\\u20ac\\u201c the values that enable us to Delivery Brilliance and be All In For The Win!\\u00c2&nbsp;At Snow, we can offer you a competitive base salary with an attractive commission structure, ticket restaurant, private health insurance, flexible working hours, and great career development opportunities.This is a permanent position within our dynamic and multicultural sales team, based in Barcelona.Additional InformationCome and be part of Snow\\u00e2\\u20ac\\u2122s journey delivering the first fully integrated SAM as a Service Platform in collaboration with our Partners. This is a chance for you to join a challenging and inspiring environment where you will have the possibility to make a daily impact. Every day you will work alongside helpful and down-to-earth colleagues who are dedicated and ambitious. Together we create an innovative environment that drives Snow forward.We are looking forward to your application.\"}"
}