{
    "id":"Kaggle::techmap::614838f0d8e42e2c4b8d5cf9::headhunter_ua::0",
    "label_age":true,
    "analysis_age":"\"Be a graduate of bachelors or masters degree (not earlier than a year of 2017)\" this is explicitly biased against those who graduated before 2017.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  . ,  . UFLP PROGRAM IS NOW OPEN FOR APPLICATIONS! We are looking for applicants for the legendary Unilever Future Leaders Program in the Customer Development, Supply Chain and Marketing functions. Unilever is where you can make your goal come true through projects, creating a better business and a better world. The Unilever Future Leaders Program is dedicated to developing Tomorrow's Leaders and Future Makers. You will work with over 400 brands which are loved by people all over the world, launch innovations that will allow our business to win and grow, you will learn from business leaders and colleagues to get better. WHO ARE WE LOOKING FOR? We are looking for the bright talents with disruptive ideas who will question and challenge the status quo and find better solutions to business problems. This is how we maintain our leadership in the market. by attracting people with fresh ideas. UFLP IS: 2, 5 years of experiences and rotations within not only the function you choose, but also cross-functional projects. Deep dive into strategic tasks, where you will be able to boost your business acumen. A Mentor who will guide you through skills you get on the program, to build a better journey through unique experiences. A flexible learning program, where besides your functional agenda, you will also tailor customized development plan, including such skills as leadership, emotional intelligence, negotiations. Salary of 29 095 gross at the begging of the program and an annual bonus. Agile ways of working, where you will be able to dive into work in a distant format, working from a space which suits best for you. TO APPLY YOU NEED TO: Be a graduate of bachelors or masters degree (not earlier than a year of 2017). Speak English at the upper-intermediate level. Be flexible for business trips during your rotations. Have an ability to work full-time. Have a Ukrainian residency or a permit to work in Ukraine. Be interested in either Customer Development, Marketing or Supply Chain! READY TO APPLY? Visit unileverleaders. com. ua to apply or send your application here. APPLICATION STAGES: Send your application at unileverleaders. com. Take a test. Hold an interview with HR. Visit our Discovery Center for an online assessment. Good luck and we are waiting for you! Leadership Skills. Business communication  ,  , 27.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614838f0d8e42e2c4b8d5cf9::headhunter_ua\", \"source\": \"headhunter_ua\", \"country\": \"UA\", \"company\": \"Unilever\", \"position\": \"UFLP Trainee Customer Development, Marketing, Supply Chain\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u043d\\u0435 \\u0442\\u0440\\u0435\\u0431\\u0443\\u0435\\u0442\\u0441\\u044f<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u0421\\u0442\\u0430\\u0436\\u0438\\u0440\\u043e\\u0432\\u043a\\u0430<!-- -->, <span>\\u043f\\u043e\\u043b\\u043d\\u044b\\u0439 \\u0434\\u0435\\u043d\\u044c<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <p><strong>UFLP PROGRAM IS NOW OPEN FOR APPLICATIONS!<\/strong><\/p> \\n  <p>We are looking for applicants for the legendary Unilever Future Leaders Program in the Customer Development, Supply Chain and Marketing functions.<\/p> \\n  <p>Unilever is where you can make your goal come true through projects, creating a better business and a better world.<\/p> \\n  <p>The Unilever Future Leaders Program is dedicated to developing Tomorrow's Leaders and Future Makers.<\/p> \\n  <p>You will work with over 400 brands which are loved by people all over the world, launch innovations that will allow our business to win and grow, you will learn from business leaders and colleagues to get better.<\/p> \\n  <p> <\/p> \\n  <p><strong>WHO ARE WE LOOKING FOR?<\/strong><\/p> \\n  <p>We are looking for the bright talents with disruptive ideas who will question and challenge the status quo and find better solutions to business problems. This is how we maintain our leadership in the market - by attracting people with fresh ideas.<\/p> \\n  <p> <\/p> \\n  <p><strong>UFLP IS:<\/strong><\/p> \\n  <ol> \\n   <li>2,5 years of experiences and rotations within not only the function you choose, but also cross-functional projects.<\/li> \\n   <li>Deep dive into strategic tasks, where you will be able to boost your business acumen.<\/li> \\n   <li>A Mentor who will guide you through skills you get on the program, to build a better journey through unique experiences.<\/li> \\n   <li>A flexible learning program, where besides your functional agenda, you will also tailor customized development plan, including such skills as leadership, emotional intelligence, negotiations.<\/li> \\n   <li>Salary of 29 095 gross at the begging of the program and an annual bonus.<\/li> \\n   <li>Agile ways of working, where you will be able to dive into work in a distant format, working from a space which suits best for you.<\/li> \\n  <\/ol> \\n  <p><strong>TO APPLY YOU NEED TO: <\/strong><\/p> \\n  <ol> \\n   <li>Be a graduate of bachelor\\u2019s or master\\u2019s degree (not earlier than a year of 2017)<\/li> \\n   <li>Speak English at the upper-intermediate level<\/li> \\n   <li>Be flexible for business trips during your rotations<\/li> \\n   <li>Have an ability to work full-time<\/li> \\n   <li>Have a Ukrainian residency or a permit to work in Ukraine<\/li> \\n   <li>Be interested in either Customer Development, Marketing or Supply Chain!<\/li> \\n  <\/ol> \\n  <p><strong>READY TO APPLY? <\/strong><\/p> \\n  <p>Visit unileverleaders.com.ua to apply or send your application here.<\/p> \\n  <p> <\/p> \\n  <p><strong>APPLICATION STAGES:<\/strong><\/p> \\n  <ol> \\n   <li>Send your application at unileverleaders.com.ua<\/li> \\n   <li>Take a test<\/li> \\n   <li>Hold an interview with HR<\/li> \\n   <li>Visit our Discovery Center for an online assessment<\/li> \\n  <\/ol> \\n  <p>Good luck and we are waiting for you!<\/p>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\\n<div class=\\\"vacancy-section\\\">\\n <h2 data-qa=\\\"bloko-header-2\\\" class=\\\"bloko-header-2\\\">\\u041a\\u043b\\u044e\\u0447\\u0435\\u0432\\u044b\\u0435 \\u043d\\u0430\\u0432\\u044b\\u043a\\u0438<\/h2>\\n <div class=\\\"bloko-spacing-y-5\\\"><\/div>\\n <div>\\n  <div class=\\\"bloko-tag-list\\\">\\n   <div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">\\u0410\\u043d\\u0433\\u043b\\u0438\\u0439\\u0441\\u043a\\u0438\\u0439 \\u044f\\u0437\\u044b\\u043a<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Leadership Skills<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Business communication<\/span>\\n    <\/div>\\n   <\/div>\\n  <\/div>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <h2 data-qa=\\\"bloko-header-2\\\" class=\\\"bloko-header-2\\\">\\u0410\\u0434\\u0440\\u0435\\u0441<\/h2>\\n <div class=\\\"bloko-spacing-y-5\\\"><\/div>\\n <div class=\\\"vacancy-address-text\\\" data-qa=\\\"vacancy-address-with-map\\\">\\n  <span data-qa=\\\"vacancy-view-raw-address\\\">\\u041a\\u0438\\u0435\\u0432<!-- -->, \\u0414\\u0435\\u0433\\u0442\\u044f\\u0440\\u0451\\u0432\\u0441\\u043a\\u0430\\u044f \\u0443\\u043b\\u0438\\u0446\\u0430, 27<\/span>\\n <\/div>\\n<\/div>\"}"
}