{
    "id":"Kaggle::techmap::61451a0f3bf28a6d30e93075::linkedin_ro::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Keying\/typing\" could discourage candidates who are capable of data entry.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"Competitive salary\" - this has been shown to decrease diversity in the candidate pool.",
    "verified":true,
    "synthetic":false,
    "text":" Collaborate and work closely with other subject matter experts across the Media team (paid search, display, affiliate, and mass media), as well as non-paid channels to maximize overall business results. Other job duties as defined. Education & Experience. Bachelors degree in Marketing, Communications, or related field. years of experience in paid social media, activation, management, and budgets. Experience working within Facebook Business Manager to create campaigns and ads. Comfortable with operating in a fast-paced environment and dealing with ambiguity. Have strong organizational skills being able to manage multiple projects at once. Physical Demand & Work Effort. Keying\/typing, standing, walking. Sitting for an extended period. Constant mental and\/or visual attention. The work is either repetitive or diversified requiring constant alertness in an office environment. The job is typically performed under comfortable working conditions. Any disagreeable elements are generally absent during the normal performance of the job. Compliance with company attendance standards. Comprehensive Benefits. We offer a competitive salary, outstanding benefits package that includes medical, dental, vision, life insurance, paid vacation and sick days, paid holidays, tuition reimbursement, and 401(k) with company match. TaxAct. At Blucora, we believe our work benefits from the diverse perspectives of our employees. As such, Blucora welcomes and celebrates diversity and inclusion and is committed to equal opportunity employment. At Blucora, you can expect a supportive, open, and inclusive atmosphere and a team that values your contributions. Blucora, Inc. and its subsidiaries, Avantax Wealth Management, Avantax Planning Partners (formerly HK Financial Services), and Tax. Act are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants without regard to race, color, religion, sex, national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, veteran status, and any other status protected under federal or state law. Blucora considers information gathered in the hiring process, including information on this application, confidential, and only shares it on a need-to-know basis or as required by law. If you need assistance or accommodation due to a disability, you may contact us at Blucora. com or by calling 972-870-6000 to speak with a member of the HR Talent Acquisition team.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61451a0f3bf28a6d30e93075::linkedin_ro\", \"source\": \"linkedin_ro\", \"country\": \"RO\", \"company\": \"Blucora\", \"position\": \"Paid Social Strategist\", \"notes\": \"\", \"original\": \"Blucora has a bold aspiration: we are committed to giving all people the tools needed to lead healthy financial lives - tools often reserved for the wealthy.<br><br>We now turn to the next leg, developing the technological tools that make our vision of financial health for all a reality. Atypical for the financial services industry, we take a contemporary approach to strategy and product development that is founded in user insights, rapid testing, and a singular focus on driving end-user value.<br><br>Since charting new territory daily is part of everyone's job at Blucora, we've attracted team members who thrive on the challenge, encourage each other, and are passionately committed to the goal. If you agree that problem-solving is a team sport, and feel energized by a good debate, deep-dive research, or a fun night out with colleagues, we might be the right firm for you!<br><br><strong><u>Position Summary<br><br><\/u><\/strong>TaxAct, a subsidiary of Blucora and sister company to Avantax Wealth Management and Avantax Planning Partners is seeking <strong>Paid Social Strategist<\/strong> that will assist in the execution of paid social campaigns. This role will focus on acquiring and retaining existing customers, with proper execution of Paid Social campaigns, supported by insightful reporting and analysis. The ideal candidate has a passion for meeting deadlines, is well-versed in the social media landscape, and possesses excellent communication skills.<br><br><strong><u>Essential Duties &amp; Responsibilities<br><\/u><\/strong><ul><li> Demonstrate strategic insight to develop long-term execution plans from stated business objectives, implement those programs, and achieve key metrics (KPIs). <\/li><li> Effectively communicate strategy to creative partners with clear deliverables and deadlines. <br><\/li><\/ul><strong> Campaign Activation <br><\/strong><ul><li> Organizational capabilities to assign resources, track progress, and assist in the execution. <\/li><li>Identify and document campaign details.<\/li><li> Create targeting documents to map out campaign creation. <\/li><li> Utilize 1st and 3rd party data to communicate effectively to appropriate audience segments. <\/li><li> Build campaigns, Ad sets, Ads on Social Platforms. <br><\/li><\/ul><strong> Campaign Management <br><\/strong><ul><li> Maintain current traffic documentation for all campaigns. <\/li><li> Maintain change log of campaign modifications and track results of change. <\/li><li> Quickly and confidently optimize campaign strategy based on performance data to ensure positive results. <\/li><li> Facilitate and manage pacing, spending plan, and reconciliations. <br><\/li><\/ul><strong> Reporting and Analysis <br><\/strong><ul><li> Develop campaign, audience, and performance insights based on available data. <\/li><li> Experience working with Excel formulas, pivot tables, and v-lookups. <\/li><li> Communicate associated metrics (expectations and actuals) on a daily \\u2013 and sometimes intraday \\u2013 basis. <\/li><li> Collaborate and work closely with other subject matter experts across the Media team (paid search, display, affiliate, and mass media), as well as non-paid channels to maximize overall business results. <\/li><li>Other job duties as defined.<br><\/li><\/ul><strong><u>Education &amp; Experience<br><\/u><\/strong><ul><li> Bachelor\\u2019s degree in Marketing, Communications, or related field. <\/li><li> 1+ years of experience in paid social media, activation, management, and budgets. <\/li><li> Experience working within Facebook Business Manager to create campaigns and ads. <\/li><li> Comfortable with operating in a fast-paced environment and dealing with ambiguity. <\/li><li> Have strong organizational skills being able to manage multiple projects at once. <br><\/li><\/ul><strong><u>Physical Demand &amp; Work Effort<br><\/u><\/strong><ul><li>Keying\/typing, standing, walking.<\/li><li>Sitting for an extended period.<\/li><li>Constant mental and\/or visual attention; the work is either repetitive or diversified requiring constant alertness in an office environment.<\/li><li>The job is typically performed under comfortable working conditions; any disagreeable elements are generally absent during the normal performance of the job.<\/li><li>Compliance with company attendance standards.<br><\/li><\/ul><strong><u>Comprehensive Benefits<br><br><\/u><\/strong>We offer a competitive salary, outstanding benefits package that includes medical, dental, vision, life insurance, paid vacation and sick days, paid holidays, tuition reimbursement, and 401(k) with company match.<br><br>#TaxAct<br><br><em> At Blucora, we believe our work benefits from the diverse perspectives of our employees. As such, Blucora welcomes and celebrates diversity and inclusion and is committed to equal opportunity employment. At Blucora, you can expect a supportive, open, and inclusive atmosphere and a team that values your contributions. <br><br><\/em><em> Blucora, Inc. and its subsidiaries, Avantax Wealth Management, Avantax Planning Partners (formerly HK Financial Services), and TaxAct are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants without regard to race, color, religion, sex, national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, veteran status, and any other status protected under federal or state law. Blucora considers information gathered in the hiring process, including information on this application, confidential, and only shares it on a need-to-know basis or as required by law. <br><br><\/em><em> If you need assistance or accommodation due to a disability, you may contact us at HR@Blucora.com or by calling 972-870-6000 to speak with a member of the HR Talent Acquisition team.<\/em>\"}"
}