{
    "id":"Kaggle::techmap::615b6be263579707b57edeeb::monster_de::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"the phrase \"some of us are straight\" can be seen as subtly excluding straight individuals by implying they are a minority, potentially discouraging their application",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Beschreibung At ROMEO, you will be part of a platform that connects 3 million Gay, Bi and Trans people around the world for Dates, Friends and Love. We are about 55 people from all over the world with big plans. We operate about 300 machines in a Data Center in Amsterdam, orchestrated by Kubernetes. As a Junior System Administrator at Erasys, you will join the infrastructure teams responsibility for the operation of Romeo. com. This full-time position is based in Berlin aterasys and your initial employment contract will be for 12 months, with the intention of a permanent contract in the future. Requirements Be innovative. You will maintain the production systems powering the ROMEO platform. you will team up with the Back End Engineers and bring our infrastructure to the next level. Your profile You love systems. You love Linux. You love automation. You love Dev. Ops culture. You have a background as system administrator. You know about databases and ideally database clusters. Knowledge about Networks. Experience with monitoring and alerting systems. Understanding of security. Nice to have Experience with Kubernetes. Some experience in Software Development (PHP, NodeJS). Tech Stack Ubuntu. Databases: MariaDB. ElasticSearch. Redis. Orchestration\/Automation: Puppet. Ansible. Kubernetes. RabbitMQ. Nginx. Sensu. Prometheus. Graphite. NewRelic. What we offer A friendly, informal work environment and colleagues from all over the world. English speaking working environment. Need to relocate from abroad? Our relocation budget will help you to get things started. Everything you need to do a great job (MacBook etc. ). Full-time position with flexible working hours. Flat company hierarchy and open communication. A learning environment with ample opportunity to grow. We also work hybrid: at our great offices in Amsterdam & Berlin and\/or from your own place. We are mostly gay, some of us are straight. Basically: we don't care, just be your true self! Quelle: ROMEO BV.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615b6be263579707b57edeeb::monster_de\", \"source\": \"monster_de\", \"country\": \"DE\", \"company\": \"ROMEO BV\", \"position\": \"Berlin - Junior System Engineer\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Beschreibung<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>At <strong>ROMEO<\/strong>, you will be part of a platform that connects 3 million Gay, Bi and Trans people around the world for Dates, Friends and Love. We are about 55 people from all over the world with big plans.<\/p> <p><br><\/p> <p>We operate about 300 machines in a Data Center in Amsterdam, orchestrated by Kubernetes. <\/p> <p><br><\/p> <p>As a Junior System Administrator at Erasys, you will join the infrastructure team\\u2019s responsibility for the operation of <strong>Romeo.com.<\/strong><\/p> <p><br><\/p> <p>This full-time position is based in Berlin at<strong>erasys<\/strong> and your initial employment contract will be for 12 months, with the intention of a permanent contract in the future.<\/p> <br> <br> <h4>Requirements<\/h4> <ul> <li>Be innovative.<\/li> <li>You will maintain the production systems powering the ROMEO platform.<\/li> <li>you will team up with the Back End Engineers and bring our infrastructure to the next level.<\/li> <\/ul> <ul><\/ul> <h4>Your profile<\/h4> <ul> <li>You love systems.<\/li> <li>You love Linux.<\/li> <li>You love automation.<\/li> <li>You love DevOps culture.<\/li> <li>You have a background as system administrator.<\/li> <li>You know about databases and ideally database clusters.<\/li> <li>Knowledge about Networks.<\/li> <li>Experience with monitoring and alerting systems.<\/li> <li>Understanding of security.<br><\/li> <\/ul> <h5>Nice to have<\/h5> <ul> <li>Experience with Kubernetes.<\/li> <li>Some experience in Software Development (PHP, NodeJS).<\/li> <\/ul> <h4>Tech Stack<\/h4> <ul> <li>Ubuntu<\/li> <li>Databases: <ul> <li>MariaDB<\/li> <li>ElasticSearch<\/li> <li>Redis<\/li> <\/ul><\/li> <li>Orchestration\/Automation: <ul> <li>Puppet<\/li> <li>Ansible<\/li> <li>Kubernetes<\/li> <\/ul><\/li> <li>RabbitMQ<\/li> <li>Nginx<\/li> <li>Sensu<\/li> <li>Prometheus<\/li> <li>Graphite<\/li> <li>NewRelic<\/li> <\/ul> <h4>What we offer<\/h4> <ul> <li>A friendly, informal work environment and colleagues from all over the world.<\/li> <li>English speaking working environment.<\/li> <li>Need to relocate from abroad? Our relocation budget will help you to get things started.<\/li> <li>Everything you need to do a great job (MacBook etc.)<\/li> <li>Full-time position with flexible working hours.<\/li> <li>Flat company hierarchy and open communication.<\/li> <li>A learning environment with ample opportunity to grow.<\/li> <li>We also work hybrid: at our great offices in Amsterdam &amp; Berlin and\/or from your own place<\/li> <li>We are mostly gay, some of us are straight... Basically: we don't care, just be your true self!<\/li> <\/ul> <\/div> <div aria-label=\\\"Aggregated Job Source\\\" class=\\\"descriptionstyles__SourceHolder-sc-13ve12b-9 hkVglg\\\"> <!-- -->Quelle<!-- -->: <!-- -->ROMEO BV <\/div>\"}"
}