{
    "id":"Kaggle::techmap::614bd2d9f7868e7afcde2176::headhunter_ru::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  6 . ,  . Do you have a proven track record of single-handedly, developing key business relationships with the worlds leading (Fortune 500) Consumer Products, Retail, Tech & Professional Services businesses? If this sounds like your best asset, then this opportunity may just be for you! This is a rare and exciting opportunity to join the worlds leading specialist sales & commercial skills development consultancy. Their proven methodologies have been that significant to their clients that they can offer a 10-fold ROI on their services. Joining them and learning their concepts will not only turn you into a world-class Executive Consultant but ultimately equip you with the most important business skills that anyone can offer when it comes to commercial astuteness. This hands-on job will suit an entrepreneur, looking for impact and accountability and offers career development. Though, this is a senior leadership role it requires dedication as youll help to develop new business from scratch. Here are the qualities which were looking for: Extensive experience in building and maintaining relationships with CXOs and Commercial Leaders in Fortune 500 businesses (especially, Pharma, FMCG & Retail, Tech and Professional Services). Ideally, a mix of large as well as small company experience  entrepreneurial outlook (to get the job done). Outstanding sales, presentation and commercial negotiation skills. Besides you should enjoy inspiring your audience, speaking at major gatherings. 10 years of management experience and fluent in English. Charisma, emotional intelligence and astute communication skills (Russian and English) are imperative to success. In return, for your hard work you can expect a variety of challenges, unprecedented personal development, a brilliant team, career progression and an excellent remuneration package. Besides, youll be part of a team of elite consultants considered to be the very finest in the world. Please apply only if you have a minimum of 10 years of MANAGEMENT EXPERIENCE and only with your CV in ENGLISH  thank you. for top Strategy Consultancy. 25% growth. Negotiation skills. Sales SkillsPresentation skills. Business Managementcold calling.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614bd2d9f7868e7afcde2176::headhunter_ru\", \"source\": \"headhunter_ru\", \"country\": \"RU\", \"company\": \"find a balance consulting\", \"position\": \"International Sales & Business Director \/ VP \\u2013 CPG\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u0431\\u043e\\u043b\\u0435\\u0435 6 \\u043b\\u0435\\u0442<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u041f\\u043e\\u043b\\u043d\\u0430\\u044f \\u0437\\u0430\\u043d\\u044f\\u0442\\u043e\\u0441\\u0442\\u044c<!-- -->, <span>\\u043f\\u043e\\u043b\\u043d\\u044b\\u0439 \\u0434\\u0435\\u043d\\u044c<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <p>Do you have a proven track record of \\u201csingle-handedly\\u201d, developing key business relationships with the world\\u2019s leading (Fortune 500) Consumer Products, Retail, Tech &amp; Professional Services businesses? If this sounds like your best asset, then this opportunity may just be for you!<\/p> \\n  <p>This is a rare and exciting opportunity to join the world\\u2019s leading \\u201cspecialist\\u201d sales &amp; commercial skills development consultancy. Their proven methodologies have been that significant to their clients that they can offer a 10-fold ROI on their services. Joining them and learning their concepts will not only turn you into a world-class Executive Consultant but ultimately equip you with the most important business skills that anyone can offer when it comes to commercial astuteness.<\/p> \\n  <p>This \\u201chands-on\\u201d job will suit an entrepreneur, looking for impact and accountability and offers career development. Though, this is a senior leadership role it requires dedication as you\\u2019ll help to develop new business from scratch. Here are the qualities which we\\u2019re looking for:<\/p> \\n  <ul> \\n   <li>Extensive experience in building and maintaining relationships with CXOs and Commercial Leaders in Fortune 500 businesses (especially, Pharma, FMCG &amp; Retail, Tech and Professional Services)<\/li> \\n   <li>Ideally, a mix of large as well as small company experience \\u2013 entrepreneurial outlook (to get the job done)<\/li> \\n   <li>Outstanding sales, presentation and commercial negotiation skills; besides you should enjoy inspiring your audience, speaking at major gatherings<\/li> \\n   <li>10 years of management experience and fluent in English<\/li> \\n   <li>Charisma, emotional intelligence and astute communication skills (Russian and English) are imperative to success<\/li> \\n  <\/ul> \\n  <p>In return, for your hard work you can expect a variety of challenges, unprecedented personal development, a brilliant team, career progression and an excellent remuneration package.<\/p> \\n  <p>Besides, you\\u2019ll be part of a team of elite consultants considered to be the very finest in the world.<\/p> \\n  <p>Please apply only if you have a minimum of 10 years of MANAGEMENT EXPERIENCE and only with your CV in ENGLISH \\u2013 thank you.<\/p> \\n  <p>for top Strategy Consultancy; 25% growth<\/p>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\\n<div class=\\\"vacancy-section\\\">\\n <h2 data-qa=\\\"bloko-header-2\\\" class=\\\"bloko-header-2\\\">\\u041a\\u043b\\u044e\\u0447\\u0435\\u0432\\u044b\\u0435 \\u043d\\u0430\\u0432\\u044b\\u043a\\u0438<\/h2>\\n <div class=\\\"bloko-spacing-y-5\\\"><\/div>\\n <div>\\n  <div class=\\\"bloko-tag-list\\\">\\n   <div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Negotiation skills<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Sales Skills<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Presentation skills<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Business Management<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">cold calling<\/span>\\n    <\/div>\\n   <\/div>\\n  <\/div>\\n <\/div>\\n<\/div>\"}"
}