{
    "id":"Kaggle::techmap::61403c3ea393863406877997::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" We are currently seeking a Nightshift Customer Service \/ Data entry person to join our Nightshift Team. This is a high paced environment that requires exact attention to detail. Tasks will include but not limited to. Answer inbounds calls, process orders, dispatch orders and invoice. You will be familiar or comfortable with working nightshift hours and understand that that weekend work is part of the weekly schedule. A normal week will consist of 4 x 10 hour shifts with the understanding that additional shifts will be required to cover leave periods: Wednesday 7.00pm to 5.30am. Thursday 6.00pm to 4.30am. Friday 6.00pm to 4.30am. Sunday 3.00pm to 1.30am.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61403c3ea393863406877997::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Bidfood\", \"position\": \"Nightshift Customer Service & Data input\", \"notes\": \"\", \"original\": \"<p>\\u00a0We are currently seeking a Nightshift Customer Service \/ Data entry person to join our Nightshift Team. This is a high paced environment that requires exact attention to detail. Tasks will include but not limited to. Answer inbounds calls, process orders, dispatch orders and invoice.\\u00a0<\/p><p>You will be familiar or comfortable with working nightshift hours and understand that that weekend work is part of the weekly schedule.<\/p><p>A normal week will consist of 4 x 10 hour shifts with the understanding that additional shifts will be required to cover leave periods:<\/p><p>Wednesday 7.00pm to 5.30am<\/p><p>Thursday 6.00pm to 4.30am<\/p><p>Friday 6.00pm to 4.30am<\/p><p>Sunday 3.00pm to 1.30am<\/p>\"}"
}