{
    "id":"Kaggle::techmap::614f6f96d972db1aa57bc5f8::linkedin_cy::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"Executing the orders of the superiors\": This phrase suggests a rigid, hierarchical structure where employees are expected to follow orders without question. This could be off-putting to candidates who value autonomy, creativity, and a collaborative work environment.",
    "verified":true,
    "synthetic":false,
    "text":" Libertex Group Overview. Libertex is an International Financial Services Group specialising in online trading and investment. It was founded as a Brokerage firm in 1997 and has since grown into a diverse Group of Companies, Brokers, Dealers, Educational and IT Development Centers which allows the Group to operate globally, targeting 27 countries and serving clients from 120 countries. The company has received more than 100 International Awards and Recognitions including, most recently, being named Best Trading Platform 2020 by World Finance Magazine and Best FX Broker Europe 2020 by Forex Report. Job Overview. We are looking for a Junior Dealer (Russian Speaking) to join our Cyprus office, the role will be based on rotational shift work and full training will be provided. The right candidate must have analytical and excellent communication skills, as well as the ability to work well under pressure. Main Responsibilities. Handling customers operations via terminals or by phone. Monitoring the customers activity work, its influence on the Companys revenue, dividing them into groups, for proper handling their operations and processing the companys risks, preparing reports on their results and profitability. Monitoring the normal functioning of the software. Receiving and investigating the clients complains. Executing the orders of the superiors. Providing Companys management and employees with the information related to the market and to the expertise of the dealing desk. Monitoring and processing of the hedging operations. Monitoring the market and competitors trends and news. Preparing all regular reporting requested by CySEC and addressing other regulator-related issues. Requirements. Degree in Economics, Mathematics, or any other relevant field. At least one year of experience in a dealing role within a Forex company is a must. Native\/Fluent in Russian and English is a must. CySEC Advanced Certificate is a major advantage. Knowledge of MT4 and MT5 or any other platform. Knowledge of financial markets (CFDs, futures, options, stocks) and particularly forex. Knowledge of technical and fundamental analysis. Knowledge of the most widespread customer trading techniques. Ability to work efficiently under pressure. Excellent computer skills (Microsoft Office). Advanced skills in Excel or any other reporting platform. Ability to work 24\/5 rotational shifts from Monday and Friday, with the flexibility to cover Saturday or Sunday and Public Holidays, if requested (an extra compensation will be offered). Benefits. A dynamic and globally expanding Company. 21 days annual leave. Cyprus Public Holidays.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f6f96d972db1aa57bc5f8::linkedin_cy\", \"source\": \"linkedin_cy\", \"country\": \"CY\", \"company\": \"Libertex Group\", \"position\": \"Junior Dealer (Russian Speaking)\", \"notes\": \"\", \"original\": \"<p><strong>Libertex Group Overview <\/strong><\/p><p>Libertex is an International Financial Services Group specialising in online trading and investment. It was founded as a Brokerage firm in 1997 and has since grown into a diverse Group of Companies, Brokers, Dealers, Educational and&nbsp;IT Development Centers which allows the Group to operate globally, targeting&nbsp;27 countries and serving&nbsp;clients from 120 countries.<\/p><p><br><\/p><p>The company has received more than 100 International Awards and Recognitions including, most recently, being named \\u201cBest Trading Platform 2020\\u201d by World Finance Magazine and \\u201cBest FX Broker Europe 2020\\u201d by Forex Report.<\/p><p><br><\/p><p><strong>Job Overview<\/strong><\/p><p>We are looking for a Junior Dealer (Russian Speaking) to join our Cyprus office, the role will be based on rotational shift work and full training will be provided. The right candidate must have analytical and excellent communication skills, as well as the ability to work well under pressure.<\/p><p><br><\/p><p><strong>Main Responsibilities <\/strong><\/p><ul><li>Handling customers operations via terminals or by phone<\/li><li>Monitoring the customers\\u2019 activity work, its influence on the Company\\u2019s revenue, dividing them into groups, for proper handling their operations and processing the company\\u2019s risks, preparing reports on their results and profitability<\/li><li>Monitoring the normal functioning of the software<\/li><li>Receiving and investigating the clients complains<\/li><li>Executing the orders of the superiors<\/li><li>Providing Company\\u2019s management and employees with the information related to the market and to the expertise of the dealing desk<\/li><li>Monitoring and processing of the hedging operations<\/li><li>Monitoring the market and competitors\\u2019 trends and news<\/li><li>Preparing all regular reporting requested by CySEC and addressing other regulator-related issues<\/li><\/ul><p><br><\/p><p><strong>Requirements <\/strong><\/p><ul><li>Degree in Economics, Mathematics, or any other relevant field&nbsp;<\/li><li>At least one year of experience in a dealing role within a Forex company is a must<\/li><li>Native\/Fluent in Russian and English is a must<\/li><li>CySEC Advanced Certificate is a major advantage<\/li><li>Knowledge of MT4 and MT5 or any other platform<\/li><li>Knowledge of financial markets (CFDs, futures, options, stocks) and particularly forex<\/li><li>Knowledge of technical and fundamental analysis<\/li><li>Knowledge of the most widespread customer trading techniques<\/li><li>Ability to work efficiently under pressure<\/li><li>Excellent computer skills (Microsoft Office)<\/li><li>Advanced skills in Excel or any other reporting platform<\/li><li>Ability to work <strong>24\/5 rotational shifts from Monday and Friday<\/strong>, with the flexibility to cover Saturday or Sunday and Public Holidays, if requested (an extra compensation will be offered)<\/li><\/ul><p><br><\/p><p><strong>Benefits <\/strong><\/p><ul><li>A dynamic and globally expanding Company<\/li><li>21 days annual leave + Cyprus Public Holidays<\/li><li>Comprehensive and Global Medical Insurance Plan, with coverage for the employee and their immediate family from day one<\/li><li>Participation in the Company\\u2019s Corporate Bonus Scheme<\/li><li>Udemy for Business Unlimited Membership<\/li><li>Corporate Parties &amp; Team Building Activities<\/li><li>Fun &amp; Friendly environment with great opportunities to excel professional career&nbsp;<\/li><\/ul><p><br><\/p><p><strong>Location<\/strong><\/p><ul><li>Limassol, Cyprus or potential relocation to Montenegro<\/li><\/ul><p><br><\/p><p><strong>Please send your CV in ENGLISH!<\/strong><\/p><p><strong>Only shortlisted candidates will be contacted.<\/strong><\/p>\"}"
}