{
    "id":"Kaggle::techmap::613612014da28a1359bfc63d::monsterasia_ph::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2 Free USB Ports for headset and Web Cam. Ability to connect directly to the internet service provider modem with an Ethernet cable, WIFI is not acceptable. Dedicated workspace in your home that is free of background noise and distractions. Dedicated computer monitor minimum 13 inches or larger. Sound\/Audio support. Ethernet Port must be built -in to computer. A VoIP USB Headset with microphone. Why join our ResultsCX team? Employee Performance Incentives and Prizes. Frequent Employee events, games and parties. Healthcare Benefits. Medical, Dental, Vision. 401(K). Paid Training. Discounts on Hotels, Car Rentals, Restaurants, Movie Tickets, Groceries, Child Care, and much more. Career Growth Opportunities. Flexible work schedule options. If this sounds like an opportunity that you would be interested in, don't miss out! Training classes are forming now! Spaces are limited so apply now to secure your spot! ResultsCX is an equal opportunity and affirmative action employer and will consider all qualified applicants without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, veteran status, or any other protected factors under federal, state, or local law.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613612014da28a1359bfc63d::monsterasia_ph\", \"source\": \"monsterasia_ph\", \"country\": \"PH\", \"company\": \"ResultsCX\", \"position\": \"Customer Service Representative\", \"notes\": \"\", \"original\": \"<br><b>Customer Service Representative - Remote<\/b><br><strong>Paid Training,Competitive Compensation, Medical\/Dental\/Vision Coverage, 401(K), and Endless Career Growth Opportunities!<\/strong><br><strong>Interview Today! Immediate Start Dates Available!<\/strong><br>Work in the comfort of your own home and reward yourself with a stable, fun, and challenging career in Customer Service? At ResultsCX, we will invest in you and your career journey. You can expect exceptional training delivered by servant leaders that will help you exceed in your professional goals and provide essential tools that help you deliver exceptional customer experiences. Our employees are the cornerstone of our business and the reason we have been recognized for award winning service to the customers and communities in which we serve.<br>You may work remote from your home but may be needed to come onsite to our Corpus Christi location at times. Successful candidates will need to live within a 50-mile radius of Corpus Christi, TX.<br>We expect greater of ourselves... What's Your Greater? Come find it at ResultsCX!<b>What job duties can I expect to perform as a Customer Service Representative?<\/b><br><ul><li>Providing clear, concise, and thoughtful instructions<\/li><li>Answering customer questions and providing helpful solutions<\/li><li>Promoting products and services for our clients<\/li><li>Resolving customer complaints with fast, friendly, and courteous service<\/li><\/ul><b>How can I make a difference?<\/b><br><ul><li>Consistently deliver a positive and world class customer experience via phone, web chat or email<\/li><li>Provide detailed summaries of customer calls in our CRM Database<\/li><li>Collaborate with leadership to improve our Customer Experience<\/li><\/ul><b>What requirements must I meet to join the team?<\/b><br><ul><li>High school diploma or GED<\/li><li>Ability to type 25 words per minute<\/li><li>Basic computer navigation skills and strong communication skills<\/li><li>Positive attitude, strong work ethic and ability to thrive in a dynamic environment<\/li><li>Strong communication skills<\/li><\/ul><b>What do I need to work in this role virtually in my home?<\/b><br>Our virtual positions require you to independently have access to the following during all working hours: <ul><li>An Intel or AMD PC\/ laptop running Windows 10 operating system with a minimum of 4 GB of RAM (NO Mac, Chromebook, Tablet or Smartphone)<\/li><li>Minimum processor speed of 2.0 GHz with dual core processing and at least 4 Logical Processor Core<\/li><li>At least 1GB hard drive space free on C: drive for company applications<\/li><li>High Speed Internet - minimum download speed of 10 Mbps and a minimum upload speed of 6 Mbps<\/li><li>2 Free USB Ports for headset and Web Cam.<\/li><li>Ability to connect directly to the internet service provider modem with an Ethernet cable, WIFI is not acceptable<\/li><li>Dedicated workspace in your home that is free of background noise and distractions<\/li><li>Dedicated computer monitor minimum 13 inches or larger<\/li><li>Sound\/Audio support<\/li><li>Ethernet Port must be built -in to computer<\/li><li>A VoIP USB Headset with microphone<\/li><\/ul><b>Why join our ResultsCX team?<\/b><br><ul><li>Employee Performance Incentives and Prizes<\/li><li>Frequent Employee events, games and parties<\/li><li>Healthcare Benefits - Medical, Dental, Vision<\/li><li>401(K)<\/li><li>Paid Training<\/li><li>Discounts on Hotels, Car Rentals, Restaurants, Movie Tickets, Groceries, Child Care, and much more<\/li><li>Career Growth Opportunities<\/li><li>Flexible work schedule options<\/li><\/ul><br>If this sounds like an opportunity that you would be interested in, don't miss out! Training classes are forming now! Spaces are limited so apply now to secure your spot!<br>ResultsCX is an equal opportunity and affirmative action employer and will consider all qualified applicants without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, veteran status, or any other protected factors under federal, state, or local law.\"}"
}