{
    "id":"Kaggle::techmap::614896f664fc986123d79c64::linkedin_ng::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Most Critical Proficiencies: Knowledge of the NGO business sector. Knowledge of institutional funders for international development, a plus. Ability to navigate financial and non-financial data gathering and analytics. Technically adept with ability to quickly learn and maximize usage of technology and software. Effective user of Microsoft Office Suite with intermediate skill in MS Excel. Practical knowledge of the local Regional generally accepted accounting principles and fiscal statutes. Experience with accounting systems. Essential Job Functions and Physical Demands. Ability to work under pressure, perform multiple tasks and manage consistently competing priorities. Comfortable in rapidly changing environment. Must be flexible and able to improvise to handle a variety of situations. Ability to effectively train individuals and teams using participatory methodologies. Ability to work with delicate personnel situations and to maintain confidentiality. Ability to maintain close relationships and work with team members from a distance and with limited opportunity for personal interaction. Constant sitting and working at a computer for extended periods of time. Constant face-to-face, electronic and telephone communication with colleagues and the general public. Ability to prepare documents and other materials in a well-designed and attractive format, with attention to detail. Willingness and ability to work outside of normal business hours. Ability and willingness to travel both domestically and internationally. Adequate physical condition necessary to travel to project sites in rural areas.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614896f664fc986123d79c64::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"Heifer International\", \"position\": \"Accounting Specialist - Nigeria\", \"notes\": \"\", \"original\": \"<strong>Description<br><br><\/strong>Heifer International is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability.<br><br><strong>FUNCTION<br><br><\/strong>Accountable to provide substantive support for accounting aspects of the Heifer Regional Office. Accountable for the maintenance of accounting related systems. Accountable to implement accepted methods of accounting and assure proper internal controls and perform guided assessments of controls related to financial activities, reporting and compliance. Accountable to apply critical thinking to manage the business of the Regional Office, in a face-paced, ever-changing environment. Accountable to apply and reinforce general accounting standards and Heifer's policies and procedures.<br><br><strong>ESSENTIAL CHARACTER TRAITS: <br><br><\/strong>Financial Acumen; Tech Savvy; Action oriented; Plans and aligns; Optimizes work processes; Ensures accountability; Drives results; Collaborates; Communicates effectively; Courage; Instills trust<br><br><strong>Responsibilities &amp; Deliverables<\/strong><strong>B. May perform other job-related duties as assigned (10%)<br><ul><li> Support the Regional team in accounting management to ensure compliance. (90%).<\/li><li>Maintain the general ledger accounts and reconcile balance sheet accounts, including staff travel advances reconciliations and cash\/bank\/credit card reconciliations. Reconcile all transactions in the accounting system to the general ledger and financial reports.<\/li><li>Ensure regulatory and organizational compliance of accounting transactions within the Regional program offices and support global consolidation of financial statements<\/li><li>Record all transactions in the accounting system; coordinate with the Director to complete all accounting procedures to produce monthly financial statements in accordance with local GAAP or IFRS<\/li><li>Produce accurate and timely transactions that will feed into reporting, dashboards and other key deliverables<\/li><li>Perform payroll registration including related deductions, benefits, taxes and other payments to employees and statutory institutions, in accordance with existing government laws and regulations<\/li><li>Register and maintain fixed assets in the accounting system.<\/li><li>Manage the staff expenditure and reimbursement process.<\/li><li>Maintain an efficient filing and retrieval system for financial and accounting records to ensure completeness, accuracy and compliance on weekly basis that is in line with Nigeria laws, regulations and local GAAP.<\/li><li>Partner with Headquarters in the periodic close, ensuring accurate and timely financial statements for global consolidation<\/li><li>Serve as custodian for the checkbooks.<br><br><\/li><\/ul>Minimum Requirements:<br><\/strong><ul><li>Bachelor\\u2019s degree in Accounting, plus five (5) years of related experience.<br><br><\/li><\/ul><strong>Preferred Requirements:<br><\/strong><ul><li>Experience in a donor-funded development environment with compliance requirements of institutional funders.<br><br><\/li><\/ul><strong>Most Critical Proficiencies:<br><\/strong><ul><li>Knowledge of the NGO business sector; Knowledge of institutional funders for international development, a plus.<\/li><li>Ability to navigate financial and non-financial data gathering and analytics; technically adept with ability to quickly learn and maximize usage of technology and software; effective user of Microsoft Office Suite with intermediate skill in MS Excel.<\/li><li>Practical knowledge of the local Regional generally accepted accounting principles and fiscal statutes.<\/li><li>Experience with accounting systems.<br><br><\/li><\/ul><strong>Essential Job Functions and Physical Demands<br><\/strong><ul><li>Ability to work under pressure, perform multiple tasks and manage consistently competing priorities; comfortable in rapidly changing environment. Must be flexible and able to improvise to handle a variety of situations.<\/li><li>Ability to effectively train individuals and teams using participatory methodologies.<\/li><li>Ability to work with delicate personnel situations and to maintain confidentiality.<\/li><li>Ability to maintain close relationships and work with team members from a distance and with limited opportunity for personal interaction.<\/li><li>Constant sitting and working at a computer for extended periods of time.<\/li><li>Constant face-to-face, electronic and telephone communication with colleagues and the general public.<\/li><li>Ability to prepare documents and other materials in a well-designed and attractive format, with attention to detail<\/li><li>Willingness and ability to work outside of normal business hours.<\/li><li>Ability and willingness to travel both domestically and internationally.<\/li><li>Adequate physical condition necessary to travel to project sites in rural areas.<\/li><\/ul>\"}"
}