{
    "id":"Kaggle::techmap::61556e9de073bc782c1ae754::seek_au::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"ALG has a great opportunity for multiple AME's & LAME's (Structures and Mechanical) to join our aviation client based in Mascot Airport. The position will give the successful candidates valuable exposure to the aviation industry, as well as a wide range of future career prospects. This opportunity offers a highly desirable pay rate and ongoing employment to the successful candidates. The successful candidates possess the following attributes: Holds Certificate IV in Aero skills Mechanical and or Structures. Recent industry experience. Heavy and or Line Experience on aircraft (structures or mechanical). Experience on A320 and or B787 is highly desirable. Ability to obtain a red ASIC and to complete a security background check. Ability to undergo a Drug and Alcohol Screening Test and. Demonstrate full compliance will all work rules and regulations. Eligible candidates with the above qualities are encouraged to apply now! For further information, please contact Nick Beal at (07) 3860 4747 (Mon-Fri 08:30-17:00 AEST).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61556e9de073bc782c1ae754::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Aviation Labour Group\", \"position\": \"AME's & LAME's (Structures and Mechanical)\", \"notes\": \"\", \"original\": \"<p>ALG has a great opportunity for multiple <strong>AME's &amp; LAME's (Structures and Mechanical) to join<\/strong> our aviation client based in <strong>Mascot Airport.<\/strong> The position will give the successful candidates valuable exposure to the aviation industry, as well as a wide range of future career prospects.<br \/> <br \/> This opportunity offers a highly desirable pay rate and ongoing employment to the successful candidates.<br \/> <br \/> The successful candidates possess the following attributes:<\/p><ul><li>Holds Certificate IV in Aero skills Mechanical and or Structures;<\/li><li>Recent industry experience;<\/li><li>Heavy and or Line Experience on aircraft (structures or mechanical);<\/li><li>Experience on A320 and or B787 is highly desirable<\/li><li>Ability to obtain a red ASIC and to complete a security background check;<\/li><li>Ability to undergo a Drug and Alcohol Screening Test and<\/li><li>Demonstrate full compliance will all work rules and regulations;<\/li><\/ul><p>Eligible candidates with the above qualities are encouraged to apply now! For further information, please contact <strong>Nick Beal<\/strong> at (07) 3860 4747 (Mon-Fri 08:30-17:00 AEST).<br \/> <\/p>\"}"
}