{
    "id":"Kaggle::techmap::6155bf23d198905e9e61526e::monster_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Nothing feels as good as being tan except being an employee at Planet Tan®! We are in the business of making everyone look and feel their best through the power of Sunbed and Spray Tanning. We believe that tanning is truly a transformation, and The Planet Tan Experience is where we SHINE. We’re known for bringing All Over Joy all over DFW with our fun, friendly, and knowledgeable staff. In Our Planet, the ideal candidate is highly energetic and self-motivated to achieve sales goals, thriving on a commission driven environment. Responsibilities: Meeting & Tracking Daily\/Weekly\/Monthly Sales Goals. Provide the Planet Tan Experience to each and every customer. Educate Customers on the Golden Rules of Tanning. Ensure that all company and legal requirements are met. Maintains a clean, organized, and positive salon. Cash handling, Daily Administrative Paperwork. Qualifications: Must be at least 18 years of age. Some experience in a sales environment. Must be able to stand, bend, walk for long periods of time, for 7 hours per day. Must be able to lift 25 pounds without assistance. Reliable transportation, flexible availability including nights and weekends. Preferred Qualifications: High school diploma, or equivalent. Excellent verbal and written communication skills. Proven experience in a sales environment. Your future has never been brighter! We offer a variety of perks to all of our employees: Flexible Work Schedule. FREE TANNING. Discounts on our great skincare products. Advancement Opportunities. More for Full-Time Associates. Planet Tan is sun for everyone - it’s at the core of who we are! That’s why we’re proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability status, protected Veteran status, or any other characteristic protected by law.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155bf23d198905e9e61526e::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Planet Tan\", \"position\": \"Skincare Adviser\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div> <div> Nothing feels as good as being tan except being an employee at Planet Tan\\u00ae! <br> <br> <\/div> <div> We are in the business of making everyone look and feel their best through the power of Sunbed and Spray Tanning. We believe that tanning is truly a transformation, and The Planet Tan Experience is where we SHINE. We\\u2019re known for bringing All Over Joy all over DFW with our fun, friendly, and knowledgeable staff. <br> <br> <\/div> <div> In Our Planet, the ideal candidate is highly energetic and self-motivated to achieve sales goals, thriving on a commission driven environment. <br> <br> <\/div> <div> <strong>Responsibilities:<br><\/strong> <\/div> <ul> <li>Meeting &amp; Tracking Daily\/Weekly\/Monthly Sales Goals<\/li> <li>Provide the Planet Tan Experience to each and every customer<\/li> <li>Educate Customers on the Golden Rules of Tanning<\/li> <li>Ensure that all company and legal requirements are met<\/li> <li>Maintains a clean, organized, and positive salon<\/li> <li>Cash handling, Daily Administrative Paperwork<\/li> <\/ul> <div> <strong>Qualifications:<br><\/strong> <\/div> <ul> <li>Must be at least 18 years of age<\/li> <li>Some experience in a sales environment<\/li> <li>Must be able to stand, bend, walk for long periods of time, for 7 hours per day<\/li> <li>Must be able to lift 25 pounds without assistance<\/li> <li>Reliable transportation, flexible availability including nights and weekends<\/li> <\/ul> <div> <strong>Preferred Qualifications:<br><\/strong> <\/div> <ul> <li>High school diploma, or equivalent.<\/li> <li>Excellent verbal and written communication skills<\/li> <li>Proven experience in a sales environment<\/li> <\/ul> <div> Your future has never been brighter! We offer a variety of perks to all of our employees: <br> <br> <\/div> <ul> <li>Flexible Work Schedule<\/li> <li>FREE TANNING<\/li> <li>Discounts on our great skincare products<\/li> <li>Advancement Opportunities<\/li> <li>Medical, Dental, Vision Benefits + More for Full-Time Associates<\/li> <\/ul> <div> <br> <br> <\/div> <div> Planet Tan is sun for everyone - it\\u2019s at the core of who we are! That\\u2019s why we\\u2019re proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability status, protected Veteran status, or any other characteristic protected by law <br> <br> <\/div> <\/div> <\/div>\"}"
}