{
    "id":"Kaggle::techmap::6148e94c4ca8eb4d9076a94b::seek_au::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Requires \"Be physically fit\" without clarifying the physical requirements.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"We are seeking a Funeral Arranger\/Conductor to join our Simplicity Funerals team at Osborne Park on a full time basis to help support our vision of providing absolute support and professionalism at a critical time in our client families lives. This is a difficult time for families so you will be empathetic to their situation. You will also have the capacity to be at ease in dealing with death and the expression of grief and will approach each day with a balance of sensitivity and efficiency. About the company: For over 35 years Simplicity Funerals has been giving Australian families a simple, practical, affordable yet respectful alternative to the services offered by other funeral providers. The first Simplicity funeral home opened in 1979 with the vision of giving families real choice in funeral services through simple funeral services made easy, and at affordable prices. To this day we remain true to this vision. Duties: Meet with families initially and provide advice and guidance on their options. Align our service offering with the needs of families. Assist in setting up for and delivering funeral services. Oversee operations throughout the arrangement process and on the funeral day. Skills and Experience: Proven track record of delivering a high level of customer service. Current unrestricted drivers licence. A community focused mindset and well-developed interpersonal skills. Have an excellent attention to detail. Be physically fit. In return, we offer: A competitive pay rate. Birthday leave. Discounts for health care and retail providers. Free access Employee Assistant Program. Applicants will also be expected to perform a full variety of funeral duties and should possess a mature, caring and understanding nature together with well-developed interpersonal skills and the highest level of standards. If you are seeking a genuine opportunity to make a positive contribution to a business and culture of which you can be proud, please apply now! We’d love to hear from you! *As part of our recruitment process applicants for this position will be asked to consent to a criminal record check and medical\/physical assessment to ensure fitness to complete the inherent requirements of the position. Please note that applicants with a criminal record are not automatically barred from applying for this position and each application will be considered on its merits.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148e94c4ca8eb4d9076a94b::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"InvoCare Australia Pty Limited\", \"position\": \"Funeral Arranger and Conductor\", \"notes\": \"\", \"original\": \"<p>We are seeking a Funeral Arranger\/Conductor to join our Simplicity Funerals team at Osborne Park on a full time basis to help support our vision of providing absolute support and professionalism at a critical time in our client families lives.\\u00a0<\/p><p>This is a difficult time for families so you will be empathetic to their situation. You will also have the capacity to be at ease in dealing with death and the expression of grief and will approach each day with a balance of sensitivity and efficiency.\\u00a0<\/p><p><strong>About the company:<\/strong><\/p><p>For over 35 years Simplicity Funerals has been giving Australian families a simple, practical, affordable yet respectful alternative to the services offered by other funeral providers.<\/p><p>The first Simplicity funeral home opened in 1979 with the vision of giving families real choice in funeral services through simple funeral services made easy, and at affordable prices. To this day we remain true to this vision.<\/p><p><strong>Duties:<\/strong><\/p><ul><li>Meet with families initially and provide advice and guidance on their options<\/li><li>Align our service offering with the needs of families<\/li><li>Assist in setting up for and delivering funeral services<\/li><li>Oversee operations throughout the arrangement process and on the funeral day<\/li><\/ul><p><strong>Skills and Experience:<\/strong><\/p><ul><li>Proven track record of delivering a high level of customer service<\/li><li>Current unrestricted drivers licence<\/li><li>A community focused mindset and well-developed interpersonal skills<\/li><li>Have an excellent attention to detail<\/li><li>Be physically fit<\/li><\/ul><p><strong>In return, we offer:<\/strong><\/p><ul><li>A competitive pay rate\\u00a0<\/li><li>Birthday leave<\/li><li>Discounts for health care and retail providers<\/li><li>Free access Employee Assistant Program<\/li><li>Opportunity to buy shares in our company<\/li><\/ul><p>Applicants will also be expected to perform a full variety of funeral duties and should possess a mature, caring and understanding nature together with well-developed interpersonal skills and the highest level of standards.\\u00a0<\/p><p>If you are seeking a genuine opportunity to make a positive contribution to a business and culture of which you can be proud, please apply now! We\\u2019d love to hear from you!<\/p><p><em>*As part of our recruitment process applicants for this position will be asked to consent to a criminal record check and medical\/physical assessment to ensure fitness to complete the inherent requirements of the position. Please note that applicants with a criminal record are not automatically barred from applying for this position and each application will be considered on its merits<\/em><\/p>\"}"
}