{
    "id":"Kaggle::techmap::612fdcbbd452c1504f816595::reed_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" School Nurse. Permanent, variable hours (PT and up to FT). Elstree, Herts. Term Time only. The working hours are 8.15 am - 17.15 pm (with 30 minutes for lunch). Our client is a leading independent day school for girls aged 4-18 and their academic results place them amongst the highest ranked schools in the UK. The Health Centre Team is part of a wider pastoral and First Aid team whose aim is to promote the physical health and emotional wellbeing of the students. The Health Centre is open from 08.30 - 17.00 during the school day and is a welcoming space offering medical support for students and staff. They are looking to recruit a School Nurse to join their team as soon as possible to provide nursing cover to ensure school medical provision for pupils and staff and to be part of a wider pastoral team promoting the physical health and emotional wellbeing of the girls. You will be a qualified nurse RSCN or RGN and the equivalent full-time salary will be within RCN Band 6\/7. Actual working days will be discussed at interview stage. All staff are entitled to a free lunch, use of the pool and gym facilities and membership of the schools Group Personal Pension Plan. Apply online or request an informal conversation.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::612fdcbbd452c1504f816595::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Careerline\", \"position\": \"School Nurse\", \"notes\": \"\", \"original\": \"<p>School Nurse - Permanent, variable hours (PT and up to FT) - Elstree, Herts<\/p> <p>Term Time only<\/p> <p>The working hours are 8.15 am - 17.15 pm (with 30 minutes for lunch)<\/p> <p>Our client is a leading independent day school for girls aged 4-18 and their academic results place them amongst the highest ranked schools in the UK. The Health Centre Team is part of a wider pastoral and First Aid team whose aim is to promote the physical health and emotional wellbeing of the students. The Health Centre is open from 08.30 - 17.00 during the school day and is a welcoming space offering medical support for students and staff.<\/p> <p>They are looking to recruit a School Nurse to join their team as soon as possible to provide nursing cover to ensure school medical provision for pupils and staff and to be part of a wider pastoral team promoting the physical health and emotional wellbeing of the girls.<\/p> <p>You will be a qualified nurse RSCN or RGN and the equivalent full-time salary will be within RCN Band 6\/7. Actual working days will be discussed at interview stage. All staff are entitled to a free lunch, use of the pool and gym facilities and membership of the school\\u2019s Group Personal Pension Plan.<\/p> <p>Apply online or request an informal conversation<\/p>\"}"
}