{
    "id":"Kaggle::techmap::6155f39fdb73f175d270ff15::monster_de::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" The position is (initially) limited to two years, but under certain circumstances an extension can be arranged. To promote diversity, we welcome applications from talented people regardless of gender, cultural background, nationality, ethnicity, sexual identity, physical abilities, religion and age. Qualified applicants with physical disabilities will be given preference. Interested? If you have further questions, simply contact Dr. Paul Pfluger, 49 89 3187-43359, who will be happy to be of assistance. Helmholtz Zentrum Munchen. Deutsches Forschungszentrum fur Gesundheit und Umwelt (GmbH). Institute for Diabetes and Obesity. Ingolstadter Landstrae 1.85764 Oberschleiheim. Award for excellent gender equality policy for women and men. Helmholtz Zentrum Munchen is particularly committed to promoting professional equality between women and men. It therefore aims to increase the proportion of the underrepresented sex in the respective field. The Helmholtz Zentrum Munchen is part of the Helmholtz Association, Germany's largest scientific organization. Altogether 42.000 people currently work in its 19 scientific-technical and biological-medical research centers. The Association's annual budget amounts to around 5 billion Euros.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155f39fdb73f175d270ff15::monster_de\", \"source\": \"monster_de\", \"country\": \"DE\", \"company\": \"Helmholtz Zentrum M\\u00fcnchen\", \"position\": \"Postdoc - Bioinformatician\", \"notes\": \"\", \"original\": \"<p>Helmholtz Zentrum M\\u00fcnchen is a research center with the mission to discover personalized medical solutions for the prevention and therapy of environmentally triggered diseases and promote a healthier society in a rapidly changing world.<\/p><p>At our institute you will find a scientifically stimulating international environment. Together with renowned scientists and supported by an excellent infrastructure you will have the opportunity to make an important contribution for a healthier society.<\/p><p>The <strong>Research Unit Neurobiology of Diabetes<\/strong> (Prof. Dr. Paul Pfluger) at the <strong>Institute for****Diabetes and Obesity<\/strong>, Helmholtz Diabetes Center (HDC) in Munich is looking for two highly talented and motivated individuals to join their research team for the ERC-funded 5-year-project \\u201cWeight management by AgRP neurons\\u201d.<\/p><p>We are looking for a highly motivated<\/p><h1>Postdoc - Bioinformatician (f\/m\/x)101034<\/h1><p>Full time<\/p><p>Neuherberg near Munich<\/p><p>Postdocs<\/p><h2>Your responsibilities<\/h2><ul><li>You will analyze snRNAseq and other NGS as well as (phospho-)proteome and lipidome data to unravel novel (epi)genetic mechanisms in the hypothalamic control of metabolism.<\/li><li>You will join a network of biologists and bioinformaticians to advance our recent development of multi-omics integration tools (see e.g. Klaus et al. Mol Metab 2021; PMID 34271221).<\/li><li>You are supported to pursue an academic career that includes teaching of undergraduate and graduate students in analyzing their NGS data. Additional trainings in university didactics, management and communication for a postgraduate qualification (Habilitation) will be supported.<\/li><\/ul><h2>Your qualifications<\/h2><ul><li>PhD in bioinformatics or a relevant science discipline (e.g. Life Science, Biology, Nutritional Science, Medicine) with profound bioinformatics training.<\/li><li>Knowledge of standard bioinfiormatic methods e.g. R, Python or Galaxy.<\/li><li>Willingness to teach graduate students and lab members in analyzing NGS data using R, Python or Galaxy.<\/li><\/ul><h2>What we offer you<\/h2><p>work-life balance<br> flexible working hours &amp; working-time models<br> continuous education and training<br> 30 days annual leave<br> on-site health management service<br> home office options<br> on-site nursery<br> elder care company pension scheme discounted public transport ticket<br> Munich, with its numerous lakes and its vicinity to the Alps, is considered to be one of the cities with the best quality of life worldwide. With its first-class universities and world-leading research institutions it offers an intellectually stimulating environment.<\/p><p>Remuneration and social benefits are based on the collective wage agreement for public-sector employees at federal level (TV EntgO Bund). The position is (initially) limited to two years, but under certain circumstances an extension can be arranged.<\/p><p>To promote diversity, we welcome applications from talented people regardless of gender, cultural background, nationality, ethnicity, sexual identity, physical abilities, religion and age. Qualified applicants with physical disabilities will be given preference.<\/p><p><strong>Interested?<\/strong>If you have further questions, simply contact <strong>Dr. Paul Pfluger, +49 89 3187-43359<\/strong>, who will be happy to be of assistance. **Helmholtz Zentrum M\\u00fcnchen<br> Deutsches Forschungszentrum f\\u00fcr Gesundheit und Umwelt (GmbH)<br> Institute for Diabetes and Obesity<br>Ingolst\\u00e4dter Landstra\\u00dfe 1<\/p><p>85764 Oberschlei\\u00dfheim**<\/p><hr><p>Award for excellent gender equality policy for women and men. Helmholtz Zentrum M\\u00fcnchen is particularly committed to promoting professional equality between women and men. It therefore aims to increase the proportion of the underrepresented sex in the respective field. The Helmholtz Zentrum M\\u00fcnchen is part of the Helmholtz Association, Germany's largest scientific organization. Altogether 42.000 people currently work in its 19 scientific-technical and biological-medical research centers. The Association's annual budget amounts to around 5 billion Euros.<\/p>\"}"
}