{
    "id":"Kaggle::techmap::6140a7023649a841ed3ef6d9::linkedin_us::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Our Assistant Managers support the Store Manager in leading teams to maximize the output of the store through the optimization of talent, operational execution, and delivery of a rewarding experience for customers and associates. Why You’ll Love It. Closed by 8pm nightly. Closed on Thanksgiving & Christmas. Clear path to promotion. Paid time off. Bonus opportunity. Flexible schedules. Associate discounts. Stable employment with growing company. What You’ll Do: Provide a great experience for our customers. Ensure items are in stock and priced correctly. Maintain a safe, clean, and organized store. Be a subject matter expert in your role and model adherence to standard operating procedures. Understand and learn other aspects of store operations including stocking associate duties and responsibilities. Drive and coach program execution and results in accordance with Standard Operating Procedure. Serve as Leader on Duty as scheduled. Other duties as assigned. Requirements. What We Need: Must be at least 18 years old. Minimum of two years experience in retail management\/leadership role. Technical, Trade or Vocational degree of High School diploma\/equivalent or 2 years management or functional experience. Ability to communicate clearly with customers and associates in person and via e-mail and telephone. Ability to intermittently lift, push and\/or pull up to 50 pounds and stand\/move for entire shift. Ability to lift, bend, kneel, climb, crawl and\/or twist and safely climb up\/down a ladder. Ability to work nights, overnights, weekends and holidays as needed.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6140a7023649a841ed3ef6d9::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Harbor Freight Tools\", \"position\": \"Retail Sales Manager\", \"notes\": \"\", \"original\": \"Our Assistant Managers support the Store Manager in leading teams to maximize the output of the store through the optimization of talent, operational execution, and delivery of a rewarding experience for customers and associates.<br><br><strong><u>Why You\\u2019ll Love It<br><\/u><\/strong><ul><li>Closed by 8pm nightly<\/li><li>Closed on Thanksgiving &amp; Christmas<\/li><li>Clear path to promotion<\/li><li>Paid time off<\/li><li>Bonus opportunity<\/li><li>Flexible schedules<\/li><li>Associate discounts<\/li><li>Stable employment with growing company<\/li><\/ul><strong>What You\\u2019ll Do:<br><\/strong><ul><li>Provide a great experience for our customers<\/li><li>Ensure items are in stock and priced correctly<\/li><li>Maintain a safe, clean, and organized store<\/li><li>Be a subject matter expert in your role and model adherence to standard operating procedures<\/li><li>Understand and learn other aspects of store operations including stocking associate duties and responsibilities<\/li><li>Drive and coach program execution and results in accordance with Standard Operating Procedure<\/li><li>Serve as Leader on Duty as scheduled<\/li><li>Other duties as assigned<br><\/li><\/ul><strong><u>Requirements<br><br><\/u><\/strong><strong>What We Need:<br><\/strong><ul><li>Must be at least 18 years old<\/li><li>Minimum of two years experience in retail management\/leadership role<\/li><li>Technical, Trade or Vocational degree of High School diploma\/equivalent or 2 years management or functional experience.<\/li><li>Ability to communicate clearly with customers and associates in person and via e-mail and telephone.<\/li><li>Ability to intermittently lift, push and\/or pull up to 50 pounds and stand\/move for entire shift.<\/li><li>Ability to lift, bend, kneel, climb, crawl and\/or twist and safely climb up\/down a ladder.<\/li><li>Physically able and willing to become certified to operate a forklift in accordance with IIPP (Injury and Illness Prevention Program).<\/li><li>Ability to work nights, overnights, weekends and holidays as needed.<\/li><\/ul>\"}"
}