{
    "id":"Kaggle::techmap::61560a11a6740c534abc2120::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Broad knowledge of other facilities and community resources. Broad knowledge of other health care disciplines and their role in client care. Broad knowledge of the normal growth and development of children. Broad knowledge of school, legislation and government policies and procedures that relate to client. Demonstrated ability to work with Aboriginal children and youth with behavioural, social, emotional and mental health\/psychiatric issues. Demonstrated ability to perform psychosocial assessments and provide treatment planning and care. Demonstrated ability to apply knowledge of theory and practice to a case coordination process. Demonstrated ability to communicate effectively, both orally and in writing, with Aboriginal children, youth and their families, educational personnel,. Aboriginal child welfare and resources social workers, other service providers, colleagues, physician, and other health care staff, both one-on-one and in groups. Demonstrated listening and information seeking skills that promotes communication and lead to a co-operative approach to problem solving within a multidisciplinary setting. Demonstrated ability to establish workload priorities. Demonstrated ability to take clinical input and direction from a supervisor. Demonstrated ability to work both independently and collaboratively as a member of a multidisciplinary team. Demonstrated ability to work with individuals with diverse backgrounds and exhibits a Cross-Cultural Competency. Demonstrated ability to adjust to new or unexpected events, to problem solve, and to deal effectively with conflict situations. Demonstrated ability to provide consultation, leadership and work direction. Ability to operate related equipment. Physical ability to perform the duties of the position. Basic computer literacy to operate computerized client care information system and word processing, spreadsheet, Internet and e-mail software. The hours of work including days off and work area may be subject to change consistent with operational requirements and the provision of the Collective Agreement and applicable statutes. Successful applicants may be required to complete a Criminal Records Review Check. WHY JOIN VANCOUVER COASTAL HEALTH? VCH is a world class innovator in medical care, research and teaching, delivering service to more than one million BC residents. At VCH, we embrace thinking boldly, taking smart risks, and \"going first\" when we believe it will lead to the best possible outcomes for patients and their families. We invite you to join us in creating healthy lives in healthy communities by showcasing our passion for care, connection to the communities we serve and our culture of teamwork that makes VCH a great place to work.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61560a11a6740c534abc2120::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Vancouver Coastal Health\", \"position\": \"Mental Health Clinician - Child & Youth - Aboriginal\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Job Description: <table> <tbody> <tr> <td><strong>Job Title: <\/strong><\/td> <td>Mental Health Clinician - Child &amp; Youth - Aboriginal<\/td> <\/tr> <tr> <td><strong>Work Site: <\/strong><\/td> <td>Child &amp; Youth Mental Health North East - Vancouver, BC<\/td> <\/tr> <tr> <td><strong>Status: <\/strong><\/td> <td>Regular Full Time<\/td> <\/tr> <tr> <td><strong>Start Date: <\/strong><\/td> <td><p style=\\\"margin:0px\\\">As soon as possible<\/p><\/td> <\/tr> <tr> <td><strong>Salary: <\/strong><\/td> <td>$35.65 - $44.56 per hour<\/td> <\/tr> <tr> <td><strong>Hours: <\/strong><\/td> <td><p style=\\\"margin:0px\\\">0900-1700\/1200-2000<\/p><p style=\\\"margin:0px\\\">Days off: Saturday, Sunday, and statutory holidays<\/p><\/td> <\/tr> <tr> <td><strong>Reference#: <\/strong><\/td> <td>147190-cye<\/td> <\/tr> <\/tbody> <\/table> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>Come work as a Mental Health Clinician with Vancouver Coastal Health (VCH)!<\/strong><br><br>Vancouver Coastal Health is looking for a Mental Health Clinician with a &nbsp;<strong>Master's Degree in &nbsp;Behavioural Science<\/strong> to join the Vancouver Community North East Child &amp; Youth Mental Health team in supporting Aboriginal youth in Vancouver, BC.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>As a Mental Health Clinician with Vancouver Child &amp; Youth Mental Health, you will:<\/strong><\/p> <ul> <li>Perform assessments, coordinate client care, and provide treatment services that are culturally appropriate for Aboriginal youth with severe mental health issues and their families.<\/li> <li>Conduct psychosocial assessments on Aboriginal children experiencing severe behavioural, social, emotional disturbances and serious mental health problems.<\/li> <li>Collaborate with multidisciplinary team and consult with psychiatrists\/pediatrician to develop, implement, maintain, and adjust individualized treatment plans.<\/li> <li>Provide treatment services that are sensitive to Aboriginal culture including behavioural interventions, family sessions, parent groups, psychoeducation, and individual child counselling using a combination of western and traditional aboriginal care practices and approaches, as appropriate.<\/li> <li>Establish and maintain relationships based on respect and understanding.<\/li> <li>Initiate and participate in case conferences\/meetings.<\/li> <li>Provide support to colleagues and consultative services to children &amp; youth services providers for continuity of care.<\/li> <\/ul> <p style=\\\"margin:0px\\\"><strong>RECOVERY, STRENGTH, RESPECT, RESILIENCE<\/strong><br>Vancouver Coastal Health Mental Health and Addictions Services is committed to collaborating with consumers and families to build on strengths, talents and interests in order to foster a community of hope, growth and self-determination.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>QUALIFICATIONS:<\/strong><br><br><\/p> <p style=\\\"margin:0px\\\"><strong>Education &amp; Experience<\/strong><\/p> <ul> <li>Master\\u00e2\\u20ac\\u2122s degree in Behavioural Science.<\/li> <li>Three (3) years\\u00e2\\u20ac\\u2122 recent, related experience working with the designated program population (youth) in a mental health setting or an equivalent combination of education, training and experience.<\/li> <li>Valid BC Drivers License. Local area travel may require the use of a personal vehicle.<\/li> <\/ul> <p style=\\\"margin:0px\\\"><strong>Knowledge &amp; Abilities<\/strong><\/p> <ul> <li>Knowledge of the principles of recovery in mental illness.<\/li> <li>Knowledge of Psychosocial Rehabilitation methodology.<\/li> <li>Comprehensive knowledge of the diagnosis and treatment of behavioural, social emotional and mental health\/psychiatric problems in Aboriginal children and youth.<\/li> <li>Broad knowledge of mental illness diagnosis and treatment, substance abuse and addictions treatment.<\/li> <li>Broad knowledge of psychopharmacology (indications and side-effects).<\/li> <li>Broad knowledge of psychotherapeutic and counseling skills.<\/li> <li>Broad knowledge of Aboriginal health, social and community services.<\/li> <li>Broad knowledge of other facilities and community resources.<\/li> <li>Broad knowledge of other health care disciplines and their role in client care.<\/li> <li>Broad knowledge of the normal growth and development of children.<\/li> <li>Broad knowledge of school, legislation and government policies and procedures that relate to client.<\/li> <li>Demonstrated ability to work with Aboriginal children and youth with behavioural, social, emotional and mental health\/psychiatric issues.<\/li> <li>Demonstrated ability to perform psychosocial assessments and provide treatment planning and care.<\/li> <li>Demonstrated ability to apply knowledge of theory and practice to a case coordination process.<\/li> <li>Demonstrated ability to communicate effectively, both orally and in writing, with Aboriginal children, youth and their families, educational personnel,<\/li> <li>Aboriginal child welfare and resources social workers, other service providers, colleagues, physician, and other health care staff, both one-on-one and in groups.<\/li> <li>Demonstrated listening and information seeking skills that promotes communication and lead to a co-operative approach to problem solving within a multidisciplinary setting.<\/li> <li>Demonstrated ability to establish workload priorities.<\/li> <li>Demonstrated ability to take clinical input and direction from a supervisor.<\/li> <li>Demonstrated ability to work both independently and collaboratively as a member of a multidisciplinary team.<\/li> <li>Demonstrated ability to work with individuals with diverse backgrounds and exhibits a Cross-Cultural Competency.<\/li> <li>Demonstrated ability to adjust to new or unexpected events, to problem solve, and to deal effectively with conflict situations.<\/li> <li>Demonstrated ability to provide consultation, leadership and work direction.<\/li> <li>Ability to operate related equipment.<\/li> <li>Physical ability to perform the duties of the position.<\/li> <li>Basic computer literacy to operate computerized client care information system and word processing, spreadsheet, Internet and e-mail software.<\/li> <\/ul> <p style=\\\"margin:0px\\\">The hours of work including days off and work area may be subject to change consistent with operational requirements and the provision of the Collective Agreement and applicable statutes. Successful applicants may be required to complete a Criminal Records Review Check.<br><br><\/p> <p style=\\\"margin:0px\\\"><strong>WHY JOIN VANCOUVER COASTAL HEALTH?<\/strong><\/p> <p style=\\\"margin:0px\\\"><br>VCH is a world class innovator in medical care, research and teaching, delivering service to more than one million BC residents. At VCH, we embrace thinking boldly, taking smart risks, and \\\"going first\\\" when we believe it will lead to the best possible outcomes for patients and their families. We invite you to join us in creating healthy lives in healthy communities by showcasing our passion for care, connection to the communities we serve and our culture of teamwork that makes VCH a great place to work.<\/p> <ul> <li>Comprehensive health benefits package, including MSP, extended health and dental and municipal pension plan<\/li> <li>Grow your career with employer-paid training and leadership development opportunities<\/li> <li>Wellness supports, including counselling, critical incident and innovative wellness services are available to employees and their immediate families<\/li> <li>Award-winning recognition programs to honour staff, medical staff and volunteers<\/li> <li>Access to exclusive discount offers and deals for VCH staff<\/li> <\/ul> <p style=\\\"margin:0px\\\">Diversity, equity and inclusion are essential to delivering exceptional care and building a great place to work. At VCH, we value and accommodate unique differences to ensure that our staff and medical staff (both current and prospective) have the opportunity and are supported to thrive.<br><br>To build a strong and representative workforce, we are seeking candidates who will contribute to a caring and inclusive culture. We encourage applications from members of communities that are disadvantaged on any grounds under the B.C. Human Rights Code, including Indigenous Peoples, people of colour, people of all genders and sexualities and people with disabilities.<br><br>VCH is proud to be recognized as a Best Place to Work in Canada in 2021 by Glassdoor and Forbes.<br><br><strong>Only short-listed applicants will be contacted for this posting.<\/strong><br><br><br>***Employees of VCH must apply via the <strong>Internal Application Process<\/strong>. Refer to the <strong>https:\/\/my.vch.ca\/working-here\/job-postings<\/strong> site for <strong>How to Apply<\/strong> instructions. Current VCH employees who apply to this posting using this external site will be considered as an external candidate. Seniority will not apply.***<br><br>Thank you for your interest in Vancouver Coastal Health.<\/p> <\/div>\"}"
}