{
    "id":"Kaggle::techmap::6145362d3b753c22e68626f1::linkedin_mx::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":"The bilingual requirement in Spanish and English reflects the linguistic needs of the region's customer base and workforce, rather than favouring any racial or ethnic group.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Experience supporting functional Operations such as Customer Service, Transportation, Supply Chain, Manufacturing and\/or Distribution preferred. Bilingual (Spanish and English), a must. KNOWLEDGE SKILLS AND ABILITIES (Those necessary to perform the job competently). Must have a proven track record of relationship building with both internal and external customers. Strong analytical and problem-solving skills. Excellent oral, written and interpersonal communication skills. Ability to handle employee conflicts and differences by interpreting verbal\/ non-verbal behavior, detecting perceptions and needs of employees, understanding and valuing employee differences. Demonstrated business acumen and the ability to understand business strategy and goals. Requires working knowledge of MS Office and HRIS systems. Ability to work independently and with a team. ENVIRONMENTAL WORKING CONDITIONS & PHYSICAL EFFORT (Under Typical Positions). Typically works in an office with adequate lighting and ventilation and a normal range of temperature and noise level. Work assignments are diversified. Examples of past precedent are used to resolve work problems. New alternatives may be developed to resolve problems. A frequent volume of work and deadlines impose strain on routine basis. While performing the duties of this job, the associate may be exposed to industrial warehouses, manufacturing and office areas. Minimal physical effort is required. Work is mostly sedentary but does require walking, standing, bending, reaching, lifting or carrying objects that typically weigh less than 10 lbs. DISCLAIMER: The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position. Avantor is proud to be an equal opportunity employer. EEO Statement. We are an Equal Employment\/Affirmative Action employer. We do not discriminate in hiring on the basis of sex, gender identity, sexual orientation, race, color, religious creed, national origin, physical or mental disability, protected Veteran status, or any other characteristic protected by federal, state\/province, or local law. If you need a reasonable accommodation for any part of the employment process, please contact us by email at avantorsciences. com and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145362d3b753c22e68626f1::linkedin_mx\", \"source\": \"linkedin_mx\", \"country\": \"MX\", \"company\": \"Avantor\", \"position\": \"HR Business Partner\", \"notes\": \"\", \"original\": \"<strong>Job Summary<br><\/strong>The Business Partner, Human Resources will partner with their respective senior business leaders and associates within VWR to implement key HR processes and programs. This role is responsible for providing strategic HR support in the areas of employee relations, compliance, diversity, performance management, HR analysis, process redesign, succession planning, organizational and workforce planning and development and career development.<br><strong>MAJOR JOB DUTIES AND RESPONSIBILITIES (List in order of importance)<br><br><\/strong><ul><li>Responsible for partnering and consulting with senior leadership team on all HR initiatives for respective areas of support.<\/li><li>HRBP and their direct reports will implement company-wide HR strategy to support business initiatives and growth and provide day-to-day associate relations guidance and support.<\/li><li>Provides insightful, confidential, and business- focused guidance to leaders on all matters related to associate and organization development. Leads succession planning and cross-functional talent discussions with leadership teams.<\/li><li>Champions and leads training and development initiatives to meet business needs.<\/li><li>Ensures that sourcing and selection criteria are established to support both the financial and strategic needs of the business.<\/li><li>Provides day-to-day associate relations support for area management and associates.<\/li><li>Facilitates collaborative problem solving strategies to resolve associate relations issues through effective communication with all levels of associates.<\/li><li>Leads in implementing Avantor HR policies and procedures as well as monitoring the effectiveness of these programs. Assists assigned functional teams with the understanding of these programs.<\/li><li>Ensures that functional teams are trained on recruiting procedures and that appropriate attention is placed on associate retention issues. <\/li><li>Works with functional leaders to ensure that performance reviews are done in a timely manner. Works to ensure that career and training opportunities are being identified.<\/li><li>Assists management team in developing skills to manage human resources more effectively through modeling, coaching, instruction, and training.<\/li><li>Acts as a member of respective leadership team and participates in all staff meetings and provides HR insights on business issues when necessary. <\/li><li>Manages projects and\/or participates as a project member on company-wide HR initiatives.<\/li><li>Supports and champions organizational change initiatives and assists field leaders as necessary.<\/li><li>Performs other duties as assigned.<br><\/li><\/ul><strong>QUALIFICATIONS (Education\/Training, Experience and Certifications)<br><br><\/strong><ul><li>Requires 4-year college degree or equivalent work experience. Master's degree preferred or equivalent work experience.<\/li><li>Requires minimum of 5+ years of Human Resources experience.<\/li><li>Professional in Human Resources (PHR) certification, preferred.<\/li><li>Experience in managing of collective bargaining agreements and delivering management training programs preferred.<\/li><li>Experience supporting functional Operations such as Customer Service, Transportation, Supply Chain, Manufacturing and\/or Distribution preferred.<\/li><li>Bilingual (Spanish and English), a must<br><\/li><\/ul><strong>KNOWLEDGE SKILLS AND ABILITIES (Those necessary to perform the job competently)<br><br><\/strong><ul><li>Must have a proven track record of relationship building with both internal and external customers<\/li><li>Strong analytical and problem-solving skills<\/li><li>Excellent oral, written and interpersonal communication skills<\/li><li>Ability to handle employee conflicts and differences by interpreting verbal\/ non-verbal behavior, detecting perceptions and needs of employees, understanding and valuing employee differences<\/li><li>Demonstrated business acumen and the ability to understand business strategy and goals<\/li><li>Requires working knowledge of MS Office and HRIS systems<\/li><li>Ability to work independently and with a team <br><\/li><\/ul><strong>ENVIRONMENTAL WORKING CONDITIONS &amp; PHYSICAL EFFORT (Under Typical Positions)<br><br><br><\/strong>Typically works in an office with adequate lighting and ventilation and a normal range of temperature and noise level.<br><br>Work assignments are diversified. Examples of past precedent are used to resolve work problems. New alternatives may be developed to resolve problems. A frequent volume of work and deadlines impose strain on routine basis. <br><br>While performing the duties of this job, the associate may be exposed to industrial warehouses, manufacturing and office areas.<br><br>Minimal physical effort is required. Work is mostly sedentary but does require walking, standing, bending, reaching, lifting or carrying objects that typically weigh less than 10 lbs<br><br><strong>DISCLAIMER:<br><br><\/strong>The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position.<br>Avantor is proud to be an equal opportunity employer.<br><strong><strong> EEO Statement <br><br><br><\/strong><\/strong><em> We are an Equal Employment\/Affirmative Action employer. We do not discriminate in hiring on the basis of sex, gender identity, sexual orientation, race, color, religious creed, national origin, physical or mental disability, protected Veteran status, or any other characteristic protected by federal, state\/province, or local law. <br><br><\/em><em> If you need a reasonable accommodation for any part of the employment process, please contact us by email at <\/em><em><u> TalentManagement@avantorsciences.com <\/u> and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address. <br><br><\/em><em>For more information about equal employment opportunity protections, please view the Equal Employment Opportunity is THE LAW Poster, EEO is the Law Poster Supplement, and Pay Transparency Non-Discrimination Provision using the links below.<br><br><\/em> EEO is the Law <br><br> OFCCP EEO Su pplement <br><br> PAY TRANSPARENCY NONDISCRIMINATION PROVISION <br><br>3rd party non-solicitation policy<br><br>By submitting candidates without having been formally assigned on and contracted for a specific job requisition by Avantor, or by failing to comply with the Avantor recruitment process, you forfeit any fee on the submitted candidates, regardless of your usual terms and conditions. Avantor works with a preferred supplier list and will take the initiative to engage with recruitment agencies based on its needs and will not be accepting any form of solicitation<br>\"}"
}