{
    "id":"Kaggle::techmap::614e7eb248f252376a32e427::britishjobs_uk::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Rapidly growing Insurance\/Broker seek an interim FP&A Manager to provide support to the CFO. The successful candidate will have recent FP&A experience gained from Insurance and\/or Insurance Broking be immediately available and able to commit to a minimum of 3 months. Work on a variety of projects helping to assess the structure of the business going ahea. Produce appropriate variance analysis covering actuals \/ forecasts \/ budgets. Assist the preparation of broking monthly management accounts and submit to Group as per the timetable. Ensure those accounts are prepared in accordance with current accounting standards and group policy. Lead the business heads in the preparation of annual budgeting and adhoc forecasting. Ensure those plans are underpinned by the appropriate drivers of performance and PY's are bridged. Attend and contribute to the key broking meeting e. g. pricing \/ broking exec and monthly results. Management of the relationship with the key broking personal ensuring they receive the necessary support. Wok with the CFO to develop improved MI across the broking businesses FP&A experience gained from an Insurance\/Insurance Broking business is essential.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614e7eb248f252376a32e427::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Human Capital Partners Limited\", \"position\": \"Interim FP&A Manager\", \"notes\": \"\", \"original\": \"Rapidly growing Insurance\/Broker seek an interim FP&amp;A Manager to provide support to the CFO. The successful candidate will have recent FP&amp;A experience gained from Insurance and\/or Insurance Broking be immediately available and able to commit to a minimum of 3 months. <br><br>Work on a variety of projects helping to assess the structure of the business going ahea<br>Produce appropriate variance analysis covering actuals \/ forecasts \/ budgets<br>Assist the preparation of broking monthly management accounts and submit to Group as per the timetable<br>Ensure those accounts are prepared in accordance with current accounting standards and group policy.<br>Lead the business heads in the preparation of annual budgeting and adhoc forecasting<br>Ensure those plans are underpinned by the appropriate drivers of performance and PY&#39;s are bridged<br>Attend and contribute to the key broking meeting e.g. pricing \/ broking exec and monthly results<br>Management of the relationship with the key broking personal ensuring they receive the necessary support.<br>Wok with the CFO to develop improved MI across the broking businesses FP&amp;A experience gained from an Insurance\/Insurance Broking business is essential. <br><br>\"}"
}