{
    "id":"Kaggle::techmap::61458a9e1fc3b643e50b21b3::linkedin_za::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"Competitive salary\" - this has been shown to decrease diversity in the candidate pool.",
    "verified":true,
    "synthetic":false,
    "text":" Ability to operate independently with a high degree of energy, enthusiasm and flexibility. Ability to develop and maintain strong client relationships individually or in a team setting. Other. Supervisory Responsibilities: None. Equipment To Be Used: Personal computer and other office equipment such as telephone, calculator, fax, machine, copier, scanner, etc. Typical Physical Demands: Manual dexterity sufficient to operate standard office equipment. Typical Mental Demands: Able to work effectively in a fast paced environment. Make judgment decisions and adapt to changing work situations. Grasp and apply new ideas. Communicate with various personalities at all levels. Working Conditions: Works in typical office setting. Occasionally called upon to work hours in excess of your normal daily schedule. Reed Smith offers a challenging work environment, business casual dress code and a total compensation package that includes a competitive salary, flexible benefits program, tuition assistance, and generous 401 (k) plan. Reed Smith is an Equal Opportunity Employer. Reed Smith's success depends heavily on the effective utilization of qualified people, regardless of their race, ancestry, religion, color, sex, age, national origin, sexual orientation, gender identity and\/or expression, disability, veteran's status, or any characteristic protected by law. As a firm, we adhere to and promote equal employment opportunity for all. Reed Smith provides reasonable accommodations for persons with disabilities, including in the application and interview process. Qualified candidates only. No search firms.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61458a9e1fc3b643e50b21b3::linkedin_za\", \"source\": \"linkedin_za\", \"country\": \"ZA\", \"company\": \"Reed Smith LLP\", \"position\": \"Business and Advisory Solutions Analyst\", \"notes\": \"\", \"original\": \"<strong><u>US Job Description<br><br><\/u><\/strong><strong><strong>Firm Information<br><br><\/strong><\/strong>Reed Smith is a global relationship law firm with more than 1,700 lawyers in 30 offices throughout the United States, Europe, Asia and the Middle East.<br><br>Founded in 1877, the firm represents leading international businesses, from Fortune 100 corporations to mid-market and emerging enterprises. Its lawyers provide litigation and other dispute resolution services in multi-jurisdictional and other high-stakes matters; deliver regulatory counsel; and execute the full range of strategic domestic and cross-border transactions. Reed Smith is a preeminent advisor to industries including financial services, life sciences, health care, advertising, entertainment and media, shipping and transport, energy and natural resources, real estate, manufacturing, technology, and education. For more information, visit reedsmith.com.<br><br><strong><strong>Position Summary<br><br><\/strong><\/strong>The Business &amp; Advisory Solutions practice at Gravity Stack is focused on blending top-tiered management consulting expertise through a legal lens to help F500 clients and alike strengthen and automate business operations, mitigate risk, and ensure industry compliance.<br><br>The Business &amp; Advisory Solutions Analyst will join a team of consulting experts working across industries to solve a wide spectrum of business challenges. An ideal team member will be able to leverage fundamental knowledge of project and process management while applying creative problem solving to <strong><em>design <\/em><\/strong>bespoke solutions for each client\\u2019s unique business needs.<br><br><strong><u>Essential Functions<br><\/u><\/strong><ul><li> Assist in consulting with clients on developing innovative solutions and tailored technology workflows, and managing customer budget and expectations throughout the litigation and transactional lifecycles.<\/li><li> Assist in explaining solution capabilities, limitations, and implementation requirements and describe technical tradeoffs and implementation alternatives while balancing revenue opportunities.<\/li><li> Assist in requirements sessions and provide implementation management while working with stakeholders and the delivery team to select, design, deploy and support on an ongoing basis.<\/li><li> Execute on understanding of Business Analysis professional standards, business processes, workflows, methodologies and leading practices.<br><\/li><\/ul><strong><u>Requirements<br><br><\/u><\/strong><strong>Education: <\/strong> Bachelor\\u2019s degree preferred in Business, Computer Science, Industrial Engineering, Data Analytics<br><br><strong><u>Experience<br><br><\/u><\/strong>Top tiered management consulting experience (Big 4, MBB, Accenture, etc.) preferred.<br><br>PMP or other professional certification in project management, process optimization preferred.<br><br>1-3 years of related Business Analysis or PMO experience.<br><br>1-3 years in professional services (consulting or software sales\/implementation).<br><br><strong><u>Experience In Two Or More Of The Following Disciplines<br><\/u><\/strong><ul><li> Project management\/coordinator\/PMO <\/li><li> Business analysis <\/li><li> Financial analysis <\/li><li> Process improvement <\/li><li> Technology implementation\/integration <\/li><li> Data analytics <\/li><li> Organizational change management <br><\/li><\/ul><strong>Skills: <\/strong> Exemplary communications skills, both verbal and written. Ability to operate independently with a high degree of energy, enthusiasm and flexibility. Ability to develop and maintain strong client relationships individually or in a team setting.<br><br><strong><u>Other<br><br><\/u><\/strong><strong>Supervisory Responsibilities: <\/strong>None<br><br><strong>Equipment To Be Used: <\/strong>Personal computer and other office equipment such as telephone, calculator, fax, machine, copier, scanner, etc.<br><br><strong>Typical Physical Demands: <\/strong>Manual dexterity sufficient to operate standard office equipment.<br><br><strong>Typical Mental Demands: <\/strong> Able to work effectively in a fast paced environment. Make judgment decisions and adapt to changing work situations. Grasp and apply new ideas. Communicate with various personalities at all levels.<br><br><strong>Working Conditions: <\/strong>Works in typical office setting. Occasionally called upon to work hours in excess of your normal daily schedule.<br><br>Reed Smith offers a challenging work environment, business casual dress code and a total compensation package that includes a competitive salary, flexible benefits program, tuition assistance, and generous 401 (k) plan.<br><br>Reed Smith is an Equal Opportunity Employer. Reed Smith's success depends heavily on the effective utilization of qualified people, regardless of their race, ancestry, religion, color, sex, age, national origin, sexual orientation, gender identity and\/or expression, disability, veteran's status, or any characteristic protected by law. As a firm, we adhere to and promote equal employment opportunity for all.<br><br>Reed Smith provides reasonable accommodations for persons with disabilities, including in the application and interview process.<br><br>Qualified candidates only. No search firms.\"}"
}