{
    "id":"Kaggle::techmap::6155b1ccd198905e9e60d912::monster_us::14",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Geared for the Driven. Safety is always top of mind for Valvoline Instant Oil Change SM (VIOC), and we want you to know that we are working hard to protect our team members and our guests with our stay-in-your-car oil change process plus newly added safety measures in line with CDC guidelines. We are proud to provide essential services to our communities. Whether you’re looking for a part-time job with flexible hours or a full-time career with excellent advancement potential, you’ll find it all at VIOC. With an award-winning training program and fair and honest values, we’re here to help you reach every milestone. What you’ll do. As an Assistant Manager, you will blend technical and management skills to lead, develop and train others in providing superior customer service. No day is ever dull. You’ll be on the move, interacting with your team and customers to find the best solutions for their vehicle’s needs while building loyalty. You will also enjoy playing a role in your team members’ success. If you are ready to take the initiative, we’re here to help you put your career on the fast-track to success. Deliver a positive first impression to each guest with a warm and friendly greeting. Build trust and win repeat, loyal customers. Assist the Service Center Manager (SCM) in the daily operation and oversight of the service center. Responsible for inventory, labor management and financial performance of the service center. Become familiar with Environmental, Health & Safety (EH&S) compliance and other policies and procedures. Help maintain a clean, well-organized service center and facilitate a safe and secure working environment. Provide superior customer service leadership. How you’ll succeed. You are friendly and willing to work as part of customer-focused team. Have effective interpersonal, oral communication skills. Ability to perform mathematical calculations such as addition, subtraction, multiplication, division, and percentages. Knowledge of cash handling, facility and safety control policies and practices. Ability to occasionally lift up to 50 pounds. Be able to stand for extended periods of time and climb stairs. Have full mobility and are able to twist, stoop and bend. High school diploma or equivalent. Six months of supervisory experience or related experience\/training preferred. Why choose a career with VIOC? For over 30 years, we’ve been bringing the convenience of fast, friendly maintenance service to busy people. Today, we operate over 1, 100 locations across the U. S. and growing.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155b1ccd198905e9e60d912::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Valvoline\", \"position\": \"Assistant Manager - Clive, IA\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <header> <p><strong>Geared for the Driven<\/strong><\/p> <p>Safety is always top of mind for Valvoline Instant Oil Change<sup> SM<\/sup> (VIOC), and we want you to know that we are working hard to protect our team members and our guests with our stay-in-your-car oil change process plus newly added safety measures in line with CDC guidelines. We are proud to provide essential services to our communities.&nbsp;<\/p> <p>Whether you\\u2019re looking for a part-time job with flexible hours or a full-time career with excellent advancement potential, you\\u2019ll find it all at VIOC. With an award-winning training program and fair and honest values, we\\u2019re here to help you reach every milestone.&nbsp;<\/p> <p><strong>What you\\u2019ll do<\/strong><\/p> <p>As an Assistant Manager, you will blend technical and management skills to lead, develop and train others in providing superior customer service. No day is ever dull. You\\u2019ll be on the move, interacting with your team and customers to find the best solutions for their vehicle\\u2019s needs while building loyalty. You will also enjoy playing a role in your team members\\u2019 success. If you are ready to take the initiative, we\\u2019re here to help you put your career on the fast-track to success.<\/p> <ul> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Deliver a positive first impression to each guest with a warm and friendly greeting<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Build trust and win repeat, loyal customers<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Assist the Service Center Manager (SCM) in the daily operation and oversight of the service center <\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Responsible for inventory, labor management and financial performance of the service center.<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Become familiar with Environmental, Health &amp; Safety (EH&amp;S) compliance and other policies and procedures<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Mentor, lead and train the team to optimize their development <\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Help maintain a clean, well-organized service center and facilitate a safe and secure working environment<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Provide superior customer service leadership<br><\/li> <\/ul> <p style=\\\"color:rgb( 118 , 113 , 113 )\\\">&nbsp;<\/p> <p><strong>How you\\u2019ll succeed<\/strong><\/p> <ul> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">You are friendly and willing to work as part of customer-focused team<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Have effective interpersonal, oral communication skills<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Ability to perform mathematical calculations such as addition, subtraction, multiplication, division, and percentages<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Knowledge of cash handling, facility and safety control policies and practices<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Ability to occasionally lift up to 50 pounds<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Be able to stand for extended periods of time and climb stairs<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Have full mobility and are able to twist, stoop and bend<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">High school diploma or equivalent<\/li> <li style=\\\"color:rgb( 118 , 113 , 113 )\\\">Six months of supervisory experience or related experience\/training preferred<\/li> <\/ul> <p><strong>&nbsp;<\/strong><\/p> <p><strong>Why choose a career with VIOC?<\/strong><\/p> <p>For over 30 years, we\\u2019ve been bringing the convenience of fast, friendly maintenance service to busy people. Today, we operate over 1,100 locations across the U.S. and growing. We\\u2019re passionate about cars, but we\\u2019re really in the business of taking care of people. We live by the policy of promoting from within and maintaining an unwavering dedication to hiring, developing and supporting the best talent in the world. Isn\\u2019t it time you aligned your career to your needs? Join us today!<\/p> <p>&nbsp;<\/p> <p><strong>Benefits include:<\/strong><\/p> <ul style=\\\"outline:0px !important\\\"> <li style=\\\"outline:0px !important\\\">Competitive pay &amp; flexible work schedule<\/li> <li>On-the-job training<\/li> <li>Paid weekly<\/li> <li>We promote from within\\u2013a commitment we are passionate about<\/li> <li>No late evenings<\/li> <li>Paid time off and holidays*<\/li> <li>Medical, dental, vision, and 401(k) savings plans*<\/li> <\/ul> <p><em>*Terms and conditions apply and benefits may differ depending on location<\/em><\/p><em>Valvoline is proud to be an Equal Opportunity Employer and welcomes everyone to apply.&nbsp; All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, or protected veteran status and will not be discriminated against on the basis of disability.<\/em> <\/header> <\/div>\"}"
}