{
    "id":"Kaggle::techmap::614d3714463aa27e3dae34a9::seek_au::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Experienced Heavy Rigid Drivers. ABOUT THE CLEINT. Action Workforce has partnered up with a very reputable company based in South Brisbane. This company is well known and pride themselves on a great working environment. Our client have a very strong multicultural working environment and are looking for HR Drivers to join the team. Located in Rocklea 4106, Eagle Farm 4009 and Staplyton 4207. Pay Rate $34+. Monday to Friday on-going casual roster. 38 hours a week with over time opportunities. Opportunity to go full time with the client in three month. ROLES AND RESPONSIBILITIES. Multi Drops Experience. Tailgate Experience. Physically fit and able to lift 20+kgs. Current valid Truck Licence (HR or higher). Good traffic report (must supply a recent traffic history report. maximum of 7 days old). SKILLS AND EXPERENICE. Have a great attitude. Have great attention to detail. Be able to hit Deadlines. TO BE CONSIDERED YOU MUST. Be flexible with working hours. Clean criminal record (Police Check performed). Have own transport and licence. Have a Passport or Birth Certificate. Have two professional references. Have a can do attitude & stable work history. All applications will be treated with the strictest of confidence and will be subject to suitability based on Action Workforce induction process which includes full drug screening and physical assessment. If you believe that you meet the above criteria, please click \"Apply for This Job\". Due to the high volume of applications only successful applicants will be contacted. If you have not received a call within 2 weeks please consider your application unsuccessful.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d3714463aa27e3dae34a9::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Action Workforce\", \"position\": \"Experienced Heavy Rigid Drivers - ASAP Start\", \"notes\": \"\", \"original\": \"<p><strong>Experienced Heavy Rigid Drivers<\/strong><\/p><p> <\/p><p><strong>ABOUT THE CLEINT <\/strong><\/p><p>Action Workforce has partnered up with a very reputable company based in South Brisbane. This company is well known and pride themselves on a great working environment.<\/p><p>Our client have a very strong multicultural working environment and are looking for HR Drivers to join the team.<\/p><p> <\/p><ul><li>Located in Rocklea 4106, Eagle Farm 4009 and Staplyton 4207<\/li><li>Pay Rate $34+<\/li><li>Monday to Friday on-going casual roster<\/li><li>38 hours a week with over time opportunities<\/li><li>Opportunity to go full time with the client in three month<\/li><\/ul><p> <\/p><p><strong>ROLES AND RESPONSIBILITIES<\/strong><\/p><ul><li>Multi Drops Experience<\/li><li>Tailgate Experience<\/li><li>Physically fit and able to lift 20+kgs<\/li><li>Current valid Truck Licence (HR or higher)<\/li><li>Good traffic report (must supply a recent traffic history report - maximum of 7 days old)<\/li><\/ul><p><strong>SKILLS AND EXPERENICE<\/strong><\/p><ul><li>Have a great attitude<\/li><li>Have great attention to detail<\/li><li>Be able to hit Deadlines<\/li><\/ul><p><strong>TO BE CONSIDERED YOU MUST<\/strong><\/p><ul><li>Be flexible with working hours<\/li><li>Clean criminal record (Police Check performed)<\/li><li>Have own transport and licence<\/li><li>Have a Passport or Birth Certificate<\/li><li>Have two professional references<\/li><li>Have a can do attitude &amp; stable work history<\/li><\/ul><p> <\/p><p>All applications will be treated with the strictest of confidence and will be subject to suitability based on Action Workforce induction process which includes full drug screening and physical assessment.<\/p><p>If you believe that you meet the above criteria, please click \\\"Apply for This Job\\\".<\/p><p>Due to the high volume of applications only successful applicants will be contacted. If you have not received a call within 2 weeks please consider your application unsuccessful. Previous applicants need not apply.<\/p>\"}"
}