{
    "id":"Kaggle::techmap::6149f9482bc7ed5360cf9045::itjobslist_us::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Overview:At Cube. Smart, our culture makes the difference. When we say it s what s inside that counts, we are saying you count. Responsibilities:What Cube. Smart offers:Non-Traditional Retail Hours Competitive Hourly Rate and Bonus Opportunities. Paid Time Off Vacation, Sick, and Holidays Generous Health Benefits 401k retirement plan with company match Short Term Disability. Tuition Reimbursement Storage discounts. The Maintenance teammate is responsible for Keeping a clean and safe storage facility to ensure condition meets company guidelines (i. e. landscaping, parking and paving, fence, walls, doors, painting)Performing minor and routine maintenance activities throughout the facility. Providing upkeep of the appearance of the building and property by sweeping hallways, stairs and storage spaces, including restroom areas Cleaning vacated units on a timely basis and preparing units for future rentals. Reporting maintenance requirements, potential equipment failures and unsafe conditions to management. Other duties as assigned. You d be great in this role if you can Work independently with minimal supervision. Communicate and interact professionally with teammates and customers. Make basic repairs. Use handheld tools and equipment. You ll love working here because YOU WILL MAKE A DIFFERENCE YOU WILL BELONG TO A TEAM YOU WILL GROW WITH USQualifications:We also want you to know that. You must have the ability to work Saturdays and\/or Sundays. While performing the duties of this job, you will be frequently required to stand, sit, kneel, crouch, crawl, bend, climb or balance on a ladder. On occasion, you may need to lift and\/or move up to 50 pounds. You may be required to travel daily to and from other facilities for various tasks as directedNote: If you have experience working in any of the following types of jobs, we encourage you to apply: Custodian, Janitorial, Custodial, Housekeeper, Janitor, Maintenance, Housekeeping, Groundskeeper, Landscaper, Laborer, Warehouse. #LI-MZ1",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6149f9482bc7ed5360cf9045::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"CubeSmart\", \"position\": \"Maintenance\", \"notes\": \"\", \"original\": \"Overview:At CubeSmart, our culture makes the difference. When we say it s what s inside that counts, we are saying you count .Responsibilities:What CubeSmart offers:Non-Traditional Retail Hours Competitive Hourly Rate and Bonus OpportunitiesPaid Time Off Vacation, Sick, and Holidays Generous Health Benefits 401k retirement plan with company match Short Term DisabilityTuition Reimbursement Storage discountsThe Maintenance teammate is responsible for Keeping a clean and safe storage facility to ensure condition meets company guidelines (i.e. landscaping, parking and paving, fence, walls, doors, painting)Performing minor and routine maintenance activities throughout the facilityProviding upkeep of the appearance of the building and property by sweeping hallways, stairs and storage spaces, including restroom areas Cleaning vacated units on a timely basis and preparing units for future rentalsReporting maintenance requirements, potential equipment failures and unsafe conditions to managementOther duties as assignedYou d be great in this role if you can Work independently with minimal supervisionCommunicate and interact professionally with teammates and customersMake basic repairs; use handheld tools and equipmentYou ll love working here because YOU WILL MAKE A DIFFERENCE YOU WILL BELONG TO A TEAM YOU WILL GROW WITH USQualifications:We also want you to know that.You must have the ability to work Saturdays and\/or SundaysWhile performing the duties of this job, you will be frequently required to stand, sit, kneel, crouch, crawl, bend, climb or balance on a ladderOn occasion, you may need to lift and\/or move up to 50 poundsYou may be required to travel daily to and from other facilities for various tasks as directedNote: If you have experience working in any of the following types of jobs, we encourage you to apply: Custodian, Janitorial, Custodial, Housekeeper, Janitor, Maintenance, Housekeeping, Groundskeeper, Landscaper, Laborer, WarehouseWe are an Equal Opportunity Employer, Minority\/Female\/Veteran\/Individuals with Disabilities\/Sexual Orientation\/Gender Identity.#LI-MZ1\"}"
}