{
    "id":"Kaggle::techmap::6141f4387ea9bc0ff350d4a1::seek_au::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"They operate within a leading edge. Net technical environment, working on modular components hosted in AWS and require a strong Software Developer to provide a mix of technical skills to assist in the deliver of new features and technology in their expanding development team. This role reports into the Development manager working in a multiple disciplined team at the Northern suburbs HQ with WFH flexibility 1 to 2 days per week. Their platform is built using a distributed event-driven architecture, leveraging a host of modern technologies to deliver a robust and scalable system. Primarily written in. Net with Angular web components, they're committed to staying abreast of technical developments and aren't afraid to use the best tools for the job. Key Responsibilities. Work in an agile environment well supported by BA's, Testers and our Dev Ops team. Influence all aspects of the technical team from delivery through to development. Take part in daily stand-ups and weekly releases. Providing leadership and development skills to help the team deliver value and mentor junior team members and assure code quality is at the highest standard and architecture are adhered to (no hacky code). Share technical knowledge across teams and help solve difficult technical challenges. Collaborate with stakeholders across the business to identify and deliver key functionality. Drive technical improvements within and across the teams. Key Requirements: Deep understanding of. Net and ideally container driven development. Broad experience in large, integrated, software systems. Strong software design and architectural skills particularly around DDD, CQRS and ES. Committed to writing, and upholding, quality code and design principles. Cloud experience. particularly in AWS and deployment using Team City \/ Octopus Deploy. Qualifications in a relevant software discipline. On Offer: Permanent opportunity to work on modern technology. WFH 2 days per week (Monday & Friday). Norther Suburbs HQ with parking available on-site. To apply please click apply or call Clint Davies on 08 9266 0900 for a confidential discussion.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6141f4387ea9bc0ff350d4a1::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Robert Walters\", \"position\": \"Software Developer\", \"notes\": \"\", \"original\": \"<p>They operate within a leading edge .Net technical environment, working on modular components hosted in AWS and require a strong Software Developer to provide a mix of technical skills to assist in the deliver of new features and technology in their expanding development team.<\/p><p>This role reports into the Development manager working in a multiple disciplined team at the Northern suburbs HQ with WFH flexibility 1 to 2 days per week.<\/p><p>Their platform is built using a distributed event-driven architecture, leveraging a host of modern technologies to deliver a robust and scalable system. Primarily written in.Net with Angular web components, they're committed to staying abreast of technical developments and aren't afraid to use the best tools for the job.<\/p><p> <\/p><p><strong>Key Responsibilities<\/strong><\/p><ul><li>Work in an agile environment well supported by BA's, Testers and our Dev Ops team;<\/li><li>Influence all aspects of the technical team from delivery through to development<\/li><li>Take part in daily stand-ups and weekly releases<\/li><li>Providing leadership and development skills to help the team deliver value and mentor junior team members and assure code quality is at the highest standard and architecture are adhered to (no hacky code)<\/li><li>Share technical knowledge across teams and help solve difficult technical challenges<\/li><li>Collaborate with stakeholders across the business to identify and deliver key functionality<\/li><li>Drive technical improvements within and across the teams<\/li><\/ul><p> <\/p><p><strong>Key Requirements:<\/strong><\/p><ul><li>Experience in developing event-driven architectures and expose to SaaS or PaaS software products<\/li><li>Deep understanding of .Net and ideally container driven development<\/li><li>Broad experience in large, integrated, software systems<\/li><li>Strong software design and architectural skills particularly around DDD, CQRS and ES<\/li><li>Committed to writing, and upholding, quality code and design principles<\/li><li>Cloud experience - particularly in AWS and deployment using Team City \/ Octopus Deploy<\/li><li>Qualifications in a relevant software discipline<\/li><\/ul><p> <\/p><p><strong>On Offer:<\/strong><\/p><ul><li>Permanent opportunity to work on modern technology<\/li><li>WFH 2 days per week (Monday &amp; Friday)<\/li><li>Norther Suburbs HQ with parking available on-site<\/li><\/ul><p> <\/p><p> <\/p><p>To apply please click apply or call Clint Davies on 08 9266 0900 for a confidential discussion.<\/p>\"}"
}