{
    "id":"Kaggle::techmap::6148c777e0d5ef56fd13c2e5::careerbuilder_se::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"\"Knowledge of Swedish (preferably mother tongue) \" is biased against fluent Swedish speakers but are not native speakers.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" job description. Are you an energetic and highly motivated salesperson looking for a new opportunity? Come join our sales team in Helsingborg! As a sales manager at Marchesini Group you will be responsible for promoting sales of our products in the Scandinavian Area (Sweden, Denmark, Finland, Norway and Iceland). Additionally you will generate new business opportunities, develop and maintain long-term business relationship with new and current customers. responsibilities. Your main responsibilities will be: Maintaining and increasing sales of our products and services. Prepare responses to request for proposals and request for information with Area Manager support. Travelling to potential and existing customers within an assigned sales area to present company offerings and build brand awareness. Manage customer relationship throughout all phases of the sales cycle. Coordinate with other team members and departments to optimize the sales effort. Maintain high customer satisfaction rating that meets customer standards. Support customer with technical advice. Communicate sales and service opportunities to new and acquired customers. Attend and participate in trade shows, trainings, factory acceptance tests and other relevant events. Track all sales activities in company CRM system and update account information regularly. You share an office in Helsingborg with your colleagues, a Sales Manager, a service technician and an administrator \/ inside salesman. working hours. Full time, 40 hours\/week. The position is positioned in Helsingborg. Due to the nature of the role, full flexibility will be given and also required. In the new normal you will have around 100-120 estimated travel days per year. qualifications. We are looking for you who have minimum a secondary education (preferably with technical focus), a technical background and at least 5 years of proven sales experience. Knowledge of Swedish (preferably mother tongue) and English are required along with proficiency in Microsoft Office and a drivers license. Its strongly meritorious if you have knowledge of the aseptic and sterile process or sector-specific sales experience within the pharmaceutical or cosmetic industry. As a salesperson you have outstanding negotiation and consultative sales skills, strong communications skills and ability to interact with all levels of the organization. You also have strong analytical and problem-solving skills. For us, it is important that all competence and skills in the labor market are utilized. We welcome all applicants and strive for diversity. application. Selection and interviews will be ongoing.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148c777e0d5ef56fd13c2e5::careerbuilder_se\", \"source\": \"careerbuilder_se\", \"country\": \"SE\", \"company\": \"Randstad AB\", \"position\": \"sales manager to Marchesini Group Helsingborg\", \"notes\": \"\", \"original\": \"<br \/><br \/><b>job description.<\/b><br \/><br \/><div><div>\\u00a0Are you an energetic and highly motivated salesperson looking for a new opportunity? Come join our sales team in Helsingborg! As a sales manager at Marchesini Group you will be responsible for promoting sales of our products in the Scandinavian Area (Sweden, Denmark, Finland, Norway and Iceland). Additionally you will generate new business opportunities, develop and maintain long-term business relationship with new and current customers.\\u00a0<br \/><br \/><\/div><\/div><br \/><br \/><b>responsibilities.<\/b><br \/><br \/><div><div>\\u00a0Your main responsibilities will be:<\/div><ul><li>Maintaining and increasing sales of our products and services<\/li><li>\\u00a0Prepare responses to request for proposals and request for information with Area Manager support<\/li><li>Travelling to potential and existing customers within an assigned sales area to present company offerings and build brand awareness<\/li><li>Manage customer relationship throughout all phases of the sales cycle<\/li><li>Coordinate with other team members and departments to optimize the sales effort<\/li><li>Maintain high customer satisfaction rating that meets customer standards<\/li><li>Support customer with technical advice<\/li><li>\\u00a0Communicate sales and service opportunities to new and acquired customersAttend and participate in trade shows, trainings, factory acceptance tests and other relevant events<\/li><li>\\u00a0Track all sales activities in company CRM system and update account information regularly.\\u00a0<\/li><\/ul><div><br \/>You share an office in Helsingborg with your colleagues, a Sales Manager, a service technician and an administrator \/ inside salesman.<\/div><\/div><br \/><br \/><b>working hours.<\/b><br \/><br \/><div><div>\\u00a0Full time, 40 hours\/week. The position is positioned in Helsingborg. Due to the nature of the role, full flexibility will be given and also required. <strong>In the new normal you will have around 100-120 estimated travel days per year. <\/strong><br \/><br \/><\/div><\/div><br \/><br \/><b>qualifications.<\/b><br \/><br \/><div><div>\\u00a0We are looking for you who have minimum a secondary education (preferably with technical focus), a technical background and at least 5 years of proven sales experience. Knowledge of Swedish (preferably mother tongue) and English are required along with proficiency in Microsoft Office and a driver\\u2019s license.\\u00a0<br \/><br \/><\/div><div>It\\u00b4s strongly meritorious if you have knowledge of the aseptic and sterile process or sector-specific sales experience within the pharmaceutical or cosmetic industry.\\u00a0<br \/><br \/><\/div><div>As a salesperson you have outstanding negotiation and consultative sales skills, strong communications skills and ability to interact with all levels of the organization. You also have strong analytical and problem-solving skills.\\u00a0<br \/><br \/><\/div><div>For us, it is important that all competence and skills in the labor market are utilized. We welcome all applicants and strive for diversity.\\u00a0<br \/><br \/><\/div><\/div><br \/><br \/><b>application.<\/b><br \/><br \/><div><div>\\u00a0Selection and interviews will be ongoing. The position may be filled before the last day of application, therefore, apply as soon as possible. Please motivate what you can contribute with to Marchesini in your application.\\u00a0<br \/><br \/><\/div><div><strong>For more information:<\/strong> In this recruitment Marchesini Group cooperate with Randstad. If you have any questions regarding this position and the recruitment process, please contact recruiter Mikaela Hutzelmann Persson at [Email available when viewing the job]\\u00a0<br \/><br \/><\/div><\/div>&nbsp;\"}"
}