{
    "id":"Kaggle::techmap::614bfac6b5367173cc052469::linkedin_be::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The term \"Native\/Native level French\" could introduce bias by excluding qualified candidates who are fluent in French but are not native speakers, thereby potentially favouring certain racial or ethnic backgrounds.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1-2 years sales development experience, preferably at a SaaS company. Native\/Native level French. A proven track for prospecting new business from initial outreach to discovery and pre-qualification. A process driven individual who can organize and prioritize their prospect list. Someone with a sales strategic mindset. An individual with solid verbal and written sales skills. A team player and a self-starter.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614bfac6b5367173cc052469::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"Kaltura\", \"position\": \"Sales Development Representative\", \"notes\": \"\", \"original\": \"Kaltura\\u2019s mission is to power any video experience for any organization. Kaltura is the video experience cloud, powering communication, collaboration, learning, and entertainment. Kaltura\\u2019s products are used by over 1,000 global enterprises, media companies, service providers, and educational institutions, engaging more than a hundred million viewers at home, at work, and at school.<br><br>Our core values are openness, flexibility, and collaboration. We like to think of ourselves as a cool, fun, and talented group of professionals looking to create cutting-edge technology. Kaltura is a fast-paced environment where standards are high, and initiative is always encouraged. Kaltura has over 700 employees worldwide with offices in New York, London, Singapore, and Tel Aviv. We are growing rapidly and have many exciting open positions all over the world. We promote a flexible work environment that encourages work-life-balance, internal mobility and relocation, community involvement, LGBTQ rights, a refer-a-friend program, and a newly launched paternity leave policy.<br><br><strong>If you don't meet 100% of the requirements below - that's okay, nobody's perfect! We believe in hiring people, not just a list of skills. We encourage you to apply if you think this is a role that would make you excited about coming to work every day.<br><br><\/strong><strong><u>Requirements<br><br><\/u><\/strong>Kaltura is looking to expand their EMEA SDR team. As a Sales Development Representative (SDR) you will be using sales strategy, strong prospecting skills, and process to help grow pipeline that leads to revenue. The position will call on you to handle inbound leads, and work with the sales reps to target accounts for outbound efforts. This is a lead generating position with potential to grow to a closing role in the future.<br><br><strong><u>In This Role You Will<br><\/u><\/strong><ul><li> Leverage sales skills via phone, email and social media in an effort to gauge and influence interest in Kaltura and qualify them for a more in- depth conversation<\/li><li> Position the value of Kaltura\\u2019s solutions to stakeholders at Enterprise companies, Universities and Colleges.<\/li><li> Manage inbound leads coming from the website, webinars, events among other sources.<\/li><li> Identify and pursue the key stake holders at Fortune 1000 companies.<\/li><li> Consistently meet and exceed SDR quotas for appointments scheduled.<\/li><li> Partner with marketing to execute prospecting strategies.<\/li><li> Learn to sell Kaltura and be placed on a track for growth to a closing role or other position.<br><\/li><\/ul><strong><u>What We Are Looking For<br><\/u><\/strong><ul><li> 1-2 years sales development experience, preferably at a SaaS company<\/li><li> Native\/Native level French<\/li><li> A proven track for prospecting new business from initial outreach to discovery and pre-qualification<\/li><li> A process driven individual who can organize and prioritize their prospect list<\/li><li> Someone with a sales strategic mindset<\/li><li> An individual with solid verbal and written sales skills<\/li><li> A team player and a self-starter<\/li><\/ul>\"}"
}