{
    "id":"Kaggle::techmap::61662faa4394ba2ad800f6c5::linkedin_fi::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrases \"will stop at nothing to ensure a task is complete\" and \"self-directed initiators\" can resonate more with male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Clinical Support Specialist, Robotic Assisted Surgery. Learn more about what a Mako Product Specialist does at Stryker and get to know Avnish: httpswww. youtube. com\/watch? vUbSzewUYdY. Learn more about the Mako robot: httpswww. youtube. com\/watch? vs-hSfOKrAZI. Who We Want. Collaborative partners. People who build and leverage cross-functional relationships to bring together ideas, data and insights to drive continuous improvement in functions. Dedicated achievers. People who thrive in a fast-paced environment and will stop at nothing to ensure a task is complete and meets regulations and expectations. Self-directed initiators. People who take ownership of their work and need no prompting to drive productivity, change, and outcomes. What You Will Do. In this role, youll be a resident expert in everything concerning the Mako robot  our newest product used in robotic-arm assisted surgery. The Mako enables surgeons to have a more predictable surgical experience when performing joint replacement surgery, but before they can use the machine, they need you. We depend on your strong communication skills to train surgeons on how to use this life-changing product, and will look to you for product support and assistance pre-, during, and post- operations. In addition to providing ongoing education, you will be a crucial conduit to our Stryker engineers for feedback on product design. Additional tasks include creating case reports, resolving product problems, obtaining purchase orders, monitoring inventory and assisting sales and marketing teams in an effort to increase account growth of the Mako robot. Your Responsibilities Include. Provide clinical product support to all end users and provide on-site guidance and assistance during surgical procedures. Provide surgeons and operating room staff with training and Clinical\/Technical support in the operation of the company's robotic arm applications, associated equipment and instruments to insure ideal placement and precision. Additionally, you will provide ongoing in-services, and customer education to assigned account(s). Use proprietary software to prepare pre-operative CT scans for use in conjunction with the company's RIO\/ Robotic Arm Interactive Orthopedic System, assists surgeon in preoperative implant planning, implant sizing and positioning. Solve potential product problems for customers in an expeditious and highly satisfactory manner. Collaborate with Sales Representatives and Marketing to increase public awareness and highlight clinical benefits of the products, and build strong relationships with key surgeons and OR staff at targeted accounts. Provide feedback on product to improve performance and customer satisfaction.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61662faa4394ba2ad800f6c5::linkedin_fi\", \"source\": \"linkedin_fi\", \"country\": \"FI\", \"company\": \"Stryker\", \"position\": \"Mako Product Specialist Pori (Finland)\", \"notes\": \"\", \"original\": \"<strong>Clinical Support Specialist, Robotic Assisted Surgery <br><br><\/strong><strong>Learn more about what a Mako Product Specialist does at Stryker and get to know Avnish: <\/strong><strong>https:\/\/www.youtube.com\/watch?v=UbSzewU_YdY<br><br><\/strong><strong>Learn more about the Mako robot: <\/strong><strong>https:\/\/www.youtube.com\/watch?v=s-hSfOKrAZI<br><br><\/strong><strong><u>Who We Want<br><br><\/u><\/strong><strong>Collaborative partners.<\/strong> People who build and leverage cross-functional relationships to bring together ideas, data and insights to drive continuous improvement in functions.<br><br><strong>Dedicated achievers.<\/strong> People who thrive in a fast-paced environment and will stop at nothing to ensure a task is complete and meets regulations and expectations.<br><br><strong>Self-directed initiators.<\/strong> People who take ownership of their work and need no prompting to drive productivity, change, and outcomes.<br><br><strong><u>What You Will Do<br><br><\/u><\/strong>In this role, you\\u2019ll be a resident expert in everything concerning the Mako robot \\u2013 our newest product used in robotic-arm assisted surgery. The Mako enables surgeons to have a more predictable surgical experience when performing joint replacement surgery, but before they can use the machine, they need you. We depend on your strong communication skills to train surgeons on how to use this life-changing product, and will look to you for product support and assistance pre-, during, and post- operations. In addition to providing ongoing education, you will be a crucial conduit to our Stryker engineers for feedback on product design. Additional tasks include creating case reports, resolving product problems, obtaining purchase orders, monitoring inventory and assisting sales and marketing teams in an effort to increase account growth of the Mako robot.<br><br><strong><u>Your Responsibilities Include<br><\/u><\/strong><ul><li>Provide clinical product support to all end users and provide on-site guidance and assistance during surgical procedures. <\/li><li>Provide surgeons and operating room staff with training and Clinical\/Technical support in the operation of the company's robotic arm applications, associated equipment and instruments to insure ideal placement and precision. Additionally, you will provide ongoing in-services, and customer education to assigned account(s). <\/li><li>Use proprietary software to prepare pre-operative CT scans for use in conjunction with the company's RIO\/ Robotic Arm Interactive Orthopedic System, assists surgeon in preoperative implant planning, implant sizing and positioning.<\/li><li>Solve potential product problems for customers in an expeditious and highly satisfactory manner.<\/li><li>Collaborate with Sales Representatives and Marketing to increase public awareness and highlight clinical benefits of the products, and build strong relationships with key surgeons and OR staff at targeted accounts.<\/li><li>Provide feedback on product to improve performance and customer satisfaction. <br><\/li><\/ul><strong><u>What You Need<br><\/u><\/strong><ul><li>Clinical support experience, for example as a medical field technician, nurse, physiotherapist, application specialist or similar<\/li><li>Strong customer interaction experience, you place the customer at the heart of everything you do!<\/li><li>Strong communication and interpersonal skills to collaborate with all levels of a medical department<\/li><li>High level of stress resistance, demonstrated problem solving skills to troubleshoot potential problems<\/li><li>High degree of flexibility to travel within region<\/li><li>Demonstrated detail orientation, curious and fast-learner<\/li><li>Demonstrated knowledge of business administrative and clerical procedures and systems (e.g., word processing, file management and record maintenance)<\/li><li>Fluent in Finnish and English<\/li><\/ul>\"}"
}