{
    "id":"Kaggle::techmap::616606ffa415414189c9e376::linkedin_th::0",
    "label_age":true,
    "analysis_age":"\"Perform well under pressure and thrives in a fast-paced environment\" this can be interpreted as implicit bias against older candidates",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"\"Strong communication skills\" without further clarification could be regarded as biased against people not native to the locality.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 5 years of Materials Planning experience. Worked with Global MNC. About Our Client. Our client is a global manufacturer of home appliances. Job Description. Handle activities related to the purchase of material, material control, and inventory control, shipping\/receiving. Develops, implements, and maintains policies, procedures and material control systems. Ensures materials are ordered and in stock to meet company requirements, while maintaining acceptable inventory levels. Develops material schedules and coordinates the efficient movement of materials with purchasing, production and engineering. Reviews and plans requirements for purchasing materials. Prepare material requirement plans using enterprise resource planning systems. Assist with the establishment and maintenance of the production control system. Selects, develops, and evaluates personnel to ensure the efficient operation of the function. Coordinating logistics and BOI requirements. Handling end to end material function. Vendor development, create alternate source and negotiation for cost saving projects. Strong exposure of handling MM Module in ERP. The Successful Applicant. Bachelor's degree or higher in Engineering or related subjects. At least 3-5 years of experience in Materials Planning and Procurement. Background with Home Appliances products will be advantageous. Experience working for a global MNC. Experience working with Chinese clients will be preferred. Advanced Microsoft Office Excel skills. Attention to detail and ability to manage multiple tasks simultaneously. Strong communication skills. Able to influence and get results. Must be a team player and demonstrate successful experience working in across functional international team environment. Perform well under pressure and thrives in a fast-paced environment. Good level of English language. What's On Offer. Base Salary. Allowance. Leading Organisation. Contact: Paam Yanaranop. Quote job ref: 4217039.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::616606ffa415414189c9e376::linkedin_th\", \"source\": \"linkedin_th\", \"country\": \"TH\", \"company\": \"Michael Page\", \"position\": \"Material Buyer (Chonburi) - Global Home Appliances\", \"notes\": \"\", \"original\": \"<ul><li>5 years of Materials Planning experience<\/li><li>Worked with Global MNC<br><br><\/li><\/ul><strong>About Our Client<br><br><\/strong>Our client is a global manufacturer of home appliances.<br><br><strong>Job Description<br><br><\/strong><ul><li> Handle activities related to the purchase of material, material control, and inventory control, shipping\/receiving.<\/li><li> Develops, implements, and maintains policies, procedures and material control systems. Ensures materials are ordered and in stock to meet company requirements, while maintaining acceptable inventory levels.<\/li><li> Develops material schedules and coordinates the efficient movement of materials with purchasing, production and engineering.<\/li><li> Reviews and plans requirements for purchasing materials.<\/li><li> Prepare material requirement plans using enterprise resource planning systems.<\/li><li> Assist with the establishment and maintenance of the production control system. Selects, develops, and evaluates personnel to ensure the efficient operation of the function.<\/li><li> Coordinating logistics and BOI requirements<\/li><li> Handling end to end material function.<\/li><li> Vendor development, create alternate source and negotiation for cost saving projects.<\/li><li> Strong exposure of handling MM Module in ERP.<br><br><\/li><\/ul><strong>The Successful Applicant<br><br><\/strong><ul><li> Bachelor's degree or higher in Engineering or related subjects.<\/li><li> At least 3-5 years of experience in Materials Planning and Procurement.<\/li><li> Background with Home Appliances products will be advantageous.<\/li><li> Experience working for a global MNC.<\/li><li> Experience working with Chinese clients will be preferred.<\/li><li> Advanced Microsoft Office Excel skills<\/li><li> Attention to detail and ability to manage multiple tasks simultaneously<\/li><li> Strong communication skills; able to influence and get results<\/li><li> Must be a team player and demonstrate successful experience working in across functional international team environment<\/li><li> Perform well under pressure and thrives in a fast-paced environment<\/li><li> Good level of English language<br><br><\/li><\/ul><strong>What's On Offer<br><br><\/strong><ul><li> Base Salary<\/li><li> Allowance<\/li><li> Leading Organisation<br><br><\/li><\/ul><strong>Contact: Paam Yanaranop<br><br><\/strong><strong>Quote job ref: 4217039<\/strong>\"}"
}