{
    "id":"Kaggle::techmap::6144ba63c368be4701bcb5f6::monsterasia_sg::7",
    "label_age":true,
    "analysis_age":"While the position is open to both recent graduates and mid-career individuals, the specific mention of graduation years might make it less appealing or accessible to older graduates who do not see themselves reflected in the typical profile of recent graduates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"This position reports to the Head of Programme Design and Delivery Team and interfaces with heads of department and employees. This position supports the organisation’s leadership activities, leading to leadership programme design and delivery. The trainee will have the following responsibilities:. 1. Support the planning of leadership programmes. 2. Assist in designing leadership development curriculum for corporate leaders at different level. 3. Develop presentation materials for different stakeholder presentations. 5. Support the facilitation of leadership programmes and delivery. 6. Support the development of research findings into teaching points for training delivery. 7. Support vendor management and programme logistics. Duration of Traineeship: 6 months. This position is open for both recent graduates and. mid career individuals (mature and non mature). Graduates interested in this position should possess. a Bachelor's Degree. Mid career individuals. from any qualification level can apply. Eligibility: Singapore Citizen or PR, graduated in calendar years 2019 to 2021, OR completed National Service between 2019 to 2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144ba63c368be4701bcb5f6::monsterasia_sg\", \"source\": \"monsterasia_sg\", \"country\": \"SG\", \"company\": \"Human Capital Leadership Institute Pte. Ltd.\", \"position\": \"Programme Design Assistant #SGUnitedTraineeships #SGUP\", \"notes\": \"\", \"original\": \"<div><p>This position reports to the Head of Programme Design and Delivery Team and interfaces with heads of department and employees. This position supports the organisation\\u2019s leadership activities, leading to leadership programme design and delivery.<\/p><p><br><\/p><p>The trainee will have the following responsibilities:<\/p><p><br><\/p><p>1. Support the planning of leadership programmes<\/p><p>2. Assist in designing leadership development curriculum for corporate leaders at different level<\/p><p>3. Develop presentation materials for different stakeholder presentations<\/p><p>5. Support the facilitation of leadership programmes and delivery<\/p><p>6. Support the development of research findings into teaching points for training delivery<\/p><p>7. Support vendor management and programme logistics<\/p><p><br><\/p><p>Duration of Traineeship: 6 months<\/p><p><br><\/p><p>This position is open for both recent graduates and<\/p><p>mid career individuals (mature and non mature).<\/p><p>Graduates interested in this position should possess<\/p><p>a Bachelor's Degree. Mid career individuals<\/p><p>from any qualification level can apply.<\/p><p><br><\/p><p>Eligibility: Singapore Citizen or PR, graduated in calendar years 2019 to 2021, OR completed National Service between 2019 to 2021<\/p><\/div>\"}"
}