{
    "id":"Kaggle::techmap::614bcc1c2bc7ed5360cfcddc::itjobslist_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Our Senior Associates (full-time) support the leadership team through operational execution and delivery of a rewarding customer experience. Why You ll Love It:Closed by 8pm nightly. Closed on Thanksgiving & Christmas. Clear path to promotion. Paid time off. Bonus opportunityFlexible schedules. Associate discountsStable employment with growing company. What You ll Do:Provide a great experience for our customers. Ensure efficient processing of point of sale transactions. Maintain a safe, clean, and organized store. Become a subject matter expert in your role and model adherence to standard operating procedures. Understand and learn other aspects of store operations including logistics associate duties and responsibilities. Other duties as assigned. What We Need:Must be at least 18 years old. Minimum of 1 year experience in retail or customer service. Ability to communicate clearly with customers and associates in person and via e-mail and telephone. Ability to intermittently lift, push and\/or pull up to 50 pounds and stand\/move for entire shift. Ability to lift, bend, kneel, climb, crawl and\/or twist and safely climb up\/down a ladder. Physically able and willing to become certified to operate a forklift in accordance with IIPP (Injury and Illness Prevention Program)Ability to work nights (until 8 p. m. ), weekends and holidays as needed.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614bcc1c2bc7ed5360cfcddc::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"Harbor Freight\", \"position\": \"Senior Retail Sales Associate 18.45\/hr\", \"notes\": \"\", \"original\": \"Our Senior Associates (full-time) support the leadership team through operational execution and delivery of a rewarding customer experience.Why You ll Love It:Closed by 8pm nightlyClosed on Thanksgiving & ChristmasClear path to promotionPaid time offBonus opportunityFlexible schedulesAssociate discountsStable employment with growing companyWhat You ll Do:Provide a great experience for our customersEnsure efficient processing of point of sale transactionsMaintain a safe, clean, and organized storeBecome a subject matter expert in your role and model adherence to standard operating proceduresUnderstand and learn other aspects of store operations including logistics associate duties and responsibilitiesOther duties as assignedWhat We Need:Must be at least 18 years oldMinimum of 1 year experience in retail or customer serviceAbility to communicate clearly with customers and associates in person and via e-mail and telephone.Ability to intermittently lift, push and\/or pull up to 50 pounds and stand\/move for entire shift.Ability to lift, bend, kneel, climb, crawl and\/or twist and safely climb up\/down a ladder.Physically able and willing to become certified to operate a forklift in accordance with IIPP (Injury and Illness Prevention Program)Ability to work nights (until 8 p.m.), weekends and holidays as needed.\"}"
}