{
    "id":"Kaggle::techmap::63670f01f2717228ad1eced4::glassdoor_ie::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" All debris, dust, cardboard, plastics, cables, etc are to be cleared, removed off site and disposed appropriately. Complete weekly van checklist and be accountable in ensuring the Companys vehicle is kept clean, tidy, and litter free at all time. Work directly\/indirectly with relevant team lead\/members, contractors, and customer as guided by your team leader. Remain up to date with requirements and best practice relating to PV design and installations. Assist in diagnosing, identify, and resolve any deficiencies in PV Systems and\/or system malfunctions and operational issues. Help develop documentation, manuals, and best practice guidelines. Adhere to all OHS&W requirements. Communicate with customers in a professional, considerate, and respectful manner, answering all questions and concerns to the best of your ability. Demonstrate system functionality and performance, including start-up, shut-down, normal operation, and emergency or bypass operations to customer. Requirements: Passion for renewable technologies. RECI \/ Safe electric registered electrician \/ QC an advantage salary reflective of qualification. Good communication and interpersonal skills. Able to work on own initiative. Ability to work with teams. Good Time Keeping. Friendly Manner. Experience working in solar or Infrared heating systems would be an advantage but not essential. Test and inspection qualifications would be beneficial. Full Driving License. Safe Pass. Wiliness to travel. Full training provided. Job Type: Full-time. Salary: Negotiable depending on experience. Job Type: Full-time. Salary: €50, 000.00-€75, 000.00 per year. Benefits: Company pension. Employee discount. Relocation assistance. Schedule: Monday to Friday. Supplemental pay types: Bonus pay. Overtime pay.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::63670f01f2717228ad1eced4::glassdoor_ie\", \"source\": \"glassdoor_ie\", \"country\": \"IE\", \"company\": \"PV Generation\", \"position\": \"Electrician\", \"notes\": \"\", \"original\": \"<p><b>Job Description<\/b><\/p><p>Monaghan based positions.<\/p><p>Accommodation Available<\/p><p>Due to continued success & market growth PV Generation are seeking a fully qualified Electrician.<\/p><p>Qualified Electricians required to support installations of Solar PV installations. If you are interested in being part of an exciting and sustainable industry with a fast-growing Irish company and learn new skills, then please apply to PV Generation.<\/p><p>You will be based either in out of our Monaghan or Cork offices and work in a region nearest to your home.<\/p><p>We require qualified electricians with at least 1 years\\u2019 experience. You will need to be flexible and hardworking with the ability to work with a diverse team across the Ireland.<\/p><p>We are looking for a steady and committed candidate on a long-term basis.<\/p><p><b>Essential Duties and Responsibilities<\/b><\/p><p>\\u00b7 Execute all tasks assigned by your designated Team Leader<\/p><p>\\u00b7 Review project plans and survey notes to ensure that the project is built according to design.<\/p><p>\\u00b7 Coordinate travel time with other teams where required<\/p><p>\\u00b7 Identify (eg pick list) and load up products\/components required for the project<\/p><p>\\u00b7 Identify electrical, environmental, and safety hazards associated with photovoltaic (PV) installations on site. Apply all necessary Health and Safety attires and equipment correctly and where required PPE to be worn.<\/p><p>\\u00b7 Determine PV system designs or configurations are based on factors such as customer needs, expectations, and site conditions.<\/p><p>\\u00b7 Determine appropriate sizes, ratings, and locations for all system overcurrent devices, disconnect devices, grounding equipment, and surge suppression equipment<\/p><p>\\u00b7 Assist in carrying out all aspect of electrical installation and commissioning for a PV system, including but not limited to electrical wiring, mounting of inverters and batteries, testing, installation of main switches and other standard commercial and residential electrical work<\/p><p>\\u00b7 Double check electrical installation for proper wiring, polarity, grounding, or integrity of terminations<\/p><p>\\u00b7 Act as site team member during installations, ensuring efficient, safe, and quality work with adherence to the Company\\u2019s high standard of installation, best practice and regulatory requirements<\/p><p>\\u00b7 Measure and analyze system performance and operating parameters to assess operating condition of systems or equipment<\/p><p>\\u00b7 Program, adjust, or configure inverters and controls for desired set points and operating modes.<\/p><p>\\u00b7 Test operating voltages to ensure operation within acceptable limits.<\/p><p>\\u00b7 Compile, record, and submit all documentations required for the project.<\/p><p>\\u00b7 Practice the highest housekeeping standard set by the Company, making sure<\/p><p>\\u00b7 Customer\\u2019s Premise is left the way it was. All debris, dust, cardboard, plastics, cables, etc are to be cleared, removed off site and disposed appropriately.<\/p><p>\\u00b7 Complete weekly van checklist and be accountable in ensuring the Company\\u2019s vehicle is kept clean, tidy, and litter free at all time.<\/p><p>\\u00b7 Work directly\/indirectly with relevant team lead\/members, contractors, and customer as guided by your team leader.<\/p><p>\\u00b7 Remain up to date with requirements and best practice relating to PV design and installations.<\/p><p>\\u00b7 Assist in diagnosing, identify, and resolve any deficiencies in PV Systems and\/or system malfunctions and operational issues.<\/p><p>\\u00b7 Help develop documentation, manuals, and best practice guidelines.<\/p><p>\\u00b7 Adhere to all OHS&W requirements.<\/p><p>\\u00b7 Communicate with customers in a professional, considerate, and respectful manner, answering all questions and concerns to the best of your ability.<\/p><p>\\u00b7 Demonstrate system functionality and performance, including start-up, shut-down, normal operation, and emergency or bypass operations to customer.<\/p><p><b>Requirements: <\/b><\/p><ul><li>Passion for renewable technologies<\/li><li>RECI \/ Safe electric registered electrician \/ QC an advantage salary reflective of qualification<\/li><li>Good communication and interpersonal skills<\/li><li>Able to work on own initiative<\/li><li>Ability to work with teams<\/li><li>Good Time Keeping<\/li><li>Friendly Manner<\/li><li>Experience working in solar or Infrared heating systems would be an advantage but not essential<\/li><li>Test and inspection qualifications would be beneficial<\/li><\/ul><ul><li>Full Driving License<\/li><li>Safe Pass<\/li><li>Wiliness to travel<\/li><\/ul><p>Full training provided<\/p><p>Job Type: Full-time<\/p><p>Salary: Negotiable depending on experience<\/p><p>Job Type: Full-time<\/p><p>Salary: \\u20ac50,000.00-\\u20ac75,000.00 per year<\/p><p>Benefits:<\/p><ul><li>Company pension<\/li><li>Employee discount<\/li><li>Relocation assistance<\/li><\/ul><p>Schedule:<\/p><ul><li>Monday to Friday<\/li><\/ul><p>Supplemental pay types:<\/p><ul><li>Bonus pay<\/li><li>Overtime pay<\/li><\/ul>\"}"
}