{
    "id":"Kaggle::techmap::61493b24e48deb575b2ab770::reed_uk::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"We have a fantastic opportunity for people living in St Albans and the surrounding areas. **COMPANY CAR PROVIDED**. Come and be a meter reader, using your great customer service skills and good local knowledge. As a meter reader, you will be on your feet all of the day and getting the benefits of fresh air and activity along with engaging with the general public in their homes and businesses whilst reading their gas and electricity meters. We are working in partnership with Morrison Data Services (M Group Services) and on behalf of the most of the utility suppliers so as a meter reader you will be an ambassador for the world of utilities. The role is a relatively flexible one requiring you to work between 40-45 hours per week, between the hours of 8am-8pm Monday to Friday and 8am-6pm on Saturday. You will need a good level of computer literacy as you will be using a hand-held device on which your daily work schedule will be activated and an eye for detail is paramount. You need to be able to climb many flights of stairs, bend down into cupboards, and deliver a well-balanced service to all of your customers. A good sense of planning is imperative, knowing your local area well and to ensure that you make your day the most productive and fulfilling. You will receive full training so experience in the role is not necessary although could be a benefit. You will need:. Full driving license, valid for use within the UK with no more than 6 points. Access to your own car which will need business insurance. 5 years' checkable history including a clear criminal record to pass the screening and vetting standards. Physical fitness as you can expect to walk up to approximately 8 miles per day. The package: * £9. 32 per hour. * 32p per hour of the £9. 32 hourly rate of pay is an hourly non-consolidated guaranteed allowance for contracted hours worked. Uncapped performance-related bonus. Opportunity to earn another £250 per month on an offered incentive scheme. Full uniform and PPE provided. 28 days' holiday per year. Mileage allowance at 35 pence per mile. Business expenses reimbursed. Company pension enrolment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61493b24e48deb575b2ab770::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Hamilton Mayday\", \"position\": \"Meter Reader\", \"notes\": \"\", \"original\": \"We have a fantastic opportunity for people living in St Albans and the surrounding areas.<br><br>**COMPANY CAR PROVIDED** <br><br>Come and be a meter reader, using your great customer service skills and good local knowledge. As a meter reader, you will be on your feet all of the day and getting the benefits of fresh air and activity along with engaging with the general public in their homes and businesses whilst reading their gas and electricity meters.<br><br>We are working in partnership with Morrison Data Services (M Group Services) and on behalf of the most of the utility suppliers so as a meter reader you will be an ambassador for the world of utilities.<br><br>The role is a relatively flexible one requiring you to work between 40-45 hours per week, between the hours of 8am-8pm Monday to Friday and 8am-6pm on Saturday.<br>You will need a good level of computer literacy as you will be using a hand-held device on which your daily work schedule will be activated and an eye for detail is paramount. You need to be able to climb many flights of stairs, bend down into cupboards, and deliver a well-balanced service to all of your customers. A good sense of planning is imperative, knowing your local area well and to ensure that you make your day the most productive and fulfilling.<br><br>You will receive full training so experience in the role is not necessary although could be a benefit. Training will last 1 week and will be both classroom-based and field-based with an experienced meter reader so you get to see the job through someone else's eyes.<br><br>You will need:<br>* Full driving license, valid for use within the UK with no more than 6 points<br>* Access to your own car which will need business insurance<br>* 5 years' checkable history including a clear criminal record to pass the screening and vetting standards<br>* Physical fitness as you can expect to walk up to approximately 8 miles per day<br><br>The package:<br>* \\u00a39.32 per hour<br>* 32p per hour of the \\u00a39.32 hourly rate of pay is an hourly non-consolidated guaranteed allowance for contracted hours worked<br>* Uncapped performance-related bonus<br>* Opportunity to earn another \\u00a3250 per month on an offered incentive scheme<br>* Full uniform and PPE provided<br>* 28 days' holiday per year<br>* Mileage allowance at 35 pence per mile<br>* Business expenses reimbursed<br>* Company pension enrolment<br>* Possible career progression with our client<br><br>COME AND BE A METER READER!<br><br>How to apply:<br>Please submit your CV or call the Recruitment Team on .<br>\"}"
}