{
    "id":"Kaggle::techmap::615cbae97434d912b2fe5eb0::britishjobs_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The mention of the company's recognition of a lower proportion of female drivers and the explicit desire to rectify this might suggest a preference for female candidates to balance the gender ratio in the workforce.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" In for your commitment and expertise, you will get: A salary of £27000 - £28300 (Based on a 45-hour working week Monday to Friday). No scheduled weekend working. 13 paydays per year (Every 4 weeks). Ongoing career development opportunities. Discounts with retailers including o2. A 24-hour wellbeing helpline. Pension. Your annual leave will be 31 days (inclusive of Christmas Day) so you have 30 days to book throughout the holiday year. Due to the nature of our work, bank holidays are normal working days except for Christmas Day. About phs: Phs Group was founded in 1963 and we are the leading provider for Hygiene Services in the UK, Spain and Ireland with over 90, 000 customers across 300, 000 locations incorporating numerous businesses during its 57 years of business. Our businesses include: Washrooms, Healthcare, Floorcare, Phs Direct and Direct 365 (sale of consumables), Phs Greenleaf, Teacrate, Besafe, Wastekit and Compliance. Although we welcome candidates from all demographics, we recognise we do not have a proportionate number of female drivers in this location currently and would like to rectify this. At phs, we pride ourselves on our diverse workforce, and ensuring we have an inclusive environment for all our staff. We remain committed to ensuring our teams can bring their true selves to work without risk or fear of discrimination.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615cbae97434d912b2fe5eb0::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"PHS Group Limited\", \"position\": \"Class 2 Service Driver\", \"notes\": \"\", \"original\": \"<br>Class 2 Service Driver <br>As a key worker working in our Healthcare Division, you play a key part in the success of phs. To our customers, you are the face of the company. Your excellent customer service skills will help keep our customers happy - and ensure they remain our customers!<br>Being an experienced Class 2 Service Driver in our Healthcare division, your responsibilities will include collecting health related waste products ranging from Pharmaceutical, Non and Hazardous Waste and well as clinical. This currently includes providing support to the nation&#39;s Covid testing stations - but whatever your route for the day, you&#39;ll play a vital part in keeping our customers facilities hygienic and fresh.<br>A day in the life of a Service Driver at phs will involve;  <br>You will follow planned routes, using PDA devices to confirm collections, manage any site access issues. We use in-cab technology but if you can operate a satellite navigation device and a smart phone, you will have no problem with these.<br>You will be using Soft Compaction Vehicles, designed specifically for the service we provide which are like refuge collection vehicle.<br>Emptying\/Collecting Euro Bins containing offensive waste<br>Supporting Covid testing stations by collecting sealed waste<br>Completing hazardous Consignment notes\/Transfer notes.<br>Returning to your allocated depot every day to empty the waste from the vehicle that was collected.<br>The ideal candidate for a Service Driver role at phs will:<br>Safety and legal compliance are a must. We welcome applications from people with a good safety record.<br>Essential qualifications are a Category C (LGV Class 2) license, current Driver CPC card and a valid Digital Tachograph Card.<br>To be eligible for this role you will have held a full driving license for at least 12 months and, have attained the appropriate LGV Cat C License. You cannot have no more than 6 penalty points and no IN or DD endorsements of less than five years then you could be what we are looking for.<br>Be open minded with regards to the products you will be carrying on your vehicle.<br>Due to the nature of waste we handle, drivers are advised to have vaccinations against Hepatitis B, tetanus\/polio. Hepatitis A is also advised. Employee vaccinations are paid for by phs. In for your commitment and expertise, you will get:  <br>A salary of &pound;27000 - &pound;28300 (Based on a 45-hour working week Monday to Friday)<br>No scheduled weekend working.<br>13 paydays per year (Every 4 weeks)<br>Ongoing career development opportunities<br>Discounts with retailers including o2.<br>A 24-hour wellbeing helpline<br>Pension<br>Your annual leave will be 31 days (inclusive of Christmas Day) so you have 30 days to book throughout the holiday year. Due to the nature of our work, bank holidays are normal working days except for Christmas Day. About phs:<br>Phs Group was founded in 1963 and we are the leading provider for Hygiene Services in the UK, Spain and Ireland with over 90,000 customers across 300,000 locations incorporating numerous businesses during its 57 years of business.<br>Our businesses include: Washrooms, Healthcare, Floorcare, Phs Direct and Direct 365 (sale of consumables), Phs Greenleaf, Teacrate, Besafe, Wastekit and Compliance. <br>Although we welcome candidates from all demographics, we recognise we do not have a proportionate number of female drivers in this location currently and would like to rectify this.<br>At phs, we pride ourselves on our diverse workforce, and ensuring we have an inclusive environment for all our staff. We remain committed to ensuring our teams can bring their true selves to work without risk or fear of discrimination.\"}"
}