{
    "id":"Kaggle::techmap::6148de1574e09d223d7d4892::careerbuilder_uk::9",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Repeated use of the word 'strong' suggests a masculine bias",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". Job Profile Summary. Role Synopsis. Do you have the confidence, energy, and experience vital to lead with minimal direction, as well as the interpersonal skills to thrive in a collaborative environment? Then this could be your next opportunity! In this position you'll work alongside other E&C professionals, businesspeople, lawyers, investigators, and other functional teams (e. g., procurement, audit). The successful candidate should enjoy a fast-paced and diverse workload and the experience, exposure, and capability this builds, and will have proven skills in the areas of leadership and project management. The role is a permanent position in the business-facing team within the Ethics & Compliance function, to replace an E&C Manager who has moved to another team in mid September. Ethics & Compliance plays a meaningful role in BP’s management of significant risks, and is an area where BP is recognised as a leader internationally. The purpose of the E&C Function is to develop, implement and maintain an effective programme to address regulatory compliance risks, and ensure a strong, ethical culture throughout BP consistent with our Code of Conduct and Values & Behaviours. Job Advert. In this role you will: Be responsible for leading all aspects of and facilitating the appropriate and proactive management of risks to include: Act as a key partner to the assigned businesses and functions, offering sound and practical advice, mentor and support to ECLs and Leadership Teams. Maintain awareness of concerns and investigations, engaging with Business Integrity and ECLs as appropriate. We have the following requirements:. Substantial prior experience \/professional qualification in Ethics & Compliance or in a related compliance, investigative, advisory or risk-focused area such as Legal, Audit, Business Integrity, HR investigations and Finance. Strong senior influencing skills: group leaders are among the key individuals and the role will be encouraged to meet with them solo and be able to challenge them respectfully yet optimally. Ability to operate with a high degree of autonomy: this function is structured to attract hard working individuals who will grow with handling an array of exciting businesses with limited supervision, driving the E&C agenda within their portfolio. High standard of analytical and drafting skills, with attention to detail. Self-confidence to take a firm stand and upbeat persistence in seeking solutions to sophisticated issues..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148de1574e09d223d7d4892::careerbuilder_uk\", \"source\": \"careerbuilder_uk\", \"country\": \"UK\", \"company\": \"BP\", \"position\": \"Ethics & Compliance Manager\", \"notes\": \"\", \"original\": \"<br \/><br \/><b>Job Profile Summary<\/b><br \/><br \/><strong>Role Synopsis <\/strong><br \/>Do you have the confidence, energy, and experience vital to lead with minimal direction, as well as the interpersonal skills to thrive in a collaborative environment? Then this could be your next opportunity! In this position you'll work alongside other E&C professionals, businesspeople, lawyers, investigators, and other functional teams (e.g., procurement, audit). The successful candidate should enjoy a fast-paced and diverse workload and the experience, exposure, and capability this builds, and will have proven skills in the areas of leadership and project management. <br \/>The role is a permanent position in the business-facing team within the Ethics & Compliance function, to replace an E&C Manager who has moved to another team in mid September.<br \/><br \/>Ethics & Compliance plays a meaningful role in BP\\u2019s management of significant risks, and is an area where BP is recognised as a leader internationally. <br \/><br \/>The purpose of the E&C Function is to develop, implement and maintain an effective programme to address regulatory compliance risks, and ensure a strong, ethical culture throughout BP consistent with our Code of Conduct and Values & Behaviours.<br \/><br \/><b>Job Advert<\/b><br \/><br \/><strong>In this role you will: <\/strong><br \/>Be responsible for leading all aspects of and facilitating the appropriate and proactive management of risks to include:<br \/><br \/>Act as a key partner to the assigned businesses and functions, offering sound and practical advice, mentor and support to ECLs and Leadership Teams<br \/><br \/>Develop and enable an inclusive, energized and high performing team that is interoperable and passionate about effective prioritization, analytical problem solving and planning;<br \/><br \/>Maintain awareness of concerns and investigations, engaging with Business Integrity and ECLs as appropriate.<br \/><br \/><strong>We have the following requirements:<\/strong><br \/>\\u2022 Substantial prior experience \/professional qualification in Ethics & Compliance or in a related compliance, investigative, advisory or risk-focused area such as Legal, Audit, Business Integrity, HR investigations and Finance.<br \/>\\u2022 Strong senior influencing skills: group leaders are among the key individuals and the role will be encouraged to meet with them solo and be able to challenge them respectfully yet optimally.<br \/>\\u2022 Ability to operate with a high degree of autonomy: this function is structured to attract hard working individuals who will grow with handling an array of exciting businesses with limited supervision, driving the E&C agenda within their portfolio<br \/>\\u2022 High standard of analytical and drafting skills, with attention to detail.<br \/>\\u2022 Self-confidence to take a firm stand and upbeat persistence in seeking solutions to sophisticated issues.<br \/>\\u2022 Strong work ethic and creative ability to achieve identified goals.<br \/>\\u2022 Ability to deliver the agenda in a creative and collaborative manner.<br \/>\\u2022 Strong awareness \/ sensitivity to different cultures.<br \/>\\u2022 Proven track record to build positive relationships and influence members across the business.<br \/><br \/><strong>One or more of the following:<\/strong><br \/>\\u2022 Experience of advising on key risks such as ABC, CAT, ITR.<br \/>\\u2022 Experience of managing programmes.<br \/>\\u2022 Understanding of internal investigations or employee concerns programmes. <br \/><br \/><strong>Education <\/strong><br \/>Degree and\/or professional qualification.<br \/><br \/><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. <\/em><br \/><br \/>We look forward to hearing from you! <br \/><br \/><b>Entity<\/b><br \/><br \/>Strategy & Sustainability<br \/><br \/><b>Job Family Group<\/b><br \/><br \/>Ethics & Compliance Group<br \/><br \/><b>Relocation available<\/b><br \/><br \/>No<br \/><br \/><b>Travel required<\/b><br \/><br \/>Negligible travel<br \/><br \/><b>Time Type<\/b><br \/><br \/>Full time<br \/><br \/><b>Country<\/b><br \/><br \/>United Kingdom<br \/><br \/><b>About BP<\/b><br \/><br \/><b>STRATEGY & SUSTAINABILITY<\/b><br \/><br \/>If you\\u2019re a sustainability focused strategic thinker, this could be for you: The purpose of strategy & sustainability is to define a value-adding, sustainability-led strategic \\u200edirection for us to deliver on our ambition of reimagining energy for people and our planet. Working within S&S, you will be embedded in the centre of the organisation bringing together strategy, sustainability and \\u200ecapital allocation into a group-wide framework and promoting ethics and compliance across the \\u200eorganisation.<br \/><br \/> Join us and help us achieve our purpose through:\\u200e<br \/><br \/><b>A modern, dynamic and collaborative approach to strategy, sustainability and capital allocation <\/b> \\u2013 \\u200eyou will work with the businesses, finance and the broad organisation to support the \\u200edelivery of our ambition, our aims and our financial aspirations. Together we will help frame and make the \\u200eoptimal trade-offs and choices for us.<br \/><br \/><b>A lens on sustainability as a competitive advantage <\/b>\\u2013 you will drive sustainability to unleash new \\u200ebusiness opportunities, growth and value to us.\\u200e<br \/><br \/><b>Proprietary bp insights <\/b> \\u2013 you will focus on developing a distinctive understanding of global \\u200eeconomics, energy markets, customer needs and competitors to support our businesses and \\u200estrategy.\\u200e<br \/><br \/><b>Proactive shaping of external policy <\/b>\\u2013 you will define where our company stands on matters of public policy \\u2013 \\u200ein line with our aims \\u2013 as well as how we can contribute to proactively shape the external \\u200eenvironment across regions.\\u200e<br \/><br \/><b>Strategic oversight of our carbon management activities <\/b> \\u2013 you will coordinate and drive progress \\u200eon our net zero ambition and aims.\\u200e<br \/><br \/><b>Effective ethics and compliance as a driver of organisational and business sustainability <\/b> \\u2013 you will \\u200esupport our bp business groups and other entities in promoting an ethical culture and work \\u200eenvironment, and effective compliance risk management.\\u200e<br \/><br \/><b>Enabling our company and its businesses to achieve their goals <\/b> \\u2013 where our organisation holds expertise, we will \\u200euse it collaboratively and constructively.<br \/>&nbsp;\"}"
}