{
    "id":"Kaggle::techmap::6156139aa6740c534abc5794::monster_ca::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The physical requirements mentioned in the job description are essential functions necessary to perform the role effectively and safely in a hospital setting, and therefore do not constitute disability bias.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description. Join a hospital where everyone makes a difference! Cambridge Memorial Hospital (CMH) is a thriving community hospital that proudly provides acute care services including: Emergency, Surgery, Medicine, Womens and Childrens Health, Intensive Care, Mental Health, and Inpatient Rehabilitation. Our vision is to provide exceptional healthcare by exceptional people. Our dedicated and skilled staff are passionate about providing outstanding patient-centred care, and an exceptional patient experience to residents of the Waterloo Region and beyond. Come be part of our vision as CMH leads in innovation and compassion! To learn more about CMH, please visit our website at www. cmh. org. As a key member of the Women & Childrens Health team, the Obstetrics Registered Practical Nurse is responsible for assessing, analyzing, prioritizing, planning and evaluating care in collaboration with women and families in both normal and complex situations. The nursing care includes antenatal care, postpartum care, breastfeeding support, infant care and care following perinatal loss. The physical demands of the role may include but are not limited to prolonged sitting, standing, walking, bending, lifting, pushing and pulling. This part-time position contributes to ensuring there is a safe environment for patients, staff and visitors. Duties as per job fact sheet. Posted hours do not constitute a guarantee that shifts will not be subject to change. Qualifications:. Current Certificate of Registration with the College of Nurses in Ontario as a Registered Practical Nurse in good standing required. Diploma in Practical Nursing required. BCLS certification within the last 2 years required. Neonatal Resuscitation course required within the past 2 years or willingness to complete within 6 months. Breastfeeding Certificate Program required or willingness to complete within 1 year. Current experience within the past 2 years with the physiological, psychosocial and emotional needs of the post-partum women and neonates required. Proven track record working effective in a multidisciplinary team. Demonstrated ability to collaborate with internal and external stakeholders. Stellar verbal and written communication skills. Proven ability to remain resilient and adapt during changing priorities and critical situations. Experience with Meditech an asset. Demonstrated ability to attend work on a regular basis is required. We thank all those who apply, however, only those selected for an interview will be contacted.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156139aa6740c534abc5794::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Cambridge Memorial Hospital\", \"position\": \"Registered Practical Nurse, Women's & Childrens (Obstetrics)\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <br> <br>Join a hospital where everyone makes a difference! Cambridge Memorial Hospital (CMH) is a thriving community hospital that proudly provides acute care services including: Emergency, Surgery, Medicine, Women\\u2019s and Children\\u2019s Health, Intensive Care, Mental Health, and Inpatient Rehabilitation. <br> <br> <br>Our vision is to provide exceptional healthcare by exceptional people. Our dedicated and skilled staff are passionate about providing outstanding patient-centred care, and an exceptional patient experience to residents of the Waterloo Region and beyond. <br> <br> <br>Come be part of our vision as CMH leads in innovation and compassion! To learn more about CMH, please visit our website at www.cmh.org. <br> <br> <br> <br> <br> <br> <br> <br> <br> <br>As a key member of the Women &amp; Children\\u2019s Health team, the Obstetrics Registered Practical Nurse is responsible for assessing, analyzing, prioritizing, planning and evaluating care in collaboration with women and families in both normal and complex situations. The nursing care includes antenatal care, postpartum care, breastfeeding support, infant care and care following perinatal loss. The physical demands of the role may include but are not limited to prolonged sitting, standing, walking, bending, lifting, pushing and pulling. This part-time position contributes to ensuring there is a safe environment for patients, staff and visitors. Duties as per job fact sheet. <br> <br> <br> <br> <br> <br> <br>Posted hours do not constitute a guarantee that shifts will not be subject to change. <br> <br> <br> <br> <br> <br>Qualifications: <br> <br> <br> <br>+ Current Certificate of Registration with the College of Nurses in Ontario as a Registered Practical Nurse in good standing required <br> <br> <br>+ Diploma in Practical Nursing required <br> <br> <br>+ BCLS certification within the last 2 years required <br> <br> <br>+ Neonatal Resuscitation course required within the past 2 years or willingness to complete within 6 months <br> <br> <br>+ Breastfeeding Certificate Program required or willingness to complete within 1 year <br> <br> <br>+ Current experience within the past 2 years with the physiological, psychosocial and emotional needs of the post-partum women and neonates required <br> <br> <br>+ Proven track record working effective in a multidisciplinary team <br> <br> <br>+ Demonstrated ability to collaborate with internal and external stakeholders <br> <br> <br>+ Stellar verbal and written communication skills <br> <br> <br>+ Proven ability to remain resilient and adapt during changing priorities and critical situations <br> <br> <br>+ Experience with Meditech an asset. <br> <br> <br>+ Demonstrated ability to attend work on a regular basis is required <br> <br> <br> <br> <br> <br> <br> <br> <br>We thank all those who apply, however, only those selected for an interview will be contacted. <br> <br> <br> <br> <br> <br>As part of our commitment to the health and safety of our patients, staff and community from COVID-19, subject to any accommodation required by applicable human rights legislation, Cambridge Memorial Hospital requires that all staff have received all required doses of a COVID-19 vaccine approved by Health Canada. <br> <br> <br> <br> <br> <br>The successful external applicant is required to provide the applicable criminal record check, as requested by Human Resources, in accordance with federal and provincial legislation. Valid criminal record checks are in original format and dated with two months from date of conditional offer from CMH. <br> <br> <br> <br> <br> <br>Cambridge Memorial Hospital is committed to providing and fostering a respectful workplace. All reasonable accommodation will be made to support participation in the recruitment process. Where needed, accommodations for disabilities will be provided, on request, to support participation in all aspects of the recruitment process. <br> <br> <br> <br> <br>System ID: 2021-3716 <br> <br>Department: Womens &amp; Childrens\\u2019 <br> <br>Job Type (EN): Part Time <br> <br>Post End Date: 10\/5\/2021 <br> <br>External Company URL: https:\/\/www.cmh.org\/ <\/div>\"}"
}