{
    "id":"Kaggle::techmap::614d9b23da373a4092cc34a9::monsterasia_ae::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 5 years of experience managing businesses or programs serving military operators in the region. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d9b23da373a4092cc34a9::monsterasia_ae\", \"source\": \"monsterasia_ae\", \"country\": \"AE\", \"company\": \"Honeywell\", \"position\": \"Lead Account Manager\", \"notes\": \"\", \"original\": \"<br>Join a team recognized for leadership, innovation and diversity<br>The future is what we make it.<br>When you join Honeywell, you become a member of our distributed team of problem solvers, innovators, dreamers and doers who make the things that make the future.<br>That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars.<br>Working at Honeywell isn't just about developing cool things. That's why all of our employees enjoy access to dynamic career opportunities across different fields and industries.<br>Are you ready to help us build the future?<br><b>Responsibilities<\/b><ul><li>Establishes strong relationships with key influencers military operators, Ministries of Defence, and other government agencies that use Honeywell products and services <\/li><li>Leads a cross-functional, integrated product team to achieve Annual Operating Plan (including achievement of revenue and profit objectives). <\/li><li>Provides customer demand planning inputs, managing military operator customer relationships, identification, development and support of new business capture, and adherence to contract, schedule, cost, regulatory agency, and international trade compliance requirements. <\/li><li>Interfaces with cross-functional personnel, including Engineering, Integrated Supply Chain, Contracts\/Legal, Program Planning and Control, International Trade Compliance, and Customer and Product Support. <\/li><li>Provides leadership of the Customer Core Team (C&PS, Tech Ops, PM) and extended Customer Core Team. <\/li><li>Delivers business commitments in accordance with AOP\/Strategic Plan, including revenue, operating income and working capital performance. <\/li><li>Responsible for long-term objectives such as year-over-year growth, profitability, and win rate, as well as near-term forecast accuracy for Short Range Outlook and demand planning. <\/li><li>Identifies opportunities and executes specific plans to improve program performance. Develops and executes detailed action plans, including extensive risk\/opportunity analysis, with Engineering, Integrated Supply Chain, and Sales teams for achieving revenue and net investment \/ operating income targets for the program(s) in this segment. <\/li><li>Leads the execution of all engineering, product, and solution delivery programs for Region and is responsible for maintaining good and consistent program performance within budgets and requirements. <\/li><li>Responsible for achieving required cost & schedule adherence, scope management, export compliance, and IPDS compliance. Key program performance metrics include EAC fidelity, CPI, SPI, OTTR, A\/R, and HMR Milestone Fidelity.<\/li><\/ul><br><b>Qualifications<\/b><ul><li>Bachelors degree, Bachelor of Science degree in engineering, business or operations preferred<\/li><li>10 years of previous business experience, including but not limited to business management, engineering, sales, operations, finance, contracts, customer support<\/li><li>5 years of experience managing businesses or programs serving military operators in the region<\/li><\/ul><br>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\"}"
}