{
    "id":"Kaggle::techmap::61427019a973d70733cfaec4::britishjobs_uk::2",
    "label_age":true,
    "analysis_age":"The requirement that applicants be over 25 years old due to car insurance reasons could potentially lead to age discrimination, excluding younger but equally capable candidates. A more inclusive approach would involve exploring insurance options that accommodate younger drivers or explicitly stating why age is a critical factor for the role.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"Specifies a preference for female Care Assistants, which might be viewed as gender bias unless it is supported by genuine occupational requirements as specified under Schedule 9, Paragraph 1 of the UK's Equality Act 2010, rather than the possibly outdated reference to \"SDA section 7.\" This provision permits gender-specific hiring when essential for the provision of same-sex personal care, where privacy and dignity are concerns. It's important that this justification is clearly articulated in the job posting to ensure compliance and clarity.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The preference for non-smokers, unless tied directly to the health requirements of clients (such as conditions exacerbated by smoke), could be viewed as discriminatory. An alternative, more inclusive phrasing would be to emphasize the need for maintaining a smoke-free environment in client homes or during work hours to meet specific health-related client needs, rather than excluding smokers outright from the application process.",
    "verified":true,
    "synthetic":false,
    "text":"About the role. Are you looking to join our remarkable team of Care Assistants who spend every day making a difference to people's lives? We are looking for compassionate, kind and supportive people to become part of our proud team at Advantage Healthcare. We are looking to recruit Female. Care Assistants in and around Garstang. You must have a passion for providing the best care to clients with complex care needs. Applicants must hold a full UK driving licence but not need to have your own vehicle. You must be over 25 years of age for car insurance reasons. Non-smoker preferable. *SDA section 7 applies. We can offer you: Days and\/or nights. On-going FREE training and development opportunities. Free Uniform In return, we'd like you to have: Excellent communication skills, written, verbal and listening. A caring and compassionate attitude. The ability to commit to regular (flexible) hours If you have any of the following experience, it will support your application. but even if you don't we can still offer FREE training in all these areas: Tracheostomy care. Ventilation care. Medication management. Catheter care. Manual handling. Spinal Injury. ABI. Epilepsy. Experience of working with clients with complex care needs Advantage Healthcare is a leading care provider who puts care at the heart of everything we do. We support a range of clients varying in age and care requirements which can include mental health, learning disabilities, physical disabilities and clients with more complex clinical needs. These may include personal care, assistance with moving and handling, support with community outings and medication administration.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61427019a973d70733cfaec4::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"CCH Advantage healthcare\", \"position\": \"Female Healthcare Assistant\", \"notes\": \"\", \"original\": \"About the role <br><br> Are you looking to join our remarkable team of Care Assistants who spend every day making a difference to people&#39;s lives?<br><br>We are looking for compassionate, kind and supportive people to become part of our proud team at Advantage Healthcare.<br><br> We are looking to recruit Female* Care Assistants in and around Garstang.<br><br> You must have a passion for providing the best care to clients with complex care needs. <br><br> Applicants must hold a full UK driving licence but not need to have your own vehicle. You must be over 25 years of age for car insurance reasons. Non-smoker preferable. <br><br> *SDA section 7 applies<br><br> We can offer you: <br><br>Days and\/or nights<br>On-going FREE training and development opportunities <br>Free Uniform In return, we&#39;d like you to have:<br><br>Excellent communication skills, written, verbal and listening<br>A caring and compassionate attitude<br>The ability to commit to regular (flexible) hours If you have any of the following experience, it will support your application - but even if you don&#39;t we can still offer FREE training in all these areas:<br><br>Tracheostomy care<br>Ventilation care<br>Medication management<br>Catheter care<br>Manual handling<br>Spinal Injury<br>ABI<br>Epilepsy<br>Experience of working with clients with complex care needs Advantage Healthcare is a leading care provider who puts care at the heart of everything we do. We support a range of clients varying in age and care requirements which can include mental health, learning disabilities, physical disabilities and clients with more complex clinical needs. <br><br>As a Care Assistant duties will vary dependent on each client&#39;s individual care plan. These may include personal care, assistance with moving and handling, support with community outings and medication administration. <br><br>\"}"
}