{
    "id":"Kaggle::techmap::614134148be8df1fa24bb303::careerbuilder_us::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Consumer, Business and Digital Banking – We work with our retail banking, business banking, consumer lending, mortgage and digital banking businesses to define far reaching technology strategies to evolve our customer experiences, to make us easier to do business with and to deliver solutions that provide real value. This includes all core consumer deposit, loan and payment processing and servicing platforms. All core channel systems for retail branches, ATMs and call centers. Custom built online and mobile banking platforms. And mtb. com and marketing ecosystem capabilities. Overview: Manages the activities of several Technology Team Leaders or units and responsible for each Team’s\/unit’s development and systems support efforts. Provides day-to-day direction for the units and applications in line with goals of department and the clients they support. Responsible for managing client relations and expectations. Manages the project queue for their area. Strives to achieve individual and organizational objectives at minimum cost. Primary Responsibilities: Manage and participate in consults with client management in the analysis of short-range business requirements and recommend innovations that anticipate future impact of changing business requirements. Responsible for building a positive client relationship. Monitor the technology direction of the industry and vendor applications. Oversee application development, support testing efforts, technology infrastructure\/project management and other technology domains. Build rapport within the organization. Communicate and develop a professional level of communication and cooperation. Control the activities of the teams, assign personnel to various projects and direct their activities. Ensure completion of schedules. Responsible for short-term staffing planning. Ensure adherence to all Department and Technology standards and procedures, including all documentation requirements. May translate requirements to assist staff in preparing detailed specifications for system enhancements. Manage recommended designs based on business and technology requirements. Identify issues and concerns. Manage monitoring project plans. May coordinate major project activities. Remain current on activities outside the team that may impact the team or client environment. Develop and manage multiple cost center budgets. Education and Experience Required: Minimum of an Associate’s degree and 7 years’ technology or systems management\/leadership experience, or in lieu of a degree a combined minimum of 9 years’ higher education and\/or work experience, including a minimum of 7 years’ technology or systems management\/leadership experience. Capable of working on multiple projects of a complex nature. Proficiency with project management, word processing and spreadsheet applications. Complete understanding of the system development life cycle. Excellent problem-solving skills to assist in issue resolution. Familiar with application development software and hardware platforms. Excellent verbal and written communication skills.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614134148be8df1fa24bb303::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"M&T Bank\", \"position\": \"Technology Team Lead - Workforce Identity Engineering & Development\", \"notes\": \"\", \"original\": \"<p><b>Consumer, Business and Digital Banking<\/b> \\u2013 We work with our retail banking, business banking, consumer lending, mortgage and digital banking businesses to define far reaching technology strategies to evolve our customer experiences, to make us easier to do business with and to deliver solutions that provide real value. This includes all core consumer deposit, loan and payment processing and servicing platforms; all core channel systems for retail branches, ATMs and call centers; custom built online and mobile banking platforms; and mtb.com and marketing ecosystem capabilities.<\/p>\\r\\n<p><b>Overview: <\/b><\/p><p>Manages the activities of several Technology Team Leaders or units and responsible for each Team\\u2019s\/unit\\u2019s development and systems support efforts.\\u00a0 Provides day-to-day direction for the units and applications in line with goals of department and the clients they support.\\u00a0 Responsible for managing client relations and expectations.\\u00a0 Manages the project queue for their area.\\u00a0 Strives to achieve individual and organizational objectives at minimum cost.<\/p>\\r\\n<p><b>Primary Responsibilities:<\/b><\/p><ul><li>Manage and participate in consults with client management in the analysis of short-range business requirements and recommend innovations that anticipate future impact of changing business requirements.\\u00a0 Responsible for building a positive client relationship.<\/li><li>Monitor the technology direction of the industry and vendor applications<\/li><li>Oversee application development, support testing efforts, technology infrastructure\/project management and other technology domains.\\u00a0<\/li><li>Build rapport within the organization. Communicate and develop a professional level of communication and cooperation.<\/li><li>Control the activities of the teams, assign personnel to various projects and direct their activities.<\/li><li>Ensure completion of schedules.\\u00a0 Responsible for short-term staffing planning.<\/li><li>Implement technology consistent with Division standards and long-range plans. Ensure adherence to all Department and Technology standards and procedures, including all documentation requirements.<\/li><li>May translate requirements to assist staff in preparing detailed specifications for system enhancements.\\u00a0 Manage recommended designs based on business and technology requirements.\\u00a0\\u00a0 Identify issues and concerns.<\/li><li>Manage monitoring project plans; may coordinate major project activities.\\u00a0 Remain current on activities outside the team that may impact the team or client environment.<\/li><li>Develop and manage multiple cost center budgets.<\/li><\/ul>\\r\\n<p><b>Education and Experience Required:<\/b><br \/>Minimum of an Associate\\u2019s degree and 7 years\\u2019 technology or systems management\/leadership experience, or in lieu of a degree a combined minimum of 9 years\\u2019 higher education and\/or work experience, including a minimum of 7 years\\u2019 technology or systems management\/leadership experience<br \/>Capable of working on multiple projects of a complex nature<br \/>Proficiency with project management, word processing and spreadsheet applications<br \/>Complete understanding of the system development life cycle<br \/>Excellent problem-solving skills to assist in issue resolution<br \/>Familiar with application development software and hardware platforms<br \/>Excellent verbal and written communication skills<br \/>Excellent analytical skills<br \/>Excellent decision-making skills<br \/>Strong project management skills<br \/>Strong presentation skills<br \/>Experience encouraging teamwork and serving as role model when leading and directing others<br \/>Understand technical, business and operational impacts of a project or problem<br \/>\\u00a0<\/p><p><b>About M&T Technology:<\/b>\\u00a0<\/p><p>At M&T Tech,\\u00a0we\\u2019re a team of makers, doers, and builders, working to create the most advanced technology solutions in banking.\\u202f We\\u2019re not your stereotypical suit and tie bankers: We\\u2019re an innovative team of leading tech experts, pushing boundaries, and taking risks.\\u202f We\\u2019re building an agile team of the most skilled and creative, workers to solve complex problems, architecting solutions, writing high-performance software, and charting our new path, all to make the lives of our customers, and the communities that we serve, better.\\u202f Join us and be part of something new as we build tomorrow\\u2019s bank, today<\/p>\\r\\n<p><b>About M&T<\/b><\/p><p>M&T Bank is a Top 20 US bank holding company and one of the best performing and financial stable regional banks in the country, we offer our technology employees a wide range of performance-based career development opportunities. We have a strong commitment to our customers and the communities we serve, and we continue to grow with a focus on the future. So, when looking to advance your career, look to M&T. Grow with us.<\/p>\\r\\n<p>#LI-KB1<\/p><p>#Development, #leadership, #Technology, #Infrastructure, #Monitor, #techlead,<\/p>\\r\\n<p><\/p><p><\/p><br \/><br \/><b><u><b>Location<\/b><\/u><\/b><br \/><br \/>Amherst, New York, United States of America&nbsp;\"}"
}