{
    "id":"Kaggle::techmap::6130bbcc11ff555f6c283a65::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The physical demands section, which states that the job \"Requires extensive and heavy physical activity and dexterity\" and \"Must be able to carry or handle materials sometimes up to 75 pounds\", could inadvertently exclude candidates with certain physical disabilities, even if they are otherwise qualified for the role and could perform the essential functions with reasonable accommodations.",
    "label_masculine":true,
    "analysis_masculine":"The job description uses language that may subtly favour male candidates, such as \"Rough grading and undeveloped job sites present a threat to safety where carelessness or poor judgment could result in serious of fatal injury to self or others\", which could be seen as appealing more to masculine stereotypes of risk-taking and physical strength.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Responsibilities: This position operates one or more types of construction equipment. Such as asphalt pavers, asphalt rollers, material transfer vehicles, milling machines, back hoes and skid steers as they apply to milling and paving operations. Operators are responsible for safe operation, non-mechanical maintenance and up-keep of equipment. Discusses plans and goals for the day's work with field manager and determines best method of getting assigned work done safely, productively and on time. Performs physical duties that are commonly associated with the safe and productive operation of said piece of equipment. Performs equipment maintenance duties such as cleaning, greasing and maintaining fluid levels on equipment. Operates equipment with priority of making the job safe for all persons working around the equipment. Communicates clearly with other crew members in a manner commensurate with teamwork in order to accomplish daily goals. Qualifications: GED \/ HS Diploma a plus. 2 yrs of equipment operating experience is a necessity. Related work experience is a necessity. Valid Driver s License required. SKILLS, KNOWLEDGE AND ABILITIES: Make judgments regarding the most efficient operations of equipment and attachments. Must have very good hand, foot and eye coordination to safely operate their equipment. Compliance with Allan Myers Polices including but not limited to: Equipment repair \/ maintenance procedures and Operator Safety Standards. Safety, Safety, Safety! Home Safe Tonight and related policies. AIPS. PHYSICAL DEMANDS: Requires extensive and heavy physical activity and dexterity. Must be able to operate for long periods of time and to get into awkward positions when cleaning and providing maintenance to the equipment. Requires the ability to stand, walk, reach, kneel, climb or balance. Must be able to carry or handle materials sometimes up to 75 pounds. Requires specific types of vision: close, color, peripheral. WORK ENVIRONMENT: Responsible for safety of self and fellow workers. Work conditions vary from site to site and are affected by the weather. Rough grading and undeveloped job sites present a threat to safety where carelessness or poor judgment could result in serious of fatal injury to self or others. Works adjacent to live traffic on most days. TRAVEL REQUIREMENTS: A must, overnight stays may be required on occasion. Night and Weekend work shifts are common throughout the normal milling and paving season. Overview: Our Company Does Work That Matters. Allan Myers is the largest heavy civil construction and materials production contractor in the mid-Atlantic.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6130bbcc11ff555f6c283a65::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Allan Myers\", \"position\": \"Paving\/Milling - Equipment Operator\", \"notes\": \"\", \"original\": \"Responsibilities:<br \/>This position operates one or more types of construction equipment; such as asphalt pavers, asphalt rollers, material transfer vehicles, milling machines, back hoes and skid steers as they apply to milling and paving operations. Operators are responsible for safe operation, non-mechanical maintenance and up-keep of equipment.<br \/>Discusses plans and goals for the day's work with field manager and determines best method of getting assigned work done safely, productively and on time.<br \/>Performs physical duties that are commonly associated with the safe and productive operation of said piece of equipment.<br \/>Performs equipment maintenance duties such as cleaning, greasing and maintaining fluid levels on equipment.<br \/>Operates equipment with priority of making the job safe for all persons working around the equipment.<br \/>Communicates clearly with other crew members in a manner commensurate with teamwork in order to accomplish daily goals.<br \/>Qualifications:<br \/>GED \/ HS Diploma a plus.<br \/>2 yrs of equipment operating experience is a necessity.<br \/>Related work experience is a necessity.<br \/>Valid Driver s License required.<br \/>SKILLS, KNOWLEDGE AND ABILITIES:<br \/><br \/>Make judgments regarding the most efficient operations of equipment and attachments.<br \/>Must have very good hand, foot and eye coordination to safely operate their equipment<br \/>Compliance with Allan Myers Polices including but not limited to:<br \/>Equipment repair \/ maintenance procedures and Operator Safety Standards<br \/>Safety, Safety, Safety!<br \/> Home Safe Tonight and related policies<br \/> AIPS <br \/><br \/>PHYSICAL DEMANDS:<br \/>Requires extensive and heavy physical activity and dexterity. Must be able to operate for long periods of time and to get into awkward positions when cleaning and providing maintenance to the equipment.<br \/>Requires the ability to stand, walk, reach, kneel, climb or balance. Must be able to carry or handle materials sometimes up to 75 pounds. Requires specific types of vision: close, color, peripheral.<br \/><br \/>WORK ENVIRONMENT:<br \/>Responsible for safety of self and fellow workers.<br \/>Work conditions vary from site to site and are affected by the weather.Rough grading and undeveloped job sites present a threat to safety where carelessness or poor judgment could result in serious of fatal injury to self or others. Works adjacent to live traffic on most days.<br \/><br \/><br \/>TRAVEL REQUIREMENTS:<br \/>A must, overnight stays may be required on occasion.<br \/>Night and Weekend work shifts are common throughout the normal milling and paving season.<br \/>Overview:<br \/><br \/>Our Company Does Work That Matters<br \/>Allan Myers is the largest heavy civil construction and materials production contractor in the mid-Atlantic. We build infrastructure: the highways and bridges that connect cities and towns, the public water and wastewater systems that provide clean water to your home and keep our streams clean. We take pride in meeting the highest quality standards because it ensures our work will have a long-lasting positive impact on the community.<br \/>Our Family is Strong and Growing<br \/>We employ more than 2,100 men and women. Our reputation for Better, Faster, Safe performance continues to bring us tremendous success. To keep up with rising demand for our products and services, we need to hire many more hard-working, ambitious people to fill hourly and salaried positions. Join our elite team, learn and grow with us, and we will provide a pathway to the American Dream for you and your family.<br \/>Your Future is a Career Not a Job <br \/>As a family-owned company, we attract the best workers in the industry because we treat every person as a family member. That means we practice care and concern for one another s safety and well-being. We pay well and provide generous benefits. We offer extensive training and promote from within. If you have the drive, we will help you build a career in the thriving construction industry and reach your full potential.<br \/><br \/><br \/>Allan Myers is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br \/><br \/><br \/><br \/><br \/><br \/>\"}"
}