{
    "id":"Kaggle::techmap::6143188edd0656540e6cb0a4::monster2_es::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The phrase \"Fluency in one or more regional languages of Africa or Asia\" introduces racial bias by implying a preference for candidates from specific ethnic backgrounds, potentially discouraging applicants who do not speak these languages.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" ENGINEERING MANAGEMENTSummaryLove Wikipedia and its sibling projects? The Wikimedia Foundation is an inclusive employer, and we are looking for experienced engineering management to join our team, reporting to engineering leadership in Technology and Product Engineering. Were committed to making knowledge available to everyone globally. This is an opportunity to do good while improving what we think is the best place on the internet. You know how to build a sustainable culture, showing empathy for users and employees, a collaborative mindset, and data-informed systems thinking. You are passionate about growing people, helping software engineers achieve their career goals while also creating amazing opportunities for them to flourish and improve technically. In this role, you will work in a distributed remote environment, where we value teamwork and a consensus-oriented approach as we build fully open source software. You are a proactive and collaborative partner with product management, design, quality & test engineering, technical program management, and community relations. You will manage highly skilled engineers, who ship quality software used by over a billion users, empowering them to do their best work. Travel is not currently required due to the pandemic. During normal non-pandemic times, some travel is expected, usually 3-4 times per year. You are responsible for:Fostering a supportive team environment, ensuring diverse voices are heard. Guiding team members with structured development techniques. Coaching engineers in the art and science of software engineering and evolvable software architecture. Participating in hiring considerate of diversity, equity, and inclusion. Partnering with peers on cross-team delivery and radiating organizational updates. Facilitating product technical strategy and roadmap setting with software engineers and technical product management. Supervising budget and staffing. Skills and Experience:Expertise in consumer-facing internet technology for large and diverse audiences. History of developing high productivity engineering teamsBS\/MS\/Ph. D in Computer Science or other relevant technical field or the equivalent in work experience. Qualities that are important to us:A desire to make meaningful contributions to knowledge equity, free culture, and open access. Clear communication in both synchronous and asynchronous channels. Additionally, wed love it if you have:Fluency in one or more regional languages of Africa or Asia. Experience with service based and streaming architectures. Familiarity with Wikipedia \/ wikitext \/ markdown editing or content management systems (e. g., Media. Wiki, Drupal, WordPress). We grow and care for Media. Wiki and Wikimedia specific services. Media.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6143188edd0656540e6cb0a4::monster2_es\", \"source\": \"monster2_es\", \"country\": \"ES\", \"company\": \"Wikimedia Foundation\", \"position\": \"Engineering Management\", \"notes\": \"\", \"original\": \"ENGINEERING MANAGEMENTSummaryLove Wikipedia and its sibling projects? The Wikimedia Foundation is an inclusive employer, and we are looking for experienced engineering management to join our team, reporting to engineering leadership in Technology and Product Engineering.We\\u2019re committed to making knowledge available to everyone globally. This is an opportunity to do good while improving what we think is the best place on the internet. You know how to build a sustainable culture, showing empathy for users and employees, a collaborative mindset, and data-informed systems thinking. You are passionate about growing people, helping software engineers achieve their career goals while also creating amazing opportunities for them to flourish and improve technically.In this role, you will work in a distributed remote environment, where we value teamwork and a consensus-oriented approach as we build fully open source software. You are a proactive and collaborative partner with product management, design, quality &amp; test engineering, technical program management, and community relations. You will manage highly skilled engineers, who ship quality software used by over a billion users, empowering them to do their best work.Travel is not currently required due to the pandemic. During normal non-pandemic times, some travel is expected, usually 3-4 times per year.You are responsible for:Fostering a supportive team environment, ensuring diverse voices are heardGuiding team members with structured development techniquesCoaching engineers in the art and science of software engineering and evolvable software architectureParticipating in hiring considerate of diversity, equity, and inclusionPartnering with peers on cross-team delivery and radiating organizational updatesFacilitating product technical strategy and roadmap setting with software engineers and technical product managementSupervising budget and staffingSkills and Experience:Expertise in consumer-facing internet technology for large and diverse audiencesHistory of developing high productivity engineering teamsBS\/MS\/Ph.D in Computer Science or other relevant technical field or the equivalent in work experienceQualities that are important to us:A desire to make meaningful contributions to knowledge equity, free culture, and open accessClear communication in both synchronous and asynchronous channelsAdditionally, we\\u2019d love it if you have:Fluency in one or more regional languages of Africa or AsiaExperience with service based and streaming architecturesFamiliarity with Wikipedia \/ wikitext \/ markdown editing or content management systems (e.g., MediaWiki, Drupal, WordPress). We grow and care for MediaWiki and Wikimedia specific services. MediaWiki is an open source, PHP, MySQL, and JavaScript web application that powers Wikipedia and other Wikimedia Foundation websites. It has been incrementally developed for over 15 years to become a richly featured wiki engine and the basis for hundreds of extensions and skins, and has a vibrant volunteer community. Our services utilize a number of technologies.The following teams are actively seeking candidates:Campaigns: Our vibrant global network of Wikimedia organizers run content campaigns such as Wiki Loves Monuments, Art + Feminism, Wiki Loves Human Rights, and Wikimedia Asian Month that focus on new and experienced contributors, and are a key mechanism of content development on Wikipedia, Wikimedia Commons, Wikidata, and other Wikimedia projects. Our work aims to improve the experience for campaign organizers and campaign participants, so they can more effectively take part in the Wikimedia movement.Content Transform Team: We support and evolve technologies central to the editing and reading experiences on Wikipedia. These include wikitext used extensively in editing Wikipedia, structured markup formats that nicely support both machine readability and WYSIWYG experiences, optimized content APIs for Wikipedia on the web &amp; apps, and multi-tier maps infrastructure. We strive to make it easier for Wikimedians to edit and communicate with each other, and faster to preview and incorporate their high quality contributions across the Wikimedia projects spanning hundreds of human languages.Platform: The Platform Engineering Team is responsible for the maintenance and development of the MediaWiki and Wikimedia specific services that allow our software to scale to serve millions of users.Performance Team: The Engineering Productivity Team is the heart of how software development gets done at the Foundation; we are responsible for everything from development environments, code review, CI and testing infrastructure, performance testing and reviews, to deploying. You will be managing a team responsible for creating a culture of performance at the Foundation with a focus on&nbsp;outreach (internally and externally), monitoring, knowledge, and improvement. The Performance Team creates value for readers and editors by making it possible to retrieve and render content at the speed of thought, from anywhere in the world, on the broadest range of devices and connection profiles. We focus on providing&nbsp;equal access&nbsp;to a frustration-free experience, regardless of whether someone is using a brand-new laptop on a fast network in a large metropolitan area, or if they\\u2019re using an inexpensive mobile device in a rural area with unreliable internet connectivityThe Wikimedia Foundation is...&nbsp;...the nonprofit organization that hosts and operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge, free of interference. We host the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive financial support from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.<em>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.<\/em><em>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or (415) 839-6885.<\/em>U.S. Benefits &amp; Perks*Fully paid medical, dental and vision coverage for employees and their eligible families (yes, fully paid premiums!)The Wellness Program provides reimbursement for mind, body and soul activities such as fitness memberships, baby sitting, continuing education and much moreThe 401(k) retirement plan offers matched contributions at 4% of annual salaryFlexible and generous time off - vacation, sick and volunteer days, plus 22 paid holidays - including the last week of the year.Family friendly! 100% paid new parent leave for seven weeks plus an additional five weeks for pregnancy, flexible options to phase back in after leave, fully equipped lactation room.For those emergency moments - long and short term disability, life insurance (2x salary) and an employee assistance programPre-tax savings plans for health care, child care, elder care, public transportation and parking expensesTelecommuting and flexible work schedules availableAppropriate fuel for thinking and coding (aka, a pantry full of treats) and monthly massages to help staff relaxPaid travel to Wikimedia Foundation events all around the world!Equipment including a laptop, monitor, plus a one-time stipend to cover any additional needs to make sure you have the best work experienceGreat colleagues - diverse staff and contractors speaking dozens of languages from around the world, fantastic intellectual discourse, mission-driven and intensely passionate people<em>*Please note that for remote roles located outside of the U.S., we defer to our PEO to ensure alignment with local labor laws.<\/em>More informationWikimedia FoundationApplicant Privacy PolicyBlogWikimedia 2030Our Commitment to EquityThis is Wikimedia Foundation&nbsp;Facts MatterOur ProjectsOur Tech Stack\"}"
}