{
    "id":"Kaggle::techmap::61491dc2bc312541a037f7e3::aarp_us::15",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Maintenance Apprentice. Key Purpose. The Maintenance Apprentice is responsible for the repairs and maintenance of all departments of the company building, administrative and warehouse, acting as the contact for emergency situations that affect ISS ability to open for business. Additionally, the Apprentice will assess and consider the safety of self and fellow employees, the security of our assets, and the service to our clients and team members daily. Success Criteria. Comply with safety rules, policies, and procedures. Perform work assignments in a team with other employees. Follow all company procedures, policies, and rules. Take direction and respond to supervision. Communicate with the lead, supervisor, co-workers, managers, and customers professionally. Support shift lead in completing assigned daily task. Use proper personal protective equipment. Present a professional appearance and conduct. Understand customer service and satisfaction. Key Areas of Collaboration and Influence. A solid commitment to the guest experience. Always remember safety first. Build respectful relationships with all teammates and quests. Willingness to take directions from all levels of management. Coordinate activities with other internal departments. Ideal Candidate Experience. High school graduate, certificate in trade school or equivalent work experience. Must understand how things work (facility-related). Must be able to effectively communicate (oral and written) with all employees, contractors, and vendors. Self-starter and team player. Ability to prioritize and manage multi-functional tasks Ability to work quickly and effectively under pressure. Ability to use standard powered and non-powered tools. Key Accountabilities. Immediately responds to building emergencies during work hours. Facility emergencies can be constituting mandatory overtime in certain situations. Monitors and replaces light bulbs in all assigned facilities, as needed. Monitors contractor performance and works closely with outside vendors and contractors to ensure work is completed according to specifications. Performs basic HVAC, plumbing, electrical, structural, lighting and life safety work and determines when further attention is required. Performs other maintenance duties as assigned. Physical Demands & Work Environment. While performing the duties of this job, the employee must be able to stand for long periods of time, walk, reach, climb, stoop, kneel, crouch\/crawl and occasionally lift and\/or move up to 100 pounds. Specific vision abilities include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus. Must be able to work under pressure and time deadlines during peak periods. While performing the duties of this Job, the employee is frequently exposed to moving mechanical parts.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61491dc2bc312541a037f7e3::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Guckenheimer\", \"position\": \"Apprentice - Maintenance\", \"notes\": \"\", \"original\": \"<span><\/span><p><span><span><span><b><span><span><span>Maintenance Apprentice<\/span><\/span><\/span><\/b><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<p><span><span><span><b><span><span>Key Purpose<\/span><\/span><\/b><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<p><span><span><span><span><span>The Maintenance Apprentice is responsible for the repairs and maintenance of all departments of the company building, administrative and warehouse, acting as the contact for emergency situations that affect ISS ability to open for business. Additionally, the Apprentice will assess and consider the safety of self and fellow employees, the security of our assets, and the service to our clients and team members daily. <\/span><\/span><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<p><span><span><span><b><span>Success Criteria<\/span><\/b><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<ul><li><span><span><span><span><span>Comply with safety rules, policies, and procedures<\/span><\/span><\/span><\/span><\/span><\/li>\\n<\/ul><ul><li><span><span><span><span><span><span><span>Perform work assignments in a team with other employees<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span><span>Follow all company procedures, policies, and rules<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span><span>Take direction and respond to supervision<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span><span>Communicate with the lead, supervisor, co-workers, managers, and customers professionally<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span><span>Support shift lead in completing assigned daily task<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span><span>Use proper personal protective equipment<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span><span>Present a professional appearance and conduct<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span><span>Understand customer service and satisfaction <\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n<\/ul><p>\\u00a0<\/p>\\n\\n<p><span><span><span><b><span>Key Areas of Collaboration and Influence<\/span><\/b><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<ul><li><span><span><span><span><span>A solid commitment to the guest experience <\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span>Always remember safety first<\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span>Build respectful relationships with all teammates and quests<\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span>Willingness to take directions from all levels of management<\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span>Coordinate activities with other internal departments<\/span><\/span><\/span><\/span><\/span><\/li>\\n<\/ul><p>\\u00a0<\/p>\\n\\n<p><span><span><span><b><span>Ideal Candidate Experience<\/span><\/b><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<ul><li><span><span><span><span><span><span>High school graduate, certificate in trade school or equivalent work experience<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Must understand how things work (facility-related)<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Must be able to effectively communicate (oral and written) with all employees, contractors, and vendors<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Self-starter and team player<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Ability to prioritize and manage multi-functional tasks<\/span><\/span><\/span><\/span><\/span><\/span>\\n\\t<ul><li><span><span><span><span><span><span>Ability to work quickly and effectively under pressure<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t\\t<li><span><span><span><span><span><span>Ability to use standard powered and non-powered tools<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<\/ul><\/li>\\n<\/ul><p>\\u00a0<\/p>\\n\\n<p><span><span><span><b><span>Key Accountabilities <\/span><\/b><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<ul><li><span><span><span><span><span><span>Assists with maintaining the building; immediately responds to building emergencies during work hours.\\u00a0 Facility emergencies can be constituting mandatory overtime in certain situations<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Monitors and replaces light bulbs in all assigned facilities, as needed<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Monitors contractor performance and works closely with outside vendors and contractors to ensure work is completed according to specifications<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Performs basic HVAC, plumbing, electrical, structural, lighting and life safety work and determines when further attention is required<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Performs other maintenance duties as assigned <\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n<\/ul><p>\\u00a0<\/p>\\n\\n<p><span><span><span><b><span>Physical Demands &amp; Work Environment<\/span><\/b><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n\\n<ul><li><span><span><span><span><span><span>While performing the duties of this job, the employee must be able to stand for long periods of time, walk, reach, climb, stoop, kneel, crouch\/crawl and occasionally lift and\/or move up to 100 pounds. <\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Specific vision abilities include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus\\u00a0\\u00a0 <\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Must be able to work under pressure and time deadlines during peak periods<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>While performing the duties of this Job, the employee is frequently exposed to moving mechanical parts; high, unsafe places; fumes\/airborne particles; toxic or caustic chemicals; outside weather conditions; risk of electrical shock and vibration\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0 <\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>Occasionally exposed to wet and\/or humid conditions<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n\\t<li><span><span><span><span><span><span>The noise level in the work environment is frequently loud<\/span><\/span><\/span><\/span><\/span><\/span><\/li>\\n<\/ul><p>\\u00a0<\/p>\\n\\n<p><span><span><span><em><span><span>As a global organization, ISS Group is committed to making the international community more resilient and just for all people. We encourage diversity and inclusion in their broadest terms, including ethnicity, race, age, gender, gender identity, disability, sexual orientation, religious beliefs, language, culture, and educational background. We look to lead our industry by example and to positively influence the market wherever we operate. <\/span><\/span><\/em><\/span><\/span><\/span><\/p>\\n\\n<p>\\u00a0<\/p>\\n<p>\\u00a0<\/p>\\n\\n<p>ISS, a leading workplace experience and facility management company, provides placemaking solutions that contribute to better business performance and makes life easier, more productive and enjoyable \\u2013 delivered to high standards by people who care. ISS believes that people make places and places make people. From strategy through to operations, ISS partners with over 60,000 customers in 30+ countries to deliver places that work, think and give and is served by 471,056 employees who connect people and places every single day. In 2019, ISS earned DKK 78 billion in revenue. It is headquartered in Copenhagen, Denmark.<\/p>\"}"
}