{
    "id":"Kaggle::techmap::6155b875d198905e9e611e71::monster_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":"The term \"Foreman\" typically introduces a masculine bias by using a gendered job title; in this instance, it explicitly indicates that the supervisor is male.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description Commercial Plumber will perform plumbing maintenance or construction tasking, or any combination thereof, under the supervision of the Plumbing Foreman. GENERAL DUTIES (not all inclusive): Perform cutting, fitting, connection, and installation of plumbing piping, equipment, fixtures, and systems in compliance with the Uniform Plumbing Code. Diagnose, repair, and perform scheduled Preventative Maintenance on existing plumbing systems, equipment, fixtures, and infrastructure. Maintain various plumbing systems both inside and outside of buildings. Timely response to emergency service calls during and outside of normal working hours. Accurate and thorough documentation of hours worked, tasking performed, materials used, and processes involved. Advise immediate Supervisor of job progress and material\/labor requirements. Accomplish tasking utilizing design drawings, specifications, and wiring diagrams. Follow established Standard Operating Procedures (SOPs), and create or revise SOPs as needed. Perform tasking outdoors in environmentally challenging conditions including wind and extreme cold weather. Use solid decision making ability and sound judgment to safely and effectively solve problems. Proactively identify any unsafe conditions or hazards and communicate them effectively. Work directly with other departments to plan and complete tasking. Learn and use computer based labor, material, and maintenance tracking applications. Occasionally utilize the assistance of other personnel to complete tasking, or assist other trades or departments with their tasking. Perform other duties as required. REQUIREMENTS: A current Journeyman Plumber license (8, 000 hour) or a current Master Plumber license, or equivalent. If legal residence is in an area that does not have state or local licensing requirements, work experience will be considered and verified in lieu of license. Minimum four years of documented experience in all phases of the plumbing trade including piping, fixture installation, and service and repair of plumbing systems. Knowledge of the principles of plumbing and the current Uniform Plumbing Code. Ability to diagnose, maintain, adjust, repair, and replace plumbing systems and components. Ability to read and interpret design drawings, specifications, and drawings. Possess prior computer experience and be able and willing to learn and effectively utilize computer-based labor, inventory, and maintenance tracking applications. Possess the competencies, willingness and ability to perform the duties of position. Must be willing and able to lift and move items, parts, assemblies and equipment up to the safety regulation maximum. Must be willing and able to perform physical activities including heavy lifting, climbing in and out of equipment, crawling, and working outdoors. High School diploma or equivalent. Valid Drivers License.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155b875d198905e9e611e71::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Pacific Bearing Co\", \"position\": \"Commercial Plumber\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div> <div> <p>Commercial Plumber will perform plumbing maintenance or construction tasking, or any combination thereof, under the supervision of the Plumbing Foreman. <\/p> <p>GENERAL DUTIES (not all inclusive):<\/p> <ul> <li>Perform cutting, fitting, connection, and installation of plumbing piping, equipment, fixtures, and systems in compliance with the Uniform Plumbing Code<\/li> <li>Diagnose, repair, and perform scheduled Preventative Maintenance on existing plumbing systems, equipment, fixtures, and infrastructure<\/li> <li>Maintain various plumbing systems both inside and outside of buildings<\/li> <li>Timely response to emergency service calls during and outside of normal working hours<\/li> <li>Accurate and thorough documentation of hours worked, tasking performed, materials used, and processes involved<\/li> <li>Advise immediate Supervisor of job progress and material\/labor requirements<\/li> <li>Accomplish tasking utilizing design drawings, specifications, and wiring diagrams<\/li> <li>Follow established Standard Operating Procedures (SOPs), and create or revise SOPs as needed<\/li> <li>Perform tasking outdoors in environmentally challenging conditions including wind and extreme cold weather<\/li> <li>Use solid decision making ability and sound judgment to safely and effectively solve problems<\/li> <li>Proactively identify any unsafe conditions or hazards and communicate them effectively<\/li> <li>Work directly with other departments to plan and complete tasking<\/li> <li>Learn and use computer based labor, material, and maintenance tracking applications<\/li> <li>Occasionally utilize the assistance of other personnel to complete tasking, or assist other trades or departments with their tasking<\/li> <li>Perform other duties as required<\/li> <\/ul> <p>REQUIREMENTS:<\/p> <ul> <li>A current Journeyman Plumber license (8,000 hour) or a current Master Plumber license, or equivalent. If legal residence is in an area that does not have state or local licensing requirements, work experience will be considered and verified in lieu of license<\/li> <li>Minimum four years of documented experience in all phases of the plumbing trade including piping, fixture installation, and service and repair of plumbing systems<\/li> <li>Knowledge of the principles of plumbing and the current Uniform Plumbing Code<\/li> <li>Ability to diagnose, maintain, adjust, repair, and replace plumbing systems and components<\/li> <li>Ability to read and interpret design drawings, specifications, and drawings<\/li> <li>Possess prior computer experience and be able and willing to learn and effectively utilize computer-based labor, inventory, and maintenance tracking applications<\/li> <li>Possess the competencies, willingness and ability to perform the duties of position<\/li> <li>Must be willing and able to lift and move items, parts, assemblies and equipment up to the safety regulation maximum<\/li> <li>Must be willing and able to perform physical activities including heavy lifting, climbing in and out of equipment, crawling, and working outdoors<\/li> <li>High School diploma or equivalent<\/li> <li>Valid Driver\\u2019s License<\/li> <\/ul> <p>PREFERRED:<\/p> <ul> <li>Experience working with a variety of pipe materials and fittings such as: copper, PEX, PVC, Galvanized Steel, Black Iron, Glass-fiber Reinforced Epoxy (GRE), High Density Polyethylene (HDPE)<\/li> <li>Experience with installation, repair, and maintenance of hydronic piping systems<\/li> <li>Experience in construction and maintenance of commercial and\/or industrial facilities<\/li> <li>Certification as Backflow Prevention Assembly Tester<\/li> <li>Certification as Backflow Prevention Assembly Repairer<\/li> <li>Experience with Maximo or other Computerized Maintenance Management System<\/li> <li>Experience with Microsoft Office Suite<\/li> <\/ul> <p>Education:<\/p> <ul> <li>High school or equivalent (Required)<\/li> <\/ul> <p>Experience:<\/p> <ul> <li>Plumbing: 4 years (Required)<\/li> <\/ul> <p>License\/Certification:<\/p> <ul> <li>Journeyman or Master Plumbing License (Required)<\/li> <li>Driver's License (Required)<\/li> <\/ul> <p><br><\/p> <p>We are an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. PBC Linear is a drug free workplace.<\/p> <ul> <li>Health, dental, vision insurance<\/li> <li>Paid Holidays<\/li> <li>Paid Vacation<\/li> <li>401K with match<\/li> <\/ul> <p><br><\/p> <\/div> <\/div> <br> <br> <p>PI146668983<\/p> <\/div>\"}"
}