{
    "id":"Kaggle::techmap::615af6be553e9365d1fa878f::seek_au::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Phrase 'physically fit' may exclude those with disabilities",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Due to increase of work, the above position is required to be filled. Job tasks include: Rubbish removal from vacated domestic properties. Garden maintenance (eg. pruning, grass cutting). Light Demolition. removal of small yard structures. Concrete removal. Yard leveling. Supply and spread of various materials (eg. gravel, loam). Experience and Qualifications: Must have: White Card Police Check **Please DO NOT apply if you do not have the above**. MR or HR Licence (preferred) Bobcat experience (preferred). Traffic Management (preferred) Must be physically fit and healthy Must be enthusiastic Must be able to work with minimal supervision and work within a team. We are a continually growing business with over 25 years experience in this industry. We value our employees and all work together as a team to achieve our objectives..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615af6be553e9365d1fa878f::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Compact Bobcat Services\", \"position\": \"General Laborer\/Driver - Adelaide and Metropolitan\", \"notes\": \"\", \"original\": \"<h2>Due to increase of work, the above position is required to be filled.<br \/><br \/>Job tasks include:<br \/><br \/>Rubbish removal from vacated domestic properties<br \/>Garden maintenance (eg. pruning, grass cutting)<br \/>Light Demolition - removal of small yard structures<br \/>Concrete removal<br \/>Yard leveling<br \/>Supply and spread of various materials (eg. gravel, loam)<br \/><br \/>Experience and Qualifications:<br \/><br \/>Must have:\\u00a0<\/h2><h2>White Card<\/h2><h2>Police Check<\/h2><h2><strong>**Please DO NOT apply if you do not have the above**<\/strong> \\u00a0\\u00a0<\/h2><p>\\u00a0<\/p><h2>MR or HR Licence (preferred)<\/h2><h2>Bobcat experience (preferred)<br \/>Traffic Management (preferred)<\/h2><h2>Must be physically fit and healthy<\/h2><h2>Must be enthusiastic<\/h2><h2>Must be able to work with minimal supervision and work within a team<\/h2><p>\\u00a0<\/p><h2>We are a continually growing business with over\\u00a025 years experience in this industry.<\/h2><h2>We value our employees and all work together as a team to achieve our objectives.<br \/><br \/><br \/><br \/>\\u00a0<\/h2>\"}"
}