{
    "id":"Kaggle::techmap::6141e8f4a973d70733cf7fb7::britishjobs_uk::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Our client is a multi-award winning business based on the outskirts of Horsham. They have a fantastic opportunity for someone to join their team with a desire to deliver top class customer service. As Operations Support Administrator you will have a varied and interesting role within this dynamic company and your regular duties will include:. Being the first point of contact for incoming calls. Making outbound customer satisfaction \/ research calls. Assigning projects and managing workflow. Checking reports. Managing video equipment. Performaing assorted administrative tasks. The focus on this role will be to build up relationships with workers by guiding them through various assignments and ensuring they have everything they need. Therefore, candidates should have great communication skills and be an excellent organisor. You should also have effective problem solving ability and be a self-motivated individual with a team spirit! If you are looking to secure an interesting role with plenty of variety with a dynamic company who provides a friendly working environment with plenty of scope for development, we would love for you to apply. However, if you do not hear back from us within 48 hours, kindly assume that you have been unsuccessful on this occasion. (agy).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6141e8f4a973d70733cf7fb7::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Harvey Beric Associates\", \"position\": \"Operations Support Administrator\", \"notes\": \"\", \"original\": \"Our client is a multi-award winning business based on the outskirts of Horsham. They have a fantastic opportunity for someone to join their team with a desire to deliver top class customer service.<br><br>As Operations Support Administrator you will have a varied and interesting role within this dynamic company and your regular duties will include:<br><br>  * Being the first point of contact for incoming calls<br><br>  * Making outbound customer satisfaction \/ research calls<br><br>  * Assigning projects and managing workflow<br><br>  * Checking reports<br><br>  * Managing video equipment<br><br>  * Performaing assorted administrative tasks<br><br>The focus on this role will be to build up relationships with workers by guiding them through various assignments and ensuring they have everything they need. Therefore, candidates should have great communication skills and be an excellent organisor. You should also have effective problem solving ability and be a self-motivated individual with a team spirit!<br><br>If you are looking to secure an interesting role with plenty of variety with a dynamic company who provides a friendly working environment with plenty of scope for development, we would love for you to apply. However, if you do not hear back from us within 48 hours, kindly assume that you have been unsuccessful on this occasion. (agy)<br>\"}"
}