{
    "id":"Kaggle::techmap::613fc8adff961119564fbe5a::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The requirement for candidates to be \"fit, healthy, and hardworking\" may inadvertently exclude individuals with certain disabilities who are capable of performing the essential functions of the job with reasonable accommodations.",
    "label_masculine":true,
    "analysis_masculine":"The use of phrases like \"hardworking\", \"can-do attitude\", and \"show initiative\" is often associated with stereotypically masculine qualities, thus subtly favouring male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 360 Personnel are currently seeking reliable and experienced Civil Construction Workers to work on various projects throughout Sydney. Previous Civil Construction experience is a Must. These Roles are long term opportunities that will require a valid drivers licence and own transport. Any extra tickets and qualifications are Highly Regarded. What you will need: Previous Civil Construction experience. White Card. Previous experience using power tools. Relevant tickets Highly Desirable. Fit, healthy and hardworking. Full P. P. E. Drivers Licence & Own Transport. Can-do attitude and team player. Be reliable, show initiative and be able to work in a team or autonomously. Key Duties of the role, but not limited to: General Labouring. Spotting Machinery. Trenching. Pit Pipe Works. Site Set Ups \/ Demobilisation. Laser Levels. Minor Concreting. Leading Hands. If you meet the criteria for the Civil Construction Workers Role and would like to be considered for an immediate interview, please APPLY ONLINE NOW with an up to date copy of your resume.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613fc8adff961119564fbe5a::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"360 Personnel\", \"position\": \"Civil Construction Worker\", \"notes\": \"\", \"original\": \"<p>360 Personnel\\u00a0are currently seeking reliable and experienced\\u00a0Civil Construction Workers to work on various projects throughout\\u00a0Sydney. Previous\\u00a0Civil Construction\\u00a0experience is a Must.<\/p><p>These Roles are long term opportunities that will require a valid drivers licence and own transport. Any extra tickets and qualifications are Highly Regarded.<\/p><p><strong>What you will need:<\/strong><\/p><ul><li>Previous Civil Construction experience<\/li><li>White Card<\/li><li>Previous experience using power tools<\/li><li>Relevant tickets Highly Desirable<\/li><li>Fit, healthy and hardworking<\/li><li>Full P.P.E.<\/li><li>Drivers Licence &amp; Own Transport<\/li><li>Can-do attitude and team player<\/li><li>Be reliable, show initiative and be able to work in a team or autonomously.<\/li><\/ul><p><strong>Key Duties of the role, but not limited to:<\/strong><\/p><ul><li>General Labouring<\/li><li>Spotting Machinery<\/li><li>Trenching<\/li><li>Pit Pipe Works<\/li><li>Site Set Ups \/ Demobilisation<\/li><li>Laser Levels<\/li><li>Minor Concreting<\/li><li>Leading Hands<\/li><\/ul><p>If\\u00a0you meet the criteria for the\\u00a0Civil Construction Workers Role and would like to be considered for an <strong>immediate interview,<\/strong> please\\u00a0<strong>APPLY ONLINE NOW<\/strong>\\u00a0with an up to date copy of your resume.<\/p>\"}"
}