{
    "id":"Kaggle::techmap::6145a9b38baf38350e626acb::linkedin_hk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The focus on services for \"pregnant girls in crisis\" and the emphasis on qualities like being \"embraced, equipped, and empowered\" subtly favours female candidates, as these roles are traditionally associated with caregiving and support, which are often seen as feminine traits. This can disadvantage male candidates who may feel less encouraged to apply due to the gendered nature of the language and role focus.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"he \/she\" can be seen as excluding those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" CHANGE YOUR FUTURE AND THE FUTURE FOR CHILDREN IN HONG KONG. JOIN OUR TEAM. Our staff are creative, collaborative, and willing to do whatever it takes to get the job done. They embody our core values and believe in our vision and mission. If you enjoy a work environment that is challenging, rewarding and making an impact, we invite you to consider a career with Mothers Choice. Position Description. The mission of our Pregnant Girls Services (PGS) is to provide a safe place where pregnant girls in crisis are embraced, equipped and empowered for a hopeful future. PGS provides pregnant teens with the tools and comprehensive programs to break the generational cycle of abuse and neglect. We know from our history that the more time we are able to spend with the girls ahead of the birth of their child, the more successful they are in transitioning back to the community. The Manager, PGS, is responsible for creating, innovating and managing the newly developed service framework. He\/she will lead, build and develop a core team of PGS professionals. The Manager will partner with other service teams, Community Education and Volunteer Engagement in developing strategies, operational plans and metrics to advance the programs in a more effective and sustainable way. Key Responsibilities. Provide strategic leadership in implementing the enhanced PGS framework to guide the high-quality crisis service. Collaborate with academic partners to develop evidence-based tools and an evaluation system to upgrade the standard and effectiveness of the programs as well as measuring the impact. Together with the Child Protection Manager, develop an advocacy based approach to case management for the youth clients. Model and demonstrate the best practices in case management in youth clients in order to influence our peers partners such as Social Welfare Department and other NGOs. Lead and oversee the implementation and evaluation of the case management system. With support from Community Education, ensure the whole PGS team are equipped and empowered with sexuality education and child protection training to uphold the standards and values of Mothers Choice. Lead, coach, develop and retain a high performing team. Support the development of pilot programs (e. g. Safe Families) which support PGS clients. Support cross-services relationship mapping for community partners. Support Leadership and Development in developing Professional Competency Training. And. Oversee the annual operations plan and budget. Requirements.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145a9b38baf38350e626acb::linkedin_hk\", \"source\": \"linkedin_hk\", \"country\": \"HK\", \"company\": \"\\u6bcd\\u89aa\\u7684\\u6289\\u64c7 Mother's Choice\", \"position\": \"Manager, Pregnant Girls Services\", \"notes\": \"\", \"original\": \"<p><strong>CHANGE <\/strong><strong>YOUR FUTURE AND THE FUTURE FOR CHILDREN IN HONG KONG. JOIN OUR TEAM. <\/strong><span>Our staff are creative, collaborative, and willing to do whatever it takes to get the job done. They embody our core values and believe in our vision and mission. If you enjoy a work environment that is challenging, rewarding and making an impact, we invite you to consider a career with Mother\\u2019s Choice.<\/span><\/p><p><br><\/p><p><strong>Position Description<\/strong><\/p><p>The mission of our Pregnant Girls Services (PGS) is to provide \\u201ca safe place where pregnant girls in crisis are embraced, equipped and empowered for a hopeful future\\u201d. PGS provides pregnant teens with the tools and comprehensive programs to break the generational cycle of abuse and neglect. We know from our history that the more time we are able to spend with the girls ahead of the birth of their child, the more successful they are in transitioning back to the community. The Manager, PGS, is responsible for creating, innovating and managing the newly developed service framework. He\/she will lead, build and develop a core team of PGS professionals. The Manager will partner with other service teams, Community Education and Volunteer Engagement in developing strategies, operational plans and metrics to advance the programs in a more effective and sustainable way.<\/p><p><br><\/p><p><strong>Key Responsibilities<\/strong><\/p><ul><li>Provide strategic leadership in implementing the enhanced PGS framework to guide the high-quality crisis service;<\/li><li>Collaborate with academic partners to develop evidence-based tools and an evaluation system to upgrade the standard and effectiveness of the programs as well as measuring the impact;<\/li><li>Together with the Child Protection Manager, develop an advocacy based approach to case management for the youth clients;<\/li><li>Model and demonstrate the best practices in case management in youth clients in order to influence our peers\\u2019 partners such as Social Welfare Department and other NGOs;<\/li><li>Lead and oversee the implementation and evaluation of the case management system;<\/li><li>With support from Community Education, ensure the whole PGS team are equipped and empowered with sexuality education and child protection training to uphold the standards and values of Mother\\u2019s Choice;<\/li><li>Lead, coach, develop and retain a high performing team;<\/li><li>Support the development of pilot programs (e.g. Safe Families) which support PGS clients;<\/li><li>Support cross-services relationship mapping for community partners;<\/li><li>Support Leadership and Development in developing Professional Competency Training; and<\/li><li>Oversee the annual operations plan and budget.<\/li><\/ul><p><br><\/p><p><strong>Requirements <\/strong><\/p><ul><li>Degree holder in a relevant discipline with at least 10 years\\u2019 work experience with minimum 5 years in supervisory levels.<\/li><li>Preferably with experience in social\/humanity services and non-profit organization disciplines in a multiculture environment.<\/li><li>Able to lead, coach and motivate a team of frontline workers, and act as a role model.<\/li><li>Mature, energetic and analytical with excellent interpersonal and project management skills.<\/li><li>Able to work under pressure and remain positive under adverse circumstances with a high level of resilience.<\/li><li>Bilingual in Chinese and English. Excellent communication skills in both written and verbal English required.<\/li><li>Must be aligned to the culture, values and vision of Mothers Choice.<\/li><li>Passionate about the vision of Mothers Choice that every child is in a loving family and act as an advocate for those who do not have a voice in society.<\/li><li>Must share the commitment of Mother\\u2019s Choice in upholding the safety and protection of children as paramount.<\/li><\/ul><p><br><\/p><p><strong>To Apply<\/strong><\/p><p>Interested candidates should send a cover letter, full resume quoting the job reference number (Ref: LINK\/210914\/M_PGS) and expected salary to Assistant Director, Human Resources, Mother\\u2019s Choice Limited, 10 Borrett Road, Mid-Levels, Hong Kong; email hr@motherschoice.org; fax 2525 7445 <\/p><p><br><\/p><p>Personal data collected will be used for recruitment purposes only. Applicants who do not hear from us within two months may consider their application unsuccessful. Mother\\u2019s Choice is committed to diversity and inclusion and is an equal opportunity employer. <\/p><p><br><\/p><p><strong>About Mother\\u2019s Choice<\/strong><\/p><p>Mother\\u2019s Choice is a local charity serving the many children without families and pregnant teenagers in Hong Kong. We join hands with our community to give hope and change the life stories of vulnerable girls and babies. Our vision is to see every child in a loving family.<\/p>\"}"
}