{
    "id":"Kaggle::techmap::6135bf776ef2af1a4596f5af::aarp_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Have knowledge of area and\/or map reading abilities. Use safe lifting and loading techniques. Great interpersonal\/customer service skills. Availability to work on weekends and Holidays. Knowledge\/Skills\/Abilities. Hand cart delivery experience preferred. Able to read, write and communicate in English as it relates to the job and to the safety regulations. Must have basic math skills (add, subtract, multiply, divide). Must pass pre-employment testing (including items such as Drug Screen & Background Check). Have knowledge of area and\/or map reading abilities. Use safe lifting and loading techniques. Great interpersonal\/customer service skills. Availability to work on weekends and Holidays. At Us Foods We Help Our Customers Make It with Products and Services That Shape the Communities Where We Live and Work. We Are Passionate About Demonstrating the Same Commitment to Helping Our Employees Make It Through Continued Professional Growth Opportunities and Broad Career Path Potential. Why Us Foods? Our Customers' Success Goes Far Beyond Great Food. At Us Foods, We Work to Exceed Expectations and Give Our Customers the Competitive Edge They Need. At the Foundation of Those Efforts Are Our Cultural Beliefs, The Pillars That Define Our Work Ethic, Collaborative Spirit and Commitment to Service. At Us Foods, We Are Committed to Compensation and Benefits That Respect and Reward Our Employees for Their Dedication and Hard Work. If You Join Our Team, We Provide Flexibility and Options to Fit Every Stage of Your Career. EOE Race\/Color\/Religion\/Sex\/Sexual Orientation\/Gender Identity\/National Origin\/Protected Veteran\/Disability Status.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6135bf776ef2af1a4596f5af::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"US Foods\", \"position\": \"Veterans Preferred - Van Driver Greenville\", \"notes\": \"\", \"original\": \"<p><span><br \/> Military Veterans are Encouraged to Apply.  <\/span><span><br \/><span>Join Our Community of Food People! <br \/><br \/>The VAN DRIVER is a delivery position responsible for driving a company vehicle to assigned stops and delivering foodservice products with a high level of service to US Foods customers. <br \/><br \/><b> We help YOU make it! <\/b><br \/><br \/><b>Benefits<\/b> medical, dental, vision, 401K, life insurance, strong safety culture, and much more! <b>Benefits start day ONE, stellar local leadership, best place to work!<\/b> <br \/><br \/><b> US Foods <\/b>is one of the largest food distributors with a culture and history of promoting from within, excellent training programs and a continuous improvement focus. <br \/><br \/><b>Visit O*Net to see how your service aligns with US Foods roles <\/b><br \/> www.onetonline.org\/crosswalk\/MOC\/ <br \/><br \/><b> Essential Duties and Responsibilities <\/b><br \/><br \/><\/span><\/span><\/p><ul><li>Lift up to 60 lbs. on consistent basis.<br \/><\/li><li>Load and unload Van for multi-stop deliveries.<br \/><\/li><li>Transport deliveries by driving assigned vehicles.<br \/><\/li><li>Use hand truck and load bar.<br \/><\/li><li>Accurately record delivery information including operating a hand scanner and all company required documentation.<br \/><\/li><li>Responsible for the proper documentation and disposition for any return product.<br \/><\/li><li>Communicate delivery- customer issues to proper authority (i.e., Customer Service, Territory Manager, Transportation Supervisor, etc.).<br \/><\/li><li>Deliver product to each of the designated stops on using the stop sequence provided for the day.<br \/><\/li><li>Unload product safely and stage product in the space(s) designated by customer.<br \/><\/li><li>Check invoice for complete delivery. Process paperwork and damaged merchandise if any.<br \/><\/li><li>Collect payments if necessary.<br \/><\/li><li>Monitor refrigeration system on van on a consistent basis for safety; follow all safe food handling procedures<br \/><\/li><li>Perform pre-trip and post-trip inspections such as monitoring fluid levels, tires, windshield wash and replenishing fuel.<br \/><\/li><li>Other duties as assigned.<br \/><\/li><\/ul><br \/><b> Qualifications <\/b><br \/><ul><li>Education\/Training:<br \/><ul><li>High School Education or GED preferred<br \/><\/li><\/ul><\/li><\/ul><br \/><b>Related Experience\/Requirements<\/b><br \/><ul><li>Must be 18 years of age or older.<br \/><\/li><li>Valid driver's license issued by the state of legal residence with proper endorsements if required.<br \/><\/li><li>No more than 2 convictions in the past two-year period for traffic violations, no DUI convictions in the past 3 years, no driver's license suspensions in the past 3 years.<br \/><\/li><li>1-year multi-stop delivery experience required or 6-month local delivery experience and\/or foodservice industry experience.<br \/><\/li><li>Hand cart delivery experience preferred.<br \/><\/li><li>Able to read, write and communicate in English as it relates to the job and to the safety regulations<br \/><\/li><li>Must have basic math skills (add, subtract, multiply, divide).<br \/><\/li><li>Must pass pre-employment testing (including items such as Drug Screen &amp; Background Check)<br \/><\/li><li>Have knowledge of area and\/or map reading abilities.<br \/><\/li><li>Use safe lifting and loading techniques<br \/><\/li><li>Great interpersonal\/customer service skills<br \/><\/li><li>Availability to work on weekends and Holidays<br \/><\/li><\/ul><br \/><b>Knowledge\/Skills\/Abilities<\/b><br \/><ul><li>Hand cart delivery experience preferred.<br \/><\/li><li>Able to read, write and communicate in English as it relates to the job and to the safety regulations<br \/><\/li><li>Must have basic math skills (add, subtract, multiply, divide).<br \/><\/li><li>Must pass pre-employment testing (including items such as Drug Screen &amp; Background Check)<br \/><\/li><li>Have knowledge of area and\/or map reading abilities.<br \/><\/li><li>Use safe lifting and loading techniques<br \/><\/li><li>Great interpersonal\/customer service skills<br \/><\/li><li>Availability to work on weekends and Holidays<br \/><\/li><\/ul><br \/> At Us Foods We Help Our Customers Make It with Products and Services That Shape the Communities Where We Live and Work. We Are Passionate About Demonstrating the Same Commitment to Helping Our Employees Make It Through Continued Professional Growth Opportunities and Broad Career Path Potential. <br \/><br \/> Why Us Foods? <br \/> Our Customers' Success Goes Far Beyond Great Food. At Us Foods, We Work to Exceed Expectations and Give Our Customers the Competitive Edge They Need. At the Foundation of Those Efforts Are Our Cultural Beliefs, The Pillars That Define Our Work Ethic, Collaborative Spirit and Commitment to Service. <br \/><br \/> At Us Foods , We Are Committed to Compensation and Benefits That Respect and Reward Our Employees for Their Dedication and Hard Work. If You Join Our Team, We Provide Flexibility and Options to Fit Every Stage of Your Career. <br \/><br \/><b>***EOE Race\/Color\/Religion\/Sex\/Sexual Orientation\/Gender Identity\/National Origin\/Protected Veteran\/Disability Status***<\/b><br \/><br \/>\"}"
}