{
    "id":"Kaggle::techmap::61444ccea5224e6280f7164b::careerbuilder_us::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The phrase \"Ability to stand for long periods of time.\" will discourage those with a disability from applying.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Overview. Common. Spirit Health was formed by the alignment of Catholic Health Initiatives (CHI) and Dignity Health. With more than 700 care sites across the U. S. & from clinics and hospitals to home-based care and virtual care services Common. Spirit is accessible to nearly one out of every four U. S. residents. Our world needs compassion like never before. Our communities need caring and our families need protection. With our combined resources Common. Spirit is committed to building healthy communities advocating for those who are poor and vulnerable and innovating how and where healing can happen both inside our hospitals and out in the community. Responsibilities. The Sonographer is responsible for performing obstetrical and gynecologic ultrasound examinations at a technical level in accordance with department protocols and applicable regulatory requirements. Will assume responsibility for the safe, efficient and proper operation of the ultrasound equipment. 1. Produce high quality ultrasound images and obtain appropriate measurements for each exam. 2. Recognize the sonographic appearance of normal and abnormal tissue structures and provide the best image quality for documentation. 3. Document all applicable patient and procedure data consistently and correctly. 4. Obtain and evaluate pertinent patient history and physical findings that may affect the sonographic examination. 5. Explain procedures adequately to patients to maximize patient comfort and cooperation. 6. Appropriate monitoring during all phases of procedure with special care taken to insure patient emotional and physical well-being. 7. 8. Maintain the ultrasound equipment for cleanliness and ensure proper equipment maintenance and equipment safety. 9. Calibrate and maintain equipment and order supplies when needed. 10. Schedule and coordinate tests. 11. Prepare and maintain operational logs. 12. Assist with Quality Assurance\/Improvements audits and activities as required. 13. Perform other duties as assigned. Qualifications. Education and Licensure. Graduate of an accredited school of Diagnostic Sonography program required. American Registry of Diagnostic Medical Sonographers (ARDMS) certification required. Minimum Experience. 2 years related experience required. Minimum Knowledge, Skills, and Abilities. Ability to stand for long periods of time. Demonstrate excellent customer service skills. Demonstrate effective verbal and written communication skills. Knowledge of current principles, standards, procedures, protocols, techniques and tools\/equipment relating to ultrasound examination and related procedures..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61444ccea5224e6280f7164b::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"CHI Baylor St. Luke's Medical Group\", \"position\": \"Sonographer\", \"notes\": \"\", \"original\": \"<b>Overview<\/b><br \/><p>CommonSpirit Health was formed by the alignment of Catholic Health Initiatives (CHI) and Dignity Health. With more than 700 care sites across the U.S. & from clinics and hospitals to home-based care and virtual care services CommonSpirit is accessible to nearly one out of every four U.S. residents. Our world needs compassion like never before. Our communities need caring and our families need protection. With our combined resources CommonSpirit is committed to building healthy communities advocating for those who are poor and vulnerable and innovating how and where healing can happen both inside our hospitals and out in the community.<\/p><br \/><b>Responsibilities<\/b><br \/><p>The Sonographer is responsible for performing obstetrical and gynecologic ultrasound examinations at a technical level in accordance with department protocols and applicable regulatory requirements. Will assume responsibility for the safe, efficient and proper operation of the ultrasound equipment.<\/p><p><\/p><p>1. Produce high quality ultrasound images and obtain appropriate measurements for each exam.<br \/>\\u00a02. Recognize the sonographic appearance of normal and abnormal tissue structures and provide the best image quality for documentation.<br \/>\\u00a03. Document all applicable patient and procedure data consistently and correctly.<br \/>\\u00a04. Obtain and evaluate pertinent patient history and physical findings that may affect the sonographic examination.<br \/>\\u00a05. Explain procedures adequately to patients to maximize patient comfort and cooperation.<br \/>\\u00a06. Appropriate monitoring during all phases of procedure with special care taken to insure patient emotional and physical well-being.<br \/>\\u00a07. Communicate patient information in a professional and courteous manner to patients and to referring physician offices as required.<br \/>\\u00a08. Maintain the ultrasound equipment for cleanliness and ensure proper equipment maintenance and equipment safety. \\u00a0<br \/>\\u00a09. Calibrate and maintain equipment and order supplies when needed.<br \/>\\u00a010. Schedule and coordinate tests.<br \/>\\u00a011. Prepare and maintain operational logs.<br \/>\\u00a012. Assist with Quality Assurance\/Improvements audits and activities as required.<br \/>\\u00a013. Perform other duties as assigned.<\/p><br \/><b>Qualifications<\/b><br \/><p><em><strong>Education and Licensure<\/strong><\/em><br \/>* Graduate of an accredited school of Diagnostic Sonography program required.<br \/>\\u00a0* American Registry of Diagnostic Medical Sonographers (ARDMS) certification required.<br \/><\/p><p><\/p><p><em><strong>Minimum Experience<\/strong><\/em><br \/>* 2 years related experience required.<br \/><\/p><p><\/p><p><em><strong>Minimum Knowledge, Skills, and Abilities<\/strong><\/em><br \/>* Ability to stand for long periods of time.<br \/>\\u00a0* Demonstrate excellent customer service skills.<br \/>\\u00a0* Demonstrate effective verbal and written communication skills.<br \/>\\u00a0* Knowledge of current principles, standards, procedures, protocols, techniques and tools\/equipment relating to ultrasound examination and related procedures.<br \/>\\u00a0* Knowledge of the intent, content and application of local, state and federal employee health standards, and regulatory requirements applicable to diagnostic ultrasound examination.<br \/>\\u00a0* Possess a strong work ethic and a high level of professionalism.<\/p><p><\/p><p><\/p><p>DISCLOSURE STATEMENT:<br \/>The above statements reflect the general details considered necessary to describe the essential functions of the job as identified, and shall not be considered a detailed description of all work requirements that may be inherent in position.<\/p>&nbsp;\"}"
}