{
    "id":"Kaggle::techmap::615ac3e885c64c0517b6aed8::linkedin_iq::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Use of masculine pronoun suggest a bias towards male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" He must be familiar with types of Hot, Cold & warm start up and shut down of thermal power plant and all BOP equipments including the Boiler operation, protection, Boiler Auxiliary Operation, Heat balance diagram. etc. 4. Turbine operation, Auxiliary operation  LO system. turning gear. FW heats CEP, FP etc. Protection, Introduction to governing and trouble shooting. Boiler, turbine, Generation Integrated operation unit operation under normal & emergency. Protection &Interlocks. Must have a deep knowledge and experience of operating EMERSON DCS Systems. Performance monitoring, Introduction  Boiler Turbine & Auxiliaries. knowledge of Electrical Operation AVR, Switchyard and Switchgear and their modes of operation. Experienced in Emergency handling procedure like grid failure, bus bar failure etc. 10. Unit shut down procedure & safety. Good knowledge of Ash Handling System ESP, FGD. Trouble Shooting \/ Problem solving skills. General computer skills. Languages: English is a must Kurdish and Arabic is an advantage. Reporting Skills. Team work skills. Quality and Quality assurance Organizing Skills. Training Skills. High Safety & Environmental Knowledge. Ability to comprehend and adhere to health and safety. regulations and standards. Kindly send your CV to gegstaffing. com.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615ac3e885c64c0517b6aed8::linkedin_iq\", \"source\": \"linkedin_iq\", \"country\": \"IQ\", \"company\": \"GEG Staffing\", \"position\": \"Operation Engineer\", \"notes\": \"\", \"original\": \"<br><p><strong><u>Job Description &amp; responsibilities: <\/u><\/strong><\/p><p><br><\/p><ol><li>engineer will perform the monitoring and evaluates the daily operations of a power plant. Monitors&nbsp;operations for efficiency and safety ensuring that all applicable regulatory requirements are followed. ...<\/li><\/ol><p><br><\/p><p>2.Prepare daily, weekly and any required reports and submit recommendations to team Manager concerning <span>equipment\/plant status and\/or problems.&nbsp;&nbsp;<\/span><\/p><p><br><\/p><p>3.Review all required operations documentation.<\/p><p><br><\/p><p>4.Monitoring &amp; review the startup, shut down and operating procedures.<\/p><p><br><\/p><p>5. Monitoring and observation of fault finding, problems solving, and first line maintenance ensuring that work is carried out to the appropriate standards.<\/p><p><br><\/p><p>6.When required, Suggest and advice any promote modifications and Continuous Improvement<\/p><p>&nbsp;&nbsp;&nbsp;&nbsp;Initiatives.<\/p><p><br><\/p><p>7.Continually review work and processes and determine whether improvements could be made<\/p><p>&nbsp;&nbsp;&nbsp;And advice the team manager accordingly.<\/p><p><br><\/p><p>8.Support team including Operations, Engineering and Maintenance within the constraints of<\/p><p>&nbsp;&nbsp;&nbsp;competence and authorization<\/p><p><br><\/p><p>9.Monitor and follow up the Development of operational documentation, records and procedures.<\/p><p><br><\/p><p>10.Monitoring of the (DCS) System and other process control devices.<\/p><p><br><\/p><p>11.Support, assists and advice in observation of daily maintenance actions, plant configuration changes and&nbsp;varying power generation levels.<\/p><p><br><\/p><p>12.Monitors the chemical condition of water and steam, water treatment skid and other areas in the plant to&nbsp;optimize the consumption and observe the corrections to the process as necessary.&nbsp;&nbsp;<\/p><p><br><\/p><p>13.Identifies any problems with plant equipment and clearly communicates the conditions associated with these problems to the monitoring team.<\/p><p><br><\/p><p>14.Monitors the completeness of shift round checklists, routine daily\/weekly\/monthly test checklists and&nbsp;equipment change-over checklists, etc.<\/p><p><br><\/p><p>15.Provides technical guidance, planning and oversight of equipment design and installations to team members.<\/p><p><br><\/p><p>16.Coordinates with operating company correspondence to fulfill the role requirement.<\/p><p><br><\/p><p>17.Monitor the commercial and engineering records, sub-contractors and regulatory documentation in accordance&nbsp;with Best Engineering Practices and PP requirements.&nbsp;<\/p><p><br><\/p><p>18.Collects all the required data, operating hours, outage hours, and forced outage, monitors if they are well&nbsp;prepared and documented, their type and the related outage notifications, number of dispatches starts and&nbsp;related dispatch instructions.<\/p><p><br><\/p><p>19.Collect daily data for any abnormalities, and take the proper action to notify the problems to <\/p><p>team manager.<\/p><p><br><\/p><p>20.Monitor Issuing Work Permits and Tag out\/Log out (LOTO).<\/p><p>&nbsp;<\/p><p><br><\/p><p>&nbsp;<\/p><p><strong><u>Role of Operation Engineer Requirements: <\/u><\/strong><\/p><p><u>&nbsp;<\/u><\/p><p><strong>-<u>Education<\/u><\/strong><u>:<\/u><\/p><p><br><\/p><p>Bachelor Degree in Mechanical or Electrical Engineering.<\/p><p><br><\/p><p><strong><u>-Experience:<\/u><\/strong><u> <\/u><\/p><p>&nbsp;<\/p><p>1.(15+ years) experience in Power plant operation, worked in Thermal power plant or&nbsp;&nbsp;combined cycle power plant is a must.<\/p><p><br><\/p><p>3.He must be familiar with types of Hot, Cold &amp; warm start up and shut down of thermal power plant and all BOP equipment\\u2019s including the Boiler operation, protection, Boiler Auxiliary Operation, Heat balance diagram\\u2026...etc.<\/p><p><br><\/p><p>4.Turbine operation, Auxiliary operation \\u2013 LO system. turning gear. FW heats CEP, FP\\u2026\\u2026\\u2026 etc. Protection,Introduction to governing and trouble shooting.<\/p><p><br><\/p><p>5.Boiler, turbine, Generation Integrated operation unit operation under normal &amp; emergency. Protection &amp;Interlocks.<\/p><p><br><\/p><p>6.Must have a deep knowledge and experience of operating EMERSON DCS Systems.<\/p><p><br><\/p><p>7. Performance monitoring, Introduction \\u2013 Boiler Turbine &amp; Auxiliaries.<\/p><p><br><\/p><p>8.knowledge of Electrical Operation AVR, Switchyard and Switchgear and their modes of operation.<\/p><p><br><\/p><p>9.Experienced in Emergency handling procedure like grid failure, bus bar failure \\u2026\\u2026etc.<\/p><p><br><\/p><p>10. Unit shut down procedure &amp; safety.<\/p><p><br><\/p><p>11.Good knowledge of Ash Handling System ESP, FGD.<\/p><p><br><\/p><p>12.Trouble Shooting \/ Problem solving skills.<\/p><p><br><\/p><p>13.General computer skills.<\/p><p><br><\/p><p>14.Languages: English is a must Kurdish and Arabic is an advantage.<\/p><p><br><\/p><p>15.Reporting Skills.<\/p><p><br><\/p><p>16.Team work skills.<\/p><p><br><\/p><p>17.Quality and Quality assurance Organizing Skills.<\/p><p><br><\/p><p>18.Training Skills.<\/p><p><br><\/p><p>19.High Safety &amp; Environmental Knowledge.<\/p><p><br><\/p><p>20.Ability to comprehend and adhere to health and safety<\/p><p>&nbsp;&nbsp;&nbsp;&nbsp;regulations and standards.<\/p><p><br><\/p><p>Kindly send your CV to shaida.pr@gegstaffing.com<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>\"}"
}