{
    "id":"Kaggle::techmap::614505f83da58f0d52e8c084::headhunter_kz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The use of the term \"his \/ her\" can be seen as exclusionary by those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  6 . ,  . : Reviews the outcomes of Reliability Centered Maintenance study. Provides Subject Matter Expert input to RCM study if required. Reviews the RoK oil & gas industry regulatory requirements and company specifications for Instrumentation equipment operation and maintenance. Implements them in his\/ her work. Reviews FGP Instrumentation technical documentation and operations manuals. Uses them when developing FGP Instrumentation Preventive Maintenance (PM) Plan. Develops FGP Instrumentation PM plan. Participate in the development and review of instrumentation maintenance procedures. Agrees and aligns PM plan with other discipline SMEs. Defines a list of equipment which requires development of Standard Repair Procedures (SRP). Checks quality and comments on SRPs developed by Competency Development Group (CDG). Participates in pre-commissioning, commissioning, and Start-up of FGP facilities. Reviews instrumentation testing completed to ensure all required tests \/ inspections were completed properly before acceptance. Participates in the investigation and identification of the root causes of instruments failure, in the development of recommendations for the elimination and prevention of such failures. Provide guidance and leadership in technical matters and to ensure that his group are aware of and are working to current engineering standards and procedures. Provide technical support to instrument fitters in respect of measuring instruments and materials, and also to other. Monitors the technical condition and safe operation of I&C equipment, fire extinguishing unit and fire alarm systems and takes measures to eliminate malfunctions. Processes and analyzes statistical data on the operation of I&C equipment, identifies deficiencies and develops measures to eliminate them. Continuously cooperates with the automation support team to ensure safe operation of facilities, jointly provides support during commissioning and operation of new facilities and equipment, and identifies and eliminates issues in the operation of software and hardware controllers. : Higher Education. Length of service in similar position no less than 5 years. Analytical mindset. Excellent organizational skills. Ability to assist group members in resolving technical issues and clarifying process requirements. Logical thinking. :  56\/56. Analytical skillsTeambuildingTeamleadingLeadership Skills.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614505f83da58f0d52e8c084::headhunter_kz\", \"source\": \"headhunter_kz\", \"country\": \"KZ\", \"company\": \"FIRCROFT ENGINEERING SERVICES LIMITED, KAZAKHSTAN\", \"position\": \"FGP Lead Instrumentation Engineer\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u0431\\u043e\\u043b\\u0435\\u0435 6 \\u043b\\u0435\\u0442<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u041f\\u043e\\u043b\\u043d\\u0430\\u044f \\u0437\\u0430\\u043d\\u044f\\u0442\\u043e\\u0441\\u0442\\u044c<!-- -->, <span>\\u0412\\u0430\\u0445\\u0442\\u043e\\u0432\\u044b\\u0439 \\u043c\\u0435\\u0442\\u043e\\u0434<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <strong>\\u041e\\u0431\\u044f\\u0437\\u0430\\u043d\\u043d\\u043e\\u0441\\u0442\\u0438:<\/strong> \\n  <ul> \\n   <li>Reviews the outcomes of Reliability Centered Maintenance study.<\/li> \\n   <li>Provides Subject Matter Expert input to RCM study if required.<\/li> \\n   <li>Reviews the RoK oil &amp; gas industry regulatory requirements and company specifications for Instrumentation equipment operation and maintenance. Implements them in his\/ her work.<\/li> \\n   <li>Reviews FGP Instrumentation technical documentation and operations manuals. Uses them when developing FGP Instrumentation Preventive Maintenance (PM) Plan.<\/li> \\n   <li>Develops FGP Instrumentation PM plan.<\/li> \\n   <li>Participate in the development and review of instrumentation maintenance procedures.<\/li> \\n   <li>Agrees and aligns PM plan with other discipline SMEs.<\/li> \\n   <li>Defines a list of equipment which requires development of Standard Repair Procedures (SRP).<\/li> \\n   <li>Checks quality and comments on SRPs developed by Competency Development Group (CDG).<\/li> \\n   <li>Participates in pre-commissioning, commissioning, and Start-up of FGP facilities.<\/li> \\n   <li>Reviews instrumentation testing completed to ensure all required tests \/ inspections were completed properly before acceptance<\/li> \\n   <li>Participates in the investigation and identification of the root causes of instruments failure, in the development of recommendations for the elimination and prevention of such failures.<\/li> \\n   <li>Provide guidance and leadership in technical matters and to ensure that his group are aware of and are working to current engineering standards and procedures.<\/li> \\n   <li>Provide technical support to instrument fitters in respect of measuring instruments and materials, and also to other<\/li> \\n   <li>Monitors the technical condition and safe operation of I&amp;C equipment, fire extinguishing unit and fire alarm systems and takes measures to eliminate malfunctions.<\/li> \\n   <li>Processes and analyzes statistical data on the operation of I&amp;C equipment, identifies deficiencies and develops measures to eliminate them.<\/li> \\n   <li>Continuously cooperates with the automation support team to ensure safe operation of facilities, jointly provides support during commissioning and operation of new facilities and equipment, and identifies and eliminates issues in the operation of software and hardware controllers.<\/li> \\n  <\/ul> <strong>\\u0422\\u0440\\u0435\\u0431\\u043e\\u0432\\u0430\\u043d\\u0438\\u044f:<\/strong> \\n  <ul> \\n   <li> <p>Higher Education<\/p> <\/li> \\n   <li> <p>Length of service in similar position no less than 5 years.<\/p> <\/li> \\n   <li> <p>Analytical mindset<\/p> <\/li> \\n   <li> <p>Excellent organizational skills<\/p> <\/li> \\n   <li> <p>Ability to assist group members in resolving technical issues and clarifying process requirements<\/p> <\/li> \\n   <li> <p>Logical thinking<\/p> <\/li> \\n  <\/ul> <strong>\\u0423\\u0441\\u043b\\u043e\\u0432\\u0438\\u044f:<\/strong> \\n  <ul> \\n   <li>\\u0422\\u0435\\u043d\\u0433\\u0438\\u0437 56\/56<\/li> \\n  <\/ul>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\\n<div class=\\\"vacancy-section\\\">\\n <h2 data-qa=\\\"bloko-header-2\\\" class=\\\"bloko-header-2\\\">\\u041a\\u043b\\u044e\\u0447\\u0435\\u0432\\u044b\\u0435 \\u043d\\u0430\\u0432\\u044b\\u043a\\u0438<\/h2>\\n <div class=\\\"bloko-spacing-y-5\\\"><\/div>\\n <div>\\n  <div class=\\\"bloko-tag-list\\\">\\n   <div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Analytical skills<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Teambuilding<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Teamleading<\/span>\\n    <\/div>\\n    <div class=\\\"bloko-tag bloko-tag_inline\\\" data-qa=\\\"bloko-tag bloko-tag_inline skills-element\\\">\\n     <span class=\\\"bloko-tag__section bloko-tag__section_text\\\" data-qa=\\\"bloko-tag__text\\\">Leadership Skills<\/span>\\n    <\/div>\\n   <\/div>\\n  <\/div>\\n <\/div>\\n<\/div>\"}"
}