{
    "id":"Kaggle::techmap::6151b9fed8c6290776a6b05c::reed_uk::9",
    "label_age":true,
    "analysis_age":"The phrase \" a great role for a recent graduate\" will discourage older applicants.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Our client is a market leading manufacturer of premium and high-performance rigid insulation products and insulated systems for building fabric and building services applications. Manufacturing excellence, first class customer service and unrivalled expertise in meeting the needs of the market are just some of the many strengths that this client offers. About the Technical Advisor role: Our client is looking to recruit a Technical Advisor who will provide technical advice to customers regarding pipe insulation, as well as to both internal and external employees. The role also involves helping develop and certify our products whilst providing support to the team who cover ducting systems and passive fire protection. It is preferable that you have a degree in a subject related to the position, but relevant experience would also be beneficial. This would be a great role for a recent graduate, and\/or someone looking to gain experience within an innovative technical environment. You will be joining a bright and supportive team, that is passionate about developing the skills of their people. A detailed induction and personalised training and development will help to set you up for success. Key responsibilities as our. Technical Advisor: Responding to all requests for technical advice received, via various media. Producing heat transfer and associated calculations, for pipework and ductwork insulation. Ensuring best practice advice is always given, in line with industry and company guidelines. Acting responsibly and in the interests of the company, deferring queries via line managers, where uncertainty may exist. Being aware of, and pays attention to, Key Performance Indicators. Supporting with other reasonable duties deemed relevant to the role via the line manager. Ongoing professional development. What our client is looking for in a Technical Advisor: Educated to Degree level. Excellent customer service skills, with an ability to set and adhere to customer service goals. IT proficient, with a technical bias. Excellent time management skills, being highly efficient and well organised. Always exercises high attention to detail. Whilst not essential, the following would be of benefit: Understanding of building physics. Contributes to the overall team effort by accomplishing departmental goals. Whilst practicing excellent team working skills. Do you have the skills that we are looking for? If so, click apply now to be considered as our Technical Advisor!.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6151b9fed8c6290776a6b05c::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"360 Resourcing Solutions\", \"position\": \"Technical Advisor Graduate\", \"notes\": \"\", \"original\": \"<p>Our client is a market leading manufacturer of premium and high-performance rigid insulation products and insulated systems for building fabric and building services applications.&nbsp; Manufacturing excellence, first class customer service and unrivalled expertise in meeting the needs of the market are just some of the many strengths that this client offers.<\/p> <p><strong>About the <\/strong><strong>Technical Advisor role:<\/strong><\/p> <p>Our client is looking to recruit a <strong>Technical Advisor<\/strong> who will provide technical advice to customers regarding pipe insulation, as well as to both internal and external employees. The role also involves helping develop and certify our products whilst providing support to the team who cover ducting systems and passive fire protection. It is preferable that you have a degree in a subject related to the position, but relevant experience would also be beneficial.<\/p> <p>This would be a great role for a recent graduate, and\/or someone looking to gain experience within an innovative technical environment. You will be joining a bright and supportive team, that is passionate about developing the skills of their people. A detailed induction and personalised training and development will help to set you up for success.<\/p> <p><strong>Key responsibilities as our<\/strong><strong>Technical Advisor:<\/strong><\/p> \\n<ul> \\n <li>Responding to all requests for technical advice received, via various media.<\/li>\\n <li>Producing heat transfer and associated calculations, for pipework and ductwork insulation.<\/li>\\n <li>Ensuring best practice advice is always given, in line with industry and company guidelines.<\/li>\\n <li>Acting responsibly and in the interests of the company, deferring queries via line managers, where uncertainty may exist.<\/li>\\n <li>Being aware of, and pays attention to, Key Performance Indicators<\/li>\\n <li>Supporting with other reasonable duties deemed relevant to the role via the line manager.<\/li>\\n <li>Ongoing professional development.<\/li>\\n<\/ul> <p><strong>What our client is looking for in a <\/strong><strong>Technical Advisor:<\/strong><\/p> \\n<ul> \\n <li>Educated to Degree level<\/li>\\n <li>Excellent customer service skills, with an ability to set and adhere to customer service goals.<\/li>\\n <li>IT proficient, with a technical bias.<\/li>\\n <li>Excellent time management skills, being highly efficient and well organised.<\/li>\\n <li>Always exercises high attention to detail<\/li>\\n<\/ul> <p>Whilst not essential, the following would be of benefit:<\/p> \\n<ul> \\n <li>Understanding of building physics<\/li>\\n <li>Contributes to the overall team effort by accomplishing departmental goals; whilst practicing excellent team working skills.<\/li>\\n<\/ul> <p><br><br>Do you have the skills that we are looking for? If so, click <strong>apply <\/strong> now to be considered as our <strong>Technical Advisor<\/strong><strong>!<\/strong><\/p>\"}"
}