{
    "id":"Kaggle::techmap::614c57dd27095179bbdc7ff7::linkedin_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"Clarification is given about lifting weights over 40 lbs. Therefore not biased - just stating the requirements.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" As required, obtain laboratory samples (using a fecal loop when necessary) from the patient or ensure laboratory work is performed by another team member while the patient is still in the exam room. Prepare specimens for outside laboratories. Anticipate and prepare any medications or vaccines the doctor will need to treat the patient while in the exam room. Assist to restrain animals in a safe and compassionate manner during examinations and procedures. Involves using care to employ proper retraining techniques to ensure the safety of the animal and the team. Prepare prescription labels, dispense and appropriately package medications. Ensure medications are added to the patients record and appropriately charged to the client. Our Practice. Review medical records and notes made by the admitting team member in order to discern the nature of the visit and any tests or procedures that may be required. Notify the Veterinarian when patients are ready to be seen. Advise the Veterinarian of the nature of the visit, preventive procedures due, tests that are to be run, etc. Ensure all procedures rendered during the visit are documented for proper billing. Ensure that all vaccinations, procedures, notes, etc. have been documented in the medical record. Clean exam rooms, treatment and lab areas. Restock exam rooms with supplies and clean and maintain all medical equipment as required and monitor laboratory inventory levels and order additional laboratory supplies as needed. Conduct end of day role responsibilities as established by the Practice. Our Team. Communicate ideas, express opinions and respond to team members in appropriate and respectful ways. Involves using upbeat tone, displaying positive body language, actively listening and understanding the value of differing opinions or ideas. Contribute to the team as a whole by pro-actively offering assistance to others and willingly performing job tasks that team members need help with or might be outside of normal job responsibilities. May involve assisting to clean and maintain public areas of the Practice. Position Requirements. Veterinary Office Assistant qualification preferred but not expected. Previous experience as a Veterinary Assistant or Exam Room Assistant will be considered an asset. Ability to be gentle, quiet and patient with animals. Excellent customer service skills. Ability to remain calm in stressful situations. Physical Effort: Work requires lifting and carrying animals (will be assisted by other staff members in lifting animals over 40 lbs). Walks or stands for extended periods of time.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c57dd27095179bbdc7ff7::linkedin_ca\", \"source\": \"linkedin_ca\", \"country\": \"CA\", \"company\": \"VetCare Canada\", \"position\": \"Animal Care Assistant - McEwen-Frontenac\", \"notes\": \"\", \"original\": \"Animal Care Assistant<br><br>is a newly renovated hospital that combines McEwen and Frontenac, two veterinary hospitals with more than 30+ years of experience each! The Kingston animal hospital is a full-service hospital with an emphasis on preventive medicine and personalized care. The hospital welcomes new pets, old pets and rescued pets while providing simple examinations, grooming services, life-saving surgeries as well as on-site specialty ultrasounds. We place an emphasis on your pet\\u2019s experience - it is our top priority.<br><br>McEwen-Frontenac is looking for a compassionate part-time Animal Care Assistant (ACA) with exceptional technical skills to support with animal care and handling. The team at McEwen-Frontenac Animal Hospital is committed to the highest standards of patient care. They provide medicine and surgery in a collaborative environment with compassion and friendliness. The team is passionate about providing the ideal work\/life balance with excellent flexible work schedules and a vibrant work environment.<br><br>Reporting To: Practice Manager and Vet Assistant \/ Exam Room Team Leader (if applicable)<br><br>Responsibilities (including but not limited to)<br><br>Our Clients<br><ul><li>Build positive client relationships through remaining calm in all circumstances, displaying genuine care and compassion towards clients and their pets, being respectful in all interactions and providing exceptional customer service.<\/li><li>Counsel clients, under the direction of a Veterinarian or a RVT, on various aspects of animal care such as dosage\/purpose of medications, home care and preventative healthcare recommendations. <\/li><li>Educate clients regarding preventive medicine and vaccination requirements. Recommend laboratory procedures, such as pre-anesthetic profiles, geriatric screening, fecal, urinalysis, heartworm checks, FeLV testing, etc. <\/li><li>Answer client questions and provide knowledgeable information regarding services, merchandise, pet grooming aids, food supplies and other non-medical items available at the Practice.<br><\/li><\/ul>Our Patients<br><ul><li>Approach, greet, handle, and treat animals with kindness, compassion and patience. Involves contributing to an environment in which animals feel safe and secure.<\/li><li>Prepare for the doctor by: placing the patient on the table; obtain basic patient information (weight, temperature, etc.); discuss symptoms or problems being experienced and any procedures that may need to be done (i.e. vaccinations, fecal or heartworm tests, etc.); utilize a pre-exam checklist, lifestyle surgery and any other applicable client educational pieces to ensure that all medical needs have been addressed.<\/li><li>As required, obtain laboratory samples (using a fecal loop when necessary) from the patient or ensure laboratory work is performed by another team member while the patient is still in the exam room. Prepare specimens for outside laboratories. <\/li><li>Anticipate and prepare any medications or vaccines the doctor will need to treat the patient while in the exam room. <\/li><li>Assist to restrain animals in a safe and compassionate manner during examinations and procedures. Involves using care to employ proper retraining techniques to ensure the safety of the animal and the team<\/li><li>Prepare prescription labels, dispense and appropriately package medications. Ensure medications are added to the patient\\u2019s record and appropriately charged to the client.<br><\/li><\/ul>Our Practice<br><ul><li>Review medical records and notes made by the admitting team member in order to discern the nature of the visit and any tests or procedures that may be required.<\/li><li>Notify the Veterinarian when patients are ready to be seen. Advise the Veterinarian of the nature of the visit, preventive procedures due, tests that are to be run, etc.<\/li><li>Ensure all procedures rendered during the visit are documented for proper billing. Ensure that all vaccinations, procedures, notes, etc. have been documented in the medical record.<\/li><li>Clean exam rooms, treatment and lab areas. Restock exam rooms with supplies and clean and maintain all medical equipment as required and monitor laboratory inventory levels and order additional laboratory supplies as needed.<\/li><li>Conduct end of day role responsibilities as established by the Practice. <br><\/li><\/ul>Our Team<br><ul><li>Communicate ideas, express opinions and respond to team members in appropriate and respectful ways. Involves using upbeat tone, displaying positive body language, actively listening and understanding the value of differing opinions or ideas.<\/li><li>Contribute to the team as a whole by pro-actively offering assistance to others and willingly performing job tasks that team members need help with or might be outside of normal job responsibilities. May involve assisting to clean and maintain public areas of the Practice.<br><\/li><\/ul>Position Requirements<br><ul><li>Veterinary Office Assistant qualification preferred but not expected. Previous experience as a Veterinary Assistant or Exam Room Assistant will be considered an asset.<\/li><li>Ability to be gentle, quiet and patient with animals.<\/li><li>Excellent customer service skills.<\/li><li>Ability to remain calm in stressful situations.<\/li><li>Physical Effort: Work requires lifting and carrying animals (will be assisted by other staff members in lifting animals over 40 lbs). Walks or stands for extended periods of time; frequently works in a bent position.<\/li><li>Working conditions: May be exposed to unpleasant odors, noises and animal feces. May be exposed to bites, scratches and contagious diseases.<br><\/li><\/ul>Powered by JazzHR<br><br>K9ctrRDZDp\"}"
}