{
    "id":"Kaggle::techmap::6145cec4bab81856d88c6606::linkedin_ne::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The job description includes the phrase \"with or without an accommodation,\" indicating an openness to making reasonable adjustments for candidates with disabilities.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Flexibility and the ability to handle change in a positive manner. Cosmetic artistry experience a plus. Demonstrated ability to support business growth and exhibit professional behavior. Have and maintain flexible availability. Must have open flexibility to work during peak traffic times including evenings, weekends and holidays. Must be able to perform essential functions (with or without an accommodation) without posing a \"direct threat\" to the health and safety to self or others. The Company reserves the right to alter, change, abolish and even combine jobs depending upon changing conditions. No recruitment agencies, please.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145cec4bab81856d88c6606::linkedin_ne\", \"source\": \"linkedin_ne\", \"country\": \"NE\", \"company\": \"Morphe\", \"position\": \"Beauty Artist (16 hours) - Morphe Amsterdam\", \"notes\": \"\", \"original\": \"Morphe was born in 2008 among the artists and influencers in Los Angeles. Finally. A beauty brand created for the creators. For the dreamers. For those looking for killer makeup without killing their wallet. A place where our #MorpheBabe can let their passion and creativity for beauty fly high. We're more than just a brand; we're a ride-or-die fam.<br><br>The Beauty Artist provides exceptional customer service by creating a unique, inviting, entertaining, and educational multi-brand shopping destination for the Morphe babe and demonstrates their artistry skills with clients upon request. In addition, this person must create a collaborative work environment on the sales floor, provide excellent service and meet and exceed store financial goals. In addition, the Beauty Artist will be responsible for operational activities as assigned.<br><br><strong>Sales<br><\/strong><ul><li>Provides the full Morphe customer service experience in store, delivering sales to meet or exceed targets.<\/li><li>Meets or exceeds all personal goals to positively contribute to the team and the store.<br><\/li><\/ul><strong>Service<br><\/strong><ul><li>Provide excellent customer service and product knowledge, offering full service experience and\/or simple service depending on customers\\u2019 needs.<\/li><li>Positive representative of the Morphe brand, always demonstrating professionalism and poise.<\/li><li>Support promotions, events and launches to deliver the intended experience for customers.<\/li><li>Consistently elevate own artistry skills.<\/li><li>Attends all required trainings and completes educational and developmental tools as assigned.<\/li><li>Develops knowledge of trends in industry to provide best service possible and share with the squad<br><\/li><\/ul><strong>Leadership<br><\/strong><ul><li>Contributes to a productive and dynamic Morphe squad by connecting with employees, customers, and influencers.<\/li><li>Acts with professionalism and respect in all interactions with customers, co-workers, management and business associates.<br><\/li><\/ul><strong>Operations<br><\/strong><ul><li>Must adhere to all company policies and procedures. Immediately report any variances to a Manager or a People partner.<\/li><li>Assists in execution of visual displays, merchandising and marketing standards ensuring the store is consistently replenished.<\/li><li>Assists in the preparation and completion of accurate physical inventory as assigned.<\/li><li>Assists with non-sell tasks as assigned by Management and as part of the regular daily responsibilities.<\/li><li>Accurately ring sales and use the POS correctly.<\/li><li>Arrives to work on time and consistently follows the Morphe personal appearance guidelines.<\/li><li>Follows all safety and emergency procedures.<\/li><li>Identifies potential loss prevention issues. <\/li><li>Perform additional duties as assigned. <br><\/li><\/ul><strong><u>Qualifications<br><\/u><\/strong><ul><li>2 years retail experience, previous sales experience required.<\/li><li>Excellent customer service, communication and organizational skills.<\/li><li>Ability to multi-task and build relationships.<\/li><li>Flexibility and the ability to handle change in a positive manner.<\/li><li>Cosmetic artistry experience a plus.<\/li><li>Demonstrated ability to support business growth and exhibit professional behavior. <\/li><li>Have and maintain flexible availability.<\/li><li>Must have open flexibility to work during peak traffic times including evenings, weekends and holidays. <br><\/li><\/ul>Must be able to perform essential functions (with or without an accommodation) without posing a \\\"direct threat\\\" to the health and safety to self or others.<br><br>The Company reserves the right to alter, change, abolish and even combine jobs depending upon changing conditions.<br><br><em>No recruitment agencies, please.<\/em>\"}"
}