{
    "id":"Kaggle::techmap::614b87d6b298411066437f04::linkedin_be::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Mission Generale. As an Assistant Store Manager you will actively participate in the business development of the store while embodying the Hermes spirit of tradition, quality and service. You will assist the Store Manager in the overall management of sales, service and people. You will be fully in charge of the business during the Store Managers absence. Principales activites. DRIVE BUSINESS PERFORMANCE: Achieve and drive own and team's sales objectives. Identify and develop client development opportunities for the team. Maintain own client portfolio. Coach the team to provide a consistent level of personalised service to all clients creating long-term relationships. Support the store manager in preparing the buying sessions. TEAM ANIMATION: Be the link between the team and the Store Manager through frequent presence on the sales floor. Train and motivate the team to achieve best performance within Hermes standards and everyone's development needs. Assist team in the selling ceremony and front-of-house operations. Integrate new comers by sharing the Hermes spirit, quality and service expectations. Coordinate daily morning briefs. CLIENT SERVICE: Be an ambassador of Hermes: demonstrate exemplarity and excellence in all client interactions. Handle client complaints and be a strong support to the team in case of conflicts. Offer an excellent after-sales service to create client loyalty. OPERATIONS & ADMINISTRATIVE SUPPORT: Support the Store Manager in all other operational & administrative areas. Ensure the respect of all company policies. Profil du candidat. At least 10 years of high end retail experience. At least 5 to 8 years of managerial experience. Ability to lead and drive team performance and customer service. Men's Ready-to-Wear expertise is a strong plus. Good customer relationship management skills. Strong business sense with good analytical skills. Problem solving capabilities. Strong team player. Focus on quality. Spirit of curiosity and eager to learn. Care for results. Flexibility and drive to go the extra mile. Bilingual in French and Dutch. Fluent in English. A good sense of humour!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b87d6b298411066437f04::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"Herm\\u00e8s\", \"position\": \"Assistant Store Manager Brussels\", \"notes\": \"\", \"original\": \"<strong>Mission G\\u00e9n\\u00e9rale<br><br><\/strong>As an Assistant Store Manager you will actively participate in the business development of the store while embodying the Herm\\u00e8s spirit of tradition, quality and service. You will assist the Store Manager in the overall management of sales, service and people. You will be fully in charge of the business during the Store Manager\\u2019s absence.<br><br><strong>Principales activit\\u00e9s<br><br><\/strong><strong>DRIVE BUSINESS PERFORMANCE<\/strong>:<br><ul><li>Achieve and drive own and team's sales objectives<\/li><li>Identify and develop client development opportunities for the team<\/li><li>Maintain own client portfolio<\/li><li>Coach the team to provide a consistent level of personalised service to all clients creating long-term relationships<\/li><li>Support the store manager in preparing the buying sessions<br><\/li><\/ul><strong>TEAM ANIMATION: <br><\/strong><ul><li>Be the link between the team and the Store Manager through frequent presence on the sales floor<\/li><li>Train and motivate the team to achieve best performance within Herm\\u00e8s standards and everyone's development needs <\/li><li>Assist team in the selling ceremony and front-of-house operations <\/li><li>Integrate new comers by sharing the Herm\\u00e8s spirit, quality and service expectations <\/li><li>Coordinate daily morning briefs<br><\/li><\/ul><strong>CLIENT SERVICE:<br><\/strong><ul><li>Be an ambassador of Herm\\u00e8s: demonstrate exemplarity and excellence in all client interactions<\/li><li>Handle client complaints and be a strong support to the team in case of conflicts<\/li><li>Offer an excellent after-sales service to create client loyalty<br><\/li><\/ul><strong>OPERATIONS &amp; ADMINISTRATIVE SUPPORT:<br><\/strong><ul><li>Support the Store Manager in all other operational &amp; administrative areas<\/li><li>Ensure the respect of all company policies<br><\/li><\/ul><strong>Profil du candidat<br><\/strong><ul><li>At least 10 years of high end retail experience<\/li><li>At least 5 to 8 years of managerial experience<\/li><li>Ability to lead and drive team performance and customer service<\/li><li>Men's Ready-to-Wear expertise is a strong plus <\/li><li>Good customer relationship management skills<\/li><li>Strong business sense with good analytical skills<\/li><li>Problem solving capabilities<\/li><li>Strong team player<\/li><li>Focus on quality<\/li><li>Spirit of curiosity and eager to learn<\/li><li>Care for results<\/li><li>Flexibility and drive to go the extra mile<\/li><li>Bilingual in French and Dutch - Fluent in English <\/li><li>A good sense of humour!<\/li><\/ul>\"}"
}