{
    "id":"Kaggle::techmap::6130287358640816b26715a4::linkedin_ne::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"\"Applications from qualified female candidates are strongly encouraged\" - explicit female bias",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Acceptance for the programme shall not carry with it any expectation of employment with the OPCW. Interns may not apply for, or be appointed to, any posts or positions at the OPCW within six months of the internship agreement end date. The internship programme is run in accordance with the applicable internal rules and where applicable the OPCW Staff Regulations and Interim Staff Rules. Participants in the Internship Programme receive no financial remuneration from the OPCW for expenses that they incur in relation to the programme. Costs and arrangements for travel, visas, taxes, accommodation, living expenses and repatriation, etc. are the responsibility of the intern. The intern has to enter and exit the country in accordance with the applicable immigration procedures in The Netherlands. Participants will be asked to provide proof that they have sufficient financial means for living expenses for the period of their internship. Interns will work with the normal working pattern of the OPCW which will amount to no more than 40 hours a week. Participants who are citizens of non-EU countries should agree not to undertake other work in the Netherlands during their internship other than as an intern at the OPCW, notwithstanding whether such other work is compatible with the discharge of their functions with the OPCW. Only applications submitted before the closing date and through OPCW Candidate. Space will be considered. Only applicants under serious consideration for a post will be contacted. Applications from qualified female candidates are strongly encouraged. OPCW General Terms and Conditions.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6130287358640816b26715a4::linkedin_ne\", \"source\": \"linkedin_ne\", \"country\": \"NE\", \"company\": \"Organisation for the Prohibition of Chemical Weapons (OPCW)\", \"position\": \"Internship Notice for Winter\", \"notes\": \"\", \"original\": \"<strong><u>About Us<br><br><\/u><\/strong>The OPCW internship programme is aimed at motivated students with an interest in gaining experience in international organisations. The programme normally provides work placements in the Technical Secretariat for a three to six month period. The objective of the internship is to provide you with first-hand experience in the day-to-day working environment of an international organisation. You will work with our international experts towards the OPCW mission to achieve a world permanently free of chemical weapons.<br><br>As part of our team, working directly with outstanding and inspiring career professionals, you will be exposed to high-profile conferences, participate in meetings, and contribute to our analytical work as well as the organisational policy of the OPCW.<br><br><strong>General Information<br><\/strong><ul><li> Contract Type Intern <\/li><li> Remuneration A monthly stipend of \\u20ac450 (four hundred fifty euro) <\/li><li> Closing Date 30\/09\/2021 <br><\/li><\/ul><strong><u>Job Summary<br><br><\/u><\/strong><strong>Responsibilities<br><br><\/strong>You will receive hands-on experience with real-world application. You will stretch yourself and engage in challenging work. You will work as part of a team and contribute to the OPCW's mission.<br><br><strong><u>About<br><br><\/u><\/strong>You can read more about the work of the divisions and their branches through the following links<br><br>Internship placements are offered throughout the Technical Secretariat which is divided into divisions. Many divisions are comprised by different branches.<br><ul><li> Verification Division <\/li><li> Inspectorate Division <\/li><li> Administration Division <\/li><li> International Cooperation and Assistance Division <\/li><li> Secretariat for the Policy-Making Organs <\/li><li> External Relations <\/li><li> Office of Strategy and Policy <\/li><li> Office of Internal Oversight <\/li><li> Office of the Legal Adviser <\/li><li> Office of Confidentiality and Security <\/li><li> Health and Safety <br><\/li><\/ul>When applying, please list a minimum of three preferred branches that you are interested in working in.<br><br><strong><u>What You Will Get\\u2026<br><br><\/u><\/strong>Working as part of a highly skilled team you will develop analytical and problem-solving skills. You will learn how to build working relationships with international experts working on a variety of issues.<br><br>While there will be a certain focus on building your technical and vocational skillset, we also work with our interns to develop the skills needed to manage their workload and create a healthy work\/life balance. We also offer plenty of social events so you can bond with the other interns in the programme and settle into life in the Netherlands.<br><br><strong><u>Main Responsibilities<br><br><\/u><\/strong>The responsibilities of interns vary with the work of the different branches, this is why it\\u2019s really important to make sure you identify which part(s) of the Technical Secretariat you want to work in.<br><br>Example responsibilities of an intern, which depend on their placement, may include:<br><br><strong><u>Administration Division<br><\/u><\/strong><ul><li>Providing administrative assistance;<\/li><li>Support internal and external learning activities, as well as interventions following the OPCW employee engagement survey, a review of the Performance Management and Learning system including contribution to the review of the current policy;<\/li><li>Responding to requests for technical assistance and diagnosing hardware and software issues;<br><\/li><\/ul><strong><u>Secretariat For The Policy-Making Organs<br><\/u><\/strong><ul><li>Supporting the meetings of the Policy-Making Organs;<br><\/li><\/ul><strong><u>Verification Division<br><\/u><\/strong><ul><li>Managing databases, input information, data (e.g., regarding the scheduled chemicals) or participation in Software Development and Data Analytics activities, especially if interested in working at the Declarations Branch;<br><\/li><\/ul><strong><u>Office Of Strategy And Policy<br><\/u><\/strong><ul><li>Research and draft documentation on incidents of chemical weapons use, non-routine missions, chemical security, engagement with international organisations and chemical industry, education and outreach, counter-terrorism, and science and technology;<br><\/li><\/ul><strong><u>External Relations Division<br><\/u><\/strong><ul><li>Attending OPCW's social events;<\/li><li>Updating and posting supervised social media and website content; respond to web correspondence, social media posts, and emails.<br><\/li><\/ul><strong><u>Qualifications And Experience<br><br><\/u><\/strong><strong> Education <br><br><\/strong>To be eligible for the OPCW internship programme, you must be:<br><ul><li>enrolled in and have completed at least one year of a degree programme in a university (or equivalent tertiary institution) or; in a graduate school programme (second university degree or higher) or;<\/li><li>have graduated from a university or a graduate school within a year prior to the commencement of the internship and;<\/li><li>be a citizen of an OPCW Member State .<br><\/li><\/ul><strong><u>Skills And Competencies<br><\/u><\/strong><ul><li>Teamwork - We work collectively towards the common goal of eliminating chemical weapons. As a team member, you are expected to listen to and value people\\u2019s ideas and expertise, and be willing to learn from others.<\/li><li>Commitment to Continuous Learning - The OPCW is committed to a process of continuous learning.<\/li><li>Technological Awareness - To keep up with the fast pace of technological change, but the Organisation offers training as well as support to keep ahead of developments in technology.<\/li><li>Language requirements - Be fluent in both written and spoken English.<br><\/li><\/ul><strong> Languages <\/strong>Fluency in English is essential and a good working knowledge of one of the other official languages (Arabic, Chinese, French, Russian, and Spanish) is desirable.<strong>Additional Information<br><br><\/strong>Acceptance for the programme shall not carry with it any expectation of employment with the OPCW. Interns may not apply for, or be appointed to, any posts or positions at the OPCW within six months of the internship agreement end date. The internship programme is run in accordance with the applicable internal rules and where applicable the OPCW Staff Regulations and Interim Staff Rules.<br><ul><li> Participants in the Internship Programme receive no financial remuneration from the OPCW for expenses that they incur in relation to the programme. Costs and arrangements for travel, visas, taxes, accommodation, living expenses and repatriation, etc. are the responsibility of the intern. The intern has to enter and exit the country in accordance with the applicable immigration procedures in The Netherlands. <\/li><li> Participants will be asked to provide proof that they have sufficient financial means for living expenses for the period of their internship. <\/li><li> Interns will work with the normal working pattern of the OPCW which will amount to no more than 40 hours a week. <\/li><li> Participants who are citizens of non-EU countries should agree not to undertake other work in the Netherlands during their internship other than as an intern at the OPCW, notwithstanding whether such other work is compatible with the discharge of their functions with the OPCW. <br><\/li><\/ul>Only applications submitted before the closing date and through OPCW CandidateSpace will be considered.<br><br>Only applicants under serious consideration for a post will be contacted.<br><br>Applications from qualified female candidates are strongly encouraged.<br><br>OPCW General Terms and Conditions\"}"
}