{
    "id":"Kaggle::techmap::6144b4e2c368be4701bcb358::monsterasia_sg::1",
    "label_age":true,
    "analysis_age":"The phrase \"10 or more years of IT experience\" subtly favours older candidates with extensive experience. This may disadvantage younger professionals who may be equally skilled but have fewer years in the field.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase \"big career ambitions\" can introduce masculine bias by appealing to stereotypically masculine traits of ambition and competitiveness, potentially discouraging candidates who may value collaborative or balanced career paths.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 or more years of IT experience with expertise in Enterprise Cloud infrastructure (GCP, AWS or Azure) in a mission critical environment. AWS or Azure certification is highly desired. In-depth Kubernetes, docker \/ podman experience with strong debugging, troubleshooting, and problem-solving skills. CKA\/CKAD is highly desired. Expertise in one of the following programming languages: Java, C, C, Golang or Javascript, with a focus on Site Reliability Engineering or API development. Strong experience building CI\/CD pipelines using tools such as Git, Maven, Gradle, Ant, Terraform, Helm, Ansible, Artifactory and Jenkins. Monitoring and operations experience using tools such as Prometheus, Grafana, Splunk and ELK stack. Good understanding of networking protocols and cybersecurity best practices in cloud environment. Experience with Redis or Hazelcast is highly desirable. Experience with API gateway. Scrum Master and Product Owner certification would be preferable. Preferred AWS \/ Azure Certification &ndash Cloud practitioner, Solution Architect. Preferred CKA\/CKAD. Architecture certification is desired. Open. Shift, AWS EKS, Kubernetes and Docker\/ Podman. Helm, Ansible, Terraform, Vault. Test automation and security check automation. Monitoring and Alerting &ndash Prometheus, Grafana, pagerduty, Unified Meeting. Logging &ndash ELK, Fluentd. Cloud AWS \/ Azure. Dev. Ops toolchain experience (Bitbucket, Jenkins, Artifactory, Sonar. Qube, AppScan). Design and delivery of Highly available and scalable solutions. Software programming experience preferable Java. Build automation tools (Ant, Maven, Gradle). Unix, Shell, Groovy scripting. Databases ( RDS &ndash Postgres, Aurora ). Apply now to join the Bank for those with big career ambitions. To view information on our benefits including our flexible working please visit our. We welcome conversations on flexible working.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144b4e2c368be4701bcb358::monsterasia_sg\", \"source\": \"monsterasia_sg\", \"country\": \"SG\", \"company\": \"Standard Chartered\", \"position\": \"System Reliability Engineer\", \"notes\": \"\", \"original\": \"<br><b>About Standard Chartered<\/b><br>We are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.<br>To us, good performance is about much more than turning a profit. It&#39s about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.<br>We&#39re committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.<br><b>The Role Responsibilities<\/b><br>We are seeking a talented and motivated System Reliability Engineer to join a high performing Scrum team to roll out a new Common API platform (Olympus). The candidate must be a skilled professional who has E2E software development experience with a desire to work on an Agile, dynamic and flat organisational structure.<br>The role holder is responsible for leading and setting up DevOps & SRE practises across Wealth and Private Banking to promote a better customer experience.<br>Expect to be challenged in your adaptability and ability to think outside the box and use creative ideas to solve complex, real world programming challenges. <ul><br><li>Build & Lead DevOps \/ SRE team to enhance resiliency and application quality<\/li><br><li>Design and deliver multi-tenant platforms for applications ( APIs \/ UIs )<\/li><br><li>Should be well versed to setup platform observability based on defined SLO<\/li><br><li>Define the SLI&rsquos for platform & application level to achieve the SLA&rsquos <\/li><br><li>Reduce toil and deliver fully automated platform setup<\/li><br><li>Provide the support for L3 production incident & drive the blameless post-mortem for RCA<\/li><br><li>Promote adoption and rollout of Agile and modern software engineering practices<\/li><br><li>Continues improve platform performance based on SLA\/SLO\/SLI and toil reduction<\/li><br><li>Implementation of robust, fault tolerant and distributed platform<\/li><br><li>Successful implementation of Agile practices and tools<\/li><br><li>Delivery of multi team projects and co-ordination of interdependencies<\/li><br><li>Delivery of applications that attend business and clients needs following infrastructure as a code principal and CI\/CD pipeline<\/li><br><li>Ability to solve complex software development\/design issues using clean, coherent code following established coding guidelines <\/li><br><\/ul><br><b>Our Ideal Candidate<\/b><br><ul><br><li>Experience in delivering low latency and highly available applications. Banking experience is desired. <\/li><br><li>10 or more years of IT experience with expertise in Enterprise Cloud infrastructure (GCP, AWS or Azure) in a mission critical environment. AWS or Azure certification is highly desired.<\/li><br><li>In-depth Kubernetes, docker \/ podman experience with strong debugging, troubleshooting, and problem-solving skills. CKA\/CKAD is highly desired<\/li><br><li>Expertise in one of the following programming languages: Java, C, C++, Golang or Javascript, with a focus on Site Reliability Engineering or API development<\/li><br><li>Strong experience building CI\/CD pipelines using tools such as Git, Maven, Gradle, Ant, Terraform, Helm, Ansible, Artifactory and Jenkins<\/li><br><li>Monitoring and operations experience using tools such as Prometheus, Grafana, Splunk and ELK stack<\/li><br><li>Good understanding of networking protocols and cybersecurity best practices in cloud environment<\/li><br><li>Experience with Redis or Hazelcast is highly desirable.<\/li><br><li>Experience with API gateway<\/li><br><li>Scrum Master and Product Owner certification would be preferable<\/li><br><li>Preferred AWS \/ Azure Certification &ndash Cloud practitioner, Solution Architect <\/li><br><li>Preferred CKA\/CKAD<\/li><br><li>Architecture certification is desired<\/li><br><li>OpenShift, AWS EKS, Kubernetes and Docker\/ Podman<\/li><br><li>Helm, Ansible, Terraform, Vault<\/li><br><li>Test automation and security check automation<\/li><br><li>Monitoring and Alerting &ndash Prometheus, Grafana, pagerduty, Unified Meeting<\/li><br><li>Logging &ndash ELK, Fluentd<\/li><br><li>Cloud AWS \/ Azure<\/li><br><li>DevOps toolchain experience (Bitbucket, Jenkins, Artifactory, SonarQube, AppScan)<\/li><br><li>Design and delivery of Highly available and scalable solutions <\/li><br><li>Software programming experience preferable Java<\/li><br><li>Build automation tools (Ant, Maven, Gradle)<\/li><br><li>Unix, Shell, Groovy scripting<\/li><br><li>Databases ( RDS &ndash Postgres , Aurora )<\/li><br><\/ul><br>Apply now to join the Bank for those with big career ambitions.<br>To view information on our benefits including our flexible working please visit our . We welcome conversations on flexible working.<br>\"}"
}