{
    "id":"Kaggle::techmap::614a4975e48deb575b2b3a74::reed_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Mechanical Production Operative required for a temporary ongoing assignment in the Salisbury area. The successful Production Operative must have recent experience of an assembly line or production line of a mechanical nature. You will need an eye for detail to ensure accuracy on the finished products and use of hand tools. Starting: Full training will be provided, this training will start on the day shift 8am-4pm (Monday-Friday). The pay rate will be £8. 94 per hour while you do your training, once completed a skills assessment will be conducted to look at your next pay level. The working hours will be starting on Monday-Friday 08:00am - 16:00pm. If you are interested or would like further information, please contact the team at Meridian on or via email at",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614a4975e48deb575b2b3a74::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Meridian Business Support\", \"position\": \"Production Operative\", \"notes\": \"\", \"original\": \"Mechanical Production Operative required for a temporary ongoing assignment in the Salisbury area. <br><br>The successful Production Operative must have recent experience of an assembly line or production line of a mechanical nature. You will need an eye for detail to ensure accuracy on the finished products and use of hand tools. <br><br>Starting: Full training will be provided, this training will start on the day shift 8am-4pm (Monday-Friday) <br><br>The pay rate will be \\u00a38.94 per hour while you do your training, once completed a skills assessment will be conducted to look at your next pay level. <br><br>The working hours will be starting on Monday-Friday 08:00am - 16:00pm <br><br>If you are interested or would like further information, please contact the team at Meridian on or via email at\"}"
}