{
    "id":"Kaggle::techmap::61401cf57acb0e174647de42::linkedin_be::3",
    "label_age":true,
    "analysis_age":"The term \"digital native\" can exclude older applicants.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"KEY RESPONSIBILITIES. A (Senior) Consultant at Capgemini Invent will focus on the analysis, design, and development of solutions for clients in a multi-disciplinary team environment. Under supervision, he\/she will collaborate with functional and industry specialists to assist with the strategy and execution of innovative solutions using established, best-practice, processes, and methodologies. He\/she will contribute to client satisfaction by providing value-added services and work products by using individual knowledge and insights. He\/she will maintain a focus on detail to ensure deliverables are of the highest caliber while maintaining an understanding of the big picture. PROFESSIONAL EXPERIENCE. We are looking for candidates who match the following criteria:. Have at least 1 year of working experience in consultancy or leading firms in one or more of our market units:. Financial Services (FS). Manufacturing. Automotive. Life Sciences. Telecom, Media & Technology. Energy, Utilities & Chemicals (EUC). Public Services (PS). Have experience in developing or transforming strategies and business & operating models tailored to the need of the client. Possess strong general consulting skills and can overcome internal barriers through drive and determination. Have stream and\/or project management skills (recognized certifications like PRINCE I. I etc. are a plus). EDUCATIONAL BACKGROUND. You hold a master’s degree in Business or Engineering. An MBA or an additional master’s degree is a plus. PERSONAL SKILLS. You are fluent in English and French or Dutch plus you have practical knowledge of the other Belgian national language. You have very strong interpersonal skills, including, but not limited to, verbal and written communication skills up to CxO level. You can empathize with clients in politically challenging environments, can work under pressure within given timeframes. You are a digital native, are eager to learn and want to grow rapidly in our organization. You are a team player that can work in teams with people of different grades and backgrounds. You have an entrepreneurial mindset, are results-oriented and have a can-do mentality. You are flexible in terms of assignment location.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61401cf57acb0e174647de42::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"Capgemini Invent\", \"position\": \"(Senior) Consultant\", \"notes\": \"\", \"original\": \"<p><strong>KEY RESPONSIBILITIES<\/strong><\/p><p><br><\/p><p>A (Senior) Consultant at Capgemini Invent will focus on the analysis, design, and development of solutions for clients in a multi-disciplinary team environment. Under supervision, he\/she will collaborate with functional and industry specialists to assist with the strategy and execution of innovative solutions using established, best-practice, processes, and methodologies. He\/she will contribute to client satisfaction by providing value-added services and work products by using individual knowledge and insights. He\/she will maintain a focus on detail to ensure deliverables are of the highest caliber while maintaining an understanding of the big picture.<\/p><p><br><\/p><p><strong>PROFESSIONAL EXPERIENCE<\/strong><\/p><p><br><\/p><p>We are looking for candidates who match the following criteria:<\/p><p><br><\/p><ul><li>Have at least 1 year of working experience in consultancy or leading firms in one or more of our market units:<\/li><\/ul><p><br><\/p><ul><li>Financial Services (FS)<\/li><li>Manufacturing<\/li><li>Automotive<\/li><li>Life Sciences <\/li><li>Telecom, Media &amp; Technology<\/li><li>Energy, Utilities &amp; Chemicals (EUC)<\/li><li>Public Services (PS)<\/li><\/ul><p><br><\/p><ul><li>Have experience in developing or transforming strategies and business &amp; operating models tailored to the need of the client.<\/li><li>Possess strong general consulting skills and can overcome internal barriers through drive and determination.<\/li><li>Have stream and\/or project management skills (recognized certifications like PRINCE II etc. are a plus).<\/li><\/ul><p><br><\/p><p><strong>EDUCATIONAL BACKGROUND<\/strong><\/p><p><br><\/p><ul><li>You hold a master\\u2019s degree in Business or Engineering.<\/li><li>An MBA or an additional master\\u2019s degree is a plus.<\/li><\/ul><p><br><\/p><p><strong>PERSONAL SKILLS<\/strong><\/p><p><br><\/p><ul><li>You are fluent in English and French or Dutch plus you have practical knowledge of the other Belgian national language.<\/li><li>You have very strong interpersonal skills, including, but not limited to, verbal and written communication skills up to CxO level.<\/li><li>You can empathize with clients in politically challenging environments, can work under pressure within given timeframes.<\/li><li>You are a digital native, are eager to learn and want to grow rapidly in our organization.<\/li><li>You are a team player that can work in teams with people of different grades and backgrounds.<\/li><li>You have an entrepreneurial mindset, are results-oriented and have a can-do mentality.<\/li><li>You are flexible in terms of assignment location.<\/li><\/ul>\"}"
}