{
    "id":"Kaggle::techmap::61483c6b4aed174fb1e82be9::britishjobs_uk::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Greenbean are looking for Meter Readers based in the NE1-42, 61-64, SR1-6, DH2-4, DH9 postcode and surrounding areas. This is a fantastic role for someone who loves the outdoors and is self-motivated to work independently. The role of a Meter Reader is to read gas and electricity meters using a hand-held electronic device, and other equipment. Some supporting administrative work is also required. There is a great deal of flexibility with this role, as a Meter Reader you will plan your own route, manage your schedule and workload to achieve the targets set for the week by your field delivery manager. Key Responsibilities. As this is a customer facing role you must be approachable, presentable, and polite and act as an ambassador for the company. This is an active role which therefore will need to walk between properties. As you will work alone you will be required to plan and manage your own time and workload. You will be expected to use your initiative and report any dangerous meter installations or suspected signs of tampering. Ability to work to targets What will you need: You will be supported through a full training programme to ensure you can conduct your role to the required standards in-line with Health and Safety requirements. No unspent criminal convictions. A desire to work outdoors. You will be walking from property to property so you will need a good understanding of the local area. Friendly and professional approach to work. The drive and motivation to work in an independent role. Valid full UK drivers' licence & own vehicle Full training is provided so experience is not necessary. Full time: Optional 40, 42 or 45 hours. Flexible between 8am - 8pm Monday. Sunday.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61483c6b4aed174fb1e82be9::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"greenbean by NRG\", \"position\": \"Meter Reader - Newcastle\", \"notes\": \"\", \"original\": \"Greenbean are looking for Meter Readers based in the NE1-42, 61-64, SR1-6, DH2-4, DH9 postcode and surrounding areas. This is a fantastic role for someone who loves the outdoors and is self-motivated to work independently.<br><br> The role of a Meter Reader is to read gas and electricity meters using a hand-held electronic device, and other equipment. Some supporting administrative work is also required. There is a great deal of flexibility with this role, as a Meter Reader you will plan your own route, manage your schedule and workload to achieve the targets set for the week by your field delivery manager.<br><br> Key Responsibilities<br><br>As this is a customer facing role you must be approachable, presentable, and polite and act as an ambassador for the company<br>This is an active role which therefore will need to walk between properties<br>As you will work alone you will be required to plan and manage your own time and workload<br>You will be expected to use your initiative and report any dangerous meter installations or suspected signs of tampering<br>Ability to work to targets What will you need:<br><br>You will be supported through a full training programme to ensure you can conduct your role to the required standards in-line with Health and Safety requirements<br>No unspent criminal convictions<br>A desire to work outdoors<br>You will be walking from property to property so you will need a good understanding of the local area<br>Friendly and professional approach to work<br>The drive and motivation to work in an independent role<br>Live within a commutable distance to the postcode area you will cover<br>Valid full UK drivers&#39; licence &amp; own vehicle Full training is provided so experience is not necessary <br><br> Full time: Optional 40, 42 or 45 hours.<br><br> Flexible between 8am - 8pm Monday - Sunday<br><br>\"}"
}