{
    "id":"Kaggle::techmap::6141ed5442bb593ba1b8a05e::monsterasia_in::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Uses the pronoun \"he\" and \"strong and effective engineering leader\" might lead candidates to believe only men are sought.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Are you excited about working on Microsoft 365 (M365) - Microsoft's flagship productivity suite with the opportunity to build planet scale platform and services? M365 provides highly distributed, massively scaled, highly reliable and compliant services for millions of users. We are actively looking for a leader to own components critical to workplace search which has direct impact on our topline and solve critical problems for customers in their productivity and knowledge management. We own integrations with several 3P data sources allowing customer content to participate in several key experiences like Search, Content discovery, Information protection and several other AI-ML backed experiences. This allows us to take goodness of Microsoft 365 platform to 3P data to stay on the forefront of Enterprise productivity. Different parts of the platform present different set of problems from high scale, distributed systems to components which work under resource constraints and need to be highly performant. This role comes with ownership of several of these integrations. The Engineering Manager will be expected to lead the team towards a solid vision of the agile and cross-platform engineering, be responsible for a solid architecture and amazing performance and quality, manage a great team, and remove any and all obstacles that are preventing the team from delivering as fast as they can. He must be self-driven, proactive, results-oriented and have the ability to work with minimal ongoing direction from higher up. The candidate can expect to build a wide range of skills and experiences in this role. qualifications bs\/btech degree in computer science, engineering or equivalent degree. 10. years of software development experience with c, c+. or java. background in dealing with large scale platforms with exposure to distributed computing\/microservices. proven track record as a strong and effective engineering leader. managing and growing successful teams. strong customer focus and passion for doing the right thing for the customer. proven ability to establish trusted, effective relationships across diverse sets of stakeholders. excellent communication skills and cross group collaboration. ability to quickly pick up existing concepts and employ new techniques and strong problem solving.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6141ed5442bb593ba1b8a05e::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"Microsoft\", \"position\": \"Principal Engineering Manager\", \"notes\": \"\", \"original\": \"<br>Are you excited about working on Microsoft 365 (M365) - Microsoft's flagship productivity suite with the opportunity to build planet scale platform and services? M365 provides highly distributed, massively scaled, highly reliable and compliant services for millions of users. We are actively looking for a leader to own components critical to workplace search which has direct impact on our topline and solve critical problems for customers in their productivity and knowledge management. We own integrations with several 3P data sources allowing customer content to participate in several key experiences like Search, Content discovery, Information protection and several other AI-ML backed experiences. This allows us to take goodness of Microsoft 365 platform to 3P data to stay on the forefront of Enterprise productivity. Different parts of the platform present different set of problems from high scale, distributed systems to components which work under resource constraints and need to be highly performant. This role comes with ownership of several of these integrations.<br>The Engineering Manager will be expected to lead the team towards a solid vision of the agile and cross-platform engineering, be responsible for a solid architecture and amazing performance and quality, manage a great team, and remove any and all obstacles that are preventing the team from delivering as fast as they can. He must be self-driven, proactive, results-oriented and have the ability to work with minimal ongoing direction from higher up. The candidate can expect to build a wide range of skills and experiences in this role. The candidate should have experience in all phases of the development cycle, preferably on large-scale commercial products including collaborating across the groups and cross discipline with Design, PM and our partner teams.<br>qualifications<ul><li>bs\/btech degree in computer science, engineering or equivalent degree<\/li><li>10+ years of software development experience with c, c++ or java<\/li><li> background in dealing with large scale platforms with exposure to distributed computing\/microservices <\/li><li>proven track record as a strong and effective engineering leader - managing and growing successful teams<\/li><li>strong customer focus and passion for doing the right thing for the customer<\/li><li>proven ability to establish trusted, effective relationships across diverse sets of stakeholders<\/li><li>excellent communication skills and cross group collaboration<\/li><li>ability to quickly pick up existing concepts and employ new techniques and strong problem solving<\/li><\/ul>\"}"
}