{
    "id":"Kaggle::techmap::614595b72306db307df98d84::linkedin_ng::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Raise awareness and promote changes in attitudes and behaviors re: gender, gender equality, gender mainstreaming and GBV. Actively participate in all Training of Trainers sessions in GBV prevention approaches (EMAP, etc). Build capacity of Community Outreach Volunteers on EMAP curriculum, etc. . Supervise the facilitation of EMAP activities and other outreach activities. Encourage greater self-reliance among women in the community. Promote involvement of men and youth. Communicate with the supervisor on program progress, constraints, training needs identified and other matters pertaining to the operations of the GBV program. Work with the GBV Manager to create detailed weekly and monthly work plans. Maintain confidentiality and uphold other principles in line with the GBV programming. Attend staff meetings and training events as required. HR Management & Staff Support. Supervise and mentor Community Outreach Volunteers. Support the orientation, on-going development\/training and capacity building of staff as required. Identify training opportunities for staff through various methodologies: e. g. online, workshop, collaboration with other NGOs, etc. Actively promote PSEA (Prevention of Sexual Exploitation and Abuse) standards within International Medical Corps and amongst beneficiaries served by International Medical Corps. Adhere to IMC procedures in preparing the necessary documentation for procuring training approval, materials, and payments for vendors etc., in a timely and efficient manner. Contribute to the positive image and overall credibility of the organization, notably through the application of the organizations Code of Conduct. Consider security implications of all program activities, reviewing all new initiatives with staff teams and community leaders. Other. Refrain from making false and unrealistic promises and commitments to the beneficiaries and work in the best interest of the IMC GBV Program. Foster a team spirit among the GBV team that is conducive to all staff improving their skills and knowledge base. Other duties as assigned by the supervisor to enable and develop the IMC GBV program. Qualification, Experience And Skills. University Degree in Civil Law, Human Rights, Gender Development, Psychology, Social Work or a Gender-related program. Willingness to travel to field locations and to spend time. Advanced understanding of the root causes of violence against women and girls. Experience in implementing and facilitating EMAP and other GBV prevention curriculums. Strong background in human rights and familiarity with practical challenges faced by displaced and other vulnerable persons,. Experience conducting assessments and a willingness to help plan assessments.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614595b72306db307df98d84::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"International Medical Corps IMC\", \"position\": \"GBV \/ EMAP Prevention Officer at the International Medical Corps (IMC)\", \"notes\": \"\", \"original\": \"<strong>Never Miss a Job Update Again. <br><\/strong><ul><li>Company: <\/li><li>Location: Nigeria<\/li><li>State: <\/li><li>Job type: Full-Time <\/li><li>Job category: <\/li><\/ul> <strong>Job Description<br><br><\/strong>International Medical Corps is a global, humanitarian, nonprofit organization dedicated to saving lives and relieving suffering through health care training and relief and development programs. Established in 1984 by volunteer doctors and Nurses, International Medical Corps is a private, voluntary, nonpolitical, nonsectarian organization. Its mission is to improve the quality of life through health interventions and related activities that build local capacity in under-served communities worldwide.<br><br><strong><u>We Are Recruiting To Fill The Position Of<br><br><\/u><\/strong><strong><strong>Job Title: <\/strong><strong>GBV \/ EMAP Prevention Officer<br><br><\/strong><\/strong><strong>Location: <\/strong>Maiduguri, Borno<br><br>Employment Type: Full-time<br><br>Career Category: Advocacy \/ Communications<br><br>Theme: Gender<br><br><strong><u>Job Summary<br><\/u><\/strong><ul><li>The GBV Prevention Officer will be responsible for the overall implementation of the GBV prevention\/outreach activities implemented as part of the GBV program in Borno State.<\/li><li>This includes, but is not limited to: mobilizing communities to develop and implement strategies to prevent GBV and secure a thriving environment for survivors of GBV; implementation of outreach\/community awareness raising activities; implementation of evidence-based GBV prevention approaches (EMAP, SASA! etc.); and, the direct supervision of community outreach volunteers.<\/li><li>The GBV Prevention Officer will conduct thorough assessments to ensure that sensitization sessions meet the needs of the community.<\/li><li>The GBV Prevention Officer will promote community led initiatives that improve the security conditions of women, children and survivors of GBV.<\/li><li>S\/he will plan and implement training as necessary and will work with other GBV staff to assess and meet training needs.<\/li><li>This position reports directly to the GBV Manager.<br><\/li><\/ul><strong><u>Specific Responsibilities<br><br><\/u><\/strong>The responsibilities of the GBV Prevention Officer include but are not limited to the following:<br><br><strong><u>Program Development And Implementation<br><\/u><\/strong><ul><li>Utilize participatory methodology and adult education techniques to assist communities in developing community-driven prevention and response plans.<\/li><li>Conduct focus group discussions and keep detailed documentation about the information gathered. Consider this information in planning and conducting animation, sensitizations, and in the design of information, education and communication materials.<\/li><li>With community input, develop community education methods which many include workshops, drama, games, debates, poster contests, youth clubs, and other creative methods.<\/li><li>Organize trainings and sensitization sessions for women\\u2019s groups, men\\u2019s groups, youth groups, community leaders, religious leaders, local authorities, NGOs\/CSOs on GBV issues.<\/li><li>Promote active community participation in prevention and response to GBV.<\/li><li>Raise awareness and promote changes in attitudes and behaviors re: gender, gender equality, gender mainstreaming and GBV.<\/li><li>Actively participate in all Training of Trainers sessions in GBV prevention approaches (EMAP, etc)<\/li><li>Build capacity of Community Outreach Volunteers on EMAP curriculum, etc.**<\/li><li>Supervise the facilitation of EMAP activities and other outreach activities.**<\/li><li>Encourage greater self-reliance among women in the community.<\/li><li>Promote involvement of men and youth.<\/li><li>Communicate with the supervisor on program progress, constraints, training needs identified and other matters pertaining to the operations of the GBV program.<\/li><li>Work with the GBV Manager to create detailed weekly and monthly work plans.<\/li><li>Maintain confidentiality and uphold other principles in line with the GBV programming.<\/li><li>Attend staff meetings and training events as required.<br><\/li><\/ul><strong><u>HR Management &amp; Staff Support<br><\/u><\/strong><ul><li>Supervise and mentor Community Outreach Volunteers.<\/li><li>Support the orientation, on-going development\/training and capacity building of staff as required.<\/li><li>Identify training opportunities for staff through various methodologies: e.g. online, workshop, collaboration with other NGOs, etc.<\/li><li>Actively promote PSEA (Prevention of Sexual Exploitation and Abuse) standards within International Medical Corps and amongst beneficiaries served by International Medical Corps.<\/li><li>Adhere to IMC procedures in preparing the necessary documentation for procuring training approval, materials, and payments for vendors etc., in a timely and efficient manner.<\/li><li>Contribute to the positive image and overall credibility of the organization, notably through the application of the organization\\u2019s Code of Conduct.<\/li><li>Consider security implications of all program activities, reviewing all new initiatives with staff teams and community leaders.<br><\/li><\/ul><strong><u>Other<br><\/u><\/strong><ul><li>Refrain from making false and unrealistic promises and commitments to the beneficiaries and work in the best interest of the IMC GBV Program.<\/li><li>Foster a team spirit among the GBV team that is conducive to all staff improving their skills and knowledge base.<\/li><li>Other duties as assigned by the supervisor to enable and develop the IMC GBV program<br><\/li><\/ul><strong><u>Qualification, Experience And Skills<br><\/u><\/strong><ul><li>University Degree in Civil Law, Human Rights, Gender Development, Psychology, Social Work or a Gender-related program<\/li><li>Willingness to travel to field locations and to spend time.<\/li><li>Advanced understanding of the root causes of violence against women and girls<\/li><li>Experience in implementing and facilitating EMAP and other GBV prevention curriculums<\/li><li>Strong background in human rights and familiarity with practical challenges faced by displaced and other vulnerable persons,<\/li><li>Experience conducting assessments and a willingness to help plan assessments;<\/li><li>Commitment to supporting quality programs through promotion and integration of protection principles in project work in line with international best practices (meeting or exceeding minimum standards);<\/li><li>Interest in building staff capacity via trainings, resource development, shadow visits, etc.;<\/li><li>Ability and willingness to maintain regular presence at project sites (including all outreach and community center locations);<\/li><li>Proven experience in humanitarian action and in fragile contexts<\/li><li>Ability and willingness to work during irregular working hours when needed<\/li><li>Strong computer skills (Excel, Microsoft, PowerPoint and Outlook)<\/li><li>Fluency in English (written and spoken) Hausa and Kanuri is a must.<\/li><li>Strong interpersonal skills and demonstrated ability to establish effective working relations with local staff and other stakeholders.<\/li><li>Proven ability to work and live in very basic living conditions in deep field locations.<\/li><li>Ability to work under pressure, with minimal supervision,<\/li><li>Self-starter.<br><\/li><\/ul><strong>Prevention of Sexual Exploitation and Abuse<br><\/strong><ul><li>Actively promote PSEA (Prevention of Sexual Exploitation and Abuse) standards within International Medical Corps and amongst beneficiaries served by International Medical Corps.<br><\/li><\/ul><strong><u>Compliance &amp; Ethics<br><\/u><\/strong><ul><li>Promotes and encourages a culture of compliance and ethics throughout International Medical Corps.<\/li><li>As applicable to the position, maintains a clear understanding of International Medical Corps\\u2019 and donor compliance and ethics standards and adheres to those standards.<\/li><li>Conducts work with the highest level of integrity.<br><\/li><\/ul><strong>Application Closing Date<br><br><\/strong>21st September, 2021.<br><br><strong>Don't Keep! Kindly Share:<br><\/strong><li><\/li><li><\/li><li><\/li>\"}"
}