{
    "id":"Kaggle::techmap::614dbb4d2b7bd5561aa0b657::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The use of the term \"he\/she\" can be seen as exclusionary by those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Summary:Catholic Charities Archdiocese of New Orleans (CCANO) will provide assistance to hurricane IDA survivors in the most affected parishes covered by the agency. The Construction Cost Analysts is an integral part of the disaster recovery efforts and will be responsible for developing estimates for damaged homes utilizing Xactimate software. Estimates will be shared with survivors to help them understand the cost of their repairs, support the short term and long term work of disaster case managers and help the agency plan for the scope of services and cost of the intervention. Knowledge, Skills, and Abilities:This position requires strong organizational, relational, and communication skills plus the ability to manage multiple projects at the same time. The Construction Cost Analyst must be very well versed in the construction field. S\/H will be working in a fast paced environment and must be able to provide excellent customer service under these circumstances. Proficiency in Excel and Word is essential, knowledge of Xactimate is highly preferred and\/or ability to learn this software quickly with minimum guidance. Cost estimator is also expected to maintain records of each household served and must be very comfortable using or leaning to use our agency data tracking system. S\/He must be confrontable working with a diverse team and be able to make presentations to large groups when presentation of cases require his\/hers assistance. Applicant should have demonstrated the ability to relate well to people of diverse ethnic and economic backgrounds and have a commitment to CCANO's mission. Reliable transportation and the ability to be mobile is a must since the majority of time will be spent in different parishes. Minimum Qualifications:Minimum of 5 years experience in general construction and experience with hurricane damages dwellings preferred. Basic knowledge of plumbing, electrical, and HVAC systems and the Universal Standard Building Codes is required, as is the ability to do an itemized estimate using computerized software, preferably Xactimate. Essential Functions:Complete estimates for hurricane damaged homes utilizing Xactimate software as requested by case management agencies participating in the disaster response. Support case managers when using estimates for appeals and case presentation. Follow guidelines as set out in the Spirit of Hope (SOH) director and\/or case manager supervisor in preparing and submitting estimates. Follow local and state building codes in preparing estimates. Work with case mangers and clients to review and understand estimates.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614dbb4d2b7bd5561aa0b657::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Catholic Charities Archdiocese of New Orleans\", \"position\": \"Disaster Construction Cost Analyst (6 MONTHS ONLY)\", \"notes\": \"\", \"original\": \"Summary:Catholic Charities Archdiocese of New Orleans (CCANO) will provide assistance to hurricane IDA survivors in the most affected parishes covered by the agency. The Construction Cost Analysts is an integral part of the disaster recovery efforts and will be responsible for developing estimates for damaged homes utilizing Xactimate software. Estimates will be shared with survivors to help them understand the cost of their repairs, support the short term and long term work of disaster case managers and help the agency plan for the scope of services and cost of the intervention.Knowledge, Skills, and Abilities:This position requires strong organizational, relational, and communication skills plus the ability to manage multiple projects at the same time. The Construction Cost Analyst must be very well versed in the construction field. S\/H will be working in a fast paced environment and must be able to provide excellent customer service under these circumstances. Proficiency in Excel and Word is essential, knowledge of Xactimate is highly preferred and\/or ability to learn this software quickly with minimum guidance. Cost estimator is also expected to maintain records of each household served and must be very comfortable using or leaning to use our agency data tracking system. S\/He must be confrontable working with a diverse team and be able to make presentations to large groups when presentation of cases require his\/hers assistance. Applicant should have demonstrated the ability to relate well to people of diverse ethnic and economic backgrounds and have a commitment to CCANO's mission. Reliable transportation and the ability to be mobile is a must since the majority of time will be spent in different parishes.Minimum Qualifications:Minimum of 5 years experience in general construction and experience with hurricane damages dwellings preferred. Basic knowledge of plumbing, electrical, and HVAC systems and the Universal Standard Building Codes is required, as is the ability to do an itemized estimate using computerized software, preferably Xactimate.Essential Functions:Complete estimates for hurricane damaged homes utilizing Xactimate software as requested by case management agencies participating in the disaster response.Support case managers when using estimates for appeals and case presentationFollow guidelines as set out in the Spirit of Hope (SOH) director and\/or case manager supervisor in preparing and submitting estimates.Follow local and state building codes in preparing estimates.Work with case mangers and clients to review and understand estimates.Assist case managers and clients providing guidance on interpreting estimates given by professional contractors.Provide guidance to SOH team to help prevent contractor fraud.Be able to effectively identify disaster related damage vs differed maintenance or non-disaster related damages.Work with senior case manager and supervisor to prepare estimates necessary for case presentationsProvide random audits of estimates to ensure accuracy and continuity.Follow policies and guidelines for all grant resources.Submits monthly and quarterly progress reports in a timely manner.Input data into databases such as Apricot and any other data based require for additional grant reporting.Complete all required daily numerical\/narrative logs.Cultivate effective relationships with partner agencies, inspectors, vendors, and the community.Participate in meetings, conference calls, and trainings as requested by the SOH Director and or agency leadership.Maintain open communication with SOH Director and or agency leadership.Work as a cooperative team member with the management agency team.Additional functions as determined by the Project Director.Reports to: Spirit of Hope (SOH) director<br \/>\"}"
}