{
    "id":"Kaggle::techmap::6135c446dadc2354fdc506b6::careerbuilder_gr::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"VitrinaBox is a highly promising startup. We are very excited to announce that we’re. hiring to continue our scale up stage. We are looking to grow support team members of our Startup. Supporter & Tester. Job Description. We are looking for a supporter, who has remarkable. Data Entry Operation responsibilities include collecting customer request, editing data files and entering data in our platform, like fast typing with an eye for detail. Also UX perception and experience in various computer uses. Particularly, you may have experience in a variety of usages, such as pc games, or being in charge of a You. Tube channel, or being an administrator of a website, etc. Your primary focus will be Data Entry on supporting our existing. ew customers and testing in a daily basis our platform in every section, in order to be in an eligibl and stable phase. In addition, you must be capable of supporting the customers who deal with problems regarding our business logic and solve any possible question they may have. Last but not least, any programming knowledge will be beneficial, but surely it is not required. Therefore, a commitment to continuous testing of our platform, a great UX knowledge, and a diverse experience in computer usage are the fundamental requirements for this position. Responsibilities. Entering data in our platform. Editing data files. Provide technical support to the customers, by communicating and responding to any question. Create bug reports. Ensure the technical feasibility of UI\/UX designs. Collaborate with other team members. Skills and Qualifications. Adobe Premiere or equivalent Video editing tool. Fast typing with an eye for detail. Good knowledge and understanding of UX concepts. A serious relationship with our startup. Self-directed team player who thrives in a continually changing environment, and application needs. Highly skilled at communicating and at providing solutions. Great interpersonal and communication skills. Experience in using Google Chrome developer tools. Decent knowledge of Office 365 products (Excel, Word, etc. ). Ability to adapt to various browsers, operating systems and devices, in order to test the platform thoroughly. Good understanding of browser rendering behavior and performance. Understanding of cross-browser compatibility issues and ways to work around such issues. Military obligations for men should be accomplished..... Other desirable, but non-essential skills:.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6135c446dadc2354fdc506b6::careerbuilder_gr\", \"source\": \"careerbuilder_gr\", \"country\": \"GR\", \"company\": \"VitrinaBox\", \"position\": \"Supporter & Tester\", \"notes\": \"\", \"original\": \"<p><strong><span>VitrinaBox is a highly promising startup. We are very excited to announce that we\\u2019re<\/span><\/strong> <\/p>\\r<p><strong><span>h<\/span><\/strong><strong><span>iring to continue our scale up stage. We are looking to grow support team members of our Startup.<\/span><\/strong> <\/p>\\r<p><br \/><\/p>\\r<p><strong><span>Supporter & Tester<\/span><\/strong> <\/p>\\r<p><br \/><\/p>\\r<p><strong><span><br \/>\\rJ<\/span><\/strong><strong><span>o<\/span><\/strong><strong><span>b Description<\/span><\/strong> <\/p>\\r<p><br \/><\/p>\\r<p><span>W<\/span><span>e are looking for a supporter, who has <\/span><span>remarkable<\/span> <span>Data Entry Operation responsibilities include collecting customer request, <a>editing data files and entering data in our platform<\/a>, like fast typing with an eye for detail. \\u00a0Also UX perception <\/span><span>and experience in various computer uses. Particularly, you may have experience in a variety of usages, such as pc games, or being in charge of a YouTube channel, or being an administrator of a website, etc<\/span><span>. Your primary focus will be Data Entry on supporting our existing\/new customers and testing in a daily basis our platform in every section, in order to be in an eligibl and stable phase. In addition, you must be capable of supporting the customers who deal with problems regarding our business logic and solve any possible <\/span><span>question they may have<\/span><span>. Last but not least, any programming knowledge will be beneficial, but surely it is not required. Therefore, a commitment to continuous testing of our platform, a great UX knowledge, and a <\/span><span>diverse <\/span><span>experience in computer usage are the fundamental requirements for this position.<\/span><\/p>\\r<p><br \/><\/p>\\r<p><strong><span><br \/>\\rR<\/span><\/strong><strong><span>esponsibilities<\/span><\/strong> <\/p>\\r<p><br \/><\/p>\\r<ul>\\r    <li>Entering data in our platform.<\/li>\\r    <li>Editing data files. <\/li>\\r    <li>Provide technical support to the customers, by communicating and responding to any question.<\/li>\\r    <li>Monitor the stability of our platform in a daily basis \\u2013 UI Testing.<\/li>\\r    <li>Create bug reports.<\/li>\\r    <li>Ensure the technical feasibility of UI\/UX designs.<\/li>\\r    <li>Collaborate with other team members.<\/li>\\r<\/ul>\\r<p><br \/><\/p>\\r<p><strong><span><br \/>\\rSkills and Qualifications<\/span><\/strong> <\/p>\\r<p><br \/><\/p>\\r<ul>\\r    <li>Adobe Premiere or equivalent Video editing tool.<\/li>\\r    <li>Fast typing with an eye for detail<\/li>\\r    <li>Good knowledge and understanding of UX concepts<\/li>\\r    <li>A serious relationship with our startup.<\/li>\\r    <li>Self-directed team player who thrives in a continually changing environment, and application needs.<\/li>\\r    <li>Highly skilled at communicating and at providing solutions.<\/li>\\r    <li>Great interpersonal and communication skills.<\/li>\\r    <li>Experience in using Google Chrome developer tools.<\/li>\\r    <li>Decent knowledge of Office 365 products (Excel, Word, etc.)<\/li>\\r    <li>Ability to adapt to various browsers, operating systems and devices, in order to test the platform thoroughly.<\/li>\\r    <li>Good understanding of browser rendering behavior and performance.\\r    <li>Understanding of cross-browser compatibility issues and ways to work around such issues.<\/li>\\r    <li>Military obligations for men should be accomplished.<\/li>\\r    <\/li>\\r<\/ul>\\r<p><br \/><\/p>\\r<p><br \/><\/p>\\r<p><br \/><\/p>\\r<p><br \/><\/p>\\r<p><br \/><\/p>\\r<p><strong><span><br \/>\\rOther desirable, but non-essential skills:<\/span><\/strong><\/p>\\r<p><strong> <\/strong><\/p>\\r<ul>\\r    <li>Basic Html and JavaScript knowledge.\\u00a0\\u00a0 <\/li>\\r    <li>A minimum of 1 years of experience.<\/li>\\r<\/ul>\\r<p><br \/><\/p>\\r<p><br \/><\/p>\\r<p><br \/><\/p>\\r<p><strong><span><br \/>\\rWe Offer (according to Skills)<\/span><\/strong> <\/p>\\r<ul>\\r    <li>Monthly wage.<\/li>\\r    <li>Bonus at the end of the project.<\/li>\\r    <li>Excellent working environment.<\/li>\\r    <li>Working hours 10:30 \\u2013 18:30.<\/li>\\r<\/ul>\\r<p><span>\\u00a0\\u00a0 \\u00a0<\/span><\/p>\\r<p><strong><span>P<\/span><\/strong><strong><span>ortfolio is essential of previous or\/and current work.<\/span><\/strong> <\/p>\\r<p><span>S<\/span><span>e<\/span><span>nd your CV\\u00a0<\/span><\/p>\\r<p><br \/><\/p>\\r<p><span>NOTE: We will not respond to non-<strong>Support-Tester<\/strong> oriented personnel.<\/span><\/p>\\r<br \/>\\u00a0\"}"
}