{
    "id":"Kaggle::techmap::6134c06b0d968e4ca67dcf15::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"competitive salary\" - defining a salary range has been shown to increase diversity amongst candidates.",
    "verified":true,
    "synthetic":false,
    "text":" 6-month Fixed Term, Full-Time role in a fantastic team culture. Central location close to all modes of transport. Lead, mentor, coach, and train. He angitutanga: The opportunity. As a Senior Regulatory Support Officer in Building Consents, you will work closely with Team Leaders and Management to achieve our business goals. In this role, you will be responsible for providing subject matter expertise, guidance on building consents, and code compliance processes from lodgement to issuance ensuring our products are delivered within our statutory requirements. You will also manage all enquiries, invoicing, and loading of the Producer Statement Register for Auckland Council. In addition, you will have responsibility for identifying opportunities to improve processes, deliver training, and supporting the team with workflow and coaching. Great stakeholder management is required for this position as you will be working with different departments within the Auckland council. He korero mou: About you. Naturally, you will be confident in facilitating workflow to colleagues and assist them with issues when they arise. You will have an eye for detail and excel in different computer systems. You will be used to working within high-pressure environments, be adaptable and work well to meet targets. Ideally, you will have at least 3 years of experience working in an admin\/ leadership type of role. A previous background in regulatory and knowledge of the Building Act 2004 is desirable. You will be an enthusiastic individual with an overall positive attitude, who can drive continuous improvements and guide staff through the departments change. You will be a shining example of our high-performing behaviours and be confident to challenge where those behaviours are not being met. Nga ahuatanga kei a matou: What we offer. You will be part of a passionate team that is working towards building the future of Auckland. We are currently looking for an individual to join our high-performing team. This is a full-time six-month role. This is an opportunity for you to develop your skills while working with a supportive team. You will be rewarded with a competitive salary and a good work-life balance. A chance to help Auckland Council achieve our vision for Auckland to be a world-class city. Copy & paste the following link into your web browser to view the position description: httpsbit. ly\/2TfHIQS. Applications close 12 September 2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6134c06b0d968e4ca67dcf15::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Auckland Council\", \"position\": \"Senior Regulatory Support Officer\", \"notes\": \"\", \"original\": \"<p>\\u00a0<\/p><ul> <li>6-month Fixed Term, Full-Time role in a fantastic team culture<\/li> <li>Central location close to all modes of transport<\/li> <li>Lead, mentor, coach, and train<\/li> <\/ul><p>\\u00a0<\/p><p><strong>He angit\\u016btanga: The opportunity\\u00a0<\/strong><br \/>As a Senior Regulatory Support Officer in Building Consents, you will work closely with Team Leaders and Management to achieve our business goals. \\u00a0In this role, you will be responsible for providing subject matter expertise, guidance on building consents, and code compliance processes from lodgement to issuance ensuring our products are delivered within our statutory requirements. You will also manage all enquiries, invoicing, and loading of the Producer Statement Register for Auckland Council.<br \/>\\u00a0<br \/>In addition, you will have responsibility for identifying opportunities to improve processes, deliver training, and supporting the team with workflow and coaching. Great stakeholder management is required for this position as you will be working with different departments within the Auckland council.<br \/>\\u00a0<br \/><strong>He k\\u014drero m\\u014du: About you\\u00a0<\/strong><br \/>Naturally, you will be confident in facilitating workflow to colleagues and assist them with issues when they arise. \\u00a0You will have an eye for detail and excel in different computer systems. \\u00a0You will be used to working within high-pressure environments, be adaptable and work well to meet targets. Ideally, you will have at least 3 years of experience working in an admin\/ leadership type of role. A previous background in regulatory and knowledge of the Building Act 2004 is desirable.<br \/>\\u00a0<br \/>You will be an enthusiastic individual with an overall positive attitude, who can drive continuous improvements and guide staff through the department\\u2019s change. You will be a shining example of our high-performing behaviours and be confident to challenge where those behaviours are not being met.<br \/><strong>\\u00a0<br \/>Ng\\u0101 \\u0101huatanga kei a m\\u0101tou: What we offer\\u00a0<\/strong><br \/>You will be part of a passionate team that is working towards building the future of Auckland. We are currently looking for an individual to join our high-performing team. This is a full-time six-month role.<br \/>\\u00a0<br \/>This is an opportunity for you to develop your skills while working with a supportive team. You will be rewarded with a competitive salary and a good work-life balance. A chance to help Auckland Council achieve our vision for Auckland to be a world-class city.\\u00a0<\/p><p>\\u00a0<\/p><p>Copy &amp; paste the following link into your web browser to view the <strong>position description<\/strong>: https:\/\/bit.ly\/2TfHIQS<\/p><p>\\u00a0<\/p><p><strong>Applications close 12 September\\u00a02021<\/strong><\/p><p><br \/>Auckland Council is an equal opportunity employer (EOE) and we are committed to providing a working environment that embraces and values diversity and inclusion. If you have any support or access requirements, we encourage you to advise us at the time of application to assist you through the recruitment process.<\/p><p>\\u00a0<\/p>\"}"
}