{
    "id":"Kaggle::techmap::614138b28be8df1fa24bd7f3::careerbuilder_us::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Able to stand for 8 hours\" without further clarification or description of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Choose the days you'd like to work! We have Product Loader opportunities at our client company in Alexandria. Need flexibility for work\/life balance? Need hours that work with your school schedule? These are day shift, long-term temporary positions that offer a flexible schedule. You are able to choose from 8 - 37. 5 hours\/week. In this active role, you'll play an integral role in the testing of packaging equipment by loading and unloading product. Core weekday hours are 7:30am-3:30pm. Pay is $13-14\/hr. No weekends required. QUALIFIED CANDIDATES ARE:. Team focused.. Able to work well in a fast-paced environment.. Willing to learn. Training is provided! Able to stand for 8 hours. Pro Staff, a Staffmark Group company, offers short-term to long-term projects, temporary to contract-to-hire, or direct placements. With proven expertise in Administrative, Clerical, Light Industrial and Manufacturing backgrounds, Pro Staff matches the right people with the right career opportunities. About Pro Staff. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Pro Staff is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment. All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614138b28be8df1fa24bd7f3::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Pro Staff\", \"position\": \"Product Loader\", \"notes\": \"\", \"original\": \"Choose the days you'd like to work! We have Product Loader opportunities at our client company in Alexandria. Need flexibility for work\/life balance? Need hours that work with your school schedule? These are day shift, long-term temporary positions that offer a flexible schedule. You are able to choose from 8 - 37.5 hours\/week. In this active role, you'll play an integral role in the testing of packaging equipment by loading and unloading product.\\u00a0<br \/>\\n<br \/>\\nCore weekday hours are 7:30am-3:30pm. Pay is $13-14\/hr. No weekends required.\\u00a0<br \/>\\n<br \/>\\nQUALIFIED CANDIDATES ARE:\\u00a0<br \/>\\n-\\u00a0 Team focused;\\u00a0<br \/>\\n<br \/>\\n-\\u00a0 Able to work well in a fast-paced environment;\\u00a0<br \/>\\n<br \/>\\n-\\u00a0 Willing to learn - Training is provided!\\u00a0<br \/>\\n<br \/>\\n-\\u00a0 Able to stand for 8 hours\\u00a0<br \/>\\n<br \/>\\nPro Staff, a Staffmark Group company, offers short-term to long-term projects, temporary to contract-to-hire, or direct placements. With proven expertise in Administrative, Clerical, Light Industrial and Manufacturing backgrounds, Pro Staff matches the right people with the right career opportunities.<br \/>\\n<div>\\n <p>About Pro Staff<\/p>\\n <p> Pro Staff is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Pro Staff is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment.<\/p>\\n \\n<p> All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations. \\n<\/p>\\n<\/div>&nbsp;\"}"
}