{
    "id":"Kaggle::techmap::6156178da6740c534abc713f::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Assists in bid-IFC drawing price comparisons. Participates in project post-mortems to analyze bid vs. actual. Participates in pre-award negotiations to ensure that contracts offered comply with the terms and conditions. Participates in the development of project execution strategy. Develops and maintains client relations. Follows up on quotations to determine status. Assists in Contract Change Notice (CCN) pricing as requested. Provides support as well as coaching and mentoring to the Estimating team. Performs Project Management duties as requested. Qualifications: Minimum of 8 years of estimating Industry experience is required. The following education will be considered an asset: A Diploma in Construction Engineering Technology. Achievement of a Project Management Certificate (PMC) from a recognized Project Management Institute (PMI). A team player who is self-motivated and has demonstrated leadership skills. Excellent written and verbal communication skills. Very strong critical thinking, attention to detail and problem-solving skills. Exceptional organization and time management skills. Ability to work cooperatively and collaboratively with all levels of employees, management. and external relationships. Adaptable and flexible with taking on new opportunities as assigned by the Proposal Manager. Proficient in MS Office software. Working Conditions. The job may require the incumbent to walk stairs. Be outside in inclement weather (slippery surfaces and cold). Carrying objects, driving and being exposed to normal office routines. Physical Requirements. The incumbent is required to have close visual acuity to perform an activity such as: preparing and analyzing data and figures. Viewing a computer terminal for extended periods of time. And extensive reading. The incumbent is also required to stand and sit for extended periods of time. Please note that only qualified candidates will be contacted. Waiward is an equal opportunity employer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156178da6740c534abc713f::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Waiward\", \"position\": \"Lead Estimator\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Overview: <p style=\\\"margin:0px\\\"><strong><\/strong><\/p> <p style=\\\"margin:0px\\\"><strong>Location: &nbsp; <\/strong>Edmonton, Alberta<\/p> <p style=\\\"margin:0px\\\"><strong>Position: &nbsp; <\/strong>Permanent \/ Full Time \/ Day<\/p> <p style=\\\"margin:0px\\\"><strong>Positions Available:<\/strong> 1<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"line-height:150%\\\">Waiward is a respected construction and maintenance service provider that operates one of Canada\\u00e2\\u20ac\\u2122s largest fabrication shops based out of Edmonton, Alberta. Our mission is <em>To Be Your Trusted Partner<\/em> which ensures we act with integrity in all that we do. Through planned growth and development, we have kept our commitment to provide our customers with an unsurpassed level of service. Waiward\\u00e2\\u20ac\\u2122s historical and future success is grounded in our collective commitment to our core values.<\/p> <p style=\\\"margin-bottom:8.25pt;line-height:150%\\\">At Waiward, we believe a diverse and inclusive workplace is the key to unlocking the full potential of our people. It is essential to build a team that represents the communities and clients we are serving. We attract, hire, and develop people of all backgrounds and ensure fairness and inclusion within our hiring processes. We believe in investing in people based on their expertise, capabilities, aspirations, and performance despite their race, religion, gender identity, sexual orientation, and beliefs.<\/p> <p style=\\\"margin-bottom:8.25pt;line-height:150%\\\">As a leader in our industry, we believe diversity and inclusion strengthen our team and are committed to making sustainable progress in our company and the communities and clients we serve. With the support of our leadership team and peers, our people are encouraged to share their perspectives.<\/p> <p style=\\\"margin:6pt 0in 6pt 0in\\\"><strong>Job Purpose<\/strong><\/p> <p style=\\\"margin-top:6pt\\\">The Lead Estimator is a critical position within Waiward and will evaluate incoming bids for technical fit, scope, schedule, size, client, etc. and make recommendations weather to proceed with submitting a bid (bid \/no-bid decisions). &nbsp; This role will support the creation of estimating streams and simplify our current estimating practices, as well as support the Estimating team as required in all stages of the proposal with support from internal teams. &nbsp; The Lead Estimator will provide direction for bid kickoff, clarification, and meetings and will support client relationships \/ discussions in all stages of the proposal.<\/p> <p style=\\\"margin:6pt 0in 6pt 0in\\\"> &nbsp;<\/p>Responsibilities: <ul> <li>Displays a commitment to Waiward\\u00e2\\u20ac\\u2122s incident-free vision, values, and culture.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Exercises due diligence in review of Request for Quotation documents.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Communicates with clients regarding the process of developing tenders according to the client\\u00e2\\u20ac\\u2122s specifications.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Supports detailed material take-offs and cost estimates as per company standards.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Prepares and submit tenders in accordance with company standards.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Follows company procedures for verification and checking of bids.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Confirms capacities with Waiward\\u00e2\\u20ac\\u2122s Production and Drafting to meet project schedules.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Assists in bid-IFC drawing price comparisons.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Participates in project post-mortems to analyze bid vs. actual.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Participates in pre-award negotiations to ensure that contracts offered comply with the terms and conditions.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Participates in the development of project execution strategy.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Develops and maintains client relations.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Follows up on quotations to determine status.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Assists in Contract Change Notice (CCN) pricing as requested.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Provides support as well as coaching and mentoring to the Estimating team.<\/li> <li style=\\\"margin-top:6pt;margin-bottom:6pt\\\">Performs Project Management duties as requested.<\/li> <\/ul>Qualifications: <ul> <li>Minimum of 8 years of estimating Industry experience is required<\/li> <li>The following education will be considered an asset:<\/li> <li style=\\\"margin:6pt 0in 6pt 1in\\\">A Diploma in Construction Engineering Technology<\/li> <li style=\\\"margin:6pt 0in 6pt 1in\\\">Achievement of a Project Management Certificate (PMC) from a recognized Project Management Institute (PMI)<\/li> <li>A team player who is self-motivated and has demonstrated leadership skills<\/li> <li>Excellent written and verbal communication skills<\/li> <li>Very strong critical thinking, attention to detail and problem-solving skills<\/li> <li>Exceptional organization and time management skills<\/li> <li>Ability to work cooperatively and collaboratively with all levels of employees, management<br>and external relationships.<\/li> <li>Adaptable and flexible with taking on new opportunities as assigned by the Proposal Manager.<\/li> <li>Proficient in MS Office software<\/li> <\/ul> <p style=\\\"margin:0px\\\"><strong>Working Conditions<\/strong><\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">The job may require the incumbent to walk stairs; be outside in inclement weather (slippery surfaces and cold); carrying objects, driving and being exposed to normal office routines.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>Physical Requirements<\/strong><\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">The incumbent is required to have close visual acuity to perform an activity such as: preparing and analyzing data and figures; viewing a computer terminal for extended periods of time; and extensive reading. The incumbent is also required to stand and sit for extended periods of time.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><em><strong>*Please note that only qualified candidates will be contacted. Waiward is an equal opportunity employer.<\/strong><\/em><\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <\/div>\"}"
}