{
    "id":"Kaggle::techmap::614127ba8be8df1fa24b43eb::careerbuilder_us::9",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Installation and repair of a variety of electrical equipment, such as generators, transformers, switchboards, controllers, circuit breakers, motors, heating units, conduit systems, or other transmission equipment. Working from blueprints, drawings, layouts, or other specifications. Locating and diagnosing trouble in the electrical system or equipment. Working standard computations relating to load requirements of wiring or electrical equipment. Use of a variety of electricians hand tools, and test & measurement instruments. Requires rounded training and experience, usually acquired through a formal apprenticeship, licensed Journeyman or Masters. Maintains the general cleanliness and appearance of assigned spaces. Assists others as part of the maintenance team as required and performs other duties assigned. Must be able to lift 50 lbs., squat, bend, stoop and kneel for short periods, climb a ladder, stand for long periods of time, constant arm extensions. Occasional exposure to elements such as heat, cold, noise, dust, dirt, chemicals, but none to the point of being disagreeable. May involve minor safety hazards where likely result would be cuts, bruises, etc. Must be able to pass a local background check and have the ability to obtain and maintain NAC\/LAC clearance after hire. Hospital experience, Fire Alarm and NICET Certification, preferred. HAVES: Journeyman Electrician, required. Minimum of 5 years of experience in commercial building electrical systems, wiring, motor control centers, motor starters, transformers, conduit runs, PM or electrical troubleshooting of wiring circuits, main and branch feeders, and maintenance on all building systems. Excellent oral and written communication skills. Knowledge of computer software programs to include Word, Excel, Power Point and Outlook required. Experience with a Facility Computerized Maintenance Management System software (CMMS) highly desired.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614127ba8be8df1fa24b43eb::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"J&J Worldwide\", \"position\": \"Fire Alarm Technician\", \"notes\": \"\", \"original\": \"<p>Installation and repair of a variety of electrical equipment, such as generators, transformers, switchboards, controllers, circuit breakers, motors, heating units, conduit systems, or other transmission equipment.<br \/><br \/> Working from blueprints, drawings, layouts, or other specifications.<br \/><br \/> Locating and diagnosing trouble in the electrical system or equipment.<br \/><br \/> Working standard computations relating to load requirements of wiring or electrical equipment.<br \/><br \/> Use of a variety of electricians hand tools, and test & measurement instruments.<br \/><br \/> Requires rounded training and experience, usually acquired through a formal apprenticeship, licensed Journeyman or Masters<br \/><br \/> Maintains the general cleanliness and appearance of assigned spaces.<br \/><br \/> Assists others as part of the maintenance team as required and performs other duties assigned.<br \/><br \/> Must be able to lift 50 lbs., squat, bend, stoop and kneel for short periods, climb a ladder, stand for long periods of time, constant arm extensions.<br \/><br \/> Occasional exposure to elements such as heat, cold, noise, dust, dirt, chemicals, but none to the point of being disagreeable. May involve minor safety hazards where likely result would be cuts, bruises, etc.<br \/><br \/> Must be able to pass a local background check and have the ability to obtain and maintain NAC\/LAC clearance after hire.<\/p><br \/>Hospital experience, Fire Alarm and NICET Certification, preferred.<br \/>HAVES:<br \/><br \/> Journeyman Electrician, required.<br \/><br \/> Minimum of 5 years of experience in commercial building electrical systems, wiring, motor control centers, motor starters, transformers, conduit runs, PM or electrical troubleshooting of wiring circuits, main and branch feeders, and maintenance on all building systems.<br \/><br \/> Excellent oral and written communication skills.<br \/><br \/> Knowledge of computer software programs to include Word, Excel, Power Point and Outlook required.<br \/><br \/> Experience with a Facility Computerized Maintenance Management System software (CMMS) highly desired.&nbsp;\"}"
}