{
    "id":"Kaggle::techmap::6148afdd4aed174fb1e83fa5::britishjobs_uk::1",
    "label_age":true,
    "analysis_age":"\"recent graduate\" is biased against older graduates",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":"Descriptions like \"hands-on role,\" \"self-motivation,\" and \"able to work well under pressure\" are masculine leaning phrases.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The mention that candidates \"must be able to hold Security Clearance\" might indirectly exclude non-nationals or individuals from different demographic backgrounds.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Draken Europe are recruiting for two Business Graduates to join the business in February 2022. The role will involve 12-month secondments in each the Supply Chain and Business Development departments. Within Supply Chain you will be responsible for purchase order administration and expedition, resolution of invoice discrepancies, production of functional reports (SLA \/ KPIs) and supply chain analytics, plus leading \/ supporting specific continuous improvement (CI) initiatives such as the consolidation and rationalisation of Supply Chain procedures across both the Fixed Wing and Rotary Wing business units. While seconded to the Business Development Team you will support a range of people across business functions at senior level to result in the selection, delivery and ongoing evaluation of current and future programmes. The opportunity is to become directly involved in Business Win and Business Strategy and to be hands on in the capture phase, bid planning and proposal development. The position is based at our Bournemouth Airport site and is an exciting opportunity for someone looking to develop their career within a commercial and military aerospace domain. As a Business Graduate your skills and qualification will include:. Recent graduate in Business Studies, Business Management or other similar discipline with exposure to modules related to Procurement & Supply Chain and Business Strategy. Hands-on role requiring self-motivation and ability to work independently at times. Good team working and ability to manage stakeholder relationships. Effective communicator. Resilient and able to work well under pressure. May be exposed to ITAR data so must be able to hold Security Clearance. Key responsibilities within Supply Chain:. Ensure the timely procurement of goods and services to satisfy operational requirements, using the various Purchasing systems within the Fixed and Rotary wing business units.. Monitor group mailboxes and forward on emails for action to supply chain officers as appropriate. Develop functional reporting and governance metrics. Strategic Value Plans, Key Performance Indicators and Service Level Agreements. Perform data analysis to inform supply \/ spend base segmentation, preferencing and prioritisation, influencing the development of category and supplier relationship management strategies. Support the Procurement, Supply Chain and Stores teams in identifying, capturing and realising cost and complexity reduction opportunities to improve the overall effectiveness and efficiency of Procurement and Supply Chain activities. Develop spend analytics capabilities, generating spend dashboards and regular reporting to improve visibility and inform supplier and contract reviews. Undertake specific Continuous Improvement projects. Key Responsibilities within Business Development: Campaign Management:. Helping contribute to a successful campaign which results in down selection in a major bid.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148afdd4aed174fb1e83fa5::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Draken\", \"position\": \"Business Graduate\", \"notes\": \"\", \"original\": \"Draken Europe are recruiting for two Business Graduates to join the business in February 2022. The role will involve 12-month secondments in each the Supply Chain and Business Development departments.<br><br>Within Supply Chain you will be responsible for purchase order administration and expedition, resolution of invoice discrepancies, production of functional reports (SLA \/ KPIs) and supply chain analytics, plus leading \/ supporting specific continuous improvement (CI) initiatives such as the consolidation and rationalisation of Supply Chain procedures across both the Fixed Wing and Rotary Wing business units.<br><br>While seconded to the Business Development Team you will support a range of people across business functions at senior level to result in the selection, delivery and ongoing evaluation of current and future programmes.<br><br>The opportunity is to become directly involved in Business Win and Business Strategy and to be hands on in the capture phase, bid planning and proposal development.<br><br>The position is based at our Bournemouth Airport site and is an exciting opportunity for someone looking to develop their career within a commercial and military aerospace domain.<br><br>As a Business Graduate your skills and qualification will include:<br><br>  * Recent graduate in Business Studies, Business Management or other similar discipline with exposure to modules related to Procurement &amp; Supply Chain and Business Strategy.<br><br>  * Hands-on role requiring self-motivation and ability to work independently at times.<br><br>  * Good team working and ability to manage stakeholder relationships.<br><br>  * Effective communicator.<br><br>  * Resilient and able to work well under pressure<br><br>  * May be exposed to ITAR data so must be able to hold Security Clearance<br><br>Key responsibilities within Supply Chain:<br><br>  * Ensure the timely procurement of goods and services to satisfy operational requirements, using the various Purchasing systems within the Fixed and Rotary wing business units<br><br>  * Source parts \/ components, create and process purchase, repair and exchange orders, expediting delivery dates to meet engineering requirements whilst maintaining accurate records on all ERP and tracking systems<br><br>  * Monitor group mailboxes and forward on emails for action to supply chain officers as appropriate<br><br>  * Develop functional reporting and governance metrics; Strategic Value Plans, Key Performance Indicators and Service Level Agreements<br><br>  * Perform data analysis to inform supply \/ spend base segmentation, preferencing and prioritisation, influencing the development of category and supplier relationship management strategies<br><br>  * Support the Procurement, Supply Chain and Stores teams in identifying, capturing and realising cost and complexity reduction opportunities to improve the overall effectiveness and efficiency of Procurement and Supply Chain activities.<br><br>  * Develop spend analytics capabilities, generating spend dashboards and regular reporting to improve visibility and inform supplier and contract reviews<br><br>  * Undertake specific Continuous Improvement projects<br><br>Key Responsibilities within Business Development:<br><br>Campaign Management:<br><br>  * Helping contribute to a successful campaign which results in down selection in a major bid<br><br>  * Review bid requirement and assess opportunity<br><br>  * Identifying customer requirements<br><br>  * Identifying risks and opportunities<br><br>  * Prepare regular reports on campaign status<br><br>  * Stakeholder management including internal and external customers<br><br>Strategic growth plan:<br><br>  * Assist in the consolidation of the 5YP to provide a concise evaluation of Draken&rsquo;s projected growth opportunities, market size and share.<br><br>Business Development<br><br>  * Contribute to bid management activity<br><br>  * Prepare data to support capture planning and bid preparation<br><br>  * Take ownership of sub-phases or sub-tasks of projects and bids<br><br>  * Identify and produce key data relevant to ongoing Bids and Capture plans<br><br>Business Win Procedure:<br><br>  * Supporting Business Win focussed on Opportunity Evaluation, Bid Review and Pre-Tender Reviews<br><br>Draken Europe<br><br>Draken combines advanced technology with a diverse range of aircraft platforms and highly skilled people to deliver mission-critical global aviation solutions for government customers worldwide.<br><br>Our end-to-end capabilities include customised Operational Readiness Training, Aircraft MRO &amp; Engineering, Specialised Helicopter Training as well as Search &amp; Rescue and Surveillance services.<br><br>Our differences make us stronger. For example, we need people from both commercial and military backgrounds to keep our services reliable yet challenging. In the same way we need people of different ethnicity, backgrounds, gender, sexual orientation, gender identity, religious and non-religious beliefs. For no other reason than it makes our organization perform better.<br><br>It&rsquo;s this diversity of perspective and talent that delivers our values and enables our success, as a diverse mix of voices leads to better discussions, decisions and outcomes for everyone.<br><br>We believe that diversity is bringing your own unique perspective to the conversations, inclusion is having a voice and engagement is having that voice heard.<br><br>Intolerance, which we condemn in any form, has no place in our Company, and we all have a responsibility to ensure that we treat each other fairly and with respect.<br><br>We want a culture where everyone who joins feels they have opportunities to succeed and grow, and operate in an environment where they can be authentic.<br><br>We are also an Armed Forces friendly organisation, and as part of our commitment to the Armed Forces Covenant, welcome applications from veterans and services spouses and partners who met the criteria in our job specifications.<br><br>In line with our Disability Confident Commitments, we provide reasonable adjustments to facilitate our interview process, please liaise with our recruitment partners at AMS if any reasonable adjustments are required.<br>\"}"
}