{
    "id":"Kaggle::techmap::6159f76e9773a9507ce6ea75::monster_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description Description: Want to join an AMAZING organization with a mission of building girls of COURAGE, CONFIDENCE, and CHARACTER who make the world a better place? Girl Scouts offers the best leadership development experience for girls in the world. Our Girl Scout Leadership Experienceis a one-of-a-kind leadership development program for girls, with proven results. It is based on time-tested methods and research-backed programming that help girls take the lead-in their own lives and in the world. At Girl Scouts North Carolina Coastal Pines, we BELIEVE in the power of girls. We CONNECT over 41 counties spanning central and eastern North Carolina. We GET INVOLVED in our communities with hundreds of service projects completed each year. The Camp and Outdoor Program Director will design, develop, and execute programs that meet the changing needs of girl scout members, with the primary focus on programs related to travel, summer camps (overnight and day), outdoor programming, and training. This position will be located in Raleigh, NC during the non-summer season (September- May) and at Camp Graham in Vance County, NC during the summer season (June-August). The salary range for this exempt position is $40, 000 - $45, 000. This position is work from home flexible when not participating in required in person activities. Candidate must reside in North Carolina. MAJOR ACCOUNTABILITIES: Plans, develops, manages, and evaluates new and existing Girl Scout resident camp, day camp, and outdoor activities. Works in collaboration with the program team and volunteers as applicable to provide and support well-rounded, relevant, and accessible program opportunities, training, resources, and support to our members in all 41 counties. Recruits, hires, trains, manages, and evaluates camp staff based on the established GSUSA, Council, and ACA guidelines. Provides leadership for committees and task groups, as assigned. Develops relevant training curriculum to support outdoor experiences. Develops and maintains a risk management plan for all program operations. Ensures compliance with all safety standards and policies in accordance with GSUSA, ACA, and state and local laws and health regulations. Partners with property staff to identify and forecast camp needs, strategic priorities, and improvements in conjunction with ensuring maintenance, replacement, and acquisition of program equipment to support programs at camp. Demonstrates sound fiduciary oversight and prepares and manages budgets (including grant programs). Ensures that programs and camp are cost effective and provides regular budget and forecasting reports.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6159f76e9773a9507ce6ea75::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Girl Scouts of North Carolina Coastal Pines\", \"position\": \"Camp and Outdoor Program Director\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Description: <p>Want to join an <strong>AMAZING<\/strong> organization with a mission of building girls of <strong>COURAGE<\/strong>, <strong>CONFIDENCE,<\/strong> and <strong>CHARACTER<\/strong> who make the world a better place? <\/p> <p><\/p> <p>Girl Scouts offers the best leadership development experience for girls in the world. Our <strong>Girl Scout Leadership Experience<\/strong><strong>is a one-of-a-kind leadership development program for girls, with proven results. It is based on time-tested methods and research-backed programming that help girls take the lead-in their own lives and in the world. <\/strong><\/p> <p><\/p> <p>At Girl Scouts North Carolina Coastal Pines, we <strong>BELIEVE<\/strong> in the power of girls. We <strong>CONNECT<\/strong> over 41 counties spanning central and eastern North Carolina. We <strong>GET INVOLVED<\/strong> in our communities with hundreds of service projects completed each year. <\/p> <p><\/p> <p>The Camp and Outdoor Program Director will design, develop, and execute programs that meet the changing needs of girl scout members, with the primary focus on programs related to travel, summer camps (overnight and day), outdoor programming, and training. This position will be located in Raleigh, NC during the non-summer season (September- May) and at Camp Graham in Vance County, NC during the summer season (June-August). The salary range for this exempt position is $40,000 - $45,000. This position is work from home flexible when not participating in required in person activities. Candidate must reside in North Carolina. <\/p> <p><\/p> <p><strong>MAJOR ACCOUNTABILITIES:<\/strong><\/p> <ul> <li>Plans, develops, manages, and evaluates new and existing Girl Scout resident camp, day camp, and outdoor activities. <\/li> <li>Works in collaboration with the program team and volunteers as applicable to provide and support well-rounded, relevant, and accessible program opportunities, training, resources, and support to our members in all 41 counties.<\/li> <li>Recruits, hires, trains, manages, and evaluates camp staff based on the established GSUSA, Council, and ACA guidelines.<\/li> <li>Provides leadership for committees and task groups, as assigned.<\/li> <li>Develops relevant training curriculum to support outdoor experiences.<\/li> <li>Develops and maintains a risk management plan for all program operations. Ensures compliance with all safety standards and policies in accordance with GSUSA, ACA, and state and local laws and health regulations.<\/li> <li>Partners with property staff to identify and forecast camp needs, strategic priorities, and improvements in conjunction with ensuring maintenance, replacement, and acquisition of program equipment to support programs at camp.<\/li> <li>Demonstrates sound fiduciary oversight and prepares and manages budgets (including grant programs). Ensures that programs and camp are cost effective and provides regular budget and forecasting reports.<\/li> <li>Provides leadership opportunities for older girls, including providing oversight and direction for girls to serve on committees and task groups or participate in leadership training.<\/li> <li>Implements and provides support to assigned GSUSA initiatives: trip and travel, day camp, summer resident camp, outdoor education\/stewardship, adventure programming, etc.<\/li> <li>Promotes and supports Council's and GSUSA's affirmative action plans and their commitments to diversity throughout the organization.<\/li> <li>Provides excellent customer service by demonstrating empathy and exercising innovative problem solving. Ensures a consistent and timely communication system is in place to meet the needs of customers, volunteers, program partners and other stakeholders.<\/li> <\/ul> <p><strong>SUMMER CAMP RESPONSIBILITIES:<\/strong><\/p> <ul> <li>Ensures ACA, GSUSA, and state and local laws and health regulations are followed.<\/li> <li>Provides ongoing coaching, training, and management to seasonal camp staff.<\/li> <li>Works to minimize risks while at camp to ensure the safety of campers, volunteers, and staff.<\/li> <li>Administers designated resident camp budget.<\/li> <li>Works with seasonal camp staff to provide programs related to the Girl Scout Leadership Experience.<\/li> <li>Evaluates staff and campers throughout the season to ensure program objectives are being achieved.<\/li> <li>Maximizes camp attendance through retention and acquisition efforts, including developing and marketing an engaging, relevant resident camp program.<\/li> <li>Provides support, awareness, access, training, and resources to troops\/areas\/volunteers to increase and enrich the outdoor experiences and camp utilization of members.<\/li> <\/ul> <p><br><\/p>. Requirements: <ul> <li>Bachelor's degree in recreation and\/or 4 years of experience in recreational program planning and implementation or other related field.<\/li> <li>Able to work independently with little supervision. Supervisory experience preferred. <\/li> <li>Knowledge and experience of outdoor camping skills. <\/li> <li>Strong communication and organizational skills; must be detail oriented. <\/li> <li>Experience in designing, implementing and evaluating programs.<\/li> <li>Must be able to work flexible schedule (evenings and weekends); to reside at camp during summer resident camp; to supervise, communicate, train, and evaluate work of volunteers and staff.<\/li> <li>Proven experience with establishing and maintaining effective working relationships with volunteers and staff. <\/li> <li>Must have a valid driver's license and be able to drive a vehicle.<\/li> <li>Must be willing to work outdoors as needed and traveling to remote locations may be required to perform the duties of this position.<\/li> <\/ul> <p><br><\/p> <p><strong>GSNCCP Benefits Offered:<\/strong><\/p> <p><strong>Paid Holidays<\/strong>: Martin Luther King Jr.'s Birthday, Good Friday, Memorial Day, Juneteenth, Independence Day, Labor Day, Indigenous People's Day, Veteran's Day, Thanksgiving (two days), Winter Break 12\/24 - 1\/1. <strong>Paid Time Off:<\/strong> Vacation, Sick, Floating Holiday, Community Service, Mental Health Leave. <strong>Medical Benefits:<\/strong> Medical, Dental, Vision, Retirement Plan - 403(b), Employee Assistance Program, Accident, Critical Illness, Short-Term Disability, Life Insurance, and more. <\/p> <p><br><\/p> <p><strong>Diversity, Equity, Inclusion &amp; Belonging:<\/strong><\/p> <p>GS-NCCP supports employees and volunteers who deliver the Girl Scouts Leadership Experience (GSLE) for girls in troops and at camp, serving approximately 20,000 girls every year. GS-NCCP recognizes its responsibility to nurture diversity, equity, inclusion, and belonging, for girls, families, volunteers, and staff. To make the world a better place, we must commit to working together to build an inclusive society. Inclusivity is a big part of the Girl Scout DNA. Girl Scouts is a nonpolitical, nonpartisan organization. <\/p> <p><br><\/p> <p><strong>GSNCCP is an Equal Opportunity Employer:<\/strong><\/p> <p>Girl Scouts - North Carolina Coastal Pines provides equal employment opportunities to all qualified persons and prohibits discrimination and harassment of any type without regard to race, sex (including pregnancy, sexual orientation, transgender status or gender identity), color, religion, national origin, disability, genetic information, age, marital status, veteran status, or other characteristics protected by federal, state or local laws. Reasonable accommodations may be made to enable individuals to perform the essential function of the position. If you require a reasonable accommodation, please contact Human Resources at or . <\/p> <p><br><\/p> <br> <br> <p>PI<\/p> <\/div>\"}"
}