{
    "id":"Kaggle::techmap::6142406da973d70733cf9d09::britishjobs_uk::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Mechanical Engineer needed for my Sheffield based client, an industry leader in, services and installation of induction melting equipment. This role will be involved in the overhaul and repair of various types of induction equipment from removal and testing to refurbishment, commissioning and installation duties. The role encompasses full product delivery to customer sites across the UK and overseas. Responsibilities of the Mechanical Engineer. A multiskilled team is responsible for the manufacture \/ refurbishment of Induction Coils from 5Kg up to 60 Tons in capacity. Materials used in the manufacture of our Induction Coils include large section of Stainless-steel tubing, these are formed to exacting standards to produce the finished item. Specialist skills associated with this Coil manufacturing processes include, Tig Welding, Brazing and Soldering. A Powder Coat Electrical Insulation along with additional protective surface finishes to the final produced Coil are required to be applied. High tolerance fabrication of the finished article is required to exacting standards, although mechanically formed the Coil is also a precision Electrical component in the Melting process. Refurbishment and upgrading existing equipment both in-house and at the customers premises. Understanding of Engineering Department produced Mechanical schematics, plus the ability to problem solve if the situation arises. Skills Knowledge, Skills and Attributes required: Strong analytical and problem-solving skills. Possess good verbal and written communication skills. Possess the ability to work productively, efficiently & effectively with initiative and drive under tight timescales. Consistent attention to detail and quality. Ability to listen and follow instructions. Flexible and enthusiastic approach when dealing with changing priorities. A team player with high personal standards. Additional Requirements: The employee frequently is required to stand, sit, and reach with hands and arms. The employee is occasionally required to stoop, kneel, and crouch. The employee must be able to lift components. Specific vision abilities required by this job include close vision, colour vision, and ability to adjust focus. The ability to work to a shift pattern, at times of peak demand. ENG001.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6142406da973d70733cf9d09::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"RE People\", \"position\": \"Mechanical Fitter\", \"notes\": \"\", \"original\": \"Mechanical Engineer&nbsp;needed for my Sheffield based client, an industry leader in, services and installation of induction melting equipment.<br><br>This role will be involved in the overhaul and repair of various types of induction equipment from removal and testing to refurbishment, commissioning and installation duties. The role encompasses full product delivery to customer sites across the UK and overseas.<br><br>Responsibilities of the Mechanical Engineer;<br><br>A multiskilled team is responsible for the manufacture \/ refurbishment of Induction Coils from 5Kg up to 60 Tons in capacity.&nbsp;<br>Materials used in the manufacture of our Induction Coils include large section of Stainless-steel tubing, these are formed to exacting standards to produce the finished item.&nbsp;<br>Specialist skills associated with this Coil manufacturing processes include, Tig Welding, Brazing and Soldering.&nbsp;<br>A Powder Coat Electrical Insulation along with additional protective surface finishes to the final produced Coil are required to be applied.&nbsp;<br>High tolerance fabrication of the finished article is required to exacting standards, although mechanically formed the Coil is also a precision Electrical component in the Melting process.&nbsp;<br>Refurbishment and upgrading existing equipment both in-house and at the customers premises.&nbsp;<br>Understanding of Engineering Department produced Mechanical schematics, plus the ability to problem solve if the situation arises.&nbsp;<br>Skills Knowledge, Skills and Attributes required:<br><br>Strong analytical and problem-solving skills<br>Possess good verbal and written communication skills<br>Possess the ability to work productively, efficiently &amp; effectively with initiative and drive under tight timescales<br>Consistent attention to detail and quality<br>Ability to listen and follow instructions<br>Flexible and enthusiastic approach when dealing with changing priorities<br>A team player with high personal standards<br>Additional Requirements:<br><br>While performing the duties of this job, dexterity is required<br>The employee frequently is required to stand, sit, and reach with hands and arms<br>The employee is occasionally required to stoop, kneel, and crouch<br>The employee must be able to lift components<br>Specific vision abilities required by this job include close vision, colour vision, and ability to adjust focus.<br>The ability to work to a shift pattern, at times of peak demand<br>ENG001<br><br>\"}"
}