{
    "id":"Kaggle::techmap::6145a8117b52fb603875ff96::linkedin_cn::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" About The Role. The Senior Scientist-IHC automation will be responsible for delivering the IHC automation platform for RabMAb development to deliver best-in-class RabMAbs in a high-throughput method. Roles & Responsibilities. Be responsible for the method development of the IHC automation and image analysis platform for the screening of RabMAb clones in early development. Develop and troubleshoot the staining method for RabMAb clones with a high throughput staining system in IHC, using your in-depth technical knowledge. Develop and troubleshoot image analysis algorithms to analyze IHC results, using your in-depth technical knowledge. Report and present results to the program team meeting on a regular basis. Have in-depth understanding of target information, including target function, expression pattern, subcellular location, clinical application prospect. Ability to design, plan, analyze and troubleshoot IHC experiments. About You. Have at least 5 years experience in using IHC automation and troubleshooting of IHC. Have at least 2 years of experience in an image analysis platform with experience in writing image analysis algorithms from first principles. Experience in using Artificial Intelligence in pathology tissue recognition would be highly desirable. Have both histologic and pathological education and ability to recognise different tumour and normal human tissues. Experience in mouse pathology is desirable. PhD. degree in biology and PhD. in human or animal medicine preferred. Education abroad highly desirable. Experience in aligned applications to IHC, such WB, ICC, IF, IP and Flow would be desirable. Excellent communication (both English and Chinese). Independent learner and able to adapt to a fast-paced working environment. If this sounds like you and youd like to be a part of a fast-paced, growing business with the vision to become the most influential company and best-loved brand in life sciences, please apply now! Pay and Benefits. In addition to competitive salaries, we offer an attractive and flexible benefits package, a culture focused on well-being and opportunities for growth and development, and a highly flexible working environment. About Us. An idea conceived in a University of Cambridge laboratory in 1998, Abcam plc (www. abcamplc. com) began life as an innovative and entrepreneurial start-up, spearheaded by like-minded individuals who shared a common purpose of providing the scientific community with quality antibody reagents, as well as trustworthy and up-to-date information about their uses and limitations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145a8117b52fb603875ff96::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"Abcam\", \"position\": \"Senior Scientist (IHC)\", \"notes\": \"\", \"original\": \"<strong><u>About The Role<br><br><\/u><\/strong>The Senior Scientist-IHC automation will be responsible for delivering the IHC automation platform for RabMAb development to deliver best-in-class RabMAb\\u2019s in a high-throughput method.<br><br>Roles &amp; Responsibilities<br><ul><li>Be responsible for the method development of the IHC automation and image analysis platform for the screening of RabMAb clones in early development.<\/li><li>Develop and troubleshoot the staining method for RabMAb clones with a high throughput staining system in IHC, using your in-depth technical knowledge.<\/li><li>Develop and troubleshoot image analysis algorithms to analyze IHC results, using your in-depth technical knowledge.<\/li><li>Report and present results to the program team meeting on a regular basis.<\/li><li>Have in-depth understanding of target information, including target function, expression pattern, subcellular location, clinical application prospect.<\/li><li>Ability to design, plan, analyze and troubleshoot IHC experiments.<br><\/li><\/ul><strong><u>About You<br><\/u><\/strong><ul><li>Have at least 5 years\\u2019 experience in using IHC automation and troubleshooting of IHC.<\/li><li>Have at least 2 years of experience in an image analysis platform with experience in writing image analysis algorithms from first principles.<\/li><li>Experience in using Artificial Intelligence in pathology tissue recognition would be highly desirable.<\/li><li>Have both histologic and pathological education and ability to recognise different tumour and normal human tissues. Experience in mouse pathology is desirable.<\/li><li>PhD. degree in biology and PhD. in human or animal medicine preferred. Education abroad highly desirable.<\/li><li>Experience in aligned applications to IHC, such WB, ICC, IF, IP and Flow would be desirable.<\/li><li>Excellent communication (both English and Chinese).<\/li><li> Independent learner and able to adapt to a fast-paced working environment. <br><\/li><\/ul>If this sounds like you and you\\u2019d like to be a part of a fast-paced, growing business with the vision to become the most influential company and best-loved brand in life sciences, please apply now!<br><br>Pay and Benefits<br><br>In addition to competitive salaries, we offer an attractive and flexible benefits package, a culture focused on well-being and opportunities for growth and development, and a highly flexible working environment.<br><br><strong><u>About Us<br><br><\/u><\/strong>An idea conceived in a University of Cambridge laboratory in 1998, Abcam plc (www.abcamplc.com) began life as an innovative and entrepreneurial start-up, spearheaded by like-minded individuals who shared a common purpose of providing the scientific community with quality antibody reagents, as well as trustworthy and up-to-date information about their uses and limitations. Abcam has now grown to become a leading supplier of protein research tools to life scientists, whilst always maintaining the core collaborative values assumed at its inception.<br><br>Abcam now supports life science researchers in their quest to understand the cause of disease and ultimately offer improvements to diagnoses and treatments. To achieve this\\u202foutcome,\\u202fthe company\\u202fboth develops and manufactures its own products in specialist facilities across the globe,\\u202fand\\u202fsources\\u202ffrom over 400 partners, offering scientists the newest, most innovative and highest quality research tools available globally, regardless of source. With a customer base of research scientists who require high performance products with detailed technical specifications, 64% of global researchers use Abcam products.\\u202f<br><br>Inclusion &amp; Diversity<br><br>Abcam is an Equal Opportunity Employer and makes all employment decisions without regard to age, national origin, race, ethnicity, religion, creed, gender, sexual orientation, disability, veteran status, or any other characteristic protected by law.<br><br><strong>Primary Location<br><br><\/strong>CN-CN-Hangzhou<br><br><strong>Work Locations<br><br><\/strong>Hangzhou<br><br><strong>Job<br><br><\/strong>Research and Development<br><br><strong>Organization<br><br><\/strong>Hangzhou<br><br><strong>Schedule<br><br><\/strong>Regular<br><br><strong>Shift<br><br><\/strong>Standard<br><br><strong>Job Type<br><br><\/strong>Full-time<br><br><strong>Travel<br><br><\/strong>No<br><br><strong>Job Posting<br><br><\/strong>Aug 31, 2021, 4:01:25 AM<br><br>\"}"
}