{
    "id":"Kaggle::techmap::6144769369db0c5bd595de6a::linkedin_ni::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" We're looking for someone who genuinely loves to help and care for people. A Care Provider is responsible for remotely monitoring the vital signs of patients who are using our devices such as blood pressure cuffs, glucometers, etc., and to facilitate the handoff to Level 2 Care Managers when action needs to be taken with patients whose vital signs fall outside of normal limits. This is a Bilingual role. You must be a fluent speaker of the English and Spanish Language. Please do not apply if you cannot speak both. Job Responsibilities. Responsible for ensuring the successful on-boarding of new providers and patients as they implement Care Management and Transitional Care Management Programs. Ability to use good clinical judgment, critical thinking skills, and to interpret\/adapt\/apply guidelines and protocols. Contact clients to learn about and address their needs, complaints, or other issues with the service while anticipating to also handle calls from customers. Provide appropriate solutions and alternatives in a timely manner. Follow up to ensure resolution. Keep records of customer interactions, process customer accounts, and file documents. Follow communication procedures, guidelines, and policies. Required Skills and Experience. At least a year of customer support experience. Impeccable English in written and verbal skills. Impeccable Spanish written and verbal skills. Strong phone contact handling skills and active listening. Customer orientation and ability to adapt\/respond to different types of characters. Ability to multitask, prioritize, and manage time effectively. System Requirements. Stable Audio, Video, and Internet Connection. At least 15mbps main internet and at least 10mbps for back-up (NO DATA CAPPING). A desktop or laptop that has an i5 processor and at least 4 GB RAM with a webcam. Noise-canceling USB Headset. Quiet, Dedicated Home Office. Smartphone. This is a Bilingual role. You must be a fluent speaker of the English and Spanish Language. Please do not apply if you cannot speak both.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144769369db0c5bd595de6a::linkedin_ni\", \"source\": \"linkedin_ni\", \"country\": \"NI\", \"company\": \"CrewBloom\", \"position\": \"Spanish Care Provider (USRN)\", \"notes\": \"\", \"original\": \"<p>We're looking for someone who genuinely loves to help and care for people.<\/p><p><br><\/p><p>A Care Provider is responsible for remotely monitoring the vital&nbsp;signs of patients who&nbsp;are using our devices such as blood pressure cuffs,&nbsp;glucometers, etc., and to facilitate the handoff to Level 2 Care Managers when action needs to be taken with patients whose vital signs fall outside of normal limits.<\/p><p><br><\/p><p>This is a Bilingual role. You must be a fluent speaker of the English and Spanish Language. Please do not apply if you cannot speak both.<\/p><p><strong>Job Responsibilities<\/strong><\/p><ul><li>Responsible for ensuring the successful on-boarding of new providers and patients as they implement Care Management and Transitional Care Management Programs<\/li><li>Ability to use good clinical judgment, critical thinking skills, and to interpret\/adapt\/apply guidelines and protocols<\/li><li>Contact clients to learn about and address their needs, complaints, or other issues with the service while anticipating to also handle calls from customers<\/li><li>Provide appropriate solutions and alternatives in a timely manner; follow up to ensure resolution<\/li><li>Keep records of customer interactions, process customer accounts, and file documents<\/li><li>Follow communication procedures, guidelines, and policies<\/li><\/ul><p><br><\/p><p><strong>Required Skills and Experience<\/strong><\/p><ul><li>At least a year of customer support experience<\/li><li>Impeccable English in written and verbal skills<\/li><li>Impeccable Spanish written and verbal skills<\/li><li>Strong phone contact handling skills and active listening<\/li><li>Customer orientation and ability to adapt\/respond to different types of characters<\/li><li>Ability to multitask, prioritize, and manage time effectively<\/li><\/ul><p><br><\/p><p><strong>System Requirements<\/strong><\/p><ul><li>Stable Audio, Video, and Internet Connection<\/li><li>At least 15mbps main internet and at least 10mbps for back-up (NO DATA CAPPING)<\/li><li>A desktop or laptop that has an i5 processor and at least 4 GB RAM with a webcam<\/li><li>Noise-canceling USB Headset<\/li><li>Quiet, Dedicated Home Office<\/li><li>Smartphone<\/li><\/ul><p><br><\/p><p>This is a Bilingual role. You must be a fluent speaker of the English and Spanish Language. Please do not apply if you cannot speak both.<\/p>\"}"
}