{
    "id":"Kaggle::techmap::613ab7bb4243ab478df4c20d::careerbuilder_uk::1",
    "label_age":false,
    "analysis_age":"The term \"Tesco will only recruit individuals who have passed the school leavers age\" is a legal requirement to ensure compliance with labour laws, and does not inherently introduce age bias, as it is focused on legal working age limits rather than favouring a particular age group.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 28 days annual leave (including bank holidays) pro rata. Uniform provided. Deals & Discounts through Tesco including Tesco Mobile & Tesco Bank. Deals and Discounts through many other external businesses. The Tesco Retirement Savings Plan  save between 4% and 7.5%, and Tesco will match your contribution. Life Assurance. 5 x contractual pay. Share Schemes  Join Buy As You Earn after 3 months, and Save As You Earn after 1 year. Career development opportunities including apprenticeships and internal development schemes. About us. Our vision here at Tesco is to become every customer's favourite way to shop, whether they are at home or out on the move. Our core purpose is Serving Britain's shoppers a little better every day. Our business was built with a simple mission  to be the champion for customers, helping them to enjoy a better quality of life and an easier way of living. This hasn't changed. Customers want great products at great value which they can buy easily and it's our job to deliver this in the right way for them. In the UK, we serve some 66 shoppers every second, so it's our goal to ensure every one of those customers experiences just a little better service on each visit. At Tesco, inclusion means that Everyones Welcome. Everyone is treated fairly and with respect. By valuing individuality and uniqueness we create a sense of belonging. Diversity and inclusion have always been at the heart of Tesco. It is embedded in our values: we treat people how they want to be treated. We always want our colleagues to feel they can be themselves at work and we are committed to helping them be at their best. Across the Tesco group we are building an inclusive workplace, a place to actively celebrate the cultures, personalities and preferences of our colleagues  who in turn help to build the success of our business and reflect the diversity of the communities we serve. Please note. Tesco will only recruit individuals who have passed the school leavers age. To find out the school leavers age for your country please visit the following link. [Link available when viewing the job] can only accept candidates over the age of 18 if the role requires working before 6:15 am or after 9:45 pm or involves working in areas such as the warehouse, beers, wines & spirits, counters, bakery and driving roles.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613ab7bb4243ab478df4c20d::careerbuilder_uk\", \"source\": \"careerbuilder_uk\", \"country\": \"UK\", \"company\": \"Tesco\", \"position\": \"Customer Delivery Driver\", \"notes\": \"\", \"original\": \"<br \/><br \/><b>About the role<\/b><br \/><br \/> <div> <br \/><br \/><b>Shift pattern<\/b><br \/><br \/>  Days From time To time    Mon 06:30:00 11:45:00   Tue 07:30:00 17:45:00   Thu 12:30:00 23:15:00   Fri 12:30:00 23:15:00   Sat 05:15:00 10:45:00  <br \/><p><b>\\u201cA job where you're in the driving seat.\\u201d<\/b><\/p><p>As the face of Tesco out on the road, our Customer Delivery Drivers get the opportunity to meet and talk to different customers in their homes every day. That\\u2019s why this role is about much more than just driving: it's about helping others and delivering great service, with a smile.<\/p><p>Being a Customer Delivery Driver its hands on, and full of variety. No two shifts are ever the alike \\u2013 customer\\u2019s look for help in all kinds of different ways.<\/p><p>For most of the day you\\u2019ll feel like your own boss, delivering to your customers but with a team of managers and colleagues back at the centre ready to support you when you need them.<\/p><p>You\\u2019ll meet great people, learn new things and be part of a specialist, diverse team where everyone is welcome.<\/p><p>Whether you are looking for stability or flexibility to suit your lifestyle, or the opportunity to progress your career, this can be the role for you.<\/p><br \/><br \/><b><b>Shift Pattern:<\/b> Various shifts available<\/b><br \/><br \/> <\/div> <br \/><br \/><b>You will be responsible for<\/b><br \/><br \/> <div> <ul><li>To serve your customer\\u2019s with a smile & look after their deliveries as if they were your own<\/li><li>Load your van where required and do regular checks to make sure it\\u2019s road worthy<\/li><li>Represent the Tesco brand whilst on the UK roads.<\/li><li>Drive safely, responsibly and within the law.<\/li><\/ul> <\/div> <br \/><br \/><b>You will need<\/b><br \/><br \/> <div> <ul><li>Passionate about delivering great customer service<\/li><li>Friendly, approachable and reliable<\/li><li>Able to adapt to working in a fast paced, constantly evolving environment<\/li><li>Able to adhere to the GB Domestic Driving Rules<\/li><li>Calm under pressure<\/li><li>A UK\/EU\/EEA Driving licence (Full or Automatic only) for at least 12 months with no more than 3 penalty points.<\/li><\/ul><p><\/p><p><strong><b>Should you be successful in your application, your offer will be subject to and conditional upon you providing your bank account details before your agreed start date.<\/b><\/strong><\/p> <\/div> <br \/><br \/><b>What\\u2019s in it for you<\/b><br \/><br \/> <div> <p><strong>As a colleague<\/strong>\\u00a0<strong>at Tesco we offer excellent benefits and rewards.<\/strong><\/p><p><strong>You will enjoy but aren\\u2019t limited to:<\/strong><\/p><ul><li>Colleague Discount Card (including a 2nd card for a family member) after 6 months service with 10% off most purchases at Tesco.<\/li><li>10% discount at One Stop and 25% discount at Tesco Caf\\u00e9<\/li><li>28 days annual leave (including bank holidays) pro rata<\/li><li>Uniform provided<\/li><li>Deals & Discounts through Tesco including Tesco Mobile & Tesco Bank<\/li><li>Deals and Discounts through many other external businesses<\/li><li>The Tesco Retirement Savings Plan \\u2013 save between 4% and 7.5%, and Tesco will match your contribution<\/li><li>Life\\u00a0 Assurance - 5 x contractual pay<\/li><li>Share Schemes \\u2013 Join \\u2018Buy As You Earn\\u2019 after 3 months, and \\u2018Save As You Earn\\u2019 after 1 year<\/li><li>Career development opportunities including apprenticeships and internal development schemes<\/li><\/ul> <\/div> <br \/><br \/><b>About us<\/b><br \/><br \/> <div> <p>Our vision here at Tesco is to become every customer's favourite way to shop, whether they are at home or out on the move. Our core purpose is \\u2018Serving Britain's shoppers a little better every day\\u2019. Our business was built with a simple mission \\u2013 to be the champion for customers, helping them to enjoy a better quality of life and an easier way of living. This hasn't changed. Customers want great products at great value which they can buy easily and it's our job to deliver this in the right way for them. In the UK, we serve some 66 shoppers every second, so it's our goal to ensure every one of those customers experiences just a little better service on each visit.<\/p><p><\/p><p>At Tesco, inclusion means that Everyone\\u2019s Welcome. Everyone is treated fairly and with respect; by valuing individuality and uniqueness we create a sense of belonging. Diversity and inclusion have always been at the heart of Tesco. It is embedded in our values: we treat people how they want to be treated. We always want our colleagues to feel they can be themselves at work and we are committed to helping them be at their best. Across the Tesco group we are building an inclusive workplace, a place to actively celebrate the cultures, personalities and preferences of our colleagues \\u2013 who in turn help to build the success of our business and reflect the diversity of the communities we serve.<\/p><p><\/p><p><strong><u>Please note<\/u><\/strong><\/p><p>Tesco will only recruit individuals who have passed the school leaver\\u2019s age.\\u00a0 To find out the school leavers age for your country please visit the following link; [Link available when viewing the job] can only accept candidates over the age of 18 if the role requires working before 6:15 am or after 9:45 pm or involves working in areas such as the warehouse, beers, wines & spirits, counters, bakery and driving roles.<\/p><p><\/p><p>On the occasions where we have high volumes of applicants, some roles may close earlier than the advertised end date in order for us to manage all of the applicants appropriately. We will only be able to offer individual feedback to those candidates who attend an interview.<\/p><p><\/p><p>For more information about us please visit www.tescoplc.com<\/p> <\/div>&nbsp;\"}"
}