{
    "id":"Kaggle::techmap::614aed6fa8cb401dbcc895bd::linkedin_pt::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The requirement for \"fluent in English\" can disadvantage candidates whose first language is not English, potentially favouring native English speakers and excluding those who may have varying degrees of proficiency.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2 years of experience in external audit on \"Big FourFluent english speaker. About Our Client. Multinational company, leader in its sector. Job Description. Review the accuracy of the information collected from different countries and analyze any discrepancies. Analyze balances' variances, P&L, and provide support in the financial statements' disclosures. Provide explanations and analytical review of group results. Perform reconciliation of intercompany and third-party balances and transactions. Perform monthly closing journal entries and accruals. Assist the consolidation process including the recording of consolidating entries. Provide support in the implementation of new IFRS standards. The Successful Applicant. Degree in management, economics or similar areas. 2 years of experience in external audit on \"Big Four\", with good knowledge of IFRS. Fluent in English (mandatory), knowledge of Spanish is a plus. Knowledge of Microsoft Dynamics NAV and SAP will be a plus. Drive for results, with a proactive attitude and focus on problem solving. Good team player, able to interact with different departaments accross the company. Dynamic, with high sense of responsibility and autonomy. What's On Offer. A good career opportunity. Contact: Caroline Alberto. Quote job ref: JN-072021-2939367.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614aed6fa8cb401dbcc895bd::linkedin_pt\", \"source\": \"linkedin_pt\", \"country\": \"PT\", \"company\": \"Michael Page\", \"position\": \"Junior Consolidation Specialist\", \"notes\": \"\", \"original\": \"<ul><li>2 years of experience in external audit on \\\"Big Four\\\"|Fluent english speaker<br><br><\/li><\/ul><strong>About Our Client<br><br><\/strong>Multinational company, leader in its sector.<br><br><strong>Job Description<br><br><\/strong><ul><li>Review the accuracy of the information collected from different countries and analyze any discrepancies<\/li><li>Analyze balances' variances, P&amp;L, and provide support in the financial statements' disclosures<\/li><li>Provide explanations and analytical review of group results<\/li><li>Perform reconciliation of intercompany and third-party balances and transactions<\/li><li>Perform monthly closing journal entries and accruals<\/li><li>Assist the consolidation process including the recording of consolidating entries<\/li><li>Provide support in the implementation of new IFRS standards<br><br><\/li><\/ul><strong>The Successful Applicant<br><br><\/strong><ul><li>Degree in management, economics or similar areas<\/li><li>2 years of experience in external audit on \\\"Big Four\\\", with good knowledge of IFRS<\/li><li>Fluent in English (mandatory), knowledge of Spanish is a plus<\/li><li>Knowledge of Microsoft Dynamics NAV and SAP will be a plus<\/li><li>Drive for results, with a proactive attitude and focus on problem solving <\/li><li>Good team player, able to interact with different departaments accross the company<\/li><li>Dynamic, with high sense of responsibility and autonomy<br><br><\/li><\/ul><strong>What's On Offer<br><br><\/strong>A good career opportunity.<br><br><strong>Contact: Caroline Alberto<br><br><\/strong><strong>Quote job ref: JN-072021-2939367<\/strong>\"}"
}