{
    "id":"Kaggle::techmap::6144cd70f35b480ec1a8746e::britishjobs_uk::14",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Multiverse is a tech startup on a mission. We’re tearing down a broken system and building an outstanding alternative to university and corporate training. Our professional apprenticeships open up many career opportunities for young adults and those looking to upskill – all while helping businesses embrace digital transformation and build a truly diverse talent pipeline. At Multiverse, we measure potential beyond academic results. Working closely with community partners, we can reach candidates from underrepresented backgrounds – building a route to boardroom for a diverse group of future leaders. Already one of the fastest growing startups in Europe, we recently landed in the US too. Now working with more than 300 companies – including Facebook, Morgan Stanley and Microsoft – we’re looking for fresh talent to take us to the next level. Here, you’ll be part of something bigger. Unlocking opportunities for all, you’ll help solve some of society’s most pressing issues, be empowered by those around you, and never stop growing your skills. Requirements. We are looking for a Digital Business Coach to deliver our apprenticeship for early career talent entering a new role in the professional world and becoming the next generation of future leaders. You would be coaching, teaching and facilitating learning experiences and supporting your apprentices to master core skills so that they can become rock stars in their workplace. Our programme’s tagline is ‘business fundamentals for a digital world’ and is about empowering young career talent to develop the workplace skills to be excellent business professionals whilst also learning how to use data and insight which is crucial to thrive and add value in this increasingly digital world. Your role will be a mixture of delivering one to one coaching sessions and facilitating taught workshops to support apprentices with their business and data skills development. Programme Overview. The Digital Business Accelerator Programme is a 13 month apprenticeship aimed at 16-25 year olds looking to begin their career in the professional world. The programme is designed to enable apprentices to develop professional workplace skills whilst also learning how to use data to improve their role. The course is delivered through a series of 11 modules and monthly coaching sessions and is focused on applied learning to build core workplace skills, data skills and workplace confidence. apprentices will be assessed on. Why join the Team. You will be joining a passionate, dynamic and rapidly growing team made up of unique individuals from a range of sectors.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144cd70f35b480ec1a8746e::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Multiverse\", \"position\": \"Digital Business Coach\", \"notes\": \"\", \"original\": \"Multiverse is a tech startup on a mission. We&rsquo;re tearing down a broken system and building an outstanding alternative to university and corporate training.<br><br>Our professional apprenticeships open up many career opportunities for young adults and those looking to upskill &ndash; all while helping businesses embrace digital transformation and build a truly diverse talent pipeline.<br><br>At Multiverse, we measure potential beyond academic results. Working closely with community partners, we can reach candidates from underrepresented backgrounds &ndash; building a route to boardroom for a diverse group of future leaders.<br><br>Already one of the fastest growing startups in Europe, we recently landed in the US too. Now working with more than 300 companies &ndash; including Facebook, Morgan Stanley and Microsoft &ndash; we&rsquo;re looking for fresh talent to take us to the next level.<br><br>Here, you&rsquo;ll be part of something bigger. Unlocking opportunities for all, you&rsquo;ll help solve some of society&rsquo;s most pressing issues, be empowered by those around you, and never stop growing your skills.<br><br>Requirements<br><br>We are looking for a Digital Business Coach to deliver our apprenticeship for early career talent entering a new role in the professional world and becoming the next generation of future leaders. You would be coaching, teaching and facilitating learning experiences and supporting your apprentices to master core skills so that they can become rock stars in their workplace. <br><br> Our programme&rsquo;s tagline is &lsquo;business fundamentals for a digital world&rsquo; and is about empowering young career talent to develop the workplace skills to be excellent business professionals whilst also learning how to use data and insight which is crucial to thrive and add value in this increasingly digital world.<br><br> As a Digital Business Coach, you will be responsible for your own cohort of apprentices, ensuring they develop into successful professionals. Your role will be a mixture of delivering one to one coaching sessions and facilitating taught workshops to support apprentices with their business and data skills development.<br><br> Programme Overview<br><br>The Digital Business Accelerator Programme is a 13 month apprenticeship aimed at 16-25 year olds looking to begin their career in the professional world. <br><br> The programme is designed to enable apprentices to develop professional workplace skills whilst also learning how to use data to improve their role.<br><br> The course is delivered through a series of 11 modules and monthly coaching  sessions and is focused on applied learning to build core workplace skills, data skills and workplace confidence - apprentices will be assessed on .<br><br>  Why join the Team<br><br>You will be joining a passionate, dynamic and rapidly growing team made up of unique individuals from a range of sectors. Our team is made up of teachers, coaches and business professionals, but we love anyone who has experience with and loves working with young talent on a one to one and group basis and has a passion for using data to drive decision making.<br><br> You will be surrounded by a group of coaches with distinctive skills and interests that promote knowledge sharing and supporting each other. The team is brought together by a common vision that apprenticeships are THE solution and that apprenticeships are an outstanding alternative to university for young people to have successful careers. <br><br> What you bring<br><br>You have a desire to have a positive impact in developing others.<br><br> You have strong communication skills and are able to work effectively with stakeholders at all levels, from senior stakeholders to people at the start of their career.<br><br> You are passionate about delivering the best learning opportunities and supporting others on their development journey.<br><br> You have a proven track record in achieving outcomes and demonstrating success.<br><br> You are adaptable and patient, able to manage competing priorities and resolve issues with empathy and compassion.<br><br> You have a keen interest in using data and have experience in making data driven decisions. <br><br> You will have a willingness to upskill in data and learn Excel and PowerBI.<br><br>Who you are: <br><br>You might be a teacher, coach or youth worker who loves working with young talent and is looking for a new challenge<br><br> You might work in a business operations role and you want to share your experience with others. You will also have experience in tutoring or mentoring others,<br><br> You might have experience in using Excel and\/or PowerBI and are keen to teach others how to use these dynamic data tools. <br><br>Benefits<br><br>What&rsquo;s in it for you?<br><br>27 days holiday (3 days are used for our December company switch off)<br><br> 1 Life Event Day (can be for your birthday, moving house, getting a puppy...)<br><br> 1 Volunteer Day to support a charitable cause<br><br> Hybrid working model with monthly office visits to MV HQ in Baker Street, London<br><br> Private Medical Insurance with Bupa<br><br> Medical cash back scheme with Medicash<br><br> Life Insurance with YuLife<br><br> Cycle to work scheme<br><br> Spill, all in one mental health support<br><br> Employer pension contributions of 3% on capped pensionable earnings<br><br> Socials and more!!<br><br>Our commitment to inclusivity<br><br>We&rsquo;re an equal opportunities employer. And proud of it. Every applicant and employee is afforded the same opportunities regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. This will never change.<br><br>Covid-19 and hiring <br><br>As we navigate through this pandemic together, we want to reassure you that keeping candidates and our employees safe is of paramount importance to us. That&rsquo;s why the entire recruitment process will take place remotely, using phone and video calls (usually zoom). For successful candidates who end up being hired, we always ensure a safe, engaging and (for the time being) a remote onboarding experience. We also take care to make sure all of your equipment will be sent to you by courier, so you are ready for your first day.<br><br>Safeguarding<br><br>All posts in Multiverse involve some degree of responsibility for safeguarding. Successful applicants are required to complete a Disclosure Form from the Disclosure and Barring Service (&quot;DBS&quot;) for the position. Failure to declare any convictions (that are not subject to DBS filtering) may disqualify a candidate for appointment or result in summary dismissal if the discrepancy comes to light subsequently<br><br>\"}"
}