{
    "id":"Kaggle::techmap::6134c27a0d968e4ca67dcfa3::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" About Grace. We are the only private hospital in Tauranga, with seven theatres, an endoscopy suite and expanded services on the way. We offer a variety of surgical procedures to the wider Bay of Plenty community. With modern facilities, high utilisation rates, a quality service, supportive management and a collegial team this is a dynamic, fast paced environment where your nursing skills and scope can develop and your career will thrive. Grace Hospital is looking for an experienced registered nurse to join our dynamic post-operative elective surgery team. The applicant would need to be able to work in a fast paced environment, demonstrate problem solving ability, have high level attention to detail and be a good communicator. The successful applicant will have a minimum of 2 years experience in a NZ surgical hospital setting. This position is for a minimum of 16 hours per week (0.4 FTE) working rostered shifts, with the potential to increase to full time if desired. Grace provides a 24\/7 service with hours to suit the daily requirements of the hospital. Please apply including your CV and covering letter via SEEK. Application close Friday 1st October 2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6134c27a0d968e4ca67dcfa3::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Grace Hospital\", \"position\": \"Experienced Registered Nurse - Ward\", \"notes\": \"\", \"original\": \"<p><strong>About Grace<\/strong><\/p>  <p>We are the only private hospital in Tauranga, with seven theatres, an endoscopy suite and expanded services on the way.\\u00a0 We offer a variety of surgical procedures to the wider Bay of Plenty community. \\u00a0With modern facilities, high utilisation rates, a quality service, supportive management and a collegial team this is a dynamic, fast paced environment where your nursing skills and scope can develop and your career will thrive.<\/p>  <p>Grace Hospital is looking for\\u00a0an experienced registered nurse\\u00a0to join\\u00a0our dynamic post-operative\\u00a0elective surgery\\u00a0team.<\/p>  <p>The applicant would need to be able to work in\\u00a0a fast paced environment, demonstrate problem solving ability, have high level\\u00a0attention to detail and be a good communicator.<\/p>  <p>The successful applicant will have a minimum of 2\\u00a0years experience in a NZ surgical hospital setting.<\/p>  <p>This position is for\\u00a0a minimum of\\u00a016 hours per week (0.4\\u00a0FTE) working rostered shifts, with the potential to increase to\\u00a0full time if desired.<\/p>  <p>Grace provides a 24\/7 service with\\u00a0hours to suit the daily requirements of the hospital.<\/p>  <p>Please apply including your CV and covering letter via SEEK.<\/p>  <p>Application close Friday 1st October 2021.<\/p>  <p>\\u00a0<\/p>\"}"
}