{
    "id":"Kaggle::techmap::61447e4670d0ad15aec84f0f::linkedin_cr::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Some of the language is slightly masculine leaning - \"driven\", \"strong team-leading\"",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 5 years experience in commercial or public sector. BS\/BA degree or equivalent work experience combined with a minimum of 5. years relevant working experience in CRM applications, systems development, software support, and consulting. 3-5 years Microsoft Dynamics 365 implementation experience and holds applicable Dynamics 365 CE and Power Platform certifications. The ideal candidate will have an advanced level of knowledge in three or more of the following areas: Active Power Apps, Customer Insights, Power Automate, Directory, Web Services, XML Technologies, SQL,. NET Frameworks, C. Experienced in Dynamics CRM (functional consulting), has a successful history in requirements gathering, definition and validation. Job role experience as a consultant in a consulting practice, facilitating discovery workshops. Experience creating strong business cases supported by compelling value propositions. Performed business requirements gathering (to be model, as is model, etc. ) and experienced configuring Dynamics CRM module(s) including Sales, Service, and Marketing solutions. Assisted in definition and functional design of conversions and interfaces and functional experience in api usage. Integration development. Proven capability solutioning, estimating and implementing in mid to large complex solutions. Proven skills as team lead of presales and technical resources to respond to client opportunities. Presales experience on Dynamics 365 coupled with industry leading 3rd party ISV solutions is highly regarded. Proficiency in all Microsoft Office (O365) products. Personal Skills. Driven to continually improve your personal skills and improve both our clients business and their clients businesses. Fluency in English both written and verbal, 90% as a minimum. Strong team-leading skills including the ability to support other team members in achieving their objectives. A clear ability to organize your own time and resources. Effective and clear written communication skills. Effective communication with senior management as well as junior staff at our clients. Work environment. Position is located in Heredia, Costa Rica. Post Covid, candidate is required to work onsite. Position requires costarrican citizenship or work permit \"free of condition\". We are not able to sponsor visa nor citizenship.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61447e4670d0ad15aec84f0f::linkedin_cr\", \"source\": \"linkedin_cr\", \"country\": \"CR\", \"company\": \"DXC Technology\", \"position\": \"Senior Dynamics D365 For Sale, Customer and Field Service\", \"notes\": \"\", \"original\": \"The Americas Microsoft Business Applications practice within DXC Technology delivers Microsoft Dynamics and Power Platform enabled solutions enhanced with our industry differentiating expertise and IP. Our cloud-based implementations help enterprise and mid-market companies accelerate digital transformation, solve business challenges, and deliver intelligent solutions that make a difference for their customers and employees.<br><br>Make DXC Technology a valuable stepping stone in your Microsoft Dynamics career path, giving you experience with interesting technology challenges and the opportunity to help solve them, a variety of clients, and an amazing Microsoft Partnership that enables you to grow your portfolio of expertise as a professional in this area. Be the expert you want to be!<br><br><strong>Career Opportunity<br><\/strong>As a Presales Solution Architect for the Dynamics 365 CE practice, you will be based in the North American market and have a key role to play in the continuing the growth and development of the DXC Eclipse business.<br><br>You are responsible for designing and presenting and estimating the delivery of Dynamics 365 CE solutions in the Americas region. This is a very important role at DXC Eclipse that requires someone with strong business acumen and product knowledge.<br><br>Working in both a consulting and a presales capacity with the Microsoft Dynamics 365 practice, you will be responsible for supporting the sales process and working with the delivery practice to obtain approvals while fostering an ongoing relationship within our customer base.<br><br>This is a great opportunity to join a market leader, can work on varied projects, and make a large impact on a successful, growing business.<br><br><strong><u>Key Responsibilities<br><\/u><\/strong><ul><li>Customer facing D365 consultant and presales expert<\/li><li>Work with the sales team to identify, qualify, research and validate opportunities<\/li><li>Drive key customer meetings and workshops to achieve the outcomes within the deadline<\/li><li>Consults on governance, strategy and transformation not just operations<\/li><li>Analysing customer business needs<\/li><li>Assisting with RFP responses, development of tailored Solution Maps and other related documents<\/li><li>Identify and design solutions that meet the customers\\u2019 requirements<\/li><li>Prepare and perform D365 for Sales, Customer and Filed Service product demonstrations to business and technical audiences<\/li><li>Providing technical and functional direction and input during the sales cycle<\/li><li>Provide estimates for project delivery<\/li><li>Assist in developing project delivery plans<\/li><li>Build ongoing relationship with customer prospects<\/li><li>Assist in refining implementation methodologies and strategies<\/li><li>Assist in making sure the D365 practice financial targets are met<br><br><\/li><\/ul><strong><u>Education And Experience Required<br><\/u><\/strong><ul><li>5+ years\\u2019 experience in commercial or public sector.<\/li><li>BS\/BA degree or equivalent work experience combined with a minimum of 5+ years relevant working experience in CRM applications, systems development, software support, and consulting.<\/li><li>3-5 years Microsoft Dynamics 365 implementation experience and holds applicable Dynamics 365 CE and Power Platform certifications.<\/li><li>The ideal candidate will have an advanced level of knowledge in three or more of the following areas: Active Power Apps, Customer Insights, Power Automate, Directory, Web Services, XML Technologies, SQL, .NET Frameworks, C#.<\/li><li>Experienced in Dynamics CRM (functional consulting), has a successful history in requirements gathering, definition and validation.<\/li><li>Job role experience as a consultant in a consulting practice, facilitating discovery workshops.<\/li><li>Experience creating strong business cases supported by compelling value propositions<\/li><li>Performed business requirements gathering (to be model, as is model, etc.) and experienced configuring Dynamics CRM module(s) including Sales, Service, and Marketing solutions.<\/li><li>Assisted in definition and functional design of conversions and interfaces and functional experience in api usage; integration development<\/li><li>Proven capability solutioning, estimating and implementing in mid to large complex solutions<\/li><li>Proven skills as team lead of presales and technical resources to respond to client opportunities<\/li><li>Presales experience on Dynamics 365 coupled with industry leading 3rd party ISV solutions is highly regarded.<\/li><li>Proficiency in all Microsoft Office (O365) products<br><br><\/li><\/ul><strong><u>Personal Skills<br><\/u><\/strong><ul><li>Driven to continually improve your personal skills and improve both our client\\u2019s business and their clients\\u2019 businesses<\/li><li>Fluency in English both written and verbal, 90% as a minimum<\/li><li>Strong team-leading skills including the ability to support other team members in achieving their objectives<\/li><li>A clear ability to organize your own time and resources<\/li><li>Effective and clear written communication skills<\/li><li>Effective communication with senior management as well as junior staff at our clients<br><br><\/li><\/ul>Work environment<br><ul><li>Position is located in Heredia, Costa Rica<\/li><li>Post Covid, candidate is required to work onsite<\/li><li>Position requires costarrican citizenship or work permit \\\"free of condition\\\". We are not able to sponsor visa nor citizenship<\/li><\/ul>\"}"
}