{
    "id":"Kaggle::techmap::615382bf2bdd6c5bf8569e42::xing_de::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The use of the term \"compassionate,\" the emphasis on providing \"holistic advocacy services,\" and the focus on building \"support networks\" subtly favor female candidates, as these responsibilities resonate more with female applicants due to their nurturing and collaborative nature.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 360 Communities is a growing and innovative nonprofit f ounded in 1970 by a group of volunteers providing services to more than 16, 000 people annually in over 40 locations in Dakota County, Minnesota. Holistic services include a network of five food shelves, two family resource centers, two domestic and sexual violence shelters, and two programs that support school success from birth to high school graduation. Our staff and volunteers work with the community and strive to fulfill our mission daily. 360 Communities mission is: \"360 Communities delivers safety and stability that improves lives. Position Overview : 360 Communities is seeking a compassionate and innovative team member to provide direct service to victims of domestic and sexual violence and act as a liaison between 360 Communities advocacy services and other professionals and resources in the community. Outreach Advocates work primarily out of a police department and\/or other community spaces. This position requires bilingual Spanish and English language skills. Position Type : Full-time, 40 hours per week, may include some nights and weekends, non-exempt. Locations : West St. Paul, MN and Inver Grove Heights, MN. Essential Duties and Responsibilities. Demonstrate commitment to the agencys mission statement and core values at all times. Provide holistic advocacy services and resources including safety planning, child\/adult education, community connections\/resources, housing, financial, legal (excluding legal advice), building support networks and other services\/resources as apparent. Exhibit knowledge of the uniqueness and complexities that are associated with providing culturally specific case management. Coordinate volunteers to attend court hearings with clients and manage court calendar, and attend court hearings as needed. Initiate follow up with victims for ongoing case management. Respond to the hospital for domestic and sexual assault exams during scheduled work times, and\/or as directed by the supervisor. Develop and maintain strong working relationships with all community partners and provide training\/education and feedback to improve response to victims including information specific to the Hispanic community. This also includes working with the Outreach Services Supervisor to address issues and trends to the larger Coordinated Community Response Group. Work alongside supervisors and Community Educator to represent 360 communities at events and presentations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615382bf2bdd6c5bf8569e42::xing_de\", \"source\": \"xing_de\", \"country\": \"DE\", \"company\": \"CommunitySEO\", \"position\": \"Outreach Advocate - Bilingual English and Spanish\", \"notes\": \"\", \"original\": \"<div><div><div><div><div><div>\\n<p><i>\\n 360 Communities is a growing and innovative nonprofit\\n <\/i>\\n f\\n <i>\\n ounded in 1970 by a group of volunteers providing services to more than 16,000 people annually in over 40 locations in Dakota County, Minnesota. Holistic services include a network of five food shelves, two family resource centers, two domestic and sexual violence shelters, and two programs that support school success from birth to high school graduation.\\n <\/i><\/p>\\n<p><i>\\n Our staff and volunteers work with the community and strive to fulfill our mission daily. 360 Communities mission is: \\\"360 Communities delivers safety and stability that improves lives\\u201d. \\n <\/i><\/p>\\n<p><b><u>\\n Position Overview\\n <\/u><\/b><u>\\n :\\n <\/u><\/p>\\n<p>\\n 360 Communities is seeking a compassionate and innovative team member to provide direct service to victims of domestic and sexual violence and act as a liaison between 360 Communities advocacy services and other professionals and resources in the community. Outreach Advocates work primarily out of a police department and\/or other community spaces.\\n <\/p>\\n<p><b><i>\\n This position requires bilingual Spanish and English language skills.\\n <\/i><\/b><\/p>\\n<p><b><u>\\n Position Type\\n <\/u><\/b><u>\\n :\\n <\/u>\\n Full-time, 40 hours per week, may include some nights and weekends, non-exempt\\n <\/p>\\n<p><b><u>\\n Locations\\n <\/u><\/b><u>\\n :\\n <\/u>\\n West St. Paul, MN and Inver Grove Heights, MN\\n <\/p>\\n<p><b>\\n Essential Duties and Responsibilities\\n <\/b><\/p>\\n<p>\\n 1. Demonstrate commitment to the agency\\u2019s mission statement and core values at all times. \\n <\/p>\\n<p>\\n 2. Provide holistic advocacy services and resources including safety planning, child\/adult education, community connections\/resources, housing, financial, legal (excluding legal advice), building support networks and other services\/resources as apparent.\\n <\/p>\\n<p>\\n 3. Exhibit knowledge of the uniqueness and complexities that are associated with providing culturally specific case management.\\n <\/p>\\n<p>\\n 4. Coordinate volunteers to attend court hearings with clients and manage court calendar, and attend court hearings as needed\\n <\/p>\\n<p>\\n 5. Initiate follow up with victims for ongoing case management.\\n <\/p>\\n<p>\\n 6. Respond to the hospital for domestic and sexual assault exams during scheduled work times, and\/or as directed by the supervisor.\\n <\/p>\\n<p>\\n 7. Develop and maintain strong working relationships with all community partners and provide training\/education and feedback to improve response to victims including information specific to the Hispanic community. This also includes working with the Outreach Services Supervisor to address issues and trends to the larger Coordinated Community Response Group.\\n <\/p>\\n<p>\\n 8. Work alongside supervisors and Community Educator to represent 360 communities at events and presentations; this may include presenting to large and small group such as local law enforcement, criminal justice professionals, social service providers, faith communities, medical facilities, and other community partners to ensure effective victim centered response to domestic violence, sexual assault, and\/or child abuse and neglect. \\n <\/p>\\n<p>\\n 9. Assist Community Educator with prevention education curriculum that is focused on youth\/students at local schools and connect with youth who disclose they need help.\\n <\/p>\\n<p>\\n 10. Arrange appointments and accompany clients as necessary.\\n <\/p>\\n<p>\\n 11. Maintain accurate logs and data for statistical purposes including program evaluation data.\\n <\/p>\\n<p>\\n 12. Attend and participate in staff meetings.\\n <\/p>\\n<p>\\n 13. Assist in shelter as directed or necessary.\\n <\/p>\\n<p>\\n 14. Pursue training opportunities for ongoing professional development and to stay up to date on trends related to the work.\\n <\/p>\\n<p>\\n 15. Perform other duties and assume other responsibilities as the need is apparent or as requested or delegated by supervisor.\\n <\/p>\\n<p><b>\\n Qualifications \\n <\/b><\/p>\\n<p><i>\\n Education and\/or Experience \\n <span data-bptag=\\\"start_jd\\\"><\/span><\/i><\/p>\\n<ul>\\n<li>\\n Bilingual in Spanish and English languages required\\n <\/li>\\n<li>\\n 1-2 years related experience working with victims of domestic and sexual violence\\n <\/li>\\n<li>\\n Bachelor\\u2019s degree preferred, but experience in lieu of degree will be considered\\n <\/li>\\n<li>\\n Knowledge of legal advocacy\\n <\/li>\\n<li>\\n Completion of 40-hour sexual assault training preferred, but will assist in obtaining\\n <\/li>\\n<\/ul>\\n<p>\\n \\u00b7 Experience being self-directed, motivated and ability to demonstrate non-judgmental professional decision-making skills. \\n <\/p>\\n<p>\\n \\u00b7 Experience with socially, economically and culturally diverse populations\\n <\/p>\\n<p>\\n \\u00b7 Computer skills, including Microsoft Word, and use of database systems. \\n <\/p>\\n<p>\\n \\u00b7 Must be able to pass a background check\\n <\/p>\\n<p>\\n \\u00b7 Must have reliable transportation to provide mobile advocacy across service area\\n <\/p>\\n<p>\\n \\u00b7 Some outreach positions require employees to be the handler for victim support dogs\\n <\/p>\\n<p>\\n \\u00b7 An offer of employment is contingent upon the successful completion of a background check prior to employment.\\n <\/p>\\n<p><i>\\n Professional Abilities and Skills\\n <\/i><\/p>\\n<ul>\\n<li>\\n<b>\\n Interpersonal:\\n <\/b>\\n Work with integrity. Ability to maintain confidentiality. Understand and comply with professional ethics and standards of practice. Contribute to building positive team spirit and put success of team above own interests. Recognize accomplishments of other team members. Seek increased responsibilities. Look for and takes advantage of opportunities. Ask for and offers help when needed.\\n <\/li>\\n<li>\\n<b>\\n Work:\\n <\/b>\\n Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited direction may exist. Strive to continuously build knowledge and skills. Display original thinking and creativity. Include appropriate people in decision-making process. Adapt to changes, delays, or unexpected events in the work environment. Ability to keep accurate and complete work records. Support cost saving measures. Set and achieve challenging goals. Ability to provide supervision and coaching to support service volunteers. \\n <\/li>\\n<li>\\n<b>\\n Time Management:\\n <\/b>\\n Prioritize and plan work activities. Use time efficiently. Arrive punctually each workday; complete assigned tasks within required time frame.\\n <\/li>\\n<li>\\n<b>\\n Communication: \\n <\/b>\\n Speak clearly and persuasively in positive or negative situations; listen and get clarification. Present and interpret numerical data and written information effectively. \\n <\/li>\\n<li>\\n<b>\\n Leadership\\n <\/b>\\n : Exhibits confidence in self and others. Inspires respect, trust and motivates others to perform well and fulfill vision. Effectively influence actions and opinions of others. Accepts feedback from others. Provides vision and inspiration to peers and subordinates. Gives appropriate recognition to others. Displays passion and optimism. \\n <\/li>\\n<\/ul>\\n<p><i>\\n Certificates, Licenses, Registrations \\n <\/i><\/p>\\n<ul>\\n<li>\\n Must possess and maintain a valid Minnesota driver\\u2019s license.\\n <\/li>\\n<li>\\n Must possess Personal Auto Insurance limits of $100,000\/$300,000\/$100,000 or a combined single limit of $300,000.\\n <\/li>\\n<\/ul>\\n<p><span data-bptag=\\\"end_jd\\\"><\/span>\\n A complete job description can be requested by e-mailing HR@360communities.org.\\n <\/p>\\n<p><b><u>\\n How to Apply\\n <\/u><\/b><i><u>\\n :\\n <\/u><\/i>\\n An application is required and may be completed at our website: https:\/\/360communities.org\/about\/employment\/employment-application\/\\n <\/p>\\n<p><b><i>\\n 360 Communities values racial, ethnic and cultural diversity. We strongly encourage diverse candidates to apply.\\n <\/i><\/b><\/p>\\n<p><i>\\n 360 Communities is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, creed, religion, national origin, sex, sexual orientation, disability, age, marital status, familial status, membership or activity in a local human rights commission, or status with regard to public assistance, protected veteran status or any other characteristic protected by law.\\n <\/i><\/p>\\n<\/div><\/div><\/div><\/div><\/div><\/div>\\n<span data-version=\\\"1.2.0-x106\\\"><\/span>\"}"
}