{
    "id":"Kaggle::techmap::61508887681fda47d1a15dcf::linkedin_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" A current Food Handlers Permit is required. Passing applicable state and\/or federal criminal background checks are required. Tuberculosis (TB) test is required. Proof of legal permission to work in the United States is required. COVID-19 precautions. Personal protective equipment provided or required. Temperature screenings. Social distancing guidelines in place. Sanitizing, disinfecting, or cleaning procedures in place. Employment Type: Full Time. Years Experience: 3.5 years. Salary: $30, 000 - $40, 000 Annual. Bonus\/Commission: No. Show more Show less.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61508887681fda47d1a15dcf::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Greenbrier Academy for Girls\", \"position\": \"Greenbrier Academy for Girls hiring Head Chef Pence Springs, West Virginia, United States\", \"notes\": \"\", \"original\": \"<section class=\\\"show-more-less-html\\\" data-max-lines=\\\"5\\\"> \\n <div class=\\\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\\\">\\n   Greenbrier Academy for Girls is searching for a passionate and dependable full-time Head Chef\/Cook to join our team. Located in Pence Springs, West Virginia, Greenbrier Academy for Girls is an all-girls therapeutic boarding school with students aged 14-18. Our students come from all over the world to receive exceptional education and therapeutic services.\\n  <br>\\n  <br>Are you looking for a challenging and rewarding way to make a difference in the lives of young women and the community?\\n  <br>\\n  <br>Do you want more than a job? Do you want purpose?\\n  <br>\\n  <br><strong><u>Essential Functions<br><\/u><\/strong>\\n  <ul>\\n   <li>Prepares healthy and delicious food in a timely and quality manner; prepares food on-site in batches for quantities that are sufficient for the needs of that site\/school.<\/li>\\n   <li>Performs food preparation tasks according to planned menus and schedule; cooks food, prepared or from scratch for student nutrition programs that meet the mandated nutritional needs; prepares and serves foods according to company dietary guidelines; and works with Silica gluten-free.<\/li>\\n   <li>Create tasty and well-balanced menu options that highlight local ingredients, including seasons, marinates, cooks, tastes meats, fruits, vegetables, and other ingredients. Scales recipes to appropriate quantities need for the assigned site\/school.<\/li>\\n   <li>Perform food safety inspections to verify quantity, quality, and specifications of orders to meet preparation needs and comply with mandated health and food safety standards.<\/li>\\n   <li>Cleans and maintains equipment and food preparation and storage areas in a sanitary condition to meet mandated health standards; reports equipment needs and malfunctions.<\/li>\\n   <li>Plan and prepare food for special events such as parent workshops and education consultant visits, tours, and graduations.<\/li>\\n   <li>Manage a documented food budget, kitchen inventory, and storage, including requisition and purchasing sufficient food for meals and snacks.<br><\/li>\\n  <\/ul><em><strong>Necessary Knowledge<br><\/strong><\/em>\\n  <ul>\\n   <li>Federal, state, and local codes and regulations governing food handling and public nutrition services.<\/li>\\n   <li>Safety and sanitation practices for food preparation, distribution, and storage.<\/li>\\n   <li>Methods, materials, and practices of volume food preparation and inventory control.<br><\/li>\\n  <\/ul><em><strong>Physical Demands and Working Environment<br><br><\/strong><\/em>Work is performed in commercial foodservice and kitchen work environment; moderate physical requirements, with risk of burns and cuts; frequent lifting, carrying, and moving up to 50-pound containers of food preparation materials and equipment; may require working in a walk-in freezer.\\n  <br>\\n  <br><strong><u>Requirements<br><\/u><\/strong>\\n  <ul>\\n   <li>A High School Diploma or GED Certificate is required. A Culinary Arts Degree is preferred.<\/li>\\n   <li>Two or more years of prior experience in food preparation for large groups is required.<\/li>\\n   <li>A current Food Handler\\u2019s Permit is required.<\/li>\\n   <li>Passing applicable state and\/or federal criminal background checks are required.<\/li>\\n   <li>Tuberculosis (TB) test is required.<\/li>\\n   <li>Proof of legal permission to work in the United States is required.<br><\/li>\\n  <\/ul>COVID-19 precautions\\n  <br>\\n  <ul>\\n   <li>Personal protective equipment provided or required<\/li>\\n   <li>Temperature screenings<\/li>\\n   <li>Social distancing guidelines in place<\/li>\\n   <li>Sanitizing, disinfecting, or cleaning procedures in place<br><\/li>\\n  <\/ul>Employment Type: Full Time\\n  <br>\\n  <br>Years Experience: 3 - 5 years\\n  <br>\\n  <br>Salary: $30,000 - $40,000 Annual\\n  <br>\\n  <br>Bonus\/Commission: No\\n  <br>\\n  <br> \\n <\/div> <button class=\\\"show-more-less-html__button show-more-less-html__button--more\\\" data-tracking-control-name=\\\"public_jobs_show-more-html-btn\\\" aria-label=\\\"Show more, visually expands previously read content above this button\\\" aria-expanded=\\\"false\\\"> Show more \\n  <icon class=\\\"show-more-less-html__button-icon\\\" data-delayed-url=\\\"https:\/\/static-exp1.licdn.com\/sc\/h\/cyolgscd0imw2ldqppkrb84vo\\\"><\/icon> <\/button> <button class=\\\"show-more-less-html__button show-more-less-html__button--less\\\" data-tracking-control-name=\\\"public_jobs_show-less-html-btn\\\" aria-label=\\\"Show less\\\" aria-expanded=\\\"true\\\"> Show less \\n  <icon class=\\\"show-more-less-html__button-icon\\\" data-delayed-url=\\\"https:\/\/static-exp1.licdn.com\/sc\/h\/4chtt12k98xwnba1nimld2oyg\\\"><\/icon> <\/button> \\n<\/section>\"}"
}