{
    "id":"Kaggle::techmap::6147f76ebfeb2129040d1f0d::seek_au::0",
    "label_age":false,
    "analysis_age":"ChatGPT  The phrase \"1 news website under 40s\" simply describes the target demographic of the website's audience and does not imply any preference or discrimination against older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1 news website under 40s. 1.3 million Australians visit every day. Australias biggest social community. At Seven we are here to bring all Australians closer to the moments that move us - were first on the scene, with our finger on the pulse, on demand, in the moment. Together, were responsible for creating and sustaining authentic Australian engagement. A new and exciting opportunity has opened for a You. Tube Producer to join the 7NEWS. com. au team. Based at 7NEWS HQ at Martin Place, Sydney Youll be: Identifying appropriate content from 7NEWS programs and uploading it to YouTube. Producing main media images for You. Tube content. Writing SEO headlines and descriptions for videos. Working with senior producers to create bespoke You. Tube content. Required to work weekends. We are looking for someone who: Has experience in a fast-paced breaking news environment. Can identify trends via You. Tube analytics. Has an understanding of You. Tube and You. Tube studio. Has a good knowledge of journalistic ethics and laws. Has a good knowledge of SEO. Can work in a small team across weekends. Understanding of audience metrics and analytics. In return, we will provide you with: Generous corporate discounts at a range of retail, tech and health & fitness facilities. A collaborative, vibrant culture. Professional development opportunities through Sevens Mentoring and Performance & Development programs. A reward and recognition program. The Seven Network is part of Seven West Media, one of Australias most prominent media companies, with a market leading presence in content across broadcast television, online and in print. Comprising some of Australias most renowned media brands, SWM includes not just Seven Network and its affiliate channels 7two, 7mate, 7flix and BVOD offering 7plus, but also 7NEWS. com. au, The West Australian, The Sunday Times and more. The Seven Network is an equal opportunity employer and we are committed to creating a diverse and inclusive workplace. Recruitment Agencies: The Seven Network does not accept any unsolicited agency resumes and will not be responsible for any fees related to unsolicited resumes.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6147f76ebfeb2129040d1f0d::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Seven Network (Operations) Limited\", \"position\": \"Youtube Producer - 7NEWS.com.au\", \"notes\": \"\", \"original\": \"<ul>\\n<li><strong>#1 news website under 40s<\/strong><\/li>\\n<li><strong>1.3 million Australians visit every day<\/strong><\/li>\\n<li><strong>Australia\\u2019s biggest social community <\/strong><\/li>\\n<\/ul>\\n<p>\\u2018At Seven we are here to bring all Australians closer to the moments that move us - we\\u2019re first on the scene, with our finger on the pulse, on demand, in the moment. Together, we\\u2019re responsible for creating and sustaining authentic Australian engagement.\\u2019<\/p>\\n<p>A new and exciting opportunity has opened for a <strong>YouTube Producer<\/strong>\\u00a0to join the 7NEWS.com.au team.<\/p>\\n<p><strong>Based at 7NEWS HQ at Martin Place, Sydney You\\u2019ll be:<\/strong><\/p>\\n<ul>\\n<li>Identifying appropriate content from 7NEWS programs and uploading it to YouTube<\/li>\\n<li>Producing main media images for YouTube content<\/li>\\n<li>Writing SEO headlines and descriptions for videos<\/li>\\n<li>Working with senior producers to create bespoke YouTube content<\/li>\\n<li>Required to work weekends<\/li>\\n<\/ul>\\n<p><strong>We are looking for someone who:<\/strong><\/p>\\n<ul>\\n<li>Has experience in a fast-paced breaking news environment<\/li>\\n<li>Can identify trends via YouTube analytics<\/li>\\n<li>Has an understanding of YouTube and YouTube studio<\/li>\\n<li>Has a good knowledge of journalistic ethics and laws<\/li>\\n<li>Has a good knowledge of SEO<\/li>\\n<li>Can work in a small team across weekends<\/li>\\n<li>Understanding of audience metrics and analytics<\/li>\\n<\/ul>\\n<p><strong>In return, we will provide you with:<\/strong><\/p>\\n<ul>\\n<li>Generous corporate discounts at a range of retail, tech and health &amp; fitness facilities<\/li>\\n<li>A collaborative, vibrant culture<\/li>\\n<li>Professional development opportunities through Seven\\u2019s Mentoring and Performance &amp; Development programs<\/li>\\n<li>A reward and recognition program<\/li>\\n<\/ul>\\n<p>The Seven Network is part of Seven West Media, one of Australia\\u2019s most prominent media companies, with a market leading presence in content across broadcast television, online and in print. Comprising some of Australia\\u2019s most renowned media brands, SWM includes not just Seven Network and its affiliate channels 7two, 7mate, 7flix and BVOD offering 7plus, but also 7NEWS.com.au, The West Australian, The Sunday Times and more.<\/p>\\n<p><em>The Seven Network is an equal opportunity employer and we are committed to creating a diverse and inclusive workplace.<\/em><\/p>\\n<p><strong>Recruitment Agencies: The Seven Network does not accept any unsolicited agency resumes and will not be responsible for any fees related to unsolicited resumes. <\/strong><\/p>\"}"
}