{
    "id":"Kaggle::techmap::614339c599456163d00e0c02::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Ivanhoe Girls Grammar School is an Anglican day school strongly committed to single sex education for girls. Catering for students from Early Learning Centre (Three Year Old) to Year 12, Ivanhoe Girls Grammar School seeks to provide excellence in education within a caring Christian community and to prepare young women for a personally and professionally fulfilling life. About the role. The Digital Content and Communications Co-ordinator is responsible for developing and overseeing the content for all of the School's communication channels, some of the traditional communication channels and importantly oversees the Schools marketing and admissions digital platforms. The position includes building relationships with key internal and third party suppliers. This role sits within the wider Communications and Marketing team and is responsible for developing communications and engagement strategies for our key stakeholders, including students, staff, current parents, applicant\/prospective families, and alumnae. The role works to maintain a positive perception of Ivanhoe Girls in the community. This position is a full time ongoing position. What you bring. Proven experience in developing, planning and implementing successful communication and content campaigns. Excellent written and oral communication skills including high accuracy and attention to detail. Excellent project management skills and experience in running multiple digital platforms simultaneously. Exceptional interpersonal and communication skills to effectively listen and communicate with a wide range of stakeholders both internally and externally. Ability to work autonomously and as a collaborative team member of the Communications and Marketing team. Valid and current Working with Children Check for Employment Purposes. The successful applicant will have Journalism, Digital Media, Public Relations and\/or Communication tertiary qualifications and substantial experience working in a public relations, social media platforms, content and\/or a digital communications role. Previous experience working in an educational environment will be highly regarded. For further information and copy of a position description please visit: httpswww. ivanhoegirls. vic. edu. au\/ivanhoeggs\/employment-opportunities. Additional Information. Ivanhoe Girls Grammar School has a zero tolerance policy for child abuse and is committed to promoting child safety, children's wellbeing and protecting children from abuse. Ministerial Order 870 requires Ivanhoe Girls to implement child safety standards and to accommodate and take the needs of all children (including but not limited to, Aboriginal and Torres Strait Islander children, children from culturally and linguistically diverse backgrounds, children with disabilities, and children who are vulnerable) into account when creating a child safe environment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614339c599456163d00e0c02::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Ivanhoe Girls' Grammar School\", \"position\": \"Digital Content and Communications Co-ordinator\", \"notes\": \"\", \"original\": \"<p>Ivanhoe Girls\\u2019 Grammar School is an Anglican day school strongly committed to single sex education for girls. Catering for students from Early Learning Centre (Three Year Old) to Year 12, Ivanhoe Girls\\u2019 Grammar School seeks to provide excellence in education within a caring Christian community and to prepare young women for a personally and professionally fulfilling life.<\/p><p><em><strong>About the role<\/strong><\/em><\/p><p>The\\u00a0Digital Content and Communications Co-ordinator is responsible for developing and overseeing the content for all of the School's communication channels, some of the traditional communication channels and importantly oversees the School\\u2019s marketing and admissions digital platforms. The position includes building relationships with key internal and third party suppliers.<\/p><p>This role sits within the wider Communications and Marketing team and is responsible for developing communications and engagement strategies for our key stakeholders, including students, staff, current parents, applicant\/prospective families, and alumnae. The role works to maintain a positive perception of Ivanhoe Girls\\u2019 in the community.<\/p><p>This position is a full time ongoing position.<\/p><p><em><strong>What you bring<\/strong><\/em><\/p><ul><li>Proven experience in developing, planning and implementing successful communication and content campaigns<\/li><li>Excellent written and oral communication skills including high accuracy and attention to detail<\/li><li>Excellent project management skills and experience in running multiple digital platforms simultaneously<\/li><li>Exceptional interpersonal and communication skills to effectively listen and communicate with a wide range of stakeholders both internally and externally<\/li><li>Ability to work autonomously and as a collaborative team member of the Communications and Marketing team<\/li><li>Valid and current Working with Children Check for Employment Purposes<\/li><\/ul><p>The successful applicant will have Journalism, Digital Media, Public Relations and\/or Communication tertiary qualifications and substantial experience working in a public relations, social media platforms, content and\/or a digital communications role.\\u00a0Previous experience working in an educational environment will be highly regarded.<\/p><p>For further information\\u00a0and copy of a position description please visit: <a href=\\\"&quot;&quot;https:\/\/www.ivanhoegirls.vic.edu.au\/ivanhoeggs\/employment-opportunities&quot;&quot;\\\">https:\/\/www.ivanhoegirls.vic.edu.au\/ivanhoeggs\/employment-opportunities<\/a><\/p><p><em><strong>Additional Information<\/strong><\/em><\/p><p>Ivanhoe Girls\\u2019 Grammar School has a zero tolerance policy for child abuse and is committed to promoting child safety, children's wellbeing and protecting children from abuse. Ministerial Order 870 requires Ivanhoe Girls\\u2019 to implement child safety standards and to accommodate and take the needs of all children (including but not limited to, Aboriginal and Torres Strait Islander children, children from culturally and linguistically diverse backgrounds, children with disabilities, and children who are vulnerable) into account when creating a child safe environment.<\/p><p>The incumbent of this role must comply with Ivanhoe Girls' Grammar School\\u2019s child safety policies and related policies and procedures (including the Code of Conduct), upholding the overarching principles and values set out and conducting themselves in accordance with the commitment to take all reasonable steps to promote the safety of children.<\/p><p><em><strong>How to apply<\/strong><\/em><\/p><h2>Written applications should be addressed to:<\/h2><p>Melanie Dow<br \/>Director of Communications and Marketing<br \/>Ivanhoe Girls\\u2019 Grammar School<br \/>123 Marshall Street<br \/>Ivanhoe VIC 3079<\/p><h2><em>Email applications to:\\u00a0<\/em>employment@ivanhoegirls.vic.edu.au<\/h2><h2><em>Applications close:<\/em> 9.00am, Friday 1 October 2021<\/h2>\"}"
}