{
    "id":"Kaggle::techmap::614189a1ca44d244ce970a96::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Ability to lift up to 50.70 lbs. on a regular basis\" - does not mention if this is unaided or aided. \"Requires quick hands\" - this is vague. Both of these might exclude those who are capable of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"offers competitive pay\" - research has shown that giving a salary range leads to more applications from diverse backgrounds.",
    "verified":true,
    "synthetic":false,
    "text":" 48forty Solutions is the largest pallet management services company in North America. We provide end-to-end pallet solutions, from supply to retrieval, on-site services, reverse logistics, and packaging materials. 48forty Solutions is truly Pallet Management Made Simple. Our operations workforce is the heart and soul of our business. We are currently looking for a Saw Shop Operator. Basic Requirements: Ability to lift up to 50.70 lbs. on a regular basis. Requires quick hands, attention to detail, commitment to quality. Observance of all safety rules and regulations. Willing to work in a labor-intensive environment. Ability to communicate effectively. Willing to work overtime as needed. Walk-ins Welcome: 312 Upchurch Ln., Walterboro, SC 29488.48forty Solutions offers competitive pay and benefits to all full-time employees. 48forty Solutions is also pleased to offer a full benefit package that includes health, dental, vision, and life insurance as well as a 401(k) retirement savings plan after 90 days. 48forty Solutions requires that none of its employees are excluded from doing business with the Federal government. All newly hired individuals are promptly screened through the E-Verify electronic employment authorization program run by the U. S. Citizenship and Immigration Service. Drug-free workplace. EOE. D\/M\/F\/V. MUST be 18 years of age or older. At 48forty Solutions, we are proud to be an Equal Opportunity\/Affirmative Action employer. All qualified candidates will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status. The above statements are intended to describe the general nature and level of work being performed. All employees may be required to perform duties outside their normal responsibilities, as needed. PI144684358.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614189a1ca44d244ce970a96::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"48forty Solutions\", \"position\": \"Sawyer\", \"notes\": \"\", \"original\": \"<div><div><div><div> <div> <div><div><div><div><div><p>48forty Solutions is the largest pallet management services company in North America. We provide end-to-end pallet solutions, from supply to retrieval, on-site services, reverse logistics, and packaging materials. 48forty Solutions is truly Pallet Management Made Simple. Our operations workforce is the heart and soul of our business. We are currently looking for a <strong>Saw Shop Operator<\/strong>.<\/p><p><strong>Basic Requirements:<\/strong><\/p><ul><li>Ability to lift up to 50 - 70 lbs. on a regular basis<\/li><li>Requires quick hands, attention to detail, commitment to quality<\/li><li>Observance of all safety rules and regulations<\/li><li>Willing to work in a labor-intensive environment<\/li><li>Ability to communicate effectively<\/li><li>Willing to work overtime as needed<\/li><\/ul><p><strong>Walk-ins Welcome: <\/strong>312 Upchurch Ln., Walterboro, SC 29488<\/p><p>48forty Solutions offers competitive pay and benefits to all full-time employees. 48forty Solutions is also pleased to offer a full benefit package that includes health, dental, vision, and life insurance as well as a 401(k) retirement savings plan after 90 days.<\/p><p>48forty Solutions requires that none of its employees are excluded from doing business with the Federal government. All newly hired individuals are promptly screened through the E-Verify electronic employment authorization program run by the U.S. Citizenship and Immigration Service.<\/p><ul><li>Drug-free workplace. EOE. D\/M\/F\/V<\/li><li>MUST be 18 years of age or older<\/li><\/ul><p>At 48forty Solutions, we are proud to be an Equal Opportunity\/Affirmative Action employer. All qualified candidates will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status.<\/p><p>The above statements are intended to describe the general nature and level of work being performed. All employees may be required to perform duties outside their normal responsibilities, as needed.<\/p><\/div><\/div><\/div><\/div><\/div> <\/div> <\/div><\/div><\/div><\/div><br \/><br \/><br \/><br \/><p>PI144684358<\/p><br \/>\"}"
}