{
    "id":"Kaggle::techmap::615205f3e844a96154ca8295::britishjobs_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The requirement to \"lift small heavy boxes\" without mentioning reasonable accommodations could disadvantage candidates with physical disabilities who might be capable of performing the job with appropriate adjustments or assistance.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Packing Operative. The OSP Group are recruiting for Packing Operatives in a busy company based in Colchester for full time temporary work up until Christmas. Job responsibilities include:. Packing products for dispatch. Passing packed products in a timely and effective manner. Ensure that all orders are completed accurately. Working safely at speed and following instructions. Ensure high levels of attention to detail at all times. Work as part of a team and on own initiative. Requires numeracy and manual dexterity. General warehousing tasks. Job requirements include:. Work efficiently and effectively as part of a team. Able to lift small heavy boxes. Basic computer literacy, good numeracy skills, general willingness to learn. Experience of working in a Warehouse is beneficial but not essential. Be flexible. Must be hardworking and reliable. Benefits include:. Lots of overtime available. Friendly working environment. Full time work for the next 3 months. Opportunity to become permanent. Packing Operative. Working hours. 8am till 4pm. Monday to Friday. Pay rates from £8.91 - £9.99 per hour. Weekly pay.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615205f3e844a96154ca8295::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"OSP Group Ltd\", \"position\": \"Packing Operative\", \"notes\": \"\", \"original\": \"Packing Operative<br><br>The OSP Group are recruiting for Packing Operatives in a busy company based in Colchester for full time temporary work up until Christmas.<br><br>Job responsibilities include:<br><br>  * Packing products for dispatch<br><br>  * Passing packed products in a timely and effective manner<br><br>  * Ensure that all orders are completed accurately<br><br>  * Working safely at speed and following instructions<br><br>  * Ensure high levels of attention to detail at all times<br><br>  * Work as part of a team and on own initiative<br><br>  * Requires numeracy and manual dexterity<br><br>  * General warehousing tasks<br><br>Job requirements include:<br><br>  * Work efficiently and effectively as part of a team<br><br>  * Able to lift small heavy boxes<br><br>  * Basic computer literacy, good numeracy skills, general willingness to learn<br><br>  * Experience of working in a Warehouse is beneficial but not essential<br><br>  * Be flexible<br><br>  * Must be hardworking and reliable<br><br>Benefits include:<br><br>  * Lots of overtime available<br><br>  * Friendly working environment<br><br>  * Full time work for the next 3 months<br><br>  * Opportunity to become permanent<br><br>Packing Operative - Working hours<br><br>8am till 4pm - Monday to Friday<br><br>Pay rates from &pound;8.91 - &pound;9.99 per hour - Weekly pay<br>\"}"
}