{
    "id":"Kaggle::techmap::61448ae043e74a6bcce4c0de::linkedin_be::1",
    "label_age":true,
    "analysis_age":"The phrase \"10 years' experience in ICT related project management\" may introduce age bias by setting an unattainable standard for younger workers, thereby favouring older candidates with more years of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years' experience in ICT related project management, preferably in a (semi-)industrial environment that involves a large service component with short (maintenance or repair) deadlines. Up-to-date knowledge of digital technology trends (AI, data analytics, open source, cloud computing, cybersecurity) and best practices. Proven track record with projects related to digital transformation. Knowledge of Electronic Document Management or Enterprise Content Management is a plus. Certification by the Project Management Institute (PMI), Prince I. I, ITIL or equivalent is a plus. Knowledge of various project management methodologies (e. g., agile\/scrum\/design sprints). Proven leadership and influencing skills and the ability to delegate effectively. Cost and risk management skills. Excellent communication, interpersonal and negotiation skills. Ability to make important decisions under pressure. Problem-solving skills. Time management skills. Friendly and approachable. Speaks French fluently with good command of Dutch and English. Offer. Challenging assignment for an estimated duration of 6.9 months with one of the leaders in their field in Belgium!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61448ae043e74a6bcce4c0de::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"3W Select\", \"position\": \"Project Manager Digital Transformation\", \"notes\": \"\", \"original\": \"<p>Our client is located in the Li\\u00e8ge area and specializes in the design, study, implementation and maintenance of electrical, electronic and electromechanical installations in the field of transport infrastructure and heritage.<\/p><p>As they are working to a large extent with public enterprises and institutions, their business processes are quite diverse and often have complex formal requirements.&nbsp;Our client has decided to start a transformation of their main business processes with a specific focus on their digitalization.&nbsp;This must lead to increased efficiency, lower costs, better insights and higher quality overall.&nbsp;An initial analysis of their current processes and flows (\\u2018as is\\u2019) has been carried out, but now the digital transformation has to be initiated and implemented across the whole of the organization. <\/p><p><br><\/p><p>We are therefore looking for a <strong>Senior Project Manager<\/strong> to head up this challenging <strong>\\u2018Digital Business Process Transformation\\u2019<\/strong>.&nbsp;<\/p><p><br><\/p><p>As the Senior Project Manager (PM) you are responsible for overseeing the successful initiation and completion of the project.&nbsp;This includes managing relevant resources, setting up internal and external teams, setting deadlines, communicating with company executives about the state of the project, ensuring projects stay on track and on budget, and adjusting if necessary to meet new requirements.<\/p><p><br><\/p><p><strong>Responsibilities:<\/strong><\/p><ul><li>Review existing internal business processes and identify areas of improvement<\/li><li>Assist in the definition of the project scope and goals<\/li><li>Assist with the development of new fit-for-purpose digital solutions to improve operational efficiency and improve service level, while ensuring that they can be easily integrated into the existing ERP (Navision) and other important company software<\/li><li>Creating a short- and medium term goals, determining milestones, adhering to deadlines and allocating internal resources<\/li><li>Delegating tasks on the project to employees best positioned to complete them<\/li><li>Identifying and managing potential risks and liabilities<\/li><li>Making effective decisions when presented with multiple options for how to progress with the project<\/li><li>Serving as a point of contact for teams to ensure team actions remain in synergy<\/li><li>Communicating with the management to keep the project aligned with their goals<\/li><li>Performing quality control on the project throughout development to maintain the standards expected<\/li><li>Adjusting schedules and targets on the project as needed<\/li><li>Motivating people involved in the project to complete tasks on time<\/li><li>Champion the digital transformation tools and conduct training to relevant departments within the organization<\/li><\/ul><p>&nbsp;<\/p><p><strong>Qualifications:<\/strong><\/p><ul><li>Master Degree or equal by experience<\/li><li>10+ years' experience in ICT related project management, preferably in a (semi-)industrial environment that involves a large service component with short (maintenance or repair) deadlines<\/li><li>Up-to-date knowledge of digital technology trends (AI, data analytics, open source, cloud computing, cybersecurity) and best practices<\/li><li>Proven track record with projects related to digital transformation<\/li><li>Knowledge of Electronic Document Management or Enterprise Content Management is a plus<\/li><li>Certification by the Project Management Institute (PMI), Prince II, ITIL or equivalent is a&nbsp;plus<\/li><li>Knowledge of various project management methodologies (e.g., agile\/scrum\/design sprints)<\/li><li>Proven leadership and influencing skills and the ability to delegate effectively<\/li><li>Cost and risk management skills<\/li><li>Excellent communication, interpersonal and negotiation skills<\/li><li>Ability to make important decisions under pressure<\/li><li>Problem-solving skills<\/li><li>Time management skills<\/li><li>Friendly and approachable<\/li><li>Speaks French fluently with good command of Dutch and English<\/li><\/ul><p>&nbsp;<\/p><p>&nbsp;<\/p><p><strong>Offer <\/strong><\/p><p>Challenging assignment for an estimated duration of 6 - 9 months with one of the leaders in their field in Belgium!<\/p>\"}"
}