{
    "id":"Kaggle::techmap::6140a50bc60b4546f2893a0d::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Penrhos College is a Uniting Church day and boarding school for girls, Pre-Kindergarten to Year 12. Our purpose is to inspire girls to become extraordinary women. Penrhos College is seeking an experienced Health & Physical Education Teacher to join our team in 2022. This is a 12 month, maximum-term contract to cover leave for a permanent employee. The successful applicant will have demonstrated experience in teaching across Years 7 to 10 and will be willing to take a pastoral Form and IGSSA sport coaching duties. Experience across a number of sports to support the Colleges IGSSA Program would be highly regarded. As part of our Strategic Direction, we aim to provide our girls with inspirational student experiences where our students are at the centre of all we do. As a teacher at Penrhos, you will play a significant role in planning, delivering and reflecting on the learning experiences in your classroom as well as providing a safe, supportive and respectful environment that is essential for positive student wellbeing. We are inspired by engaging, challenging and empowering our students to be the best learners they can be. At Penrhos we believe in developing experiences that shape the whole person, the unique Mind, Heart, Body and Spirit of each individual and this leads to inspiring our girls to become extraordinary women. The successful applicants will have: A Bachelor of Education or a degree qualification supported by a Post Graduate Diploma of Education. Current Teacher Registration Board of WA Membership including a Working with Children card (WWC). Appropriate Drivers License to drive school coaster buses. Current First Aid & CPR. Current Surf Bronze Medallion. Commitment to the Colleges Core Shared values of Respect, Integrity, Empathy, Knowledge, Growth and Synergy. Commitment to providing students with a safe, supportive and respectful learning environment. The following essential criteria must be addressed with evidence in the Selection Criteria document: An excellent working knowledge of the Western Australian Curriculum and associated pedagogy. An academic record which demonstrates an ability to foster personal best and the opportunity to achieve personal excellence. Demonstrated excellence in teaching Health & Physical Education across a range of ability levels based on the Western Australian Curriculum from Year 7 to 10. Ability to integrate technology into curriculum delivery to provide opportunity for students to develop 21st Century Skills. A demonstrated excellence in teaching including pastoral care and a high level of subject knowledge.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6140a50bc60b4546f2893a0d::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Penrhos College\", \"position\": \"SECONDARY SCHOOL TEACHER OF HEALTH & PHYSICAL EDUCATION\", \"notes\": \"\", \"original\": \"<p>Penrhos College is a Uniting Church day and boarding school for girls, Pre-Kindergarten to Year 12.<\/p><p><strong>Our purpose is to \\u2018inspire girls to become extraordinary women\\u2019.<\/strong>\\u00a0<\/p><p>Penrhos College is seeking an experienced Health &amp; Physical Education Teacher to join our team in 2022.<\/p><p>This is a 12 month, maximum-term contract to cover leave for a permanent employee.<\/p><p>The successful applicant will have demonstrated experience in teaching across Years 7 to 10 and will be willing to take a pastoral Form and IGSSA sport coaching duties. Experience across a number of sports to support the College\\u2019s IGSSA Program would be highly regarded.\\u00a0<\/p><p>As part of our Strategic Direction, we aim to provide our girls with \\u2018inspirational student experiences\\u2019 where our students are at the centre of all we do. As a teacher at Penrhos, you will play a significant role in planning, delivering and reflecting on the learning experiences in your classroom as well as providing a safe, supportive and respectful environment that is essential for positive student wellbeing. We are inspired by engaging, challenging and empowering our students to be the best learners they can be. At Penrhos we believe in developing experiences that shape the whole person, the unique Mind, Heart, Body and Spirit of each individual and this leads to inspiring our girls to become extraordinary women.<\/p><h2>The successful applicants will have:<\/h2><ul><li>A Bachelor of Education or a degree qualification supported by a Post Graduate Diploma of Education<\/li><li>Current Teacher Registration Board of WA Membership including a Working with Children card (WWC)<\/li><li>Appropriate Driver\\u2019s License to drive school coaster buses\\u00a0<\/li><li>Current First Aid &amp; CPR<\/li><li>Current Surf Bronze Medallion\\u00a0<\/li><li>Commitment to the College\\u2019s Core Shared values of Respect, Integrity, Empathy, Knowledge, Growth and Synergy.<\/li><li>Commitment to providing students with a safe, supportive and respectful learning environment\\u00a0<\/li><\/ul><p><strong>The following essential criteria must be addressed with evidence in the Selection Criteria document:\\u00a0<\/strong><\/p><ol><li>An excellent working knowledge of the Western Australian Curriculum and associated pedagogy.<\/li><li>An academic record which demonstrates an ability to foster personal best and the opportunity to achieve personal excellence.<\/li><li>Demonstrated excellence in teaching Health &amp; Physical Education across a range of ability levels based on the Western Australian Curriculum from Year 7 to 10.<\/li><li>Ability to integrate technology into curriculum delivery to provide opportunity for students to develop 21st Century Skills<\/li><li>A demonstrated excellence in teaching including pastoral care and a high level of subject knowledge.<\/li><li>Commitment to the IGSSA Program, and Penrhos\\u2019 full participation in events.<\/li><\/ol><p><strong>Applications close 8 am 20th September 2021<\/strong><\/p><p><strong>For further details, please view the position statement on the College\\u2019s Careers Page.\\u00a0<\/strong><\/p><h2>How to Apply:<\/h2><p><strong>Your Application must include:<\/strong><\/p><ol><li><strong>Cover letter and Selection Criteria:\\u00a0<\/strong>Please combine your cover letter and selection criteria document;<strong>\\u00a0<\/strong>stating why you are applying for the position and providing your contact details. Please address the essential criteria listed on the Position Statement and outline your suitability for the role. (Maximum 3 pages).<\/li><li><strong>Current Resume or Curriculum Vitae<\/strong> outlining your personal details, qualifications and relevant work history, education and professional memberships. Relevant work history should commence with the most recent position you have held as well as the dates\/period of employment. In the description of your work history give a brief summary of the key achievements and responsibilities for each of the positions.\\u00a0<\/li><li><strong>Work-related referees<\/strong>: Please add the names and contact details of three confidential referees.\\u00a0 It is preferable that one referee should be your present Line Manager.\\u00a0 You may include one personal referee as well.\\u00a0\\u00a0<\/li><li><strong>Submission of Application<\/strong>: When submitting your application please combine your cover letter and resume into one document to upload.\\u00a0<\/li><\/ol><p>Please send through your application in <strong>one<\/strong> document to <a href=\\\"&quot;mailto:applications@penrhos.wa.edu.au&quot;\\\">applications@penrhos.wa.edu.au<\/a>.<\/p><p><strong>Applications close 8 am 20th September 2021<\/strong><\/p><p><strong>Statement of Commitment to Child Safety and Wellbeing<\/strong><\/p><p>All children and young people who come to Penrhos College have a right to feel and be safe. We are committed to providing a child safe and child friendly environment, where children and young people are safe and feel safe and are able to actively participate in decisions that affect their lives.<\/p><p>We have a zero tolerance for child abuse and other harm and are committed to acting in student\\u2019 best interests and keeping them safe from harm.<\/p><p>The College regards its child protection responsibilities with the utmost importance and as such, is committed to providing the necessary resources to ensure compliance with all relevant child protection laws and regulations and maintaining a child safe culture.\\u00a0<\/p><p>Each member of the College community has a responsibility to understand the importance and specific role that they play individually and collectively to ensure that the wellbeing and safety of all students is at the forefront of all that they do and every decision that they make.\\u00a0<\/p><p>Only persons with unlimited rights to work in Australia need apply.<\/p><p><em>No agency calls please.\\u00a0 Applications will not be accepted through recruitment agencies for this role.<\/em><\/p><p><strong>Disclaimer:\\u00a0<\/strong>Penrhos reserves the right at its sole discretion to withdraw from the recruitment process, not to make an appointment, or to appoint by invitation, at any time. We reserve the right to remove the advert earlier than the date on the advert.<\/p>\"}"
}