{
    "id":"Kaggle::techmap::6149300b4ca8eb4d9076c36d::seek_au::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 40 hours. Ability to work rotational shift work. Willingness to work paid overtime. Pre-employment medical checks will be required. Applicants must be able to obtain an ASIC card. Full uniform will be provided. Training to be proved to successful candidate. Our Values: Think Safe Act Safe Home Safe. Outstanding service and value to the customer (internal and external). Respect & trust for each other. To look beyond the obvious. creativity, innovation and continuous improvement. Having Fun. We are committed to supporting a safe, diverse and inclusive culture where our contributions and differences are valued. We encourage our people to work collaboratively, demonstrating creativity and innovation (looking beyond the obvious) to deliver outstanding service to our customers. We provide solutions that keep the world moving! To apply for this job go to: bcsgroupcareers. com\/Vacancies and enter ref code: 5653439. Applications close 04 October 2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6149300b4ca8eb4d9076c36d::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Daifuku Oceania\", \"position\": \"System Technician - Electrical\", \"notes\": \"\", \"original\": \"<p><strong>About Daifuku<\/strong><\/p> <p>Daifuku is a multi-dimensional global company who have over 9,000 employees worldwide and specialise in material handling automation within both the aviation and logistic industries. We are the world's leading exponent on material handling solutions and are constantly striving for innovative solutions for our clients that cover industrial automation and sortation solutions. We have projects and operations globally and a current opportunity in Tullamarine working on our Cross Belt Sortation System.<\/p> <p><strong>About the Role<\/strong><\/p> <p>This role is responsible for maintaining and conducting preventative maintenance on all freight handling equipment and for providing breakdown response. Additional responsibilities include providing the client with operational improvement and ensuring the smooth running of the facility and equipment under their control.<\/p> <p>Responsibilities include but are not limited to:<\/p> <ul> <li>Ensuring all scheduled planned preventative maintenance (PPM) tasks are completed on time and in a professional manner<\/li> <li>Ensuring all maintenance activities are logged and reported in accordance with the appropriate reporting procedure, both internal and external<\/li> <li>Providing regular reports on system performance and service levels against KPI's<\/li> <li>Supporting and assisting client operational staff and other Maintenance Technicians as required<\/li> <li>Efficiently and effectively identifying and rectifying any faults<\/li> <li>Being the main client interface on site and liaise regularly with the Daifuku Operations and Maintenance manager<\/li> <li>Following all Daifuku and Client WHSE policies &amp; procedures<\/li><\/ul> <p><strong>About you:<\/strong><\/p> <p>You will have proven experience as a Maintenance Technician, holding an A grade Electrical license. To succeed in this role, you will have a willingness and desire to drive a safe environment, whilst having a positive attitude and willingness to learn and develop with external and internal training.<br \/>Solid experience with ASi control systems is desirable and holding a solid understanding of Materials Handling Systems is preferred. The ability to work autonomously and have a strong work ethic will set you aside from others.<\/p> <p><strong>You will also have:<\/strong><\/p> <ul> <li>Must hold and retain a full Victorian A grade Electrical license<\/li> <li>Experience with ASi Bus or similar control systems<\/li> <li>Must have a minimum of 5 years in the maintenance industry<\/li> <li>Experience with Nord and SEW Variable Speed devises and assemblies<\/li> <li>Experience with Profibus desired but not essential<\/li> <li>Experience desirable in automated sortation systems<\/li> <li>Understanding of Take 5's, JSA, Safety conversations<\/li> <li>CMM's - Mex preferred<\/li> <li>EWP high risk license preferred<\/li> <li>Demonstrated experience with SCADA<\/li> <li>Working at heights \/ Height Rescue training is preferred<\/li><\/ul> <p><strong>Other information:<\/strong><\/p> <ul> <li>Full-time position<\/li> <li>40 hours<\/li> <li>Ability to work rotational shift work<\/li> <li>Willingness to work paid overtime<\/li> <li>Pre-employment medical checks will be required<\/li> <li>Applicants must be able to obtain an ASIC card<\/li> <li>Full uniform will be provided<\/li> <li>Training to be proved to successful candidate<\/li><\/ul> <p><strong>Our Values:<\/strong><\/p> <ul> <li>Think Safe Act Safe Home Safe<\/li> <li>Outstanding service and value to the customer (internal and external)<\/li> <li>Respect &amp; trust for each other<\/li> <li>To look beyond the obvious - creativity, innovation and continuous improvement<\/li> <li>Having Fun<\/li><\/ul> <p>We are committed to supporting a safe, diverse and inclusive culture where our contributions and differences are valued. We encourage our people to work collaboratively, demonstrating creativity and innovation (looking beyond the obvious) to deliver outstanding service to our customers.<\/p> <p>We provide solutions that keep the world moving!<\/p> <p><em><strong>To apply for this job go to: bcsgroupcareers.com\/Vacancies and enter ref code: 5653439.<br \/><br \/>Applications close 04 October 2021<\/strong><\/em><\/p>\"}"
}