{
    "id":"Kaggle::techmap::61428a583f4067230bc0668a::seek_nz::0",
    "label_age":true,
    "analysis_age":"The requirement for the applicant to be \"mature\" implicitly favours older candidates, potentially disadvantaging younger candidates who may also possess the necessary skills and experience for the role.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" This position is for an experienced reception\/administration assistant at the Hamilton Workingmen's Club. The Hamilton Workingmen's Club is located in Frankton, Hamilton. We have approximately 7000 members and this role is an essential part of providing services to those members. Applicants should have experience using all Microsoft office suite applications and have knowledge of Xero Accounting package with regard to Creditor payments. Ability to use Indesign and Photoshop packages is an advantage. Some training can be given. Applicant must be mature and able to multi task to work in this hospitality driven role. You will be in a frontline position requiring constant contact with the public whilst undertaking normal administration roles. This is a job share position with one other person which includes rostered day. ight and weekend work on an alternate week roster. You will work between 36 and 42 hours per week as follows. Week 1. Mon 12pm  8pm. Tues 9am  3pm. Wed Off. Thurs Off. Fri 9am  3pm. Sat 11am  Midnight. Sun Midday  8pm. Week 2. Mon Off. Tues 3pm  10pm. Wed 12pm  10pm. Thurs 12pm  10.30pm. Fri 3pm  midnight. Sat Off. Sun Off. If you cannot commit to these hours this is not the role for you, so please don't apply.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61428a583f4067230bc0668a::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"EVP Recruitment Waikato Ltd\", \"position\": \"Reception\/Administration Assistant - Hamilton Workingmen's Club\", \"notes\": \"\", \"original\": \"<p>This position is for an experienced reception\/administration assistant at the Hamilton Workingmen's Club.\\u00a0<\/p> <p>The Hamilton Workingmen's Club is located in Frankton, Hamilton.\\u00a0 We have approximately\\u00a07000 members and this role is an essential part of providing services to those members.<\/p> <p>Applicants should have experience using all Microsoft office suite applications and have knowledge of Xero Accounting package with regard to Creditor payments.\\u00a0\\u00a0\\u00a0Ability to use Indesign and Photoshop packages is an advantage.\\u00a0 Some training can be given.\\u00a0 Applicant must be mature and able to multi task to work in this hospitality driven role.\\u00a0 You will be in a frontline position requiring constant contact with the public whilst undertaking normal administration roles.<\/p> <p>This is a job share position with one other person\\u00a0which includes rostered day\/night and weekend work on an alternate week roster.\\u00a0 You will work between 36 and\\u00a042 hours per week as follows;<\/p> <p>Week 1<br \/>Mon\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a012pm \\u2013 8pm<br \/>Tues\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a09am \\u2013 3pm<br \/>Wed\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a0Off<br \/>Thurs\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a0Off<br \/>Fri\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a09am \\u2013 3pm<br \/>Sat\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a011am \\u2013 Midnight<br \/>Sun\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a0Midday \\u2013 8pm<\/p> <p>Week 2<br \/>Mon\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a0Off<br \/>Tues\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a03pm \\u2013 10pm<br \/>Wed\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a012pm \\u2013 10pm<br \/>Thurs\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a012pm \\u2013 10.30pm<br \/>Fri\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a03pm \\u2013 midnight<br \/>Sat\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a0Off<br \/>Sun\\u00a0\\u00a0 \\u00a0\\u00a0\\u00a0 \\u00a0Off<\/p> <p><br \/>If you cannot commit to these hours this is not the role for you, so please don't apply.<\/p>\"}"
}