{
    "id":"Kaggle::techmap::6154e3bef8ebbc3cd2253dca::monster2_es::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" DescriptionTeleperformance is a worldwide leader in customer experience management and contact centre business process outsourcing. Our company employs around 300.000 people working in over 265 dialects and languages, in 80 countries, operating across all business sectors and all continents on behalf of major international companies. At Teleperformance, we do business with people, for people. We want our employees to be inspired and motivated. Our main goal is to make them proud to belong to Teleperformance through job satisfaction and a great work environment. Teleperformance Spain, with more than 4, 700 employees in 10 sites (certified with Great Place to Work, AENOR and Top Employer), is looking for a group of highly-skilled professionals whose focus is on engaging and obtaining high potential advertisers, and subsequently persuading them to incorporate a range of marketing products into their current Marketing strategies. ResponsibilitiesMake outbound customer calls to promote and sell our service. Create, maintain and update database of customers with complete information. Consolidate existing customer base while building new customer base. Record outbound call history and customers response in detail. Ensure customer follow-up all the time. Monitor competitors products or services and create selling strategies for own products or services. Handle customer needs and requirements. Respond to customer inquiries and resolve. RequirementsNative level of English. Previous sales experience. Experience with CRM. Strong written and oral business communication skills. Comfortable in goal driven environment and attaining goals with broader team. Excellent communication and presentation skills, both written and verbal. Goal oriented, self-motivated individual who is confident, competitive, tenacious and proactive. Able to work independently, but within a team environment Strong business acumen with the ability to evaluate multiple business models. Customer driven and focused on providing exemplary customer experience. Due to covid-19 situation our employees are working from home in Barcelona and also in other locations in Spain, but we cant wait to see you in our amazing offices when we come back to normal. (Office location surrounded by the sea, World Trade Center, Barcelona, Spain). BenefitsFull-time position, from Monday to Friday, 39 hours\/week. Salary: 22.800€ gross\/year. up to 5.700€ gross\/year in bonus. Referral Program: Bring a Friend and get a Referral fee (600€ - 1.000€ depending on the language\/project)Safety package:Flight ticket. Taxi to the airport. Taxi from the airport in Spain to your new accommodationPCR test cost compensation. Accommodation in a nice individual studio.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6154e3bef8ebbc3cd2253dca::monster2_es\", \"source\": \"monster2_es\", \"country\": \"ES\", \"company\": \"Teleperformance Spain\", \"position\": \"English Sales & Marketing Consultant - Google Ads Products\", \"notes\": \"\", \"original\": \"DescriptionTeleperformance is a worldwide leader in customer experience management and contact centre business process outsourcing. Our company employs around 300.000 people working in over 265 dialects and languages, in 80 countries, operating across all business sectors and all continents on behalf of major international companies.At Teleperformance, we do business with people, for people. We want our employees to be inspired and motivated. Our main goal is to make them proud to belong to Teleperformance through job satisfaction and a great work environment.Teleperformance Spain, with more than 4,700 employees in 10 sites (certified with Great Place to Work, AENOR and Top Employer), is looking for a group of highly-skilled professionals whose focus is on engaging and obtaining high potential advertisers, and subsequently persuading them to incorporate a range of marketing products into their current Marketing strategies.ResponsibilitiesMake outbound customer calls to promote and sell our serviceCreate, maintain and update database of customers with complete informationConsolidate existing customer base while building new customer base.Record outbound call history and customers response in detail.Ensure customer follow-up all the time.Monitor competitors\\u2019 products or services and create selling strategies for own products or services.Handle customer needs and requirements.Respond to customer inquiries and resolve.RequirementsNative level of English.Previous sales experience.Experience with CRM.Strong written and oral business communication skills.Comfortable in goal driven environment and attaining goals with broader teamExcellent communication and presentation skills, both written and verbalGoal oriented, self-motivated individual who is confident, competitive, tenacious and proactiveAble to work independently, but within a team environment\\u25cb Strong business acumen with the ability to evaluate multiple business modelsCustomer driven and focused on providing exemplary customer experience<em>Due to covid-19 situation our employees are working from home in Barcelona and also in other locations in Spain, but we can\\u2019t wait to see you in our amazing offices when we come back to normal. (Office location surrounded by the sea, World Trade Center, Barcelona, Spain).<\/em>BenefitsFull-time position, from Monday to Friday, 39 hours\/week.Salary: 22.800\\u20ac gross\/year + up to 5.700\\u20ac gross\/year in bonus.Referral Program: Bring a Friend and get a Referral fee (600\\u20ac - 1.000\\u20ac depending on the language\/project)Safety package:Flight ticketTaxi to the airportTaxi from the airport in Spain to your new accommodationPCR test cost compensationAccommodation in a nice individual studioSupport with a private Health InsuranceIntense specific sales training.A permanent presence of coaches who will facilitate your personal and professional developmentEstablished career path to grow within the projectContinuous training and certifications within Google productsBi-weekly, monthly or quarterly contestsEmployment with the world's largest provider of contact center servicesExcellent work environment, great colleagues, social arrangements and personal developmentDynamic business casual environment with colleagues of all ages gathered in a highly-motivated teamOffice location surrounded by the sea (World Trade Center, Barcelona, Spain)<em>If you want to know more about moving to Barcelona, please click here<\/em>Apply for this job\"}"
}