{
    "id":"Kaggle::techmap::614393bea973d70733d01ca1::britishjobs_uk::2",
    "label_age":false,
    "analysis_age":"The phrase \"Physically fit and strong\" is vague without clarification of requirements. Could discourage many who are physically capable of the role.",
    "label_disability":true,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Role. Warehouse Operative. Salary - £19, 000 per annum. Location. Cowley, Oxfordshire. Are you an experienced Warehouse Operative looking to work for a highly regarded and well-established company? Then please see below! Atlas Employment are delighted to be working with our client based in Cowley, who require a Warehouse Operative to join their expanding team. The successful candidate will have an enthusiastic approach with the ability to work as part of a team whilst being professional and rising to challenges. You will have an opportunity to develop professionally, building on your knowledge and widen your skillset. What will you be doing as a Warehouse Operative? Packing and loading. Wrapping products in various materials. Unloading deliveries when they arrive. Keeping packing area clean and tidy. Assisting in deliveries. You should apply for the role of Warehouse Operative if you have…. Physically fit and strong. Previous warehouse experience in a similar role. Previous Forklift experience (not essential). Confident self-starter able to work in a busy diverse environment. Keen eye for detail and good judgement. Good organisational skills. Easy transport routes from. Chiselhampton, Oxford, Cumnor, Wheatley, Woodeaton, Yarnton, Abingdon Stadhampton, Wallingford, Watlington, Benson, Didcot. Job Type. Permanent. Status - Full-Time. If you think you may be a suitable candidate for the Warehouse Operative role, please contact Jade Powell at Atlas Employment, on or email. Every candidate will be assessed only in accordance with their merits, qualifications and abilities to perform the duties of the job.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614393bea973d70733d01ca1::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Atlas Employment Ltd\", \"position\": \"Warehouse Operative Wrapper\", \"notes\": \"\", \"original\": \"Role - Warehouse Operative<br><br>Salary - &pound;19,000 per annum<br><br>Location - Cowley, Oxfordshire<br><br>Are you an experienced Warehouse Operative looking to work for a highly regarded and well-established company? Then please see below!<br><br>Atlas Employment are delighted to be working with our client based in Cowley, who require a Warehouse Operative to join their expanding team. The successful candidate will have an enthusiastic approach with the ability to work as part of a team whilst being professional and rising to challenges. You will have an opportunity to develop professionally, building on your knowledge and widen your skillset.<br><br>What will you be doing as a Warehouse Operative?<br><br>Packing and loading<br>Wrapping products in various materials<br>Unloading deliveries when they arrive<br>Keeping packing area clean and tidy<br>Assisting in deliveries <br><br>You should apply for the role of Warehouse Operative if you have&hellip;  <br><br>Physically fit and strong<br>Previous warehouse experience in a similar role <br>Previous Forklift experience (not essential) <br>Confident self-starter able to work in a busy diverse environment<br>Keen eye for detail and good judgement<br>Good organisational skills <br><br>Easy transport routes from; Chiselhampton,Oxford, Cumnor, Wheatley, Woodeaton, Yarnton, Abingdon Stadhampton, Wallingford, Watlington, Benson, Didcot <br><br>Job Type - Permanent<br><br>Status - Full-Time<br><br>If you think you may be a suitable candidate for the Warehouse Operative role, please contact Jade Powell at Atlas Employment, on or email <br><br>Please note that no terminology in this advert is intended to discriminate on the grounds of a person&#39;s gender, marital status, race, religion, colour, age, disability or sexual orientation. Every candidate will be assessed only in accordance with their merits, qualifications and abilities to perform the duties of the job.\"}"
}