{
    "id":"Kaggle::techmap::6130ccdf11ff555f6c285543::aarp_us::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The role is a physical role in mechanical maintenance.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Overview: Maintain mechanical equipment and facilities and to aid in the manufacturing of all company products in a safe and sanitary work environment. Qualifications: High School Diploma or GED. One-year certificate from college or technical school. Or two to three years related experience and\/or training. Or equivalent combination of education and experience. Must be able to posses and maintain a valid forklift license issued by the company. Experience within the food and beverage industry preferred. Able to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimals. Overtime and working on holidays is often required. PHYSICAL DEMANDS:While performing the duties of this job, the employee is regularly required to stand, use hands and stretch and reach with hands and arms. The employee frequently is required to walk, stoop, kneel, crouch, or crawl. Climb and talk or hear. The employee is occasionally required to climb or balance and smell. The employee must frequently lift and\/or move up to 10 pounds and occasionally lift and\/or move more than 100 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus. Must have full range of body motion. While performing the duties of this job, the employee is regularly exposed to moving mechanical parts. The employee is frequently exposed to wet and \/or humid conditions and risk of electrical shock. The employee is occasionally exposed to high, precarious places, fumes or airborne particles. Toxic or caustic chemicals. Outside weather conditions, and extreme cold. The noise level in the work environment is usually loud. Responsibilities: Ability to disassemble and assemble all parts of machines and support equipment according to the manufacturers, specifications. Trouble shoots and repairs all equipment in the plant. Do preventative maintenance on all equipment as scheduled. Have a basic understanding of hydraulic. Arc welding and\/or Heliarc welding. Electrical troubleshooting and repair. Electronic and PLC troubleshooting and repair. Rebuilding gearboxes and drives. Repair and troubleshooting of filling machines. Rebuilding valves and pumps. Ensure full compliance with all company safety policies and procedures. Access all areas of machines and support equipment. Access all areas of the facilities as is needed to perform repairs and maintenance. Provide own hand tools.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6130ccdf11ff555f6c285543::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Borden Dairy Company\", \"position\": \"Maintenance Technician\", \"notes\": \"\", \"original\": \"Overview:<br \/>Maintain mechanical equipment and facilities and to aid in the manufacturing of all company products in a safe and sanitary work environment.<br \/>Qualifications:<br \/>High School Diploma or GED; one-year certificate from college or technical school; or two to three years related experience and\/or training; or equivalent combination of education and experience. <br \/>Must be able to posses and maintain a valid forklift license issued by the company.<br \/>Experience within the food and beverage industry preferred.<br \/>Able to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimals.<br \/>Overtime and working on holidays is often required.<br \/>PHYSICAL DEMANDS:While performing the duties of this job, the employee is regularly required to stand, use hands and stretch and reach with hands and arms. The employee frequently is required to walk, stoop, kneel, crouch, or crawl; climb and talk or hear.<br \/>The employee is occasionally required to climb or balance and smell. The employee must frequently lift and\/or move up to 10 pounds and occasionally lift and\/or move more than 100 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.<br \/>Must have full range of body motion.<br \/>While performing the duties of this job, the employee is regularly exposed to moving mechanical parts. The employee is frequently exposed to wet and \/or humid conditions and risk of electrical shock. The employee is occasionally exposed to high, precarious places, fumes or airborne particles; toxic or caustic chemicals; outside weather conditions, and extreme cold. The noise level in the work environment is usually loud.<br \/>Responsibilities:<br \/>Ability to disassemble and assemble all parts of machines and support equipment according to the manufacturers, specifications<br \/>Trouble shoots and repairs all equipment in the plant<br \/>Do preventative maintenance on all equipment as scheduled<br \/>Be able to read electrical schematic<br \/>Have a basic understanding of hydraulic<br \/>Arc welding and\/or Heliarc welding<br \/>Electrical troubleshooting and repair<br \/>Electronic and PLC troubleshooting and repair<br \/>Rebuilding gearboxes and drives<br \/>Repair and troubleshooting of filling machines<br \/>Rebuilding valves and pumps<br \/>Ensure full compliance with all company safety policies and procedures<br \/>Access all areas of machines and support equipment<br \/>Access all areas of the facilities as is needed to perform repairs and maintenance<br \/>Provide own hand tools<br \/><br \/>\"}"
}