{
    "id":"Kaggle::techmap::6150e2fadd918b59cf241ddc::monster2_nl::0",
    "label_age":true,
    "analysis_age":"The phrase \"young and innovative SaaS company\", the description of employees as \"enthusiastic\", and \"organization with a lot of young people\" subtly imply a preference for younger candidates and a company culture that favors them.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2021-08-27iSense. Net Developer  Azure  Angular  SaaSWould you like to work in a young and innovative SaaS company with their office in the city center of Amsterdam? Do you thrive in an environment with a lot of freedom and responsibility? Then this might be your next step! ISKE48834NieuwCompany profile. This company is an international operating SaaS company that, with their software, tries to improve the heatlh and luck of employees worldwide. Every year at least 2 million people use their software in their own language. The employees of this company can be described as a young, enthusiastic, international group of people. They have a lot of freedom and responsibility in their day to day activities and they feel proud to work at this company. With this mindset they have achieved amazing things over the past few years. That's why they are growing a lot and are looking to expand their Development team. As a full stack Developer you will work in a Scrum team with 4.6 other Developers and a Product Owner. You will work with the newest technologies (A. O. NET Core and Angular) and in Azure, since the platform is hosted there. In this role you will also work with Microservices, experience with this is not a must. Each Scrum team is responsible for a certain part of the SaaS environment. There is no Architect for this platform. Instead, they have an architectural board with a representative of each Scrum team. Why do you want to work here? You will work in a Scrum team with a lot of autonomy. You work on a fast growing SaaS platform that is used by a lot of people worldwide. Employee happiness is very important, so they take good care of their employees. You will work in a mature, international organization with a lot of young people. Job description. Developing new and improve current applications using mostly. NET Core and Angular. Everything is hosted in Azure. Delivering quality code using code reviews, test driven development and continuous integration. Come up with suggestions for improvement, your ideas are appreciated. Share ideas for the architecture in the architecture board. Contribute to further develop the more 'traditional' application landscape to a full-fledged SaaS environment. Requirements. You have a bachelor or a master's degree. At least 3 years of experience working with. NET Core.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6150e2fadd918b59cf241ddc::monster2_nl\", \"source\": \"monster2_nl\", \"country\": \"NL\", \"company\": \"iSense\", \"position\": \"Net Developer \/ Azure \/ Angular \/ SaaS @ Amsterdam\", \"notes\": \"\", \"original\": \"2021-08-27iSense.Net Developer | Azure | Angular | SaaSWould you like to work in a young and innovative SaaS company with their office in the city center of Amsterdam? Do you thrive in an environment with a lot of freedom and responsibility? Then this might be your next step! ISKE48834NieuwCompany profileThis company is an international operating SaaS company that, with their software, tries to improve the heatlh and luck of employees worldwide. Every year at least 2 million people use their software in their own language. The employees of this company can be described as a young, enthusiastic, international group of people. They have a lot of freedom and responsibility in their day to day activities and they feel proud to work at this company. With this mindset they have achieved amazing things over the past few years. That's why they are growing a lot and are looking to expand their Development team.As a full stack Developer you will work in a Scrum team with 4 - 6 other Developers and a Product Owner. You will work with the newest technologies (A.O. .NET Core and Angular) and in Azure, since the platform is hosted there. In this role you will also work with Microservices, experience with this is not a must. Each Scrum team is responsible for a certain part of the SaaS environment. There is no Architect for this platform. Instead, they have an architectural board with a representative of each Scrum team.Why do you want to work here?You will work in a Scrum team with a lot of autonomy;You work on a fast growing SaaS platform that is used by a lot of people worldwide;Employee happiness is very important, so they take good care of their employees;You will work in a mature, international organization with a lot of young people. Job descriptionDeveloping new and improve current applications using mostly .NET Core and Angular. Everything is hosted in Azure;Delivering quality code using code reviews, test driven development and continuous integration;Come up with suggestions for improvement, your ideas are appreciated;Share ideas for the architecture in the architecture board;Contribute to further develop the more 'traditional' application landscape to a full-fledged SaaS environment. RequirementsYou have a bachelor or a master's degree;At least 3 years of experience working with .NET Core;At least 2 years of experience working with Angular and Azure;You are someone that likes to share his\/her ideas and comes up with suggestions for improvement; Experience with event driven or distributed systems would be nice, but is not a must. BenefitsHoliday pay 8% of gross annual salary;25 Vacation days + 0.5 bonus day per quarter if you have remained fit and healthy (read: do not report sick);Travel allowance 19 cents \/ kilometer;E-learning portal with (almost) all IT training and education that you can propose;50 euros for medical expenses (you can count gross on top of your salary!).Salary rangeBased on relevant education, work experience and certifications, you can expect a salary between 4.000,- and 5.750,- gross per month based on a 40-hours workweek.About Experis iSenseExperis iSense is a young, energetic and ambitious specialist in IT employment services. Experis iSense will help you find a job on different levels within organisations, such as operations, business consultancy, and (project)management. We want to help you find a job where you can be successful and above all happy. Working together with Experis iSense will bring you:Personal guidance before, during and after your application process;Good understanding of your personal skills through various reports;Relevant preparation for your job interview;Always aware of your application process;Monthly personal contact with a Field Coach;Free participation on a quarterly basis in Personal Development Workshops;Regular interaction with your Experis iSense colleagues in your region (iHaveFun).LocatieAmsterdamOp aanvraagPublicatiedatum27.08.2021Publicatie eindigt25.11.2021\"}"
}