{
    "id":"Kaggle::techmap::61348368a8a8c37953dd03db::itjobslist_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The physical requirements are described as optional, so is there a need for \"Ability to stand, walk, bend, type and sit for up to (8) hours.\"",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Univision is seeking a Production Assistant based in Miami, FLThe Production assistant position is a part-time seasonal position responsible for working with the production team to assist in all issues related to studio, remote, and operational needs. This is a great opportunity for a passionate music fan and someone with a flexible schedule. Job Responsibilities. Provides support to production executives as needed. Works within the established venue to provide support to production team. Reads a production schedule and show run-down. Works with and interacts with high-profile talent and management teams as their on-site contact. Required Skills & Experience. Ability to work nights, weekends and holidays. Strong passion for music. Previous experience working live music awards show is a plus. Desired Skills & Experience. Fluent in English (read and write), Spanish is a plus. Eligibility Requirements. Most be willing to work from venue location. * Employment\/education will be verified. Must have unrestricted authorization to work in the United States. Physical Requirements (optional). Ability to stand, walk, bend, type and sit for up to (8) hours. Univision is an equal opportunity\/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61348368a8a8c37953dd03db::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"Univision Communications\", \"position\": \"Production Assistant-Seasonal\", \"notes\": \"\", \"original\": \"Univision is seeking a Production Assistant based in Miami, FLThe Production assistant position is a part-time seasonal position responsible for working with the production team to assist in all issues related to studio, remote, and operational needs.This is a great opportunity for a passionate music fan and someone with a flexible schedule.Job Responsibilities* Provides support to production executives as needed.* Works within the established venue to provide support to production team.* Reads a production schedule and show run-down.* Works with and interacts with high-profile talent and management teams as their on-site contact.Required Skills & Experience* Ability to work nights, weekends and holidays.* Strong passion for music* Previous experience working live music awards show is a plus.Desired Skills & Experience* Fluent in English (read and write), Spanish is a plus.Eligibility Requirements* Most be willing to work from venue location.* Employment\/education will be verified.* Must have unrestricted authorization to work in the United StatesPhysical Requirements (optional)* Ability to stand, walk, bend, type and sit for up to (8) hours.Univision is an equal opportunity\/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.\"}"
}