{
    "id":"Kaggle::techmap::61443a70849ca910f70db3ea::linkedin_us::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"he \/she\" can be seen as excluding those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"About Marvell. At Marvell, we believe that infrastructure powers progress. That execution is as essential as innovation. That better collaboration builds better technology. Trusted by the world’s leading technology companies for 25 years, we move, store, process and secure the world’s data with semiconductor solutions designed for our customers’ current needs and future ambitions. Through a process of deep collaboration and transparency, we’re ultimately changing the way tomorrow’s enterprise, cloud, automotive, and carrier architectures transform—for the better. The data infrastructure that our customers build has never been more critical to our global economy. It’s what’s keeping the world connected, businesses running, and information flowing. If you’re ready to excel, innovate, and truly enjoy your work, apply now for the position detailed below. The Opportunity. Providing low latency, high system capacity and high per-user data rates – all necessary requirements for a 5G network – requires both the densification of the radio access network (RAN) and the deployment of additional network nodes. As 5G radio networks increasingly use wider bandwidths, the demand for high throughput micro cells with full macro cell capabilities has increased dramatically. Marvell’s OCTEON Fusion DPUs are targeted for multi-sector macro cell base stations, micro cell base stations, intelligent radio heads and O-RAN-defined distributed units (DUs). This involves contract negotiations and statement of work definitions to align customer needs and expectations with ability to deliver, planning and forecasting to best align wafer, substrate, and component supply with customer demand, and leading business planning activities such as pricing and market sizing. The Product Manager will be responsible for complete alignment between the business unit, the sales organization, and our customers. Within the business unit, s \/he will be working with all functions, including software and hardware engineering, finance, operations, and marketing, across the entire lifecycle of multiple products. The successful candidate combines broad technical knowledge of wireless and networking technologies, working experience in the semiconductor space, excellent business\/financial understanding, and superb communication skills. He or she will have a deep understanding, not only of our SoC product portfolio, but also of the customer business and use cases.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61443a70849ca910f70db3ea::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Marvell Technology\", \"position\": \"Product Marketing Manager - Strategic Accounts\", \"notes\": \"\", \"original\": \"<strong><u>About Marvell<br><br><\/u><\/strong>At Marvell, we believe that infrastructure powers progress. That execution is as essential as innovation. That better collaboration builds better technology. Trusted by the world\\u2019s leading technology companies for 25 years, we move, store, process and secure the world\\u2019s data with semiconductor solutions designed for our customers\\u2019 current needs and future ambitions. Through a process of deep collaboration and transparency, we\\u2019re ultimately changing the way tomorrow\\u2019s enterprise, cloud, automotive, and carrier architectures transform\\u2014for the better.<br><br>The data infrastructure that our customers build has never been more critical to our global economy. It\\u2019s what\\u2019s keeping the world connected, businesses running, and information flowing. If you\\u2019re ready to excel, innovate, and truly enjoy your work, apply now for the position detailed below.<br><br><strong>The Opportunity<br><br><\/strong>Providing low latency, high system capacity and high per-user data rates \\u2013 all necessary requirements for a 5G network \\u2013 requires both the densification of the radio access network (RAN) and the deployment of additional network nodes. As 5G radio networks increasingly use wider bandwidths, the demand for high throughput micro cells with full macro cell capabilities has increased dramatically. Marvell\\u2019s OCTEON Fusion DPUs are targeted for multi-sector macro cell base stations, micro cell base stations, intelligent radio heads and O-RAN-defined distributed units (DUs).<br><br>This position would report to the Senior Director of Wireless Marketing of the Processors Business Group and will focus on ensuring smooth business operation, particularly around our largest customers. This involves contract negotiations and statement of work definitions to align customer needs and expectations with ability to deliver, planning and forecasting to best align wafer, substrate, and component supply with customer demand, and leading business planning activities such as pricing and market sizing.<br><br>The Product Manager will be responsible for complete alignment between the business unit, the sales organization, and our customers. Within the business unit, s \/he will be working with all functions, including software and hardware engineering, finance, operations, and marketing, across the entire lifecycle of multiple products.<br><br>The successful candidate combines broad technical knowledge of wireless and networking technologies, working experience in the semiconductor space, excellent business\/financial understanding, and superb communication skills. He or she will have a deep understanding, not only of our SoC product portfolio, but also of the customer business and use cases. S\/he will closely follow the market dynamics with an eye on the competition, maintain product forecasts and market sizing information, anticipate future application supply needs, and establish deep-rooted relationships with internal stakeholders, partners, and customers.<br><br><strong><u>Other Responsibilities For This Position Include<br><\/u><\/strong><ul><li>Advocate for the customer and represent the customer\\u2019s voice in various internal decision-making processes, while striving to maximize value for Marvell.<\/li><li>Provide market analysis that will guide product pricing and business forecasts.<\/li><li>Help drive the sales funnel for Marvell\\u2019s SoC and board products.<\/li><li>Support business planning activities: market\/technology trends, market sizing (TAM, SAM, SOM), key customers to win, competitive analysis, product positioning and pricing.<\/li><li>Negotiate statements of work, legal and commercial terms, volume commitments, and pricing with customers and partners<\/li><li>Ensure quality input into business intelligence and forecasting tools<\/li><li>Assist engineering and sales\/FAEs to navigate escalations, change requests, schedule constrains, and other realities of product development, introduction, and mass production<\/li><li>Develop product and solution strategies with sales and cross-functional teams that yield design wins at targeted customer accounts.<\/li><li>Manage key ecosystem and technology alliances for product and solution success.<\/li><li>Collaborate with engineering to develop reference design solutions for leading use cases and architecture engagements with leading customers and their platform partners.<br><\/li><\/ul>To be considered for this position, a candidate will possess, and demonstrate, the following education, skills, experience, and characteristics:<br><ul><li>Bachelor\\u2019s degree in Business, Science, Arts or related fields and 5-10 years of related professional experience Or Master\\u2019s degree and\/or PhD in Business, Science, Arts or related fields with 3-5 years of experience.<\/li><li>7 years of relevant semiconductor experience with solid understanding of networking and\/or wireless technologies is preferred.<\/li><li>Excellent communication, interpersonal and presentation skills to all levels of the corporation, internal, partner and customer.<\/li><li>Can-do self-starter with strong cross-functional leadership skills.<\/li><li>Demonstrated product life-cycle management across whole product NPI process.<\/li><li>Proven ability to gain respect and work effectively with sales and engineering organizations.<\/li><li>Must be highly motivated, self-driven, and eager to learn new technologies<br><\/li><\/ul><strong><strong>The Perks<br><br><\/strong><\/strong>With competitive compensation and great benefits, you will enjoy our workstyle within an incredible culture. We\\u2019ll give you all the tools you need to succeed so you can grow and develop with us. For additional information on what it\\u2019s like to work at Marvell, visit our Careers page.<br><br><strong><strong>Your Future<br><br><\/strong><\/strong>Marvell provides a work environment that promotes employee growth and development. We are searching for an individual who wants to grow with the company and will strive to improve performance. If you are driven, personable, and energetic, there will be additional opportunities for you here at Marvell.<br><br>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.<br><br>Any applicant who requires a reasonable accommodation during the selection process should contact Marvell HR Helpdesk at GR-HR-Services-Americas@marvell.com or 408-222-3604.<br><br>2101898<br><br>\"}"
}