{
    "id":"Kaggle::techmap::613fd0f2ff961119564fc1da::seek_au::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Physically fit\" might discourage those with disabilities",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Amaroo Mining and Civil Pty Ltd is an indigenous mining services company based in the Kimberley and Pilbara region. As part of our growth of civil works in the Kimberley, we are seeking experienced Grader Operators with Final Trim GPS experience for an immediate start. An attractive sign on bonus is also offered. Various position are available with a range of FIFO and drive in drive out options available. These positions will be regarded as long term, with the ability to transition to a permanent contract. The successful candidates will have: HR Drivers Licence, Grader tickets and VOC. Significant experienced grader operator on a 140M Grader. GPS and Final Trim experience. Construction White Card. Physically fit and able to pass pre-employment medicals. Experience of working on remote sites. Provision of 2 referees. As an indigenous business we also welcome candidates of Aboriginal and Torres Strait Islander descent. We look forward to having our staff taking responsibility and stepping up when needed. In turn, we will not treat our staff as “just a number\". At Amaroo we strive to always be leading in employee satisfaction. Amaroo prides itself on delivering excellent customer service to our clients in a safe work environment..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613fd0f2ff961119564fc1da::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Amaroo Mining and Civil\", \"position\": \"Grader Operators (including Final Trim)\", \"notes\": \"\", \"original\": \"<p><strong>Amaroo Mining and Civil Pty Ltd <\/strong>is an indigenous mining services company based in the Kimberley and Pilbara region.\\u00a0<\/p><p>As part of our growth\\u00a0of civil works in the Kimberley, we are seeking\\u00a0<strong>experienced Grader Operators with Final Trim GPS experience\\u00a0for an immediate start. An attractive sign on bonus is also offered.<\/strong><\/p><p>Various position are available with a range of FIFO and drive in drive out options available. These positions will be regarded as long term, with the ability to transition to a permanent\\u00a0contract.<\/p><p>The successful candidates will have:<\/p><ul><li>HR Drivers Licence,\\u00a0Grader tickets and VOC<\/li><li>Significant experienced grader operator on a 140M Grader<\/li><li>GPS and Final Trim experience<\/li><li>Construction White Card<\/li><li>Physically fit and able to pass pre-employment medicals<\/li><li>Experience of working on remote sites.<\/li><li>Provision of 2 referees<\/li><\/ul><p>\\u00a0As an indigenous business we also welcome candidates of Aboriginal and Torres Strait Islander descent.<\/p><p>We look forward to having our staff taking responsibility and stepping up when needed. In turn, we will not treat our staff as \\u201c<em>just a number<\/em>\\\". At Amaroo we strive to always be leading in employee satisfaction.\\u00a0<\/p><p>Amaroo prides itself on delivering excellent customer service to our clients in a safe work environment.\\u00a0<\/p><p>\\u00a0<\/p><p>\\u00a0<\/p><p>\\u00a0<\/p>\"}"
}