{
    "id":"Kaggle::techmap::6156186ea6740c534abc7725::monster_ca::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Over-emphasis on physical requirements for a desk job.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" a€Requires the ability to sit for long periods of time, with frequent interruptionsa€Requires several hours per day of sitting, getting up and down from chairs, and reaching, bending, or carrying light loadsa€Requires manual dexterity with normal hand and finger movements for typical office work a€Talking, hearing, and seeing are important elements of completing assigned tasksa€Occasionally lifts, carries, positions, or moves objects weighing up to 50 poundsa€Working environment is usually in a frozen food and office setting, with occasional need to leave the premisesa€Occasionally works overtime, evenings, or weekends in order to complete work or to attend meetings a€Travel may be required Americold is an Equal Opportunity\/Affirmative Action Employer. EOE\/AA M\/F\/D\/V DFW.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156186ea6740c534abc7725::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Americold Logistics, LLC\", \"position\": \"Warehouse Supervisor\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Overview: <p style=\\\"margin:0px\\\">Americold provides temperature-controlled warehousing and transportation to food producers, restaurants, schools and retail outlets such as grocery stores. We're proud to provide an essential link in the food industry supply chain and to help put food on tables around the world. <br><br>Based in Atlanta, Georgia, Americold owns and operates temperature-controlled warehouses around the world. We have over 16,000 associates and offer a wide variety of career opportunities - from warehouse forklift operators and supervisors to accounting, administration, business development, customer support, engineering, transportation, and technology solutions positions.<\/p>Responsibilities: <pre style=\\\"white-space:pre-wrap\\\">Primary Responsibility: Responsible for coordinating and supervising all warehouse activities of an assigned work team on a shift basis by directing assigned Associates in the receiving, warehousing, and shipping of customer product in a manner consistent with service and cost objectives.Essential Functions:\\u00e2\\u20ac\\u00a2Supervise and coordinate the most efficient unloading of inbound shipments, orderly stacking of product, and the picking and staging of outbound shipments in accordance with the highest possible levels of quality.\\u00e2\\u20ac\\u00a2Ensure inbound and outbound shipments are accurate and free of damage.\\u00e2\\u20ac\\u00a2Responsible for the cross communication between shifts.\\u00e2\\u20ac\\u00a2Ensure the efficient and safe operation of all materials handling equipment.\\u00e2\\u20ac\\u00a2Maintain a clean; neat, and orderly work area; ensure all security policies and procedures are followed.\\u00e2\\u20ac\\u00a2Ensure Associates follow all safety policies and procedures. Thoroughly investigate and report all safety accidents and violations in a timely manner. Conduct operations in accordance with OSHA and MSDS Standards.\\u00e2\\u20ac\\u00a2Ensure proper food safety practices are maintained.\\u00e2\\u20ac\\u00a2Direct the operations of the assigned work team to achieve prescribed objectives. \\u00e2\\u20ac\\u00a2Conduct shift meetings. \\u00e2\\u20ac\\u00a2Follow all policies and procedures.\\u00e2\\u20ac\\u00a2Plan work schedules and assign duties to maintain adequate staff for effective performance of activities and response to fluctuating workloads. \\u00e2\\u20ac\\u00a2Prepare and maintain work records and reports of information such as employee time and wages, daily receipts, or inspection results. \\u00e2\\u20ac\\u00a2Collaborate with workers and managers to solve work-related problems. \\u00e2\\u20ac\\u00a2Evaluate employee performance and prepare performance appraisals. \\u00e2\\u20ac\\u00a2Conduct staff meetings to relay general information or to address specific topics, such as safety. \\u00e2\\u20ac\\u00a2Counsel employees in work-related activities, personal growth, or career development. \\u00e2\\u20ac\\u00a2Recommend or initiate personnel actions, such as promotions, transfers, or disciplinary measures. \\u00e2\\u20ac\\u00a2Assess training needs of staff and arrange for or provide appropriate instruction. \\u00e2\\u20ac\\u00a2Resolve personnel problems, complaints, or formal grievances when possible, or refer them to higher-level supervisors for resolution. \\u00e2\\u20ac\\u00a2Other duties as requested.<\/pre>Qualifications: <pre style=\\\"white-space:pre-wrap\\\">Qualifications &amp; Experience:\\u00e2\\u20ac\\u00a2HS Diploma, Associates Degree Preferred\\u00e2\\u20ac\\u00a23+ years supervisory or warehouse experience; or successful completion of Americold\\u00e2\\u20ac\\u2122s internship program; or a bachelor\\u00e2\\u20ac\\u2122s degree.\\u00e2\\u20ac\\u00a2Maintain forklift certification.Knowledge, Skills and Abilities:\\u00e2\\u20ac\\u00a2Ability to perform the same work duties as those supervised or performs more difficult or skilled tasks or assist in their performance. \\u00e2\\u20ac\\u00a2Ability to supervise employees.\\u00e2\\u20ac\\u00a2Ability to work in fast-paced, deadline-oriented environment.\\u00e2\\u20ac\\u00a2Ability to communicate effectively with variety of individuals\\u00e2\\u20ac\\u00a2Ability to pay close attention to detail.\\u00e2\\u20ac\\u00a2Strong interpersonal skills and judgment in communicating with staff.\\u00e2\\u20ac\\u00a2Must be able to relate to others beyond giving and receiving instructions: they must get along with co-workers without exhibiting behavioral extremes; perform work activities requiring reasoning, negotiating, instructing, persuading, or speaking with others; and respond appropriately to criticism from a manager.\\u00e2\\u20ac\\u00a2Willingness to develop a mentoring relationship in order to contribute experience, skills, and wisdom to subordinate employees for their development. \\u00e2\\u20ac\\u00a2Receptive to management development suggestions and willing to seek additional knowledge to facilitate job growth.\\u00e2\\u20ac\\u00a2Excellent written and oral communication skills.\\u00e2\\u20ac\\u00a2Proven ability to juggle multiple tasks simultaneously.\\u00e2\\u20ac\\u00a2Must have very strong customer service orientation with high sense of urgency in meeting objectives and deadlines.\\u00e2\\u20ac\\u00a2May require experience working in a union environment.\\u00e2\\u20ac\\u00a2Tools and Technology Required: Microsoft Office Suite, Calculators, Desktop computers and Photocopiers Physical Requirements:To perform this job successfully, an individual must be able to perform the essential functions for this position and meet the physical requirements needed to perform them. Reasonable accommodations may be made for qualified individuals with disabilities.\\u00e2\\u20ac\\u00a2Requires the ability to sit for long periods of time, with frequent interruptions\\u00e2\\u20ac\\u00a2Requires several hours per day of sitting, getting up and down from chairs, and reaching, bending, or carrying light loads\\u00e2\\u20ac\\u00a2Requires manual dexterity with normal hand and finger movements for typical office work \\u00e2\\u20ac\\u00a2Talking, hearing, and seeing are important elements of completing assigned tasks\\u00e2\\u20ac\\u00a2Occasionally lifts, carries, positions, or moves objects weighing up to 50 pounds\\u00e2\\u20ac\\u00a2Working environment is usually in a frozen food and office setting, with occasional need to leave the premises\\u00e2\\u20ac\\u00a2Occasionally works overtime, evenings, or weekends in order to complete work or to attend meetings \\u00e2\\u20ac\\u00a2Travel may be required Americold is an Equal Opportunity\/Affirmative Action Employer.EOE\/AA M\/F\/D\/V DFW.<\/pre> <\/div>\"}"
}