{
    "id":"Kaggle::techmap::614b3faa7f64d9144f551ab6::linkedin_sk::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Performs other related duties as assigned or requested by the Vice President, Medical or designee. KNOWLEDGE, SKILLS, AND ABILITIES: Ability to work in partnership with a multidisciplinary group of colleagues, including translating concepts into practical approaches and promoting consensus. Outstanding ability to work independently with minimal supervision, ability to work effectively within a team, and matrix environment. Ability to organize and work efficiently on several projects, each with specific requirements and\/or shifting priorities. Excellent oral and written communications skills as well as interpersonal skills are essential. CRITICAL JOB FUNCTIONS IN ACCORDANCE WITH ADA CRITERIA: Ability to travel domestically and internationally as required. Very limited physical effort required to perform normal job duties. MINIMUM RECRUITMENT STANDARDS: Current or prior license to practice medicine. Board certification\/eligibility. 10 years experience relevant to drug development and clinical research, including 3-5 years of biopharmaceutical industry, academic, and\/or clinical practice experience. At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible  to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70, 000. employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs. iqvia. com.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b3faa7f64d9144f551ab6::linkedin_sk\", \"source\": \"linkedin_sk\", \"country\": \"SK\", \"company\": \"IQVIA\", \"position\": \"Senior Medical Director - Internal Medicine Europe (Homebased)\", \"notes\": \"\", \"original\": \"Iqvia Biotech are looking for someone <strong>Board Certified only, or someone who has previous had board certification<br><br><\/strong><strong><u>BASIC FUNCTIONS: - <br><br><\/u><\/strong>The Senior Medical Director provides medical and scientific support to clinical research programs, study teams, and investigators. The Senior Medical Director also provides medical leadership, review, and advice for potentially or actually awarded clinical research programs. He\/she also may serve as a Medical Mentor to junior staff members. The Senior Medical Director may serve as lead on special projects or assignments for the Medical Department, as requested by the VP, Medical or designee.<br><br>The Senior Medical Director role is a team member participant role and functions in a matrix and reports to project teams much like other members of project teams. The primary role of Senior Medical Director is to serve as Medical Monitor for studies conducted by IQVIA Biotech on behalf of sponsor companies. In the role of Medical Monitor, the Senior Medical Director provides medical oversight as the first line of support for clinical trials to which he\/she is assigned as Medical Monitor. The principal function of a Medical Monitor is to serve as primary contact for the sponsor medical team and to serve as a medical resource to support the project team. The Medical Monitor is customarily available 24\/7 to answer questions from site coordinators and investigators and study team members on protocol inclusion\/exclusion criteria, protocol clarifications, and compliance issues. Major duties of the Medical Director are outlined below:<br><br><br><strong><u>ESSENTIAL JOB FUNCTIONS, DUTIES AND RESPONSIBILITIES:<br><br><\/u><\/strong><strong><u>Medical Monitoring:<br><br><\/u><\/strong>Clinical Activities:<br><br><br><ul><li>Per sponsor request, reviews and provides input for protocol development; interacts with key thought leaders and\/or sponsor representatives to develop inclusion\/exclusion criteria and study endpoints; interacts in a team approach to develop statistical and data management sections of the protocol; reviews the final protocol for clinical, safety and efficacy variables<\/li><li>Functions as project team member<\/li><li>Provides project team with training on therapeutic indication and\/or treatment modality<\/li><li>May provide study team with assistance in developing criteria for investigator site selection and networking for potential investigators for study participation, and aid in review and final selection<\/li><li>Participates in subject recruitment and retention activities which may include per sponsor request individual calls to key opinion leaders, investigators and site staff, and participation in teleconference and virtual presentations<\/li><li>Per sponsor request, presents protocol and\/or safety reporting information at investigator meetings<\/li><li>Develops project medical monitoring plan<\/li><li>Provides first line contact for investigators and monitors regarding study related medical\/safety issues and resolution of study protocol and patient eligibility issues<\/li><li>Provides medical input into the development of study protocols, training materials, informed consent, Investigator Drug Brochures, analysis plan designs, clinical study reports, regulatory approval submissions<\/li><li>Provides on call coverage for protocol queries and site support<br><br><\/li><\/ul>Safety Monitoring and SAE Reporting Activities:<br><br><br><ul><li>Works with the IQVIA Biotech or vendor Safety Management Department to provide medical review and case assessment of SAEs\/UADEs including review and edits of SAE narratives and safety queries, follow-up on outstanding safety queries, and interacting with sponsors and investigative sites to discuss safety issues as needed <\/li><li>Per sponsor request, reviews IND\/SUSAR Safety Reports, updates to Investigator Brochures, and annual IND reports with sponsor data<\/li><li>In consultation with the sponsor, follows procedures for acquiring knowledge of subject treatment assignments (i.e. breaking the blind)<\/li><li>Interacts with regulatory officials concerning safety and other study related issues, as requested<br><br><\/li><\/ul>Data Activities:<br><br><br><ul><li>Provides medical review of eCRFs and edit check specifications for clinical accuracy<\/li><li>When indicated, provides Medical Data Review Plan as appendix to the Medical Monitoring Plan<\/li><li>Performs medical review of coded terms (e.g. adverse events, concomitant medications and medical history) for medical accuracy and consistency<\/li><li>Provides individual and aggregate review of clinical data as requested and specified in the Medical Data Review appendix<\/li><li>Reviews laboratory data as requested by sponsor and as specified in the MMP or Medical Data Review Appendix<\/li><li>Reviews data tables, listings, and figures as requested by sponsor<\/li><li>Reviews and\/or writes portions of final clinical study report as requested by sponsor<br><br><\/li><\/ul>Business Development Activities:<br><br><br><ul><li>Works with Business Development to actively solicit new business for IQVIA Biotech, including assistance with marketing presentations and proposal development<\/li><li>Interacts with clients regarding drug development programs, study design and protocol development<\/li><li>Reviews and provides medical and scientific input to new business proposals<\/li><li>Participates in feasibility discussions relating to specific project proposals<\/li><li>Supports business development activities with proposal development and sales presentations<br><br><\/li><\/ul>Special Projects:<br><br><br><ul><li>Obtains literature searches to acquire background information for study proposals, preparation of training sessions, and interpretation of clinical data, report writing, etc.<\/li><li>Assists with drafting of standard operating procedures and working practices regarding Medical Director activities<\/li><li>Participates in a variety of team quality improvement efforts as necessary<\/li><li>Performs other related duties as assigned or requested by the Vice President, Medical or designee<br><br><\/li><\/ul><strong><u>KNOWLEDGE, SKILLS, AND ABILITIES:<br><br><\/u><\/strong><ul><li>Ability to work in partnership with a multidisciplinary group of colleagues, including translating concepts into practical approaches and promoting consensus<\/li><li>Outstanding ability to work independently with minimal supervision, ability to work effectively within a team, and matrix environment<\/li><li>Ability to organize and work efficiently on several projects, each with specific requirements and\/or shifting priorities<\/li><li>Excellent oral and written communications skills as well as interpersonal skills are essential<br><br><\/li><\/ul><strong><u>CRITICAL JOB FUNCTIONS IN ACCORDANCE WITH ADA CRITERIA:<br><br><\/u><\/strong><ul><li>Ability to travel domestically and internationally as required<\/li><li>Very limited physical effort required to perform normal job duties<br><br><\/li><\/ul><strong><u>MINIMUM RECRUITMENT STANDARDS:<br><br><\/u><\/strong><ul><li>Current or prior license to practice medicine; board certification\/eligibility<\/li><li>10 years\\u2019 experience relevant to drug development and clinical research, including 3-5 years of biopharmaceutical industry, academic, and\/or clinical practice experience<br><br><\/li><\/ul>At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible \\u2013 to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70,000+ employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs.iqvia.com.<br><br>\"}"
}