{
    "id":"Kaggle::techmap::613823ace253a515ffad0894::itjobslist_us::11",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Summary The Revenue Recovery Supervisor (part-time) will train and supervise daily activities of employees assigned to the area. This will require that the supervisor work in a warehouse and office environment. He\/she will ensure that all assigned duties are accomplished safely and timely. The work schedule for this position will require the ability to cover other shifts as needed. Flexibility is required in regards to work week schedules and start and end times. Part-time management employees are generally expected to work 5 1\/2 hours per day and are paid weekly. Medical, dental, and vision benefits are offered to employees and their eligible dependents. Additional benefits include educational assistance, 401K, discounted stock purchase program, and paid vacations\/holidays. Job Duties\/Skills Must be able to bend, stoop, crouch, squat, crawl, climb, stand, sit and turn\/pivot. Must be experienced in Access, Excel, Word, and PowerPoint. Must be able to supervise and train employees effectively. Must be comfortable with decision making and have excellent time management skills. Self-motivated and works well with limited direct supervision. Must be a team player. Conduct audits of procedures and methods for the different UPS Systems. Generate reports to be used by the finance department. Must follow UPS appearance guidelines. Perform other duties that may be assigned UPS is an equal opportunity employer. UPS does not discriminate on the basis of race\/color\/religion\/sex. ational origin\/veteran\/disability\/age\/sexual orientation\/gender identity or any other characteristic protected by law",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613823ace253a515ffad0894::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"UPS\", \"position\": \"Revenue Recovery PT Supervisor - Parsippany Night\", \"notes\": \"\", \"original\": \"Job Summary The Revenue Recovery Supervisor (part-time) will train and supervise daily activities of employees assigned to the area. This will require that the supervisor work in a warehouse and office environment. He\/she will ensure that all assigned duties are accomplished safely and timely. The work schedule for this position will require the ability to cover other shifts as needed. Flexibility is required in regards to work week schedules and start and end times. Part-time management employees are generally expected to work 5 1\/2 hours per day and are paid weekly. Medical, dental, and vision benefits are offered to employees and their eligible dependents. Additional benefits include educational assistance, 401K, discounted stock purchase program, and paid vacations\/holidays. Job Duties\/Skills Must be able to bend, stoop, crouch, squat, crawl, climb, stand, sit and turn\/pivot. Must be experienced in Access, Excel, Word, and PowerPoint. Must be able to supervise and train employees effectively. Must be comfortable with decision making and have excellent time management skills. Self-motivated and works well with limited direct supervision. Must be a team player. Conduct audits of procedures and methods for the different UPS Systems. Generate reports to be used by the finance department. Must follow UPS appearance guidelines. Perform other duties that may be assigned UPS is an equal opportunity employer. UPS does not discriminate on the basis of race\/color\/religion\/sex\/national origin\/veteran\/disability\/age\/sexual orientation\/gender identity or any other characteristic protected by law\"}"
}