{
    "id":"Kaggle::techmap::615684367aa49c40310e415d::monster_uk::8",
    "label_age":true,
    "analysis_age":"The role title and the phrase \"a recent graduate\" suggest an age bias.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Are you looking for a fantastic career kick start opportunity to accelerate your career in a fast-paced and successful digital marketing agency that has a proven track record of developing and rewarding its team? If so, let's talk. Are you based in any of these areas: Watford, Rickmansworth, Hemel, St Albans, High Wycombe, Amersham, Chalfonts or Harrow? If so, let's talk. Note: WE LOVE A COVERING LETTER. Role Info: Graduate Digital Marketing Executive (Paid Media). Rickmansworth, Herts \/ Remote 2 days. £24, 000. up to 10% bonus. health insurance. An agency is only as good as its people. We recruit and retain the best! ## Glassdoor 5 Stars ##. “Fosters your growth and amazing company culture”. “An excellent team & high standards of work”. “Great company to work for, lots of freedom”. “Friendly agency with a supportive culture”. The Graduate Digital Marketing Executive Opportunity: You will be set up to succeed with a full training programme which will include first-class internal and external opportunities. We have a long history of developing our team and have many individuals within the team who have progressed from junior through to senior positions. We have a number of specialisms including SEO, Content, Paid Media and Digital PR. This role is within our paid media team. Key tasks: You will be responsible for supporting with, and delivering, a huge range of digital marketing activities to a diverse client base, activities including but not exclusively:. Assisting senior members of the team to deliver a wide variety of tasks. Managing the onboarding of new clients. Account management support. Analysing performance data and making campaign improvements. Building campaigns and writing ad copy. Setting up tracking using Google Analytics and Google Tag Manager. Producing monthly reports. About You: The successful candidate (a recent graduate or a junior marketeer with some work experience) will be able to demonstrate a genuine passion for digital marketing, specifically PPC\/paid media, and a very strong academic background. Self-motivation and a love of learning are essential as is a good technical\/creative aptitude – these attributes will enable you to grow quickly into a more senior position. The agency is growing and this role offers you a huge amount of scope to progress and develop in your career.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615684367aa49c40310e415d::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"RecruitmentRevolution.com\", \"position\": \"Graduate Digital Marketing Executive (Paid Media)\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p><em>Are you looking for a fantastic career kick start opportunity to accelerate your career in a fast-paced and successful digital marketing agency that has a proven track record of developing and rewarding its team? If so, let's talk.<\/em><\/p> <p><em>Are you based in any of these areas: Watford, Rickmansworth, Hemel, St Albans, High Wycombe, Amersham, Chalfonts or Harrow? If so, let's talk.<\/em><\/p> <p>Note: WE LOVE A COVERING LETTER <\/p> <p><strong>Role Info:<\/strong><\/p> <p><strong>Graduate Digital Marketing Executive (Paid Media)<br>Rickmansworth, Herts \/ Remote 2 days<br>\\u00a324,000 + up to 10% bonus + health insurance<\/strong><\/p> <p>An agency is only as good as its people.<br>We recruit and retain the best!<\/p> <p>## Glassdoor 5 Stars ##<br>\\u201cFosters your growth and amazing company culture\\u201d<br>\\u201cAn excellent team &amp; high standards of work\\u201d<br>\\u201cGreat company to work for, lots of freedom\\u201d<br>\\u201cFriendly agency with a supportive culture\\u201d<\/p> <p><strong>The Graduate Digital Marketing Executive Opportunity:<\/strong><\/p> <p>You will be set up to succeed with a full training programme which will include first-class internal and external opportunities. We have a long history of developing our team and have many individuals within the team who have progressed from junior through to senior positions.<\/p> <p>We have a number of specialisms including SEO, Content, Paid Media and Digital PR. This role is within our paid media team; you will be trained as a PPC specialist with exposure to search, display, video and paid social.<\/p> <p><strong>Key tasks:<\/strong><\/p> <p>You will be responsible for supporting with, and delivering, a huge range of digital marketing activities to a diverse client base, activities including but not exclusively:<\/p> <p>+ Assisting senior members of the team to deliver a wide variety of tasks<br>+ Managing the onboarding of new clients<br>+ Account management support<br>+ Analysing performance data and making campaign improvements<br>+ Building campaigns and writing ad copy<br>+ Setting up tracking using Google Analytics and Google Tag Manager<br>+ Producing monthly reports<\/p> <p><strong>About You:<\/strong><\/p> <p>The successful candidate (a recent graduate or a junior marketeer with some work experience) will be able to demonstrate a genuine passion for digital marketing, specifically PPC\/paid media, and a very strong academic background.<\/p> <p>Self-motivation and a love of learning are essential as is a good technical\/creative aptitude \\u2013 these attributes will enable you to grow quickly into a more senior position.<\/p> <p>The agency is growing and this role offers you a huge amount of scope to progress and develop in your career. Many of our team started as juniors and are now in management positions.<\/p> <p>Strong written and verbal communication are important as is being something of a \\u2018numbers geek\\u2019. Expertise in Excel\/Google Sheets ideal!<\/p> <p><strong>Why Us?<\/strong><\/p> <p>We are a leading agency specialising in SEO, PPC, Digital PR and Content working with a diverse and interesting portfolio of clients in a wide range of industries including large retail brands, legal and finance.<\/p> <p>There are some great perks including: up to 10% agency bonus, 25 days\\u2019 holiday, health insurance, allocated training budget and focus on continuous personal development, sensible work\/life balance, free breakfast and fruit, team lunches, industry meetups, as well as a friendly, fun and sociable team (to name but a few).<\/p> <p>We welcome home working for up to 2 days per week from the moment you start (increasing over time). We consider ourselves to be a flexible employer and do our best to facilitate any requests regarding working pattern and location.<\/p> <p>We have offices in both Rickmansworth town centre, minutes from the tube station, and in Angel Square, London (next door to Angel tube station).<\/p> <p><strong>Sounds like a good fit? Apply here for a fast-track path to the Hiring Manager to the Agency Directors<\/strong><\/p> <p>Your Experience \/ Background \/ Previous Roles May Include:<br>Digital Marketing Executive, Junior Digital Marketing Executive, Trainee PPC Marketing Assistant, Graduate PPC Marketing Executive, Performance Marketing, PPC Marketing, Google Ads, Search Marketing, Paid Search, Paid Advertising, PPC Executive.<\/p> <p>Application notice\\u2026 We take your privacy seriously. When you apply, we shall process your details and pass your application to our client for review for this vacancy only. As you might expect we may contact you by email, text or telephone. Your data is processed on the basis of our legitimate interests in fulfilling the recruitment process. Please refer to our Data Privacy Policy &amp; Notice on our website for further details.<\/p> <p>If you have any pre-application questions please contact us first quoting the job title &amp; ref. Good luck, Team RR.<\/p> <p>&nbsp;<\/p> <\/div>\"}"
}