{
    "id":"Kaggle::techmap::645590c5cf666163916fa794::simplyhired_us::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"As a Store Associate, you’ll be responsible for merchandising and stocking product, cashiering, and cleaning to keep the store looking its best. You’ll enhance the customer shopping experience by working collaboratively with the ALDI team and providing exceptional customer service. Position Type: Full-Time. Average Hours: 32-40 hours per week. Starting Wage: $15. 50 per hour. Duties and Responsibilities: Must be able to perform duties with or without reasonable accommodation. Processes customer purchases, perform general cleaning duties, stocks shelves and merchandise displays neatly. Provide exceptional customer service, assisting customers with their shopping experience. Collaborate with team members and communicate clearly to the store management team. Provide feedback to management on all products, inventory losses, scanning errors, and general issues. Participate in taking store inventory counts according to guidelines and monitoring inventory for accuracy. Adheres to cash policies and procedures to minimize losses. Complies with all established company policies and procedures while upholding the security and confidentiality of documents and data. Other duties as assigned. Physical Demands: Ability to stock merchandise from store receiving to shelving. Ability to place product, weighing up to 45 pounds, on shelving at various heights. Regularly required to sit, stand, bend, reach, push, pull, lift, carry and walk about the store. Must be able to perform duties with or without reasonable accommodation. Qualifications: Ability to provide prompt and courteous customer service. Ability to operate a cash register efficiently and accurately. Ability to safely and properly operate equipment, including electric\/manual hand jack, floor scrubber, and cardboard baler. Ability to perform general cleaning duties to company standards. Ability to interpret and apply company policies and procedures. Excellent verbal and written communication skills. Ability to work both independently and within a team environment. Ability to stay organized, give attention to detail, follow instructions and multi-task in a professional and efficient manner. Meet any state and local requirements for handling and selling alcoholic beverages. Education and Experience: High School Diploma or equivalent preferred. Prior work experience in a retail environment preferred. A combination of education and experience providing equivalent knowledge. ALDI offerscompetitive wages and benefits, including: 401(k) Plan. Company 401(k) Matching Contributions. Employee Assistance Program (EAP). Perk. Spot National Discount Program. In addition, eligible employees are offered:.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::645590c5cf666163916fa794::simplyhired_us\", \"source\": \"simplyhired_us\", \"country\": \"US\", \"company\": \"ALDI\", \"position\": \"Store Associate\", \"notes\": \"\", \"original\": \"<div><p>As a Store Associate, you&rsquo;ll be responsible for merchandising and stocking product, cashiering, and cleaning to keep the store looking its best. You&rsquo;ll enhance the customer shopping experience by working collaboratively with the ALDI team and providing exceptional customer service.<\/p>\\n<p><b>\\nPosition Type:<\/b> Full-Time\\n<br>\\n<b>Average Hours:<\/b> 32-40 hours per week<br>\\n<b>Starting Wage:<\/b> $15.50 per hour<\/p>\\n<p>\\nDuties and Responsibilities:\\n<br>\\nMust be able to perform duties with or without reasonable accommodation.<\/p>\\n<ul><li>Processes customer purchases, perform general cleaning duties, stocks shelves and merchandise displays neatly<\/li><li>Provide exceptional customer service, assisting customers with their shopping experience\\n<\/li><li>Collaborate with team members and communicate clearly to the store management team<\/li><li>Provide feedback to management on all products, inventory losses, scanning errors, and general issues<\/li><li>Participate in taking store inventory counts according to guidelines and monitoring inventory for accuracy<\/li><li>Adheres to cash policies and procedures to minimize losses<\/li><li>Complies with all established company policies and procedures while upholding the security and confidentiality of documents and data<\/li><li>Other duties as assigned<\/li><\/ul>\\n<p>\\nPhysical Demands:<\/p>\\n<ul><li>Ability to stock merchandise from store receiving to shelving; ability to place product, weighing up to 45 pounds, on shelving at various heights<\/li><li>Regularly required to sit, stand, bend, reach, push, pull, lift, carry and walk about the store<\/li><li>Must be able to perform duties with or without reasonable accommodation<\/li><\/ul>\\n<p>\\nQualifications:<\/p>\\n<ul><li>You must be 18 years of age or older to be employed for this role at ALDI<\/li><li>Ability to provide prompt and courteous customer service<\/li><li>Ability to operate a cash register efficiently and accurately<\/li><li>Ability to safely and properly operate equipment, including electric\/manual hand jack, floor scrubber, and cardboard baler<\/li><li>Ability to perform general cleaning duties to company standards<\/li><li>Ability to interpret and apply company policies and procedures<\/li><li>Excellent verbal and written communication skills<\/li><li>Ability to work both independently and within a team environment<\/li><li>Ability to stay organized, give attention to detail, follow instructions and multi-task in a professional and efficient manner<\/li><li>Meet any state and local requirements for handling and selling alcoholic beverages<\/li><\/ul>\\n<p>\\nEducation and Experience:<\/p>\\n<ul><li>High School Diploma or equivalent preferred<\/li><li>Prior work experience in a retail environment preferred<\/li><li>A combination of education and experience providing equivalent knowledge<\/li><\/ul><p>\\nALDI offers <b>competitive wages and benefits,<\/b> including:<\/p><ul>\\n<li>401(k) Plan<\/li>\\n<li>Company 401(k) Matching Contributions<\/li>\\n<li>Employee Assistance Program (EAP)<\/li>\\n<li>PerkSpot National Discount Program<\/li><\/ul>\\n<p>In addition, <b>eligible employees<\/b> are offered:<\/p><ul>\\n<li>Medical, Prescription, Dental &amp; Vision Insurance<\/li>\\n<li>Generous Vacation Time &amp; 7 Paid Holidays<\/li>\\n<li>Up to 6 Weeks Paid Parental Leave at 100% of pay<\/li>\\n<li>Up to 2 Weeks Paid Caregiver Leave at 100% of pay<\/li>\\n<li>Short and Long-Term Disability Insurance<\/li>\\n<li>Life, Dependent Life and AD&amp;D Insurance<\/li>\\n<li>Voluntary Term Life Insurance<\/li><\/ul><p><i><br>\\nALDI is committed to equal opportunity for all employees and applicants. As a proud Equal Opportunity Employer (EOE), we do not discriminate based on race, color, national origin, ancestry, citizenship status, religion, sex, sexual stereotyping, sexual orientation, gender, gender identity, gender expression, age, marital status, mental or physical disability, medical condition, genetic information, military or veteran status, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), or any other protected characteristic. Employment may be contingent upon ALDI's receipt of an acceptable and job-related drug test, motor vehicle report, and\/or reference check, as applicable and permissible by law.<\/i><\/p><\/div>\"}"
}