{
    "id":"Kaggle::techmap::6138202b1b8cc121e81dc646::linkedin_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"\"drive revenue, and manage budgets\" this is masculine leaning language",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 5 years' experience as a manager for multifamily properties. Ability to exceed customer service expectations, drive revenue, and manage budgets. Proficient in MS Office, specifically Excel and relevant databases and property management software. Knowledge of Fair Housing Laws, real estate laws and property management principles. Reliable, dependable and ability to work weekends or varied hours as needed. Must have reliable transportation, maintain a clean driving record and evidence of auto insurance in addition to remaining insurable under companys liability insurance policy. Bachelor's Degree or equivalent experience. Nothing in this job description restricts managements right to assign or reassign duties and responsibilities to this job at any time.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6138202b1b8cc121e81dc646::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Westhome Property Management Company\", \"position\": \"Regional Property Manager\", \"notes\": \"\", \"original\": \"<p>Regional Manager - Northern California\/Denver Colorado<\/p><p><em>-Multi-Family\/Student Housing<\/em><\/p><p><em>Must reside or wiling to be located in Northern California (San Jose Metro\/San Francisco Bay Area)<\/em><\/p><p><br><\/p><p><strong><u>Summary<\/u><\/strong><\/p><p>Executes and supports the firm\\u2019s strategies related to property management operations by directing team members on the assigned portfolio of properties, and by implementing policies, procedures, and practices to enable each property to meet and exceed budgeted financial goals and achieve operational performance objectives. Responsible for the direct supervision and development of a management team comprised of 3-6 General Managers within the assigned portfolio including multi-family and student housing. Provide leadership and successfully promotes firm values and creates an environment of exceptional customer service for residents, prospects, and vendors.<\/p><p><br><\/p><p><strong>Essential Duties and Responsibilities include the following but are not limited to:<\/strong><\/p><p><br><\/p><ul><li>Conduct weekly or bi-weekly inspections of each community within assigned portfolio.<\/li><li>Ensure all office and maintenance procedures are properly adhered to, including audits of leases and office files, revenue collection procedures, cash and expense control, etc.<\/li><li>Ensure timely and accurate preparation of various weekly, monthly, quarterly and annual reporting.<\/li><li>Assist in the preparation of the annual operating budget and guide on-site staff to translate budget goals into appropriate action.<\/li><li>Support on-site teams in achieving leasing objectives through effective motivation and by maintaining a deep understanding of competitive pricing and keeping informed of market conditions.<\/li><li>Ensure all aspects of accounting, including rent collections, delinquent accounts, expenditures, and purchasing are within operating or capital budgetary guidelines and in accordance with firm policy.<\/li><li>Monitor the use of the property management software and the daily flow of paperwork including data entry, reports, deposits, leases, etc. ensuring their accuracy and promptness.<\/li><li>Handle special problems which arise from time to time in the area of resident-landlord relations.<\/li><li>Set and communicate clear standards and lead on-site staff so they strive for efficiency, fairness and consistency, to meet their full potential.<\/li><li>Meet with upper management and support departments on a regular basis to communicate property and employee relation issues.<\/li><li>Evaluate manager\\u2019s performance, complete annual performance reviews and manage performance issues effectively.<\/li><li>Attend to the training needs of the staff at each property.<\/li><li>Review, analyze, and interpret market data to identify emerging trends that may impact the performance of the portfolio and work with the area manager and asset manager to develop and implement market plans driving occupancy and revenue growth.<\/li><\/ul><p><br><\/p><p><strong>Qualifications<\/strong><\/p><ul><li>5+ years' experience as a manager for multifamily properties.<\/li><li>Ability to exceed customer service expectations, drive revenue, and manage budgets.&nbsp;<\/li><li>Proficient in MS Office, specifically Excel and relevant databases and property management software.<\/li><li>Knowledge of Fair Housing Laws, real estate laws and property management principles.<\/li><li>Reliable, dependable and ability to work weekends or varied hours as needed.<\/li><li>Must have reliable transportation, maintain a clean driving record and evidence of auto insurance in addition to remaining insurable under company\\u2019s liability insurance policy.<\/li><li>Bachelor's Degree or equivalent experience.<\/li><\/ul><p><br><\/p><p>Nothing in this job description restricts management\\u2019s right to assign or reassign duties and responsibilities to this job at any time.<\/p>\"}"
}