{
    "id":"Kaggle::techmap::6137c2ff74730d4d56e632b0::britishjobs_uk::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"While the role is a physically demanding one, the phrase \"need to be a robust and a fit person\" is vague and may discourage those who are physically able for the job.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Specification. For: Junior Laboratory Assistant (College leaver\/ Junior Graduate position). Meyer Scott Ref: VR\/08222. Location: Huntingdon. Salary: GBP8. 91p\/h- GBP9. 00p\/h (Dependent on experience). We are currently looking for a candidate to actively assist in a UKAS Accredited Materials laboratory where testing of both Soils and Aggregates takes place for Civil Engineering Purposes. The candidate will need to be a robust and a fit person who is able to manage the sorting and preparation of samples up to 20kg in weight, and cope with the physical demands of using laboratory compaction equipment to define certain properties of materials. Full training in sample handling, lifting, and health and safety aspects in the lab will be given. Duties & responsibilities will include: Working under the direction of the Laboratory Manager and his assistants, the candidate will be gradually deemed proficient to carry out several different tests including: Sample preparation, Riffling and Quartering. Water content. Particle Size Distribution. Particle Density. Optimum Moisture content and Maximum Dry Density. Aggregate durability tests (Los Angeles Abrasion \/ Magnesium Sulfate Soundness). There would also be the possibility of assisting our clients site team, carrying out sampling and site testing, as such a clean driving license would be essential. Support the team by preparing samples prior to testing, cleaning laboratory equipment after use and occasionally assisting with simple routine testing. The role involves working methodically and using a high level of attention to detail when preparing samples and accurate recording of data and other information. Desired QUALIFICATIONS: The successful candidate will need to be able to work as part of a team, This role requires candidates to be able to work independently, observing risk assessments and wearing appropriate clothing when required. The candidate must also have a methodical and logical approach to work have a precise manner, clear writing, and a basic understanding of Maths and be able to input data into a computer system. GCSE good passes in Maths, Physics and possibly Geology would be advantageous. Working Hours: This will be a full-time position of 37. 5 to 40 hours per week, normal hours are between 0700 and 1700 hours to suit personal situations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137c2ff74730d4d56e632b0::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Meyer-Scott Recruitment Services\", \"position\": \"Junior Laboratory Assistant School Leaver or Junior Graduate\", \"notes\": \"\", \"original\": \"Job Specification <br><br>For: Junior Laboratory Assistant (College leaver\/ Junior Graduate position) <br><br>Meyer Scott Ref: VR\/08222 <br><br>Location: Huntingdon <br><br>Salary: GBP8.91p\/h- GBP9.00p\/h (Dependent on experience) <br><br>We are currently looking for a candidate to actively assist in a UKAS Accredited Materials laboratory where testing of both Soils and Aggregates takes place for Civil Engineering Purposes. <br><br>The candidate will need to be a robust and a fit person who is able to manage the sorting and preparation of samples up to 20kg in weight, and cope with the physical demands of using laboratory compaction equipment to define certain properties of materials. <br>Full training in sample handling, lifting, and health and safety aspects in the lab will be given. <br><br>Duties &amp; responsibilities will include: <br><br>Working under the direction of the Laboratory Manager and his assistants, the candidate will be gradually deemed proficient to carry out several different tests including: <br><br>Sample preparation, Riffling and Quartering <br>Water content. <br>Particle Size Distribution. <br>Particle Density <br>Optimum Moisture content and Maximum Dry Density <br>Aggregate durability tests (Los Angeles Abrasion \/ Magnesium Sulfate Soundness) <br><br>There would also be the possibility of assisting our clients site team, carrying out sampling and site testing, as such a clean driving license would be essential. The candidate would be put through the course to gain a CSCS card to enable them to work on Civil Engineering and Construction sites. <br>Support the team by preparing samples prior to testing, cleaning laboratory equipment after use and occasionally assisting with simple routine testing. The role involves working methodically and using a high level of attention to detail when preparing samples and accurate recording of data and other information. <br><br>Desired QUALIFICATIONS: <br><br>The successful candidate will need to be able to work as part of a team, This role requires candidates to be able to work independently, observing risk assessments and wearing appropriate clothing when required. The candidate must also have a methodical and logical approach to work have a precise manner, clear writing, and a basic understanding of Maths and be able to input data into a computer system. <br><br>GCSE good passes in Maths, Physics and possibly Geology would be advantageous. <br><br>Working Hours: <br><br>This will be a full-time position of 37.5 to 40 hours per week, normal hours are between 0700 and 1700 hours to suit personal situations. <br><br>\"}"
}