{
    "id":"Kaggle::techmap::614932924fab796ab5187fb4::dice_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The physical requirements of standing, walking, sitting, using hands, and lifting up to 25lbs can exclude individuals with certain physical disabilities. It's important to specify that reasonable accommodations will be made to ensure inclusivity.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" -While performing the duties of this job, the associate may be required to stand, walk, and sit. The associate is frequently. required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to. occasionally lift and\/or move up to 25lbs\/12kg. -Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and. the ability to adjust focus...",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614932924fab796ab5187fb4::dice_us\", \"source\": \"dice_us\", \"country\": \"US\", \"company\": \"Ana Data Consulting\", \"position\": \"Senior Manager Data Platforms\", \"notes\": \"\", \"original\": \"<!DOCTYPE html><html><head><\/head><body><p><strong>Please send us your updated resumes to in word format with current location and best number to reach&nbsp;<\/strong><\/p><p><strong>Job Title: <\/strong>Senior Manager Data Platforms&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<\/p><p><strong>General Description of Essential Job Requirements<\/strong><\/p><p><strong>Position Summary:<\/strong><\/p><p>As a Senior Manager of Data Platforms, you will lead a team that provides an efficient and performant data tier that will supply reliable and consistent data to our internal and external customers. You will play a significant role in our digital transformation programs, such as Internet of Things, AWS expansion, Artificial Intelligence, and Machine Learning, as well as the modernization of legacy systems. You will partner with various stakeholders and teams of IT experts to provide standards and best practices on data platforms used across the enterprise, as well as partnering with our internal Data Engineering, Data Integration, and Cloud teams to ensure these standards are followed. In this role, you must balance technical leadership and people management skills while empowering the team to deliver best-in-class operational support and data solutions.<\/p><p>The ideal candidate will be passionate about data and data platform technologies and have a proven history leveraging them to drive solutions that bring stability to enable development teams to move quicker.<\/p><p>This position can sit in Reading, PA or our IT Center in Tampa, FL.<\/p><p>&nbsp;<\/p><p><strong>Major Responsibilities:<\/strong><\/p><ul><li>Select, implement, and operationalize all of Penske's data platform technologies<\/li><li>Participate in Data Modeling, Data Integration, and Data Pipeline implementation on the data platform<\/li><li>Develop plans and road map for patching, security, audit, capacity, products, and future enhancements<\/li><li>Lead multiple enterprise-level projects concurrently, ensuring they align with business priorities and budget<\/li><li>Work closely with various vendor-provided applications both on the Cloud and on-premise<\/li><li>Manage onshore and offshore database platform teams, contributing to their growth by providing feedback<\/li><li>Participate in architecture review board with data architects, infrastructure architects, and application architects to design end to end solutions<\/li><li>Provide technical guidance for integration, testing, design, development, planning and analysis of new major, large scale, production systems\/databases<\/li><li>Create run books and knowledge base related to data storage technologies<\/li><li>Contribute to improving and creating data platform policies, procedures, and operational standards, as well as documenting the current data storage landscape<\/li><li>Maintain an in-depth understanding of KPIs related to Service Level Agreements<\/li><li>Create backup, restore and disaster recovery processes for platform components<\/li><\/ul><p>&nbsp;<\/p><p><strong>Qualifications:<\/strong><\/p><ul><li>Bachelor's degree in Information Systems or Business Administration or Computer science required.<\/li><li>12 years of technology related experience required<\/li><li>3 years&rsquo; management experience required<\/li><li>2 years&rsquo; technical project leadership, ITIL, and operational support required, experience in Agile methodology and tools such as Jira preferred<\/li><li>3 years&rsquo; experience working with SQL and Data Modeling required, including a complete understanding of data modeling and data engineering solutions<\/li><li>Understanding of various data platforms such as Geospatial, Graph QL, Time series is required<\/li><li>Experience with Vendor management for delivery and operations required<\/li><li>10 years&rsquo; experience within MySQL, Oracle, and PostgreSQL, Greenplum\/Hadoop, NoSQL database technologies, Cloud-hosted Datastores preferred<\/li><li>3 years&rsquo; experience in Data Warehouse systems, Data Lake, and BI solutions, including working with tools such as Qlik and QuickSight preferred<\/li><li>2 years&rsquo; hands-on public cloud experience preferred, including experience with technologies and tools such as Continuous Integration, Continuous Deployment, Configuration Management, and Provisioning Automation<\/li><li>2 Data Integration technologies (ETL\/ Kafka\/ RabbitMQ) preferred<\/li><li>2 years&rsquo; experience with automation tools such as Cloud formation, Terraform, Ansible, etc. preferred<\/li><li>Knowledge of current Cloud Database services (RDS on AWS), S3, and in-memory cache storage such as Gemfire<\/li><li>Understanding of data platforms supporting Machine Learning and AI environment, such as SageMaker, preferred<\/li><li>Experience as an individual contributor DBA and\/or Database management preferred<\/li><li>Must have a thorough understanding of security practices such as LDAP, SSL, SSO, and certificate management<\/li><li>Proven work ethic with the utmost integrity<\/li><li>Self-awareness, with a desire for constant self-improvement (goal-oriented)<\/li><li>Personality traits for successful individuals may include self-motivated, passionate, empathetic, approachable, outgoing, energetic, and upbeat<\/li><li>Regular, predictable, full attendance is an essential function of the job.<\/li><li>Willingness to travel as necessary, work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required<\/li><\/ul><p>&nbsp;<\/p><p>Physical Requirements:<\/p><p>-The physical and mental demands described here are representative of those that must be met by an associate to<\/p><p>successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals<\/p><p>with disabilities to perform the essential functions.<\/p><p>-The associate will be required to: read; communicate verbally and\/or in written form; remember and analyze certain<\/p><p>information; and remember and understand certain instructions or guidelines.<\/p><p>-While performing the duties of this job, the associate may be required to stand, walk, and sit. The associate is frequently<\/p><p>required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to<\/p><p>occasionally lift and\/or move up to 25lbs\/12kg.<\/p><p>-Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and<\/p><p>the ability to adjust focus.<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><\/body><\/html>\"}"
}