{
    "id":"Kaggle::techmap::6144e8421912786a40a8bf7a::linkedin_dk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"***Masculine:*** The phrase \"We prioritize execution over planning and prefer trial and error over perfection\" implies a preference for a more aggressive, action-oriented approach, which can be associated with masculine-coded traits such as decisiveness and competitiveness.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"Describing markets as having \"low education and awareness\" or \"poor reimbursement\" risks perpetuating stereotypes about regions such as Asia, Eastern Europe, the Middle East, Africa, and Latin America. These phrases may imply racial bias by suggesting inherent deficiencies in these populations.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Senior Market Development Manager, Distributor Markets. Do you want to help improving healthcare standards in developing markets? In the Distributor Markets team, we are on a mission  to bring better care to patients in developing markets worldwide and to enable more people with chronic conditions resume to a normal life. We are responsible for driving strategy, business development and daily operations in close collaboration with our regional sales team and distributors in 60 countries in Asia, Eastern Europe, Middle East, Africa and Latin America. The markets are characterized by low education and awareness about our treatment areas, often poor reimbursement, and lack of \/ unawareness of patient rights. We aim to change this by building strong partnership with local distributors, to provide better education to healthcare professionals and support to patients through phone, online activities, and home visits. The position. As a Senior Market Development Manager your role will be to lead development and implementation of commercial programs to support our journey. Since the region is very dynamic, projects and responsibilities change frequently. From the beginning it will include (but not be limited to). Lead development, investment case creation and oversee implementation of Coloplast Care and Consumer\/DtC activities in 10-15 focus distributor markets. Identify growth opportunities, build investment cases with distributors and oversee implementation. Lead process to improve fact-based performance dialogue with distributors (Build engagement, buy-in, data capture and presentation). Lead creation and maintenance of Market Access project pipeline with global Market Access team, and oversee project management of pipeline project execution. Support commercial setup and organizational design for new distributors in New Markets sales region. Support development of strategy and business development planning. Own and facilitate annual business planning (ABP) process for Distributor Markets, including training and stakeholder engagement with customers. You will be given plenty of freedom to help deciding how we do this, and it is important that you can spot both opportunities and potential challenges and take initiative to react on them. To succeed with this, you have good leadership skills, and you take ownership naturally. We run many projects at a time and the role is diverse, so it is important that you can easily switch focus from the bigger picture to practical details and reverse. We prioritize execution over planning and prefer trial and error over perfection.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144e8421912786a40a8bf7a::linkedin_dk\", \"source\": \"linkedin_dk\", \"country\": \"DK\", \"company\": \"Coloplast\", \"position\": \"Senior Market Development Manager, Distributor Markets\", \"notes\": \"\", \"original\": \"<strong>Senior Market Development Manager, Distributor Markets <br><br><\/strong><strong>Do you want to help improving healthcare standards in developing markets?<br><br><\/strong>In the Distributor Markets team, we are on a mission \\u2013 to bring better care to patients in developing markets worldwide and to enable more people with chronic conditions resume to a normal life.<br><br>We are responsible for driving strategy, business development and daily operations in close collaboration with our regional sales team and distributors in 60 countries in Asia, Eastern Europe, Middle East, Africa and Latin America.<br><br>The markets are characterized by low education and awareness about our treatment areas, often poor reimbursement, and lack of \/ unawareness of patient rights. We aim to change this by building strong partnership with local distributors, to provide better education to healthcare professionals and support to patients through phone, online activities, and home visits.<br><br><strong>The position<br><br><\/strong>As a Senior Market Development Manager your role will be to lead development and implementation of commercial programs to support our journey. Since the region is very dynamic, projects and responsibilities change frequently. From the beginning it will include (but not be limited to)<br><ul><li>Lead development, investment case creation and oversee implementation of Coloplast Care and Consumer\/DtC activities in ~10-15 focus distributor markets<\/li><li>Identify growth opportunities, build investment cases with distributors and oversee implementation<\/li><li>Lead process to improve fact-based performance dialogue with distributors (Build engagement, buy-in, data capture and presentation)<\/li><li>Lead creation and maintenance of Market Access project pipeline with global Market Access team, and oversee project management of pipeline project execution<\/li><li>Support commercial setup and organizational design for new distributors in \\u201cNew Markets\\u201d sales region<\/li><li>Support development of strategy and business development planning.<\/li><li>Own and facilitate annual business planning (ABP) process for Distributor Markets, including training and stakeholder engagement with customers.<br><br><br><\/li><\/ul>You will be given plenty of freedom to help deciding how we do this, and it is important that you can spot both opportunities and potential challenges and take initiative to react on them. To succeed with this, you have good leadership skills, and you take ownership naturally.<br><br>We run many projects at a time and the role is diverse, so it is important that you can easily switch focus from the bigger picture to practical details and reverse. We prioritize execution over planning and prefer \\u201ctrial and error\\u201d over perfection. Therefore, you are not afraid of trying things out, making decision without full information and ready to adapt and change course.<br><br><strong> More About You <br><\/strong><ul><li>You are curious by heart, see opportunities and get energy from improving things.<\/li><li>You are a \\u201cgo doer\\u201d who is not afraid of getting your hands dirty. <\/li><li>You find it exciting to work with many different cultures and likes being in the front-line and engage with customers.<\/li><li>You thrive in unpredictable and sometimes chaotic environments.<\/li><li>You can keep calm and bring structure to chaos.<\/li><li>You are eager to learn.<\/li><li>You have an MSc degree and minimum five years of experience working in a multinational environment. Industry experience is a plus, but not a prerequisite. <\/li><li>You are fluent in English. Spanish is a plus, but not a requirement. <br><br><br><\/li><\/ul><strong>Are you interested?<br><br><\/strong>If you would like to know more about the position, please call Head of Strategy &amp; Operations, Distributor Markets Lau Adsersen (+45 49111475). We will take candidates into the recruitment process continuously, so do not hesitate to apply. This position will remain open until a suitable candidate has been found.<br><br>Pursuing an ambitious growth agenda, Coloplast develops and markets products and services that make life easier for people with intimate healthcare needs. Employing about 12.000 people and with products available in more than 143 countries, we are one of the world\\u00b4s leading medical device companies. We are constantly growing our business and always looking for new ways to move forward \\u2013 we explore, learn and look for new ways of doing things.<br><br>Coloplast is committed to being an inclusive organization, where people bring their differences to work each day, fulfil their potential and have a strong sense of belonging because \\u2013 and not despite \\u2013 of their differences. We therefore encourage all qualified candidates to apply regardless of gender, age, race, nationality, ethnicity, sexual orientation, religious belief or physical ability.<br><br>Visit us on Coloplast.com .<br><br>Watch the film. Follow us on LinkedIn . Like us on Facebook .<br><br>\"}"
}