{
    "id":"Kaggle::techmap::6149e37f41180e59d154a1a9::linkedin_de::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" There are also days that you will stay on the project area to work in the vegetable garden, build a tree nursery, investigate collected bugs, make an inventory of the butterflies or for example make chocolate from the cacao you collected. Lunch is at 12.30 after which the afternoon is spent usually processing data, analyzing the trap cam video's, determine the collected dung-beetles or frog pictures, writing up research or working in the garden. At 5 pm there will be a lovely dinner served. After dinner you can chat with the other students in the community house, playing cards, read a book, watch a documentary, chill in a hammock or just go to sleep. By 6pm it is dark and we expect you to be quiet at 9pm. During the weekend there will be time to chill and relax for example in the hammock, play soccer at the local soccer field, plan a trip to the waterfalls or the beach. Please note: all information above is subject to change. Please check the most up to date information on the Global Nomadic website when applying.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6149e37f41180e59d154a1a9::linkedin_de\", \"source\": \"linkedin_de\", \"country\": \"DE\", \"company\": \"Global Nomadic\", \"position\": \"Volunteer: Environmental Research Project Costa Rica\", \"notes\": \"\", \"original\": \"<strong>Location<\/strong>: close to Limon, Costa Rica<br><br><strong>Duration<\/strong>: Minimum 2 weeks, maximum 6 months commitment<br><br><strong>Start Dates:<\/strong> Project is ongoing, and you can join at any time, depending upon availability<br><br><strong>Cost<\/strong>: 736 for the first 2 weeks + 196 for each week thereafter<br><br>Fee Includes: all food, accommodation, pre-departure + in-country support, orientation and all project related activities<br><br>Does not Include: flights, airport pickup, travel insurance, personal spending, visas and vaccinations<br><br><strong>Please note:<\/strong> This opportunity is designed to give you the contacts and experience to help further your career. You are not replacing any member of staff, but helping alongside them, whilst learning new skills.<br><br><strong><u>Benefits<br><\/u><\/strong><ul><li>Work closely with staff experienced in forest conservation, agroforestry, agronomy, participatory community development, social entrepreneurship, and marketing\/communications.<\/li><li>Keywords: agroforestry, agricultural economics, biodiversity, sustainable development, research, community development, economic development, social entrepreneurship, climate change, indigenous groups, new product development, women s empowerment.<br><\/li><\/ul>Costa Rica is one of the most bio-diverse regions in the world, with an abundance of flora and fauna that is becoming a rarity in the world. This project work to map the lowland rainforest area, which is essential to its protection.<br><br>The goal of this project is study the environment, thus improving your research skills, and sharing your results with the wider scientific community. This way, we can reinforce each others knowledge and promote environmental conservation and sustainability.<br><br>If you wish to join our long term research (inventory) on the biodiversity of our private reserve, we would welcome you to our project. Research options are open to all different levels of expertise and experience. In addition to conducting long term research, you can also visit our project to conduct your own research topic. We will supervise and guide you towards a successful research methodology.<br><br>The project is located in-between an Indian reservation and a national park, and there is much to discover and learn about the local environment. Some parts have been heavily logged, however much remains pristine, and is in need of study and protection. Our goal is to identify where conservation efforts should be best focused. We have three main goals: biodiversity, reforestation and sustainable living.<br><br>Daily Life<br><br>Breakfast is served at 7am each day and will be a typical Costa Rican dish. At 8am your day starts with a trip into the jungle to start accumulating data, conducting research and other agreed projects.<br><br>There are also days that you will stay on the project area to work in the vegetable garden, build a tree nursery, investigate collected bugs, make an inventory of the butterflies or for example make chocolate from the cacao you collected.<br><br>Lunch is at 12.30 after which the afternoon is spent usually processing data, analyzing the trap cam video's, determine the collected dung-beetles or frog pictures, writing up research or working in the garden.<br><br>At 5 pm there will be a lovely dinner served. After dinner you can chat with the other students in the community house, playing cards, read a book, watch a documentary, chill in a hammock or just go to sleep.<br><br>By 6pm it is dark and we expect you to be quiet at 9pm.<br><br>During the weekend there will be time to chill and relax for example in the hammock, play soccer at the local soccer field, plan a trip to the waterfalls or the beach.<br><br><strong>Please note:<\/strong> all information above is subject to change. Please check the most up to date information on the Global Nomadic website when applying.\"}"
}