{
    "id":"Kaggle::techmap::6135756f55e18d3dfc51aedb::linkedin_de::1",
    "label_age":true,
    "analysis_age":"The phrase \"navigating yourself in a fast-paced tech environment with parallel product evolutions\" implies a preference for younger candidates",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You are eager to drive product development by discussing system designs, user requirements and trade-offs from a business perspective with various stakeholders. Stakeholder Management You have experience managing multiple stakeholders in a variety of business and tech roles and navigating yourself in a fast-paced tech environment with parallel product evolutions. Product Methodologies You have proven experience in agile software development methodologies and are familiar with Scrum, Kanban or other lean software development workflows. You know how to define a product roadmap and have experience in working with stakeholders on delivering the expected business benefits. Experience with JIRA, Github, Asana, Google Analytics and SQL is a plus. Customer focus You have strong customer and service orientation and always keep customer and partner perspectives in mind. Communication and Team Spirit Fluent in English. German or any other Central European language is a plus. Our team is important to us and we are looking to have a great team player to join us who enjoys jointly celebrating the teams successes. hotjobs.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6135756f55e18d3dfc51aedb::linkedin_de\", \"source\": \"linkedin_de\", \"country\": \"DE\", \"company\": \"Zalando\", \"position\": \"Principal Product Manager - Zalando Returns Solutions (ZRS)\", \"notes\": \"\", \"original\": \"<strong><u>Job Description<br><br><\/u><\/strong>Join us in our mission to design a holistic returns proposition for millions of customers on the Zalando platform. Develop a service that enables hundreds of Zalando partners to offer convenient returns and improve their operational costs. Play a protagonist role in the hyper-fast growing Zalando platform.<br><br>As a Principal Product Manager for Zalando Return Solutions, you are responsible for developing the software solutions behind the service, building them with various engineering and product teams. The Zalando Return Solutions product landscape spans across various logistics software systems, which you will be responsible for complementing by new Zalando Return Solutions functionalities you prioritized through user research, continuous stakeholder alignment and cross-department collaboration.<br><br><strong>WHERE YOUR EXPERTISE IS NEEDED<br><br><\/strong>You understand our complex landscape of software systems, company departments and processes in the domain of Logistics. You navigate the Zalando Return Solutions product safely through the product development processes to embed it into our portfolio of logistics services<br><br>You build relationships with internal stakeholders in various departments You continuously involve them in defining the next product priorities. You actively co-design the right product solutions with development teams within and outside of Zalando ensuring that the engineering teams have sufficient user and business context<br><br>Develop the strategic vision for your product Your ideas are based on solid understanding of the existing product strategy, customer needs and problems and Zalando\\u2019s strategy. Your ideas continuously push the development of the product and its strategic fit. You always find ways to demonstrate how your product contributes to current, mid- and long-term goals and priorities<br><br>You are the person with knowledge of several areas, most notably technology, business, logistics processes and user experience. You should not shy away from carrying out complex data analysis to build a business case to support your product strategy and vision.<br><br>Apply our 4-D (Discover, Define, Design, Deliver) product development life cycle in your product area You take a hands-on approach to product discovery, user research, data generation and analysis, backlog prioritization and roadmap planning, you define product requirements and drive forward cross-teams solution design and delivery.<br><br><strong><u>What We're Looking For<br><br><\/u><\/strong>Analytical Skills You have an analytical and pragmatic mind. You base your arguments on qualitative and quantitative data.<br><br>Motivation You are enthusiastic to work in and dive deep into a complex and highly dynamic domain with a variety of processes. You are eager to drive product development by discussing system designs, user requirements and trade-offs from a business perspective with various stakeholders.<br><br>Stakeholder Management You have experience managing multiple stakeholders in a variety of business and tech roles and navigating yourself in a fast-paced tech environment with parallel product evolutions<br><br>Product Methodologies You have proven experience in agile software development methodologies and are familiar with Scrum, Kanban or other lean software development workflows. You know how to define a product roadmap and have experience in working with stakeholders on delivering the expected business benefits. Experience with JIRA, Github, Asana, Google Analytics and SQL is a plus.<br><br>Customer focus You have strong customer and service orientation and always keep customer and partner perspectives in mind.<br><br>Communication and Team Spirit Fluent in English. German or any other Central European language is a plus. Our team is important to us and we are looking to have a great team player to join us who enjoys jointly celebrating the team\\u2019s successes.<br><br>#hotjobs\"}"
}