{
    "id":"Kaggle::techmap::615ddb438faf5f1e4d7b19a9::linkedin_iq::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1-3 years work experience in retail, customer service, recreation facility or related role. Relevant experience in a not-for-profit, military, multicultural and\/or global organization preferred. General knowledge of military community preferred. Ability to stand for up to 12 hours, lift and carry up to 50 pounds and wear up to 30 pounds of body armor. Strong interpersonal, customer service and problem-solving skills. Ability to interact with USO Leadership, the general public and military audiences at a variety of levels with integrity and professionalism. Proficiency using computers and electronics equipment. General knowledge of various software, applications, and programs including but not limited to Microsoft Office Suite and social media platforms. Demonstrated ability to exercise sound judgment related to controversial and\/or culturally sensitive subjects. Ability to handle confidential information with tact and poise. Must show initiative, self-motivation, and attention to detail with the ability to manage multiple projects with competing priorities. Ability to quickly and easily adapt to changing organizational needs. Ability to achieve desired results while working collaboratively in a team environment. Ability to perform basic math. Ability to obtain and maintain proper credentials necessary to access USO Center locations and facilities including but not limited to security, credit and\/or background screening, SOFA status, a valid United States passport and valid US and foreign drivers licenses. Must be a strong advocate of the USOs mission. Details. This position is located at Al Asad Air Base in Iraq. Resume and cover letter are required for full consideration. US Citizenship Required.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615ddb438faf5f1e4d7b19a9::linkedin_iq\", \"source\": \"linkedin_iq\", \"country\": \"IQ\", \"company\": \"USO\", \"position\": \"Duty Manager\", \"notes\": \"\", \"original\": \"<ul><li>US Citizenship Required***<br><\/li><\/ul>Since 1941, the USO has been the nation\\u2019s leading organization to serve the men and women in the U.S. military, and their families, throughout their time in uniform. From the moment they join, through their assignments and deployments, and as they transition back to their communities, the USO is always by their side.<br><br>Today\\u2019s USO continuously adapts to the needs of our men and women in uniform and their families, so they can focus on their very important mission. We operate USO centers at or near military installations across the United States and throughout the world, including in combat zones, and even un-staffed USO service sites in places too dangerous for anyone but combat troops to occupy.<br><br>The Duty Manager is responsible for providing excellent customer service, maintaining a warm, friendly, inviting environment for service members as well as maintaining the day-to-day activities of a USO Center.<br><br><u><br><ul><li>U.S. Citizenship required to acquire proper base credentialing***<br><\/li><\/ul><strong><u><br><ul><li>All new hires will be subject to a medical screening to ensure compliance with the U.S. military medical standard, MOD-15. Click on the following link to review MOD15 requirements ***<br><\/li><\/ul><strong>Principal Duties and Responsibilities (*Essential Duties)<br><\/strong><ul><li>Ensure delivery of excellent customer service, Engage and interact with visitors.*<\/li><li>Manage operations and programs during assigned shifts, including but not limited to, opening and\/or closing, managing assets, complying with all policies and procedures and following safety and security protocols.*<\/li><li>Host programs, activities and events in the center and at outreach locations.*<\/li><li>As directed by center leadership, lead the planning, execution and oversight of focus areas to include programs, logistics, inventory management, budget planning, social media and database management.*<\/li><li>Supervise volunteers during assigned shift, ensuring that quality customer service and support is provided and all SWA center standards are followed.*<\/li><li>Monitor readiness and availability of activity and lounge areas (i.e. check-in area, coffee\/snack stations, gaming, telephone, and computer rooms). Maintain standards of cleanliness for all facilities and equipment.*<\/li><li>May monitor daily sales for retail operations and replenish stock. Count cash balance at beginning and end of shifts and prepare cash for deposit.<\/li><li>Complete semi-annual and annual inventories as directed.*<\/li><li>Assume responsibility for center operations as needed in the absence of the Center Manager.*<\/li><li>Perform other duties as assigned.<br><\/li><\/ul><strong>Job Specifications<br><\/strong><ul><li>High School Diploma or equivalent. Bachelor\\u2019s Degree preferred.<\/li><li>1-3 years work experience in retail, customer service, recreation facility or related role. Relevant experience in a not-for-profit, military, multicultural and\/or global organization preferred.<\/li><li>General knowledge of military community preferred.<\/li><li>Ability to stand for up to 12 hours, lift and carry up to 50 pounds and wear up to 30 pounds of body armor.<\/li><li>Strong interpersonal, customer service and problem-solving skills. Ability to interact with USO Leadership, the general public and military audiences at a variety of levels with integrity and professionalism.<\/li><li>Proficiency using computers and electronics equipment. General knowledge of various software, applications, and programs including but not limited to Microsoft Office Suite and social media platforms.<\/li><li>Demonstrated ability to exercise sound judgment related to controversial and\/or culturally sensitive subjects. Ability to handle confidential information with tact and poise.<\/li><li>Must show initiative, self-motivation, and attention to detail with the ability to manage multiple projects with competing priorities. Ability to quickly and easily adapt to changing organizational needs.<\/li><li>Ability to achieve desired results while working collaboratively in a team environment.<\/li><li>Ability to perform basic math.<\/li><li>Ability to obtain and maintain proper credentials necessary to access USO Center locations and facilities including but not limited to security, credit and\/or background screening, SOFA status, a valid United States passport and valid US and foreign driver\\u2019s licenses.<\/li><li>Must be a strong advocate of the USO\\u2019s mission.<br><\/li><\/ul><strong><u>Details<br><\/u><\/strong><ul><li>This position is located at Al Asad Air Base in Iraq.<\/li><li>Resume and cover letter are required for full consideration.<\/li><li>US Citizenship Required***<\/li><\/ul><\/u><\/strong><\/u>\"}"
}