{
    "id":"Kaggle::techmap::613482a5a8a8c37953dcffe7::itjobslist_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"A Merchandise Handler is responsible for handling full cases of product, including consistent lifting of cartons and merchandise onto and off conveyor lines, pallets, and other storage containers. Load and unload cartons based on predetermined processes. The base pay for this position is $18. 25\/hr and has the potential to earn up to $21. 25\/hr based on the shift selection (these rates include peak season pay incentives that will expire on 12\/25\/2021). In addition, other benefits include:Paid holidays beginning on day one. Up to 40% discount on all of our brands. Safe, temperature-controlled work environment$500 Referral BonusQualifications:At least 50% of working hours are spent lifting cartons and merchandise. Merchandise Handlers may also receive merchandise into the Distribution Center, maintain case quantities for picking operations, and palletize outbound products. Inspect merchandise items to ensure proper quality and brand specification. Comprehend and follow written, verbal and computer-delivered directions. Utilize math skills to verify quantities, make adjustments, fill out worksheets, and complete order paperwork correctly. Operate Warehouse Management System (WMS), radio frequency scanners, and other equipment needed to perform job duties. Solid attention to detail, ability to follow directions and apply problem solving skills. Ability to identify products and match numbers. Ability to operate motorized and non-motorized equipment to move merchandise. Verify documentation and information to facilitate flow of merchandise through the distribution center. Must be at least 18 years of age. Previous experience in a distribution center environment is helpful. Must maintain flexibility regarding job assignments, including other departments, brands, locations, and mandatory overtime. Meet productivity standards after successfully completing training. Must be a team player and able to work well with others. Comply with all safety, hazardous material, and OSHA training, rules, and reporting. Ensuring a safe work environment. Ability to stand continuously for long periods of time, up to 10 hours per day. Ability to lift up to 50 lbs. or more up to 50% of the working hours. Lifting may be above or below shoulder level. Ability to push, pull, bend, twist, squat, climb, kneel, and stoop on a repetitive basis. Ability to utilize hand\/eye coordination and manual dexterity to include grasping and holding. Typically reports to DC Supervisor, no direct reports..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613482a5a8a8c37953dcffe7::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"Victoria s Secret\", \"position\": \"Warehouse Associate Now Hiring\", \"notes\": \"\", \"original\": \"A Merchandise Handler is responsible for handling full cases of product, including consistent lifting of cartons and merchandise onto and off conveyor lines, pallets, and other storage containers. Load and unload cartons based on predetermined processes. The base pay for this position is $18.25\/hr and has the potential to earn up to $21.25\/hr based on the shift selection (these rates include peak season pay incentives that will expire on 12\/25\/2021). In addition, other benefits include:Paid holidays beginning on day oneUp to 40% discount on all of our brandsSafe, temperature-controlled work environment$500 Referral BonusQualifications:At least 50% of working hours are spent lifting cartons and merchandise.Merchandise Handlers may also receive merchandise into the Distribution Center, maintain case quantities for picking operations, and palletize outbound products.Inspect merchandise items to ensure proper quality and brand specification.Comprehend and follow written, verbal and computer-delivered directions.Utilize math skills to verify quantities, make adjustments, fill out worksheets, and complete order paperwork correctly.Operate Warehouse Management System (WMS), radio frequency scanners, and other equipment needed to perform job duties.Solid attention to detail, ability to follow directions and apply problem solving skills.Ability to identify products and match numbers.Ability to operate motorized and non-motorized equipment to move merchandise.Verify documentation and information to facilitate flow of merchandise through the distribution centerMust possess the ability to:High school diploma or equivalent preferred.Must be at least 18 years of agePrevious experience in a distribution center environment is helpful.Must maintain flexibility regarding job assignments, including other departments, brands, locations, and mandatory overtime.Meet productivity standards after successfully completing training.Must be a team player and able to work well with others.Comply with all safety, hazardous material, and OSHA training, rules, and reporting; ensuring a safe work environment.Ability to stand continuously for long periods of time, up to 10 hours per day.Ability to lift up to 50 lbs. or more up to 50% of the working hours; lifting may be above or below shoulder level.Ability to push, pull, bend, twist, squat, climb, kneel, and stoop on a repetitive basis.Ability to utilize hand\/eye coordination and manual dexterity to include grasping and holding.Typically reports to DC Supervisor, no direct reports.Ability to function at high levels as required.An equal opportunity employer, we do not discriminate in hiring or terms and conditions of employment because of an individuals race, color, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, marital status or any other protected category recognized by state, federal or local laws. We only hire individuals authorized for employment in the United States.\"}"
}