{
    "id":"Kaggle::techmap::615d93d5f1e816642f9a390e::cvlibrary_uk::7",
    "label_age":false,
    "analysis_age":"The emphasis on \"recent graduate\" is offset by \"an experienced teaching assistant looking for a fresh adventure\". Therefore is it balanced and not ageist..",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Aspiring Teacher -Teaching Assistant. Swindon. Mainstream Primary School. English Graduates Wanted. Immediate start. Wokingham - £65-£80. Are you interested in supporting young people to achieve excellent literary skills? Graduates Wanted. Fantastic Opportunity for English\/Related Degree Graduates! Experience working with children required. A warm and welcoming Primary School in Reading is currently looking to hire an English Teaching Assistant to join their team in September. This is an exciting opportunity for a recent graduate of English (similar degrees considered, such as Creative Writing) to gain valuable experience as an English Teaching Assistant before embarking on your teacher training in September 2022. You will have the opportunity to raise academic attainment through 1:1 support for those students who need most, such as those with weak literary skills, English as a second language, and Special Education Needs. Are you an experienced teaching assistant looking for a fresh adventure? Experienced professionals who can bring their expertise to this school are also actively being sought for this role. This 'Outstanding' Ofsted rated school in Reading are looking for a confident, dedicated Learning Support Assistant who is enthusiastic and passionate about their input into a child's education. This will be an amazing opportunity for the successful applicant to develop key behaviour management, planning, and teaching skills. English Learning Support Assistant. September Start. £65-£80. 1:1 and small group support. Will support students with English as a second language, weak literacy skills, SEN students. Graduates welcomed. If you are interested in this role in Reading, and want to take advantage of this excellent opportunity, then make a note of your objectives, and either apply through this ad or send your CV through to.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615d93d5f1e816642f9a390e::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Academics Ltd\", \"position\": \"Teaching Assistant Role for Aspiring Teacher - Swindon\", \"notes\": \"\", \"original\": \"Aspiring Teacher -Teaching Assistant - Swindon<br><br>Mainstream Primary School - English Graduates Wanted <br><br>Immediate start - Wokingham - &pound;65-&pound;80 <br><br>Are you interested in supporting young people to achieve excellent literary skills?<br><br>Graduates Wanted - Fantastic Opportunity for English\/Related Degree Graduates!<br><br>Experience working with children required<br><br>A warm and welcoming Primary School in Reading is currently looking to hire an English Teaching Assistant to join their team in September. This is an exciting opportunity for a recent graduate of English (similar degrees considered, such as Creative Writing) to gain valuable experience as an English Teaching Assistant before embarking on your teacher training in September 2022. You will have the opportunity to raise academic attainment through 1:1 support for those students who need most, such as those with weak literary skills, English as a second language, and Special Education Needs.<br><br>Are you an experienced teaching assistant looking for a fresh adventure? Experienced professionals who can bring their expertise to this school are also actively being sought for this role.<br><br>This &#39;Outstanding&#39; Ofsted rated school in Reading are looking for a confident, dedicated Learning Support Assistant who is enthusiastic and passionate about their input into a child&#39;s education. This will be an amazing opportunity for the successful applicant to develop key behaviour management, planning, and teaching skills.<br><br>English Learning Support Assistant.<br>September Start<br>&pound;65-&pound;80.<br>1:1 and small group support.<br>Will support students with English as a second language, weak literacy skills, SEN students.<br>Graduates welcomed.<br>Great platform for aspiring teachers.If you are interested in this role in Reading, and want to take advantage of this excellent opportunity, then make a note of your objectives, and either apply through this ad or send your CV through to .<br><br>\"}"
}