{
    "id":"Kaggle::techmap::61416e1a435f236a81caf84c::linkedin_ch::0",
    "label_age":true,
    "analysis_age":"The phrase \"get yourself out of the middle management trap\" implies a bias towards mid-career professionals, potentially alienating both younger, less experienced candidates and older, more experienced individuals who may prefer to stay in or return to middle management roles.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Phrases like \"elite engineer,\" \"hands-on technical leader,\" and \"high-performing architects,\" are a little masculine-leaning.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Crossover is the world's 1 source of remote full-time jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Trilogy. Have you got what it takes? If you are a hands-on technical leader looking to create a bigger impact, then we think its about time to get yourself out of the middle management trap. Youve been a software engineer your whole career and proven yourself an effective technical leader. Shouldnt an elite engineer like you be the one making important decisions for your company? At Trilogy, management doesnt simply mean oversight. It means making important technical decisions. Trilogy is an enterprise software company, run by actual software engineers, not MBAs. We are looking for high-performing architects with hands-on technical leadership experience to spearhead the most important teams in our engineering department. We need technical experts to solve our most challenging software engineering problems. If youre looking to take charge in a high-stakes environment, wed like to challenge you to lead a fast-scaling organization responsible for dozens of high-quality software releases per week. What You Will Be Doing. Software architecture design. Making important technical decisions based on product change requests. Deep Dive analysis. Analyze technical problems and opportunities to improve our software quality, getting all the way into the code. Writing Improvement Proposals. You will make technical recommendations to improve the quality of our software development, based on your deep dive findings. What You Wont Be Doing. HR and administrative management. We want your technical expertise. We will never waste your time doing performance reviews, committees, etc. Overseeing steady-state operations. Our culture is continuous improvement. If its bad, fix it. If its good, make it better. Technical Team Lead Key Responsibilities. Improving our software development operation. Based on your insights from reviewing a weeks worth of work, you propose and implement big ideas to simplify the code, systematically improve quality, and scale our growing portfolio of over 100 B2B software products. Basic Requirements. Technical\/quantitative university degree. years of experience writing code. Youll have to pass a coding test to get this job. Experience managing teams from multiple engineering functions (developers, designers, product managers, testers, etc. ). Nice-to-have Requirements. Experience using deep work blocks to maximize quality and output. Experience working 100% remotely with asynchronous communication dominating how you collaborate.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61416e1a435f236a81caf84c::linkedin_ch\", \"source\": \"linkedin_ch\", \"country\": \"CH\", \"company\": \"Crossover for Work\", \"position\": \"Technical Team Lead, Trilogy - 200,000\/year USD\", \"notes\": \"\", \"original\": \"Crossover is the world's #1 source of remote full-time jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Trilogy. Have you got what it takes?<br><br>If you are a hands-on technical leader looking to create a bigger impact, then we think it\\u2019s about time to get yourself out of the middle management trap. You\\u2019ve been a software engineer your whole career and proven yourself an effective technical leader. Shouldn\\u2019t an elite engineer like you be the one making important decisions for your company?<br><br>At Trilogy, management doesn\\u2019t simply mean oversight. It means making important technical decisions.<br><br>Trilogy is an enterprise software company, run by actual software engineers, not MBAs. We are looking for high-performing architects with hands-on technical leadership experience to spearhead the most important teams in our engineering department. We need technical experts to solve our most challenging software engineering problems.<br><br>If you\\u2019re looking to take charge in a high-stakes environment, we\\u2019d like to challenge you to lead a fast-scaling organization responsible for dozens of high-quality software releases per week.<br><br><strong><u>What You Will Be Doing<br><\/u><\/strong><ul><li>Software architecture design. Making important technical decisions based on product change requests. <\/li><li>Deep Dive analysis. Analyze technical problems and opportunities to improve our software quality, getting all the way into the code.<\/li><li>Writing Improvement Proposals. You will make technical recommendations to improve the quality of our software development, based on your deep dive findings.<br><\/li><\/ul><strong><u>What You Won\\u2019t Be Doing<br><\/u><\/strong><ul><li>HR and administrative management. We want your technical expertise. We will never waste your time doing performance reviews, committees, etc. <\/li><li>Overseeing steady-state operations. Our culture is continuous improvement. If it\\u2019s bad, fix it. If it\\u2019s good, make it better.<br><\/li><\/ul><strong><u>Technical Team Lead Key Responsibilities<br><br><\/u><\/strong>Improving our software development operation. Based on your insights from reviewing a week\\u2019s worth of work, you propose and implement big ideas to simplify the code, systematically improve quality, and scale our growing portfolio of over 100 B2B software products.<br><br><strong><u>Basic Requirements<br><\/u><\/strong><ul><li>Technical\/quantitative university degree. <\/li><li>5+ years of experience writing code. You\\u2019ll have to pass a coding test to get this job.<\/li><li>Experience managing teams from multiple engineering functions (developers, designers, product managers, testers, etc.)<br><\/li><\/ul><strong><u>Nice-to-have Requirements<br><\/u><\/strong><ul><li>Experience using deep work blocks to maximize quality and output<\/li><li>Experience working 100% remotely with asynchronous communication dominating how you collaborate<\/li><li>Cloud development experience, especially AWS<br><\/li><\/ul><strong><u>About Trilogy<br><br><\/u><\/strong>Hundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>What to expect next:<br><\/strong><ul><li>You will receive an email with a link to start your self-paced, online job application.<\/li><li>Our hiring platform will guide you through a series of online \\u201cscreening\\u201d assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><\/li><\/ul><strong>Important!<\/strong> If you do not receive an email from us:<br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.<\/li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as \\u201cNot Spam\\u201d since you will receive other emails as well.<\/li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.<\/li><li>If all else fails, just reset your password by visiting https:\/\/www.crossover.com\/auth\/reset-password if you already applied using LinkedIn EasyApply.<\/li><\/ul> Crossover Job Code: LJ-3288-CH-Z\\u00fcrich-TechnicalTeamL<br><br>\"}"
}