{
    "id":"Kaggle::techmap::6146e651b74b6b3f36dd7d8e::monster2_it::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The use of \"his duties\" introduces masculine bias by using gender-specific language, which can discourage female or non-binary candidates from applying.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The phrase \"be fluent in English\" could be seen as exclusive and may discourage non-native speakers who are proficient but not fluent, potentially disadvantaging candidates based on linguistic background.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1.8 The Musician shall attend, participate in, and furnish input to scheduled and unscheduled meetings, conferences, and briefings that relate to the functions and services herein as required by the Government to provide effective communication and impart necessary information. The Contract Manager or designated representative shall attend meetings as requested by the Government. Meeting attendees shall at times include Musician managerial, supervisory, and other personnel knowledgeable of the subject matter. Meetings may start or end outside of regular duty hours. Qualifications:2.1 A minimum of two years-experience leading Christian worship with accompaniment on keyboard\/piano for comprehensive worship service requirements. 2.2 The service provider shall provide documentation of the following:a. Ability to demonstrate rhythmic accuracy, music sensitivity, and overall appreciation of liturgical aesthetics. b. Demonstrate effective communication skills with a variety of age groups, to include children, within the pluralistic environment of the Chaplain Corps and be fluent in English. Facilities: The Government will provide the chapel facilities, meeting rooms, including space to prepare for worship. The Government will ensure that the Musician has adequate access to commercial telephone lines to perform his duties conducted on the U. S. Military Installation. The Government will bear the costs of telephone use for the performance of direct services associated and outlined in this agreement. Government telephones shall only be used in the performance of services and shall not be used to make or accept personal calls. The Government will provide (on as-required basis) workspace to include desk space, telephone, and IT support. The Government shall not provide an office dedicated solely for the Musicians use (FAR 45.509-2). 3.1 Utilities: The Government will provide required utilities for all facilities (Chapels and Chapel Activity Centers) to perform the services under this contract. The Government will not make any modifications to utility outlets to accommodate Musician equipment. Materials: The Government will furnish all equipment and supplies necessary to conduct services. However, the Musician may use personal equipment to conduct Worship Services, not provided by the Military Chapel. The Government will not be held liable for loss, damage, theft, or maintenance of personal equipment. The Musician shall ensure that personal property is clearly marked and identified to preclude misidentification as Government property.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6146e651b74b6b3f36dd7d8e::monster2_it\", \"source\": \"monster2_it\", \"country\": \"IT\", \"company\": \"Music Ministry International\", \"position\": \"Worship Musician Pianist or Organist\", \"notes\": \"\", \"original\": \"<b>The successful candidate for this position will be a 1099 contractor with Music Ministry International and be responsible for the following:<\/b>1.1 Ecumenical Worship Pianist\/Keyboardist Job Description1.2 Background: The Government requires Musician Services, Pianist\/Keyboardist, in support of military religious and worship activities. The Musician shall provide support to the Religious Support Office (RSO), Chaplains, and Religious Affairs Specialists for Department of the Army (DA).The location(s) and time(s) specified in this job description.1.3 Scope of Work: The Protestant musician shall provide instrumental accompaniment (at minimum play the organ and the piano) as music support to assist the congregation in worship.1.4 Objectives:1.4.1 Musician shall attend planning and coordination meetings and provide necessary input for services.1.4.2 Musician personnel shall regard personal information on all applicants, volunteers, and participants as confidential. Musician shall comply with all privacy and confidentiality laws and regulations. As required by public laws and military regulations, the Musician shall divulge information of illegal activities to the proper authorities.1.4.3 The Musician personnel shall present a neat, well-groomed appearance appropriate for religious worship services and other activities identified in this JOB DESCRIPTION while performing under this contract.1.4.4 Musician personnel shall behave in a professional manner befitting US military religious support activities. Musician personnel shall demonstrate dignity and respect, keeping in harmony with the values and norms of the Army Chaplain Corps. Musician personnel shall refrain from using offensive language such as swearing, cursing, disparaging language, and other such communications.1.5 Recognized Holidays: The following provides information on recognized holidays for the purpose of the JOB DESCRIPTION. If submittal of any documentation (e.g. deliverables, submittals, etc.) deadlines fall on a holiday, the closest work day prior to the holiday will apply as the deadline for submittal.1.5.1 U.S. Holidays: Work shall (see 1.6.4.3) be performed on U.S. holidays occurring during the normal workweek unless otherwise directed by the Contracting Officer. When a U.S holiday occurs on a Saturday or a Sunday, the holiday is observed on the preceding Friday or following Monday, respectively.HOLIDAY NAME DATE HOLIDAY NAME DATENew Year\\u2019s Day January 1st M. L. King Memorial Day 3rd Monday in JanuaryPresidents Day 3rd Monday in February Memorial Day last Monday in MayIndependence Day July 4th Labor Day 1st Monday in SeptemberColumbus Day 2nd Monday in October Veteran\\u2019s Day November 11thThanksgiving Day 4th Thursday in NovemberChristmas Day December 25th1.5.2 Host Nation Holidays: Work shall (see 1.6.4.3) be performed on local Host Nation holidays occurringduring the normal workweek unless otherwise directed by the Contracting Officer.HOLIDAY NAME DATE HOLIDAY NAME DATEDay of Epiphany January 6st EasterEaster Monday 1st after Easter Liberation Day April 25stItalian Labor Day May 1st Saint Giulia May 22stRepublic Day June 2st Saint Ranieri June 17stAssumption Day August 15st All Saints\\u2019 Day November 1stNational Unity Day November xst Immaculate Conception December 8stChristmas Day December 25th Saint Stephen\\u2019s Day December 26th1.5.3 Musician Support Hours: Generally, services are on Sunday morning. Services may be required on other days as well (Memorial Services, Holy Days, Special Emphasis Services, etc.) The service rate shall remain the same. The musician shall provide services during a period that begins 15 minutes prior to the scheduled worship service, rehearsal, or program; and concludes 15 minutes following the conclusion of the event. The Musician may be required to provide services on legal American holidays.1.6 Place of Performance: The work to be performed under this contract will be performed throughout the United States Army Garrison (USAG) Italy (Camp Darby) located in Livorno, Italy, services are performed at a Government facilities.1.7 Installation Access: Access to U.S. installations and controlled areas is limited to personnel who meet security criteria and are authorized by Host Nation law to work in that country. Failure to submit required information\/data and obtain required documentation or clearances in accordance with Army in Europe (AE) Regulation 190-16 (AE Reg 190-16) Installation Access Control or (AE) Regulation 604-1 for Italy specific contracts, will be grounds for denying access to U.S. installations and controlled areas.1.7.1 Background Checks: Army in Europe (AE) Regulation 604-1 provides guidance pertaining to background checks for U.S. and Host Nation Musicians.1.7.2 Physical Security: The Musician shall safeguard all Government equipment, information, and property provided for Musician use. At the close of each work period, Government facilities, equipment, and materials shall be secured IAW the Army Physical Security Program (AR 190-13).1.7.3 Operations Security (OPSEC) Requirements: Musician personnel shall adhere to facility security policies and restrictions. The Musician shall immediately report suspicious activities to security personnel.1.8 The Musician shall attend, participate in, and furnish input to scheduled and unscheduled meetings, conferences, and briefings that relate to the functions and services herein as required by the Government to provide effective communication and impart necessary information. The Contract Manager or designated representative shall attend meetings as requested by the Government. Meeting attendees shall at times include Musician managerial, supervisory, and other personnel knowledgeable of the subject matter. Meetings may start or end outside of regular duty hours.2. Qualifications:2.1&nbsp; A minimum of two years-experience leading Christian worship with accompaniment on keyboard\/piano for comprehensive worship service requirements.2.2 The service provider shall provide documentation of the following:a. Ability to demonstrate rhythmic accuracy, music sensitivity, and overall appreciation of liturgical aesthetics.b. Demonstrate effective communication skills with a variety of age groups, to include children, within the pluralistic environment of the Chaplain Corps and be fluent in English.3. Facilities: The Government will provide the chapel facilities, meeting rooms, including space to prepare for worship. The Government will ensure that the Musician has adequate access to commercial telephone lines to perform his duties conducted on the U.S. Military Installation. The Government will bear the costs of telephone use for the performance of direct services associated and outlined in this agreement. Government telephones shall only be used in the performance of services and shall not be used to make or accept personal calls. The Government will provide (on as-required basis) workspace to include desk space, telephone, and IT support. The Government shall not provide an office dedicated solely for the Musician\\u2019s use (FAR 45.509-2).3.1 Utilities: The Government will provide required utilities for all facilities (Chapels and Chapel Activity Centers) to perform the services under this contract. The Government will not make any modifications to utility outlets to accommodate Musician equipment.4. Materials: The Government will furnish all equipment and supplies necessary to conduct services. However, the Musician may use personal equipment to conduct Worship Services, not provided by the Military Chapel. The Government will not be held liable for loss, damage, theft, or maintenance of personal equipment. The Musician shall ensure that personal property is clearly marked and identified to preclude misidentification as Government property.SPECIFIC TASKS5.1 Basic Services: The Musician shall provide Piano or Keyboard Music Support Service for 52 Sundays as well as 3 special holidays, to include preludes, postludes, offertory, accompanying singing of hymns\/choruses\/spiritual songs and the choir, background music for meditation, prayers, and communion.5.1.1 The Musician shall submit their proposed back-up plan (Deliverable A004) to provide back up musician compliant with the terms and conditions of the contract, in the event that the primary musician is unavailable or otherwise unable to perform under the contract. The proposed Submusician shall be provided to the KO and the COR 30 days after contract award and shall be updated annually or when the proposed substitute is no longer available. The KO has the right to request verification of qualification from all Submusicians prior to services being rendered. The price to be paid the submusician shall be a matter entirely between the Musician and theSubmusician.5.1.2 The Musician shall be on location prior to scheduled services to ensure proper preparation for successful performance, at least 15 minutes prior to the services being performed.5.1.3 The Musician shall have the ability to communicate effectively in English for coordination with the congregation\/parish and for satisfactory completion of administrative tasks.5.2. Tasks:5.2.1 Worship Services The Musician shall be available 52 Sundays as well as 3 special holidays to provide coordination of all musical selections with the Chaplain Pastor of the congregation or his\/her designated representative to select music in keeping with the theme of the worship service, accompany choir\/solo music presentations that enhance the atmosphere of worship for the particular congregation and coordinate with the worship leader and adjust tempo, and style of choir accompaniment to enhance the congregation's ability to participate in worship. Play accompaniment music for a Protestant worship service. This line item includes playing prelude and postlude music up to 15 minutes before and after the service. Play accompaniment music for congregational singing, solos duets, ensembles, and other special music as required. Services are normally between one (1) and two (2) hours in duration. Play accompaniment music for a rehearsal and other practices in preparation for Sunday services and special worship services. Rehearsals are normally one (1) hour in duration.Interested Candidates are requested to forward their resume together with three references from individuals who can attest to the candidate\\u2019s good work and steadiness.&nbsp; Candidates who do not possess the specific attributes\/qualifications in \\\"2. Qualifications\\\" above need not apply. This is a part-time position with compensation based on budget and the successful candidate\\u2019s experience and qualifications..&nbsp;&nbsp;&nbsp;<b>Apply directly at: <\/b>https:\/\/music-ministry.jobsoid.com (scroll down to \\u201cCamp Darby Chapel\\u201d).<b>&nbsp; Your application must include three (3) references including one priest or pastor who can attest to your abilities as they relate to this job posting.&nbsp; <\/b>References must include: name, title, organization, relationship to you, email address (necessary field) and phone number. Depending on security software, candidates are requested to monitor spam folders for further application communications from MMI.\"}"
}