{
    "id":"Kaggle::techmap::614595f12306db307df98db5::linkedin_ng::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The requirement for candidates to be \"very fluent in English and Eloquent in Pidgin languages\" could be seen as favouring candidates from specific linguistic or cultural backgrounds and potentially excluding others who may be otherwise be are highly proficient.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"It suggests that female candidates need an additional qualification (an MBA) to be considered equally with male candidates, potentially implying that female candidates are otherwise less qualified.",
    "verified":true,
    "synthetic":false,
    "text":" Responsibilities. Develop and implement direct to consumer marketing communication strategy. To develop and implement sales\/market growth strategies. To manage Agency resources profitably. To liaise with existing clients and recruits new accounts. To lead agency team and report to the board effectively to lead agency and client in digital marketing transformation. Requirements. Candidate must possess quality presentation skills. Possess a minimum of a first degree in any relevant discipline. Have at least 4  5 years busy experience working with FMCG, Telecom and Banking brands. Have extensive working industry connections. Willing to work outside normal working hours. Possess provable hands-on digital marketing and field operation experiences. Must be an entrepreneur. Must be resident in Ikeja Local government area axis. Must be very fluent in English and Eloquent in Pidgin languages. Must be a registered member of APCON and other relevant bodies. Must possess problem solving and negotiation abilities with an excellent Organizational ability. Strong communication and strong team \/ industry leadership skills and competencies. MBA is not an advantage but will be a plus for female candidates. Application closes by 10pm on the 30th of September. Send CV to gmail. com using name and the position title as subject.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614595f12306db307df98db5::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"Integrated Troops Limited\", \"position\": \"ADVERTISING AGENCY HEAD\", \"notes\": \"\", \"original\": \"<p><strong>Responsibilities<\/strong><\/p><ul><li>Develop and implement direct to consumer marketing communication strategy<\/li><li>To develop and implement sales\/market growth strategies<\/li><li>To manage Agency resources profitably<\/li><li>To liaise with existing clients and recruits new accounts.<\/li><li>To lead agency team and report to the board effectively to lead agency and client in digital marketing transformation<\/li><\/ul><p><strong>&nbsp;<\/strong><\/p><p><strong>Requirements<\/strong><\/p><ul><li>Candidate must possess quality presentation skills<\/li><li>Possess a minimum of a first degree in any relevant discipline<\/li><li>Have at least 4 \\u2013 5 years busy experience working with FMCG, Telecom and Banking brands<\/li><li>Have extensive working industry connections<\/li><li>Willing to work outside normal working hours<\/li><li>Possess provable hands-on digital marketing and field operation experiences<\/li><li>Must be an entrepreneur<\/li><li>Must be resident in Ikeja Local government area axis<\/li><li>Must be very fluent in English and Eloquent in Pidgin languages<\/li><li>Must be a registered member of APCON and other relevant bodies<\/li><li>Must possess problem solving and negotiation abilities with an excellent Organizational ability<\/li><li>Strong communication and strong team \/ industry leadership skills and competencies<\/li><li>MBA is not an advantage but will be a plus for female candidates<\/li><\/ul><p>&nbsp;<\/p><p><em>Application closes by 10pm on the 30th of September<\/em><\/p><p>&nbsp;<\/p><p>Send CV to imctroops@gmail.com using name and the position title as subject.<\/p>\"}"
}