{
    "id":"Kaggle::techmap::61376e09f2fd7421561f625a::seek_nz::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"we want someone who is reliable, fit and healthy\" While the role is a physically demanding one requiring fitness, the requirement for \"healthy\" might discourage someone who is not of complete health but is able for the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"The Opportunity We are looking for an Operator to join the Higgins Asphalt Team in Palmerston North. This position will involve operating an Asphalt Paver, Skid Steer and Loader Roller. Ideally you will have some industry knowledge and experience in operating Asphalt machinery. Our Operators are pro-active, and safety focused and enjoy working for an organisation where hard work is recognised and where they can build a career and not just do a job. Your role is key in enabling our Teams to deliver on what we do best – roading and infrastructure. Interested? If you are looking for your next opportunity, then this is what we think you will need to be successful in this role:. Full clean New Zealand Driver’s License. ideally Class 4 with WTR but will consider class 2. Ideally Asphalt Roller\/Paver experience. Roading and Infrastructure experience. Strong focus on health and safety not only for yourself, your colleagues but also the public. Self-motivated with a positive attitude and the ability to think for yourself • A high level of physical fitness due to the physical nature of the role. Be reliable, honest and a flexible team player. In other words, we want someone who is reliable, fit and healthy who will turn up on time every day with a positive safety focused attitude! Why Higgins? We are a leader in roading and infrastructure, across NZ and the South Pacific. With strong growth potential we have all the benefits of a large organisation, with the heart of a smaller close-knit, values-based business. Higgins is a proud member of the Fletcher Building family of companies. This is a great time to be joining us we are excited by the opportunities and investment in the industry and need someone who is just as excited to get involved and join our Teams on the journey – Apply NOW! Higgins: Building better roads for safer journeys – He pai ake te hanga o ngā rori, kia haumaru ai ngā haerenga",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61376e09f2fd7421561f625a::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Fletcher Building Limited\", \"position\": \"Asphalt Operator\", \"notes\": \"\", \"original\": \"<div><strong>The Opportunity\\u00a0<\/strong><\/div><div>We are looking for an Operator to join the Higgins Asphalt Team in Palmerston North. This position will involve operating an Asphalt Paver, Skid Steer and Loader Roller. Ideally you will have some industry knowledge and experience in operating Asphalt machinery.\\u00a0<\/div><div><br \/><\/div><div>Our Operators are pro-active, and safety focused and enjoy working for an organisation where hard work is recognised and where they can build a career and not just do a job.\\u00a0\\u00a0<\/div><div><br \/><\/div><div>Your role is key in enabling our Teams to deliver on what we do best \\u2013 roading and infrastructure.<\/div><div><br \/><\/div><div><strong>Interested?<\/strong><\/div><div>If you are looking for your next opportunity, then this is what we think you will need to be successful in this role:<\/div><div><br \/><\/div><div>\\u2022 Full clean New Zealand Driver\\u2019s License - ideally Class 4 with WTR but will consider class 2<\/div><div>\\u2022 Ideally Asphalt Roller\/Paver experience\\u00a0<\/div><div>\\u2022 Roading and Infrastructure experience\\u00a0<\/div><div>\\u2022 Strong focus on health and safety not only for yourself, your colleagues but also the public<\/div><div>\\u2022 Self-motivated with a positive attitude and the ability to think for yourself<\/div><div>\\u2022 A high level of physical fitness due to the physical nature of the role<\/div><div>\\u2022 Be reliable, honest and a flexible team player<\/div><div><br \/><\/div><div>In other words, we want someone who is reliable, fit and healthy who will turn up on time every day with a positive safety focused attitude!<\/div><div><br \/><\/div><div><strong>Why Higgins?<\/strong><\/div><div>We are a leader in roading and infrastructure, across NZ and the South Pacific.\\u00a0 With strong growth potential we have all the benefits of a large organisation, with the heart of a smaller close-knit, values-based business.\\u00a0<\/div><div><br \/><\/div><div>Higgins is a proud member of the Fletcher Building family of companies. We offer a competitive salary, Employee Welfare Fund, Share Scheme and an Employee Education Fund to help you and your family reach educational aspirations.\\u00a0<\/div><div><br \/><\/div><div>This is a great time to be joining us we are excited by the opportunities and investment in the industry and need someone who is just as excited to get involved and join our Teams on the journey \\u2013 <strong>Apply NOW!<\/strong><\/div><div><br \/><\/div><div><strong><em>Higgins: Building better roads for safer journeys \\u2013 He pai ake te hanga o ng\\u0101 rori, kia haumaru ai ng\\u0101 haerenga<\/em><\/strong><\/div>\"}"
}