{
    "id":"Kaggle::techmap::61464b6fb8f6167d193d8202::linkedin_cz::1",
    "label_age":true,
    "analysis_age":"The term \"Social Media savvy\" implies a preference for candidates who are proficient with multiple social media platforms, which can indirectly favour younger candidates who are more likely to use and be familiar with these platforms, potentially introducing age bias.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The terms \"target-driven and result-oriented\", \"self-motivated\", and \"disruptive mind\" typically resonate more with male candidates due to their assertive and competitive connotations.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The phrase \"Arabic and Russian very welcome\" can introduce racial bias by implying a preference for candidates from specific linguistic and cultural backgrounds.",
    "label_sexuality":true,
    "analysis_sexuality":"The term \"manage time of her\/his team effectively\" uses gender-specific pronouns, which can exclude non-binary individuals and those who do not identify strictly as male or female, thereby introducing sexuality bias.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 3 Years experience in travel companies business as sales or KAM or success in a similar position. Professional English is required, Arabic and Russian very welcome. Direct Procurement and 3rd party supplier negotiation experience in the assigned territory. Track record of over-achieving quota Sales  Gross profits. Strategic thinker, planner and tactical execution of ideas, budgets and targets. Target driven and result oriented. Social Media savvy (LinkedIn, Instagram, Facebook, Twitter, Regional-Local networks). Experience working with CRM system and its principles. Excellent verbal and written communications skills. Strong listening and presentation skills. Ability to multi-task, prioritize, and manage time of her\/his team effectively. Key Competencies: Results oriented. Leadership experience  Running small to midsize teams. Start-up mentality (Small team  Big and Quick wins). Planning and Organization skills. Analytical Skills. Interpersonal skills. Personality: Multilingual,. Flexible and open minded, passionate, ambitious  sees the position as a. mission and not just another 9-5 job. Well established. with a solid network in the industry and beyond, active on Social channels,. acquainted with the latest technology. and consumer trends. Enthusiastic,. initiative, self-motivated, Customer focused, disruptive mind, out of the box. thinker and solution minded, not afraid to make mistakes and to improve upon. them.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61464b6fb8f6167d193d8202::linkedin_cz\", \"source\": \"linkedin_cz\", \"country\": \"CZ\", \"company\": \"Multireisen Deutschland MRD GmbH Groups\", \"position\": \"SM Tech \\u2013Sales Tech Manager Prague\", \"notes\": \"\", \"original\": \"<strong>Department:<\/strong> <strong>Sales Multireisen Deutschland<br><br><\/strong><strong>Reporting to:<\/strong> <strong>Managing Director Multireisen Deutschland<br><br><\/strong>MultiReisen Deutschland is an international travel technology company<br><br>with headquarter in Germany, Berlin and regional offices in Hungary and Czech Republic . Since 2003 we have been collecting reviews, feedbacks, questionnaires and surveys from different travel agents, tour operators and travel management companies all over the world to build the most user-friendly and multifunctional online booking engine that will fit to any business needs.<br><br><strong><u>The World\\u2019s B2b Wholesale Provider<br><br><\/u><\/strong>One-stop convenience at best conditions, State of the art technology, Access to world-class products, True appreciation for your business, Brilliant customer support\\u2026.just some of the reasons to work with us. After all, if our current partners trust us, so can you!<br><br><strong>Tasks<br><\/strong><ul><li>Establishes the brand as a whole in the designated regions with clients and suppliers alike. Plans, assigns and organizes available resources to maximize return in terms of Sales, new and existing clients and number and quality of direct accommodation and ancillary contracts. Follows up or even better plants new trends in the assigned areas and converts the same into sellable products in coordination with other departments. SM Tech holds the key role in achieving our ambitious customer acquisition and revenue growth objectives. Manages complex business development and account management environments with competing and changing priorities and participates in the development of winning strategies to get ahead of the competition.<\/li><li>Excellent knowledge of our Product and demonstration<\/li><li>Excellent knowledge of the competitors Product<\/li><li>Excellent knowledge of the flight searches \/ hotels searches \/ GDS information \/ IATA\/ NDC \/META SEARCH\/ Comparing the prices \/ and other travel services<\/li><li>Excellent knowledge of the Contracts and check them correctly after signing<\/li><li>Follow up the inquiry task and rules<\/li><li>Key Responsibilities:<\/li><li>Create &amp; Achieve Regional Sales Plans and Business Growth Strategies for the markets<\/li><li>Fulfilment sales plan budget and numbers of the contract Monthly<\/li><li><\/li><li>Diversification across Source Market \/ Customer \/ Product<\/li><li>Develop strategy to acquire new agents<\/li><li>Execute tactical Sales Promotions in the region<\/li><li>Detailed Requirements (on Job)<\/li><li>Establish the brand in the minds of Retail Travel Agents, Wholesalers and Suppliers in your designated region \/ Area.<\/li><li>You assist in building the USP\\u2019s required to convince customers working with MRD<\/li><li>You engage your network of contacts through all available communication channels<\/li><li>Create and confirm plan of visiting companies with managing directors<\/li><li>Visit at least 4 current\/potential clients daily\\u2013Meetings with Decision makers<br><\/li><\/ul><strong><u>Requirements<br><br><\/u><\/strong><strong>Professionally:<br><\/strong><ul><li>Min. 3 Years experience in travel companies business as sales or KAM or success in a similar position <\/li><li>Professional English is required, Arabic and Russian very welcome.<\/li><li>Direct Procurement and 3rd party supplier negotiation experience in the assigned territory <\/li><li>Track record of over-achieving quota Sales \\u2013 Gross profits <\/li><li>Strategic thinker, planner and tactical execution of ideas, budgets and targets <\/li><li>Target driven and result oriented <\/li><li>Social Media savvy (LinkedIn, Instagram, Facebook, Twitter, Regional-Local networks) <\/li><li>Experience working with CRM system and its principles <\/li><li>Excellent verbal and written communications skills - Strong listening and presentation skills <\/li><li>Ability to multi-task, prioritize, and manage time of her\/his team effectively <\/li><li>Key Competencies: <\/li><li> Results oriented <\/li><li> Leadership experience \\u2013 Running small to midsize teams <\/li><li>Start-up mentality (Small team \\u2013 Big and Quick wins) <\/li><li> Planning and Organization skills <\/li><li>Analytical Skills <\/li><li> Interpersonal skills<br><\/li><\/ul><strong>Personality:<br><\/strong><ul><li>Multilingual,<br><\/li><\/ul>Flexible and open minded, passionate, ambitious \\u2013 sees the position as a<br><br>mission and not just another 9-5 job<br><ul><li>Well established<br><\/li><\/ul>with a solid network in the industry and beyond, active on Social channels,<br><br>acquainted with the latest technology<br><br>and consumer trends<br><ul><li>Enthusiastic,<br><\/li><\/ul>initiative, self-motivated, Customer focused, disruptive mind, out of the box<br><br>thinker and solution minded, not afraid to make mistakes and to improve upon<br><br>them\"}"
}