{
    "id":"Kaggle::techmap::61443674903aa61f89945d33::monsterasia_ph::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Report, analyze, insight, and drive action on AR performance and bad debts write-offs (monthly) and provisions (quarterly) to the regions and the Sales Management Team, Sales Finance Management Team, FP&A Head, Sales Director, and Finance Director. Consistently deliver on-time & correct reports that are requested by other functions in PMFTC, Region Treasury, Region Reporting, FSC, and PMI Treasury on Commercial related financials. Provide a consolidated monthly brief to Controller, Sales Director, Finance Director, and President on key financial highlights on actual performance of the commercial team (all Sales Channels). Support the CF Manager on all budget & reporting requirements. Who we're looking for. C College graduate with 3-5 years working with Commercial team and at least 1 year exposure on credit management, FMCG\/Tech Industry background. CPA is a plus. Ability to communicate well and handle difficult people. Advanced Excel skills with ability to handle high volume of data. Ability to handle systems is a must. What we offer. Our success depends on the men and women who come to work every single day with a sense of purpose and an appetite for progress. Join PMI and you too can: Seize the freedom to define your future and ours. We'll empower you to take risks, experiment and explore. Be part of an inclusive, diverse culture, where everyone's contribution is respected collaborate with some of the world's best people and feel like you belong. Pursue your ambitions and develop your skills with a global business. our staggering and scale provides endless opportunities to progress. Take pride in delivering our promise to society: to improve the lives of a billion smokers.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61443674903aa61f89945d33::monsterasia_ph\", \"source\": \"monsterasia_ph\", \"country\": \"PH\", \"company\": \"Philip Morris International\", \"position\": \"Commercial Finance Analyst\", \"notes\": \"\", \"original\": \"<br>Be a part of a revolutionary change<br>At PMI, we've chosen to do something incredible. We're totally transforming our business, and building our future on smoke-free products with the power to improve the lives of a billion smokers worldwide.<br>With huge change, comes huge opportunity. So, wherever you join us, you'll enjoy the freedom to dream up and deliver better, brighter solutions and the space to move your career forward in endlessly different directions.<br>Our new vision means we're reinventing our financial modelling, planning and forecasting tools. Join us in Finance and you'll work across the full breadth of the business, making sure our new commercial model is profitable and sustainable. There's something new to learn every single day: changes to integrate and challenges to conquer. If you love working collaboratively and taking risks, you'll be in your element here.<br>Our work spans the globe and includes audit, treasury, internal control and commercial financial support. Whether your skills are in financial control, planning and forecasting, data analytics or digital risk, there's space to move your career forward in any number of directions.<br>Your \\u00e2\\u20ac\\u02dcday to day<br>Manages the credit handling across different distribution channels of the business, regular and Adhoc PMFTC and PMI reporting requirements. This involves balancing the risk of granting credit and providing sufficient credit support to the Sales teams so that they can grow the business in their areas. Highly efficient in securing information from different sources (systems and people), validate correctness of data, analyze information quickly to infer trends and spot risks and opportunities. A strong communicator and is able to understand from the regions what is driving the costs\/AR\/risks and be able to relay the message to Head of FP&A, Sales Director, Finance Director, Regional Treasury, or PMI Treasury and just as strongly, be able to understand directions from the top and effectively roll out to the regions.<br>. Ensure the optimal Credit approach is in place to balance the controls, cost of credit and business growth.<br>. Provide analytical support and SME guidance to national projects that involves credit through financial modeling and top management engagement (Sales Director and Finance Director) for review and approvals.<br>. Report, analyze, insight, and drive action on AR performance and bad debts write-offs (monthly) and provisions (quarterly) to the regions and the Sales Management Team, Sales Finance Management Team, FP&A Head, Sales Director, and Finance Director.<br>. Consistently deliver on-time & correct reports that are requested by other functions in PMFTC, Region Treasury, Region Reporting, FSC, and PMI Treasury on Commercial related financials.<br>. Provide a consolidated monthly brief to Controller, Sales Director, Finance Director, and President on key financial highlights on actual performance of the commercial team (all Sales Channels).<br>. Support the CF Manager on all budget & reporting requirements.<br>Who we're looking for<br>. C College graduate with 3-5 years working with Commercial team and at least 1 year exposure on credit management, FMCG\/Tech Industry background.<br>. CPA is a plus<br>. Ability to communicate well and handle difficult people.<br>. Advanced Excel skills with ability to handle high volume of data.<br>. Ability to handle systems is a must.<br>What we offer<br>Our success depends on the men and women who come to work every single day with a sense of purpose and an appetite for progress. Join PMI and you too can:<br>. Seize the freedom to define your future and ours. We'll empower you to take risks, experiment and explore.<br>. Be part of an inclusive, diverse culture, where everyone's contribution is respected collaborate with some of the world's best people and feel like you belong.<br>. Pursue your ambitions and develop your skills with a global business - our staggering and scale provides endless opportunities to progress.<br>. Take pride in delivering our promise to society: to improve the lives of a billion smokers.<br>\"}"
}