{
    "id":"Kaggle::techmap::6145d550e6c602312c32e5f9::linkedin_dk::0",
    "label_age":true,
    "analysis_age":"The terms \"young and passionate team\" and \" \"opportunities to grow\" imply a preference for younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Phrases like \"self-starters who see things through from start to finish\" and \"make an immediate impact\" favour traits typically associated with male-dominated work cultures or imply a preference for male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" (m\/f\/x). At Hello. Fresh, our mission is to change the way people eat - forever. From our 2011 founding in Europes vibrant tech hub Berlin, weve become the global market leader in the meal kit sector and inspire millions of energised home cooks across the globe every week. We offer our meal kit boxes full of exciting recipes and thoughtfully sourced, fresh ingredients in 16 countries over 3 continents and shipped out more than 250 Million meals in 2019. Our rapidly increasing personnel of more than 5, 000 employees are the heart and soul of our highly international, fast-paced, and dynamic environment where innovation and smart, fast action is encouraged. We want you to join us and help take Hello. Fresh to the next level. as a company in its growth phase this is a great time to join. Career and development opportunities are endless. We will encourage you to make an immediate impact in your area of work as well as empower you to grow your career with us. About The Job. For our young and passionate team, we are looking for a Business Development Manager who can help us execute on the most important projects across our organization. Well give you the freedom and tools to bring your absolute best, and the opportunities will be limitless. You will be an integral part of a fast growing scale-up, helping us realize new business opportunities and solve critical commercial and operational challenges. We look for people who can apply deep logic to their thinking and back everything up with data. We look for natural self-starters who see things through from start to finish, and who learn from every mistake. This role offers a great opportunity to gain experience with developing, launching, and growing an online food concept in the Nordics. You will be involved in the most important topics and get a lot of responsibility from day one. There will be plenty of opportunities to grow in this role or transition into other roles as the company grows. In the job, you will. Be end-to-end responsible for our Special Projects such as country\/brand launches, supply chain expansions and complex product launches. Identify, scope and coordinate commercial and operational priorities across the organisation as part of our annual OKR cycle, performance fora and ongoing project support.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145d550e6c602312c32e5f9::linkedin_dk\", \"source\": \"linkedin_dk\", \"country\": \"DK\", \"company\": \"HelloFresh\", \"position\": \"Business Development Manager\", \"notes\": \"\", \"original\": \"(m\/f\/x)<br><br>At HelloFresh, our mission is to change the way people eat - forever. From our 2011 founding in Europe\\u2019s vibrant tech hub Berlin, we\\u2019ve become the global market leader in the meal kit sector and inspire millions of energised home cooks across the globe every week.<br><br>We offer our meal kit boxes full of exciting recipes and thoughtfully sourced, fresh ingredients in 16 countries over 3 continents and shipped out more than 250 Million meals in 2019.<br><br>Our rapidly increasing personnel of more than 5,000 employees are the heart and soul of our highly international, fast-paced, and dynamic environment where innovation and smart, fast action is encouraged.<br><br>We want you to join us and help take HelloFresh to the next level - as a company in its growth phase this is a great time to join. Career and development opportunities are endless.<br><br>We will encourage you to make an immediate impact in your area of work as well as empower you to grow your career with us.<br><br><strong><u>About The Job<br><br><\/u><\/strong>For our young and passionate team, we are looking for a Business Development Manager who can help us execute on the most important projects across our organization. We\\u2019ll give you the freedom and tools to bring your absolute best, and the opportunities will be limitless. You will be an integral part of a fast growing scale-up, helping us realize new business opportunities and solve critical commercial and operational challenges.<br><br>We look for people who can apply deep logic to their thinking and back everything up with data. We look for natural self-starters who see things through from start to finish, and who learn from every mistake.<br><br>This role offers a great opportunity to gain experience with developing, launching, and growing an online food concept in the Nordics. You will be involved in the most important topics and get a lot of responsibility from day one. There will be plenty of opportunities to grow in this role or transition into other roles as the company grows.<br><br><strong>In the job, you will...<br><\/strong><ul><li>Be end-to-end responsible for our \\u201cSpecial Projects\\u201d such as country\/brand launches, supply chain expansions and complex product launches<\/li><li>Identify, scope and coordinate commercial and operational priorities across the organisation as part of our annual OKR cycle, performance fora and ongoing project support<\/li><li>Identify and execute on continuous improvements of our commercial and operational processes and approaches<\/li><li>Support functions in critical areas with ad hoc analysis, problem solving and project management<br><\/li><\/ul><strong><u>Who We Are Looking For...<br><\/u><\/strong><ul><li>BSc\/MSc with excellent grades from a top tier university in Business, Economics or another related field of study<\/li><li>1 - 3 years of professional experience in a high performance culture environment (Consulting, Banking, GrowthCo)<\/li><li>Analytical mindset and solid business understanding<\/li><li>Ability to autonomously solve complex problems and execute on projects with wide operational implications<\/li><li>Strong project management skills including a proven track record of \\u201cgetting things done\\u201d<\/li><li>Ability to manage priorities simultaneously and meet time-sensitive deadlines<\/li><li>Fluency in English<br><\/li><\/ul><strong><u>What We Offer<br><\/u><\/strong><ul><li>The chance to have a serious impact on one of the fastest-growing technology companies in Europe in an exciting growth phase<\/li><li>Direct impact on our future operational and commercial setup from day one<\/li><li>A vibrant and international environment<\/li><li>A guaranteed steep learning curve and boost for your career<\/li><li>Competitive compensation<\/li><li>Benefit from our selection of employee perks (significant reduction on your HelloFresh boxes, drinks in the office, Friday bars, subsidized office lunch etc.)<br><\/li><\/ul><strong>Are you up for a challenge?<br><br><\/strong><em>Apply now with your CV and Cover Letter, willingly also without a photo and without stating nationality, marital status, gender, religion or other discriminatory characteristics. Language certificates and documents for residence and work permits can be submitted with your application.<br><br><\/em><em>HelloFresh \\u2018lives\\u2019 diversity. We are proud of the different backgrounds, abilities and perspectives of each team member and support the personal development on the job. Every personnel decision is based on equal opportunities, on qualifications, performance and requirements of the company and is independent of origin, skin color, religion, political orientation, gender, physical or mental disability or age. With the help of our Diversity &amp; Inclusion Committee and our team-based hiring decisions, we do everything we can to reduce prejudices in the selection.<br><br><\/em><em>We look forward to meeting you!<\/em>\"}"
}