{
    "id":"Kaggle::techmap::61413cda8be8df1fa24bf5f6::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The job description includes numerous physical and mental function requirements, such as standing or walking for an entire shift, climbing stairs, occasionally lifting or carrying up to 40 pounds, and constant use of hands, arms, and eyes. These stipulations may inadvertently exclude individuals with physical disabilities who, with reasonable accommodations, could perform the essential duties of the position. The absence of language regarding reasonable accommodations could discourage qualified candidates with disabilities from applying.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Physical and Mental Functions: Stand or walk constantly (for up to an entire shift) on various surfaces (tile, concrete, carpet). Climb stairs, ramps, or ladders occasionally during shift. Occasionally bend\/twist at waist\/knees. eck to perform various duties. Occasionally lift or carry up to 40 pounds. Run as needed. Constant use of both hands and arms in reaching\/handling\/grasping\/fingering while using phone, notepad, writing reports, and other administrative tasks. Constant use of eyes (correctable vision to normal level required) to observe, read, interact with public and co-workers, view security monitors. Includes hand\/eye coordination. Work in various environments including adverse outdoor conditions such as cold, rain or heat. Constant mental alertness and attention to detail required while setting priorities and following up on assignments. Qualifications\/Requirements: Qualified applicants for the Fire Life Safety Director position will meet the minimum requirements, as described below: High school diploma or equivalent required. At least 18 years of age. Must possess effective written and oral communication and interpersonal skills with ability to deal with all levels of personnel and the general public in a professional and effective manner. Must be able to use initiative and independent judgment within established guidelines. Must be able to frequently prepare written reports and logs in neat, legible handwriting. May require computer skills. Must be able to read and understand all operating procedures and instructions. Licensing requirements are subject to state and\/or local laws and regulations and may be required prior to employment. As a condition of employment, employee must successfully complete a background investigation and a post-offer\/pre-employment drug\/alcohol test. As a condition of continued employment, employee must maintain current active status of all required License at all times, and must carry the license at all times while on duty. Must display exceptional customer service and communication skills. Remain flexible to ever changing environments. Adapt well to different situations. Intermediate computer skills to utilize innovative, wireless technology at client specific sites. Ability to maintain satisfactory attendance and punctuality standard. Neat and professional appearance. Ability to provide quality customer service. Ability to handle both common and crisis situations at the client site, calmly and efficiently. Read, understand and clearly speak English. Constantly use speech and hearing (correctable to normal level required) in communicating with public\/co-workers, giving and receiving instructions, using phones.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61413cda8be8df1fa24bf5f6::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Allied Universal\", \"position\": \"Fire Life Safety Director - Commercial Building\", \"notes\": \"\", \"original\": \"<p>At <strong>Allied Universal\\u00ae<\/strong>, we continue to build an inclusive, <strong>Be Phenomenal\\u00ae<\/strong> culture that encourages, supports, and celebrates a diverse workplace. It fuels our innovation and connects us closer to our customers and the communities in which we serve. Allied Universal offers so much more than just a job. We offer careers. We take great pride in our promote-from-within culture. There are countless examples of individuals who began their career as Security Professionals and today hold positions on our senior leadership team. We offer medical, dental and vision coverage, life insurance, 401K, employee assistance programs, company discounts, perks and more for all full-time positions! Start your phenomenal career with Allied Universal\\u00ae today!<\/p><p><strong>Allied Universal is currently looking to hire 2 Fire Life Safety Directors for a Residential Facility located in Manhattan.<\/strong><\/p><p><\/p><p><strong>Position is:<\/strong><\/p><p><strong>Full Time<\/strong><\/p><p><strong>Work Days Available: Monday-Friday<\/strong><\/p><p><strong>Work Shifts Available: Morning and Evening<\/strong><\/p><p><\/p><p><strong>Must obtain a F85 or F89 Certificate of Fitness<\/strong><\/p><p><\/p><p>The primary mission of the <strong>Fire Life Safety Director<\/strong> is to protect life and property through the implementation of the building's fire safety plan including the management of the Fire Command Station and the supervision of the fire brigade, floor wardens, and deputy floor wardens and building evacuation supervisors.<\/p><p>The successful <strong>Fire Life Safety Director<\/strong> candidate is required to act as a liaison to the NYC Fire Department during emergencies.<\/p><p><\/p><p><strong>Expected skills and competencies necessary to perform duties include, but are not limited to:<\/strong><\/p><ul><li>Ensure that all life safety systems and related equipment are fully functional.<\/li><li>Ensure that all floors have fire safety teams including Fire Wardens, Deputy Fire Wardens, and Building Evacuation Team members.<\/li><li>Conduct fire alarm drills and maintain a written log of critiques to identify potential or actual weaknesses in response time or life safety systems and related equipment.<\/li><li>Providing clear direction, information and assistance to client visitors, guests, vendors and employees in a professional, pleasant and courteous fashion on a regular basis and during emergency situations.<\/li><li>Assist the building security staff in the visual inspection of all visitor, vendor and employee access badges\/identification cards to verify that the authorized holder is the individual presenting the badge\/id card to prevent unauthorized access to the property.<\/li><li>Maintain surveillance and reporting of any suspicious persons and\/or packages.<\/li><li>Perform CPR\/AED and basic first aid if required.<\/li><\/ul><p><\/p><p><strong>Physical and Mental Functions:<\/strong><\/p><ul><li>Stand or walk constantly (for up to an entire shift) on various surfaces (tile, concrete, carpet)<\/li><li>Climb stairs, ramps, or ladders occasionally during shift<\/li><li>Occasionally bend\/twist at waist\/knees\/neck to perform various duties<\/li><li>Occasionally lift or carry up to 40 pounds<\/li><li>Run as needed<\/li><li>Constant use of both hands and arms in reaching\/handling\/grasping\/fingering while using phone, notepad, writing reports, and other administrative tasks<\/li><li>Constant use of eyes (correctable vision to normal level required) to observe, read, interact with public and co-workers, view security monitors; includes hand\/eye coordination<\/li><li>Work in various environments including adverse outdoor conditions such as cold, rain or heat;<\/li><li>Constant mental alertness and attention to detail required while setting priorities and following up on assignments<\/li><\/ul><p><strong>Qualifications\/Requirements:<\/strong><\/p><p>Qualified applicants for the <strong>Fire Life Safety Director<\/strong> position will meet the minimum requirements, as described below:<\/p><ul><li>High school diploma or equivalent required<\/li><li>At least 18 years of age<\/li><li>Must possess effective written and oral communication and interpersonal skills with ability to deal with all levels of personnel and the general public in a professional and effective manner; must be able to use initiative and independent judgment within established guidelines<\/li><li>Must be able to frequently prepare written reports and logs in neat, legible handwriting; may require computer skills<\/li><li>Must be able to read and understand all operating procedures and instructions<\/li><li><p>Licensing requirements are subject to state and\/or local laws and regulations and may be required prior to employment.<\/p><\/li><li>As a condition of employment, employee must successfully complete a background investigation and a post-offer\/pre-employment drug\/alcohol test<\/li><li>As a condition of continued employment, employee must maintain current active status of all required License at all times, and must carry the license at all times while on duty<\/li><li>Must display exceptional customer service and communication skills<\/li><li>Remain flexible to ever changing environments; adapt well to different situations<\/li><li>Intermediate computer skills to utilize innovative, wireless technology at client specific sites<\/li><li>Ability to maintain satisfactory attendance and punctuality standard;<\/li><li>Neat and professional appearance<\/li><li>Ability to provide quality customer service<\/li><li>Ability to handle both common and crisis situations at the client site, calmly and efficiently<\/li><li>Read, understand and clearly speak English; constantly use speech and hearing (correctable to normal level required) in communicating with public\/co-workers, giving and receiving instructions, using phones<\/li><li>Must be able to handle pressure of working with high volume general public (constantly to occasionally depending on assignment)<\/li><\/ul><p><strong>Allied Universal\\u00ae<\/strong> provides unparalleled service, systems and solutions to people and businesses within our local communities, and is North America\\u2019s leading security services provider. Allied Universal delivers high-quality, tailored solutions, which allows clients to focus on their core business. For more information: [Link available when viewing the job].<\/p><p><\/p><p>We proudly support the Veteran Jobs Mission, a group of over 200 companies that have committed to collectively hiring a total of one million military veterans. <strong>EOE\/Minorities\/Females\/Vet\/Disability\/Sexual Orientation\/Gender Identity<\/strong> Allied Universal Services is an Equal Opportunity Employer committed to hiring a diverse workforce.<\/p><br \/><p><strong>Allied Universal\\u00ae<\/strong>\\u00a0provides unparalleled service, systems and solutions to people and businesses within our local communities, and is North America\\u2019s leading security services provider. Allied Universal delivers high-quality, tailored solutions, which allows clients to focus on their core business. For more information: \\u00a0[Link available when viewing the job].<\/p><p><\/p><p>We proudly support the Veteran Jobs Mission, a group of over 200 companies that have committed to collectively hiring a total of one million military veterans.\\u00a0<strong>EOE\/Minorities\/Females\/Vet\/Disability\/Sexual Orientation\/Gender Identity<\/strong>\\u00a0 Allied Universal Services is an Equal Opportunity Employer committed to hiring a diverse workforce.<\/p>&nbsp;\"}"
}