{
    "id":"Kaggle::techmap::63671053f2717228ad1ecfa0::glassdoor_ie::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" An up-to-date current driving licence is desired. To demonstrate flexibility in undertaking additional tasks as aspects of this role will require travel and working outside of normal office hours. To deliver key tasks by ensuring dignity, respect, equality, and work life balance in the workplace. Salary Scale: €44, 851 to €64, 567 per annum contributory superannuation. Rising by long service increments to €65, 464 (after 3 years satisfactory service at the maximum of the range. Non neogtiable to start at minimum of the scale. Job Type: Permanent. Salary: From €44, 851.00 per year. Benefits: Bike to work scheme. Company events. Company pension. Employee assistance program. Flexitime. Food allowance. Wellness program. Work from home. Schedule: Monday to Friday. Application deadline: 07\/11\/2022. Reference ID: 2022-102.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::63671053f2717228ad1ecfa0::glassdoor_ie\", \"source\": \"glassdoor_ie\", \"country\": \"IE\", \"company\": \"IDA Ireland\", \"position\": \"Network Administrator\", \"notes\": \"\", \"original\": \"<p><b>Network Administrator<\/b><\/p><p><b>Job Purpose<\/b><\/p><p>Working as part of the global Information & Technology Unit based out of the IDA HQ in Dublin the successful candidate will be a member of the IT team providing 3rd level support and management to the IDA\\u2019s IT infrastructure. This support includes E-mail and communications tools, servers, networks and security. The role will involve the management of technologies such as Microsoft 365, MS Teams, Active Directory, Microsoft System Centre, Windows Servers, Microsoft Hyper-V, Veeam, SANs, Fortinet firewalls, iOS devices, Microsoft Azure and other cloud solutions.<\/p><p><b>Key Tasks<\/b><\/p><ul><li>Provide 3rd level onsite support to other colleagues in the infrastructure team, Helpdesk and Development teams;<\/li><li>Responsible for creation and maintenance of documentation pertaining to network IT infrastructure and operating procedures.<\/li><li>Management and Administration of: Microsoft Active Directory on Windows Server 2019;<\/li><\/ul><p>Administration of Microsoft Teams and Cloud PSTN;Microsoft 365 environment Administration including Exchange and SharePointAntivirus, deployment and updates.Veaam backups and restores.Hybrid AD Administrative groups and user access rights.Microsoft Hyper -V environment.Grafana based monitoring system<\/p><ul><li>Experienced in administration of network topologies, switches, routing and Firewall rule base configurations.<\/li><li>Perform Hardware and Software upgrades, often complex in nature;<\/li><li>Continuously learn and keep up to date with the latest technologies and be able to solve issues as they arise.<\/li><li>Management of IT risks and issues, incident resolution, disaster recovery planning and testing which includes periodic testing for failover and fault tolerance outside core office hours.<\/li><\/ul><p><b>Key Competencies Required<\/b><\/p><p>Communications and Personal Effectiveness<br\/>Knowledge \\u2013 with an emphasis on possessing strong IT skills<br\/>Creativity and Innovation<br\/>Negotiation and Influencing<br\/>Client Focused Relationship Building<br\/>Networking<\/p><p><b>Additional Requirements: <\/b><\/p><ul><li>Minimum 3 years\\u2019 experience delivering at a level 2 IT administration role is required.<\/li><li>CCNA certification is mandatory for this role.<\/li><li>Trained and certified in Veeam Backups and Replication.<\/li><li>Trained in IT monitoring<\/li><li>Working knowledge of SCCM, DPM, Defender, Grafana, Microsoft Intune<\/li><li>Network management and analysis tools experience - SNMP, WireShark, MRTG, LanGuardian is required.<\/li><li>Experience in the deployment, management, and administration of a complex hybrid on premise \/ cloud-based IT environment.<\/li><li>Strong communication and interpersonal skills, coupled with the ability to maintain confidentiality and discretion at all times.<\/li><li>Excellent analytical, problem solving and planning skills with the ability to articulate issues to non-technical people.<\/li><li>Ability to work well under pressure and on own initiative ensuring attention to detail<\/li><li>Can-Do Proactive Starter Attitude & Aptitude<\/li><li>Ability to maintain composure<\/li><li>An up-to-date current driving licence is desired.<\/li><li>To demonstrate flexibility in undertaking additional tasks as aspects of this role will require travel and working outside of normal office hours.<\/li><li>To deliver key tasks by ensuring dignity, respect, equality, and work life balance in the workplace.<\/li><\/ul><p><b>Salary Scale: <\/b><br\/><b>\\u20ac44,851 to \\u20ac64,567 per annum contributory superannuation.<\/b><br\/>Rising by long service increments to \\u20ac65,464 (after 3 years satisfactory service at the maximum of the range. *Non neogtiable to start at minimum of the scale<\/p><p>Job Type: Permanent<\/p><p>Salary: From \\u20ac44,851.00 per year<\/p><p>Benefits:<\/p><ul><li>Bike to work scheme<\/li><li>Company events<\/li><li>Company pension<\/li><li>Employee assistance program<\/li><li>Flexitime<\/li><li>Food allowance<\/li><li>Wellness program<\/li><li>Work from home<\/li><\/ul><p>Schedule:<\/p><ul><li>Monday to Friday<\/li><\/ul><p>Application deadline: 07\/11\/2022<br\/>Reference ID: 2022-102<\/p>\"}"
}