{
    "id":"Kaggle::techmap::615c0d5d5439ba30e0dcd47c::linkedin_mt::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Requires manual dexterity sufficient to operate standard office machines such as computers, fax machines, calculators, the telephone, and other office equipment. Expected Hours of Work. The position is fulltime and frequently requires working additional time outside of normal business hours.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615c0d5d5439ba30e0dcd47c::linkedin_mt\", \"source\": \"linkedin_mt\", \"country\": \"MT\", \"company\": \"The Ritz-Carlton Yacht Collection\", \"position\": \"Senior Tax Specialist\", \"notes\": \"\", \"original\": \"<p>We invite you to explore The Ritz-Carlton Yacht Collection. The Ritz-Carlton Yacht Collection seeks an experienced Senior Tax Specialist.&nbsp;<\/p><p><br><\/p><p><strong>Job Summary <\/strong><\/p><p>The Senior Tax Specialist will be an integral part of a small but growing finance team. This lady or gentleman will work closely with the Accounting Manager, VP Controller, CFO, and outside tax advisors to handle both Tax Planning, Analysis and Preparation for the company. This role will also be responsible for both tax, audit, and reporting compliance and assist the Accounting department when needed.<\/p><p><br><\/p><p><strong>Essential Functions<\/strong><\/p><ul><li>Oversee and prepare tax provisions schedules, returns, payments, and reports<\/li><li>Support in the preparation of all the VAT returns<\/li><li>Support in the preparation of all the corporate tax returns<\/li><li>Support in the preparation of additional tax reporting \\u2013 intangible tax<\/li><li>Preparation of 1099\\u2019s<\/li><li>Oversee compliance efforts with all tax regulations<\/li><li>Advise management about the impact of tax liabilities and corporate strategies or new tax laws<\/li><li>Identify legal tax savings and recommend ways to improve profits<\/li><li>Advise management about the impact of tax liabilities and corporate strategies or new tax laws<\/li><li>Find tax solutions to complicated tax issues<\/li><li>Oversee assigned entries and reconciliations<\/li><li>Reporting \\u2013 prepare reporting for external stakeholders \\u2013 banks, FMC, audit, equity partners, planning, etc.<\/li><\/ul><p><br><\/p><p><strong>Other Duties<\/strong><\/p><p>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Functions, duties, responsibilities, and activities may change at any time with or without notice. <\/p><p><br><\/p><p><strong>Competency<\/strong><\/p><p>Education:&nbsp;&nbsp;BA\/BS in Finance, Accounting, or Business Economics, MBA desirable<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>Experience:&nbsp;<\/p><ul><li>4 years previous corporate international tax experience.<\/li><li>Previous experience in the Cruise industry is desirable.<\/li><\/ul><p>Skills:<\/p><ul><li>Must be articulate and possess strong communication skills in order to effectively communicate<\/li><li>Strong customer service skills<\/li><li>Detailed and deadline oriented<\/li><li>Strong analytical skills<\/li><li>Excellent organizational, problem-solving and follow-up skills<\/li><li>Team player<\/li><li>Self-starter, able to function with little supervision, high-energy<\/li><li>Advanced computer skills in Microsoft Office suite<\/li><li>Ability to prioritize multiple tasks and complete them on a timely basis<\/li><li>In-depth knowledge of accounting principles<\/li><li>Knowledge of Microsoft Dynamics Software will be considered a strong asset<\/li><\/ul><p>&nbsp;<\/p><p><strong>&nbsp;<\/strong><\/p><p><strong>Work Environment<\/strong><\/p><p>Works in a typical office environment with quiet-to-moderate noise generated by computer printer, fax machine and light traffic.&nbsp;<\/p><p><br><\/p><p><strong><span class=\\\"ql-cursor\\\"><\/span>Physical Demands<\/strong><\/p><p>Requires sitting, standing, walking, bending, and reaching.&nbsp;May require lifting or pushing up to 25 pounds.&nbsp;Requires manual dexterity sufficient to operate standard office machines such as computers, fax machines, calculators, the telephone, and other office equipment.&nbsp;<\/p><p><strong>&nbsp;<\/strong><\/p><p><strong>Expected Hours of Work<\/strong><\/p><p>The position is fulltime and frequently requires working additional time outside of normal business hours. <\/p><p><em>&nbsp;<\/em><\/p>\"}"
}