{
    "id":"Kaggle::techmap::6148ca1bd0a4612a3de4cfd5::linkedin_th::1",
    "label_age":true,
    "analysis_age":"The phrase \"10-15 years experience in HR consulting\" may introduce age bias by setting an unattainable standard for younger workers, thereby favouring older candidates with more years of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10-15 years experience in HR consulting across various domains such as Talent Management, Job Redesign, Workforce Transformation, HR Strategy & Operations. Deep expertise in content areas, good client engagement building upskilling plans and project management. Led sales and delivery across clients in Thailand. P&L experience. What Makes You Stand Out. Thrive in problem-solving, shaping solutions, understanding and solving for client needs. Drive a positive, constructive, engaging work and high-performance culture by espousing appropriate behaviors and inspiring others in the team to do likewise. Take ownership in the career development needs and champion the professional development of consultants in the team. Champion change management efforts for strengthening Mercers overall business and financial performance. Marsh Mc. Lennan is committed to embracing a diverse, inclusive and flexible work environment. We aim to attract and retain the best people regardless of their sex\/gender, marital or parental status, ethnic origin, nationality, age, background, disability, sexual orientation, and gender identity. About Mercer. Mercer believes in building brighter futures by redefining the world of work, reshaping retirement and investment outcomes, and unlocking real health and well-being. Mercers more than 25, 000 employees are based in 44 countries and the firm operates in over 130 countries. Mercer is a business of Marsh Mc. Lennan (NYSE: MMC), the worlds leading professional services firm in the areas of risk, strategy and people, with 76, 000 colleagues and annual revenue of $17 billion. Through its market-leading businesses including Marsh, Guy Carpenter and Oliver Wyman, Marsh & Mc. Lennan helps clients navigate an increasingly dynamic and complex environment. For more information, visit httpswww. mercer. com\/. Follow Mercer on Twitter Mercer. R133521.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148ca1bd0a4612a3de4cfd5::linkedin_th\", \"source\": \"linkedin_th\", \"country\": \"TH\", \"company\": \"Mercer\", \"position\": \"Principal Consultant, Talent Solutions\", \"notes\": \"\", \"original\": \"At Mercer, we believe in building brighter futures. Together, we\\u2019re redefining the world of work, reshaping retirement and investment outcomes, and unlocking real health and well-being. We do this by understanding data and applying it with a human touch across a dynamic Health, Wealth and Career business portfolio. For 75 years, our employees have been turning ideas into action to build healthier and more sustainable futures for our clients, colleagues and communities and people.<br><br>To strengthen our growing business in Thailand, we are looking for talent to join our Talent Solutions business, as <strong>Principal, Talent Solutions<br><br><\/strong><strong>Mercer Talent Solutions business:<\/strong> Mercer's Thailand Talent Solutions business helps clients navigate the Future of Work. With the strongest Workforce Products &amp; Insights database the market, we bring Reward and Talent expertise together to improve the way work works \\u2013 from organization design, to strategic workforce planning, to identifying future work, skills needed, skill-gaps, action plans for transformation, to performance and total rewards.<br><br><strong>PRINCIPAL<\/strong><strong>, TALENT SOLUTIONS<br><br><\/strong><strong>Our Culture:<\/strong> Entrepreneurial, Data-hungry, Curious, Energetic and Ambitious<br><br><strong>Skills we really care about: <\/strong>Problem-Solving, Creative Thinking, Collaboration, Adaptability<br><br><strong>What can you expect ?<br><br><\/strong><ul><li>Lead sales and client engagement in Talent Management, Job Redesign, Workforce Transformation and\/or HR Strategy &amp; Operations<\/li><li>Provide thought leadership by developing points-of-view and opinion papers as well as research efforts relevant to those areas<\/li><li>Support client engagement and project delivery in other complementary areas, as needed<\/li><li>Mentor, coach, engage, nurture and inspire consultants in the team to deliver a high standard of work<br><br><\/li><\/ul><strong>We will count on you to<br><br><\/strong><ul><li>Build trust-based, long-term client relationships<\/li><li>Lead business development efforts including the generation of leads and engagement with prospects, build a strong and sustainable business development pipeline<\/li><li>Lead proposal shaping, solution design fit to client needs and nurture upselling\/ cross-selling client opportunities<\/li><li>Guide and lead client delivery in the areas of Talent Management, Job Redesign, Workforce Transformation and\/or HR Strategy &amp; Operations<\/li><li>Develop strategies, including value differentiators, go-to-market plans and channel management plans for Mercer\\u2019s solutions in the practice area<\/li><li>Lead, direct and guide consulting engagements, provide guidance to project teams to build trusted relationships and deliver client value<\/li><li>Manage project scope, finances and stakeholders to time, quality, budget while developing team skills<\/li><li>Support team engagement and well-being; build a thriving, high performing team<br><br><\/li><\/ul><strong>What You Need To Have<br><br><\/strong><ul><li>10-15 years\\u2019 experience in HR consulting across various domains such as Talent Management, Job Redesign, Workforce Transformation, HR Strategy &amp; Operations<\/li><li>Deep expertise in content areas, good client engagement building upskilling plans and project management<\/li><li>Led sales and delivery across clients in Thailand<\/li><li>P&amp;L experience<br><br><\/li><\/ul><strong>What Makes You Stand Out<br><br><\/strong><ul><li>Thrive in problem-solving, shaping solutions, understanding and solving for client needs<\/li><li>Drive a positive, constructive, engaging work and high-performance culture by espousing appropriate behaviors and inspiring others in the team to do likewise<\/li><li>Take ownership in the career development needs and champion the professional development of consultants in the team<\/li><li>Champion change management efforts for strengthening Mercer\\u2019s overall business and financial performance<br><br><\/li><\/ul><em>Marsh McLennan is committed to embracing a diverse, inclusive and flexible work environment. We aim to attract and retain the best people regardless of their sex\/gender, marital or parental status, ethnic origin, nationality, age, background, disability, sexual orientation, and gender identity. <br><br><\/em><strong>About Mercer<br><br><\/strong>Mercer believes in building brighter futures by redefining the world of work, reshaping retirement and investment outcomes, and unlocking real health and well-being. Mercer\\u2019s more than 25,000 employees are based in 44 countries and the firm operates in over 130 countries. Mercer is a business of Marsh McLennan (NYSE: MMC), the world\\u2019s leading professional services firm in the areas of risk, strategy and people, with 76,000 colleagues and annual revenue of $17 billion. Through its market-leading businesses including Marsh, Guy Carpenter and Oliver Wyman, Marsh &amp; McLennan helps clients navigate an increasingly dynamic and complex environment. For more information, visit https:\/\/www.mercer.com\/. Follow Mercer on Twitter @Mercer.<br><br><strong> R_133521<\/strong>\"}"
}