{
    "id":"Kaggle::techmap::61323438211d1204c764a02a::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"A good level of physical fitness as a role requires a mixture of lifting, standing for extended periods, bending, and squatting.\" this lacks clarity and could therefore discourage many who are actually capable of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"Competitive hourly pay rate depending upon experience\" - the lack of clarity regarding pay has been shown to decrease diversity in the candidate pool.",
    "verified":true,
    "synthetic":false,
    "text":" The Company. Our client is a Hamilton-based company with 15 years plus experience in the industry. They specialize in stainless steel, carbon steel, fabrication for civil construction and building companies. Due to continued growth, they are now seeking an experienced Fabricator who is very reliable, has a great work ethic, happy to help the team whenever needed. As the Welder your responsibilities will include: Fabrication and welding of carbon steels, stainless steels, aluminum and other materials. Installation of fabricated products at any given location as reasonably requested by the employer. Maintaining high Health and Safety standards in line with the company H&S manual and policies. Maintaining high-quality assurance standards. Repairs to various equipment at any given location as reasonably requested by the employer. Site measuring, interpretation of engineer\/job drawings, and plans as required. Liaising with contractors on-site to ensure completion of project installation to standards required by the client. Assisting in the training of apprentices. Fabrication of equipment for the company to increase company assets. Servicing company equipment at regular intervals. Skills & Experience. Must have a minimum of 5 years of experience in a similar role. Must be Trade qualified. Previous experience in stainless and mild steel and is essential. Be competent TIG, MIG & all positional welding, able to pass weld tickets & regular project testing. Have excellent written and verbal communication skills. can deal with clients! Be able to prioritise and have well-developed time management skills. A good level of physical fitness as a role requires a mixture of lifting, standing for extended periods, bending, and squatting. Current Clean Full Drivers License. Salary & working hours: This position is full time, with normal hours of operation 7:30 am to 4 pm Monday to Friday (Be able to do extra hours during busy periods). Competitive hourly pay rate depending upon experience with pay time and half anything over 8 hrs each day and dirty allowance if you work in a dirty environment. All applicants must be eligible to work in New Zealand. Does this sound like you? If so, click \"APPLY\" now and submit your CV outlining your relevant experience or call Arzoo Thakur for a confidential chat on 07 839 1750.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61323438211d1204c764a02a::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Drake New Zealand - Hamilton\", \"position\": \"Structural Steel Fabricator\/ Installer\", \"notes\": \"\", \"original\": \"<p><strong>The Company<\/strong><\/p><p>Our client is a Hamilton-based company with 15 years plus experience in the industry. They specialize in stainless steel, carbon steel, fabrication for civil construction and building companies. <\/p><p>Due to continued growth, they are now seeking an experienced Fabricator who is very reliable, has a great work ethic, happy to help the team whenever needed. <\/p><p><strong>As the <\/strong><strong>Welder your responsibilities will include:<\/strong><\/p><ul><li>Fabrication and welding of carbon steels, stainless steels, aluminum and other materials.<\/li><li>Installation of fabricated products at any given location as reasonably requested by the employer.<\/li><li>Maintaining high Health and Safety standards in line with the company H&amp;S manual and policies.<\/li><li>Maintaining high-quality assurance standards.<\/li><li>Repairs to various equipment at any given location as reasonably requested by the employer.<\/li><li>Site measuring, interpretation of engineer\/job drawings, and plans as required.<\/li><li>Liaising with contractors on-site to ensure completion of project installation to standards required by the client.<\/li><li>Assisting in the training of apprentices.<\/li><li>Fabrication of equipment for the company to increase company assets.<\/li><li>Servicing company equipment at regular intervals.<\/li><\/ul><p><strong>Skills &amp; Experience<\/strong><\/p><ul><li>Must have a minimum of 5 years of experience in a similar role.<\/li><li>Must be Trade qualified <\/li><li>Previous experience in stainless and mild steel and is essential. <\/li><li>Be competent TIG, MIG &amp; all positional welding, able to pass weld tickets &amp; regular project testing.<\/li><li>Have excellent written and verbal communication skills - can deal with clients! <\/li><li>Be able to prioritise and have well-developed time management skills.<\/li><li>A good level of physical fitness as a role requires a mixture of lifting, standing for extended periods, bending, and squatting.<\/li><li>Current Clean Full Drivers License.<\/li><\/ul><p><strong>Salary &amp; working hours:<\/strong><\/p><p>This position is full time, with normal hours of operation 7:30 am to 4 pm Monday to Friday (Be able to do extra hours during busy periods)<\/p><p>Competitive hourly pay rate depending upon experience with pay time and half anything over 8 hrs each day and dirty allowance if you work in a dirty environment.<\/p><p><strong>All applicants must be eligible to work in New Zealand.<\/strong><\/p><p>Does this sound like you? If so, click <strong>\\\"APPLY\\\"<\/strong> now and submit your CV outlining your relevant experience or call<strong> Arzoo Thakur<\/strong> for a confidential chat on <strong>07 839 1750<\/strong><\/p>\"}"
}