{
    "id":"Kaggle::techmap::61516390d43e303ff8b164f8::aarp_us::11",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Do you have an active CPhT & AZ State Board of Pharmacy license? Are you looking for a hands-on, high growth position working in a closed-door non-retail environment? If so, this might be the Purr-fect role for you! Join Chewy as a Pharmacy Technician and launch your career with America s #1 Pet Pharmacy. BONUS now through October 2nd, 2021, you ll receive an additional $2. 00 per hour incentive for day shifts and $3. 00 per hour incentive for night shifts. Why you ll love working here: Safety, Health, and Culture are top priorities at Chewy Pharmacy with all our roles and locations. We offer the following benefits for our team members: Starting wages from $17. 00 - $18. 50 per hour. Competitive wages, with opportunity for increases starting after 3-months of service. Start immediately with day or night shifts. State of the art, climate-controlled environment. Employee 20% Discount Program at Chewy for all your pet needs. Team building events and company-sponsored luncheons. Career growth and promotion opportunities. Competitive benefits including paid time off and company matched 401K. What you ll do: Maintain a safe and clean pharmacy by complying with procedures, rules, and regulations. Receive and count inbound freight, and store in assigned locations. Utilize computers to research customer orders and information. Package customer orders for shipment and transport\/load onto carrier vehicles. Complete inventory cycle counts to verify inventory accuracy. Replenish Pharmacy inventory and non-inventory supplies. Assist Pharmacists in medication dispensary tasks as needed. Participate in additional special projects and perform additional tasks as assigned. What you'll need: Must have an active National Pharmacist Tech Certification (PTCB). Be at least 18 years old. Maintain a positive attitude in team and safety-oriented environment. The desire to take great pride and care in every order you fill for our pet parents (customers). Ability to stand for extending periods of time, walking up to 2 miles per shift and lift 10 pounds either with or without reasonable accommodations. Great attention to detail when filling pharmacy orders. Basic computer skills. Chewy is committed to equal opportunity. We value and embrace diversity and inclusion of all Team Members.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61516390d43e303ff8b164f8::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Chewy\", \"position\": \"Certified Pharmacy Technician Night Shift\", \"notes\": \"\", \"original\": \"<p>Do you have an active<strong> CPhT &amp; AZ State Board of Pharmacy license<\/strong><strong>? <\/strong>Are you looking for a hands-on, high growth position working in a closed-door non-retail environment? If so, this might be the Purr-fect role for you!  Join Chewy as a Pharmacy Technician and launch your career with America s #1 Pet Pharmacy.<\/p><p><strong>BONUS now through October 2nd, 2021, you ll receive an additional $2.00 per hour incentive for day shifts and $3.00 per hour incentive for night shifts. <\/strong><\/p><p><strong><u>Why you ll love working here:<\/u><\/strong><\/p><p>Safety, Health, and Culture are top priorities at Chewy Pharmacy with all our roles and locations. We offer the following benefits for our team members:<\/p><ul><li>Starting wages from $17.00 - $18.50 per hour<\/li><li>Competitive wages, with opportunity for increases starting after 3-months of service.<\/li><li>Start immediately with day or night shifts<\/li><li>State of the art, climate-controlled environment<\/li><li>Employee 20% Discount Program at Chewy for all your pet needs<\/li><li>Team building events and company-sponsored luncheons<\/li><li>Career growth and promotion opportunities<\/li><li>Competitive benefits including paid time off and company matched 401K<\/li><\/ul><p><strong><u>What you ll do:<\/u><\/strong><\/p><ul><li>Maintain a safe and clean pharmacy by complying with procedures, rules, and regulations<\/li><li>Receive and count inbound freight, and store in assigned locations<\/li><li>Utilize computers to research customer orders and information<\/li><li>Accurately fill customer orders including selection of correct medication, counting medication quantity, and labeling vials\/packaging<\/li><li>Package customer orders for shipment and transport\/load onto carrier vehicles<\/li><li>Complete inventory cycle counts to verify inventory accuracy<\/li><li>Replenish Pharmacy inventory and non-inventory supplies<\/li><li>Assist Pharmacists in medication dispensary tasks as needed<\/li><li>Participate in additional special projects and perform additional tasks as assigned<\/li><\/ul><p><strong><u>What you'll need:<\/u><\/strong><\/p><ul><li>Must have an active National Pharmacist Tech Certification (PTCB)<\/li><li>Be at least 18 years old.<\/li><li>Maintain a positive attitude in team and safety-oriented environment<\/li><li>The desire to take great pride and care in every order you fill for our pet parents (customers).<\/li><li>Ability to stand for extending periods of time, walking up to 2 miles per shift and lift 10 pounds either with or without reasonable accommodations<\/li><li>Great attention to detail when filling pharmacy orders<\/li><li>Basic computer skills<\/li><\/ul><div>Chewy is committed to equal opportunity. We value and embrace diversity and inclusion of all Team Members.<p> <\/p>If you have a disability under the Americans with Disabilities Act or similar law, or you require a religious accommodation, and you wish to discuss potential accommodations related to applying for employment at Chewy, please contact HR at chewy dot com<u><\/u><p> <\/p>To access Chewy s Privacy Policy, which contains information regarding information collected from job applicants and how we use it, please click here: ).<\/div><br \/>\"}"
}