{
    "id":"Kaggle::techmap::614acd74f5bd0f6a1df606c7::indeed_de::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Based on the mobility agreement and meeting the needs of the Air Force. Must be willing to provide information that you are a U. S. citizen. Incumbent must satisfactorily complete corporate training and remain in compliance as required by brand or franchise standards. Mus be able to work other than normal duty hours which may include evenings, weekends, and\/or holidays. Qualifications. Who May Apply: Open to everyone. Applicants will be categorized by preference(s) and\/or priority consideration eligibilities. An applicant's eligibility will be determined based on eligibility claimed in the questionnaire and proof of eligibility MUST be provided with application by the closing date, 09\/30\/2021. Business Based Action, Family Member Preference, Military Spouse Preference, Outside Applicant Veteran, and Transition Hiring Preference. In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e. g., Peace Corps, AmeriCorps) and other organizations (e. g., professional. Philanthropic. Religious. Spiritual. Community. Student. Social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience. If the position allows for qualifying based on education, your transcripts will be required as part of your application. Qualifying Experience: GENERAL EXPERIENCE: Must have experience that shows progressively responsible administrative, professional, technical or other work which has provided a general knowledge of management principles and practices,. OR progressively responsible experience in the functions managed by a manager of a full service restaurant. SPECIALIZED EXPERIENCE: In addition to general experience, applicant must have specialized experience gained in the operation or management of a government, institutional or civilian restaurant. PREFERRED EXPERIENCE: Experience working in a management role with a name brand casual dining restaurant is preferred. Professional certification and\/or accreditation in hospitality professional management areas is highly desirable. Must be able to work an irregular tour of duty, to include weekends, nights, and holidays. Incumbent is required to be mobile and sign the Air Force Mobility Agreement. Must satisfactorily complete a Tier 1 background investigation. Incumbent must satisfactorily complete corporate training and. Education Some federal jobs allow you to substitute your education for the required experience in order to qualify. This position does not allow for education substitution. Additional information. Individual must fully meet qualification\/eligibility\/background requirements for this position.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614acd74f5bd0f6a1df606c7::indeed_de\", \"source\": \"indeed_de\", \"country\": \"DE\", \"company\": \"U.S. Air Forces, Europe\", \"position\": \"General Manager\", \"notes\": \"\", \"original\": \"<div><div><h2 class=\\\"jobSectionHeader\\\"><b>Duties<\/b><\/h2>\\n<h3 class=\\\"jobSectionHeader\\\"><b>Summary<\/b><\/h3><br>\\n<div><p><br>\\n<b>About the position:<\/b><br>\\nThis position will be assigned to Ramstein AB, Germany .<br>\\nThis is a Regular Full Time (RFT) position with benefits (medical, dental, life insurance, retirement, 401(k), and annual\/sick leave.<\/p><br>\\n<\/div><h3 class=\\\"jobSectionHeader\\\"><b>Responsibilities<\/b><\/h3>\\n<p><\/p><div><div><div><div><div>Responsible for the economic and efficient management of the franchise restaurant. Ensures all food and beverages meet Air Force (AF) and franchise standards in taste, temperature, freshness, and appearance while adhering to AF and franchise programs and policies. Effectively supervises managers, staff, and oversees recruitment and training of all personnel. Keep team members current on ongoing\/upcoming promotions, business trends, and safety issues. Ensures adherence to all health and safety standards. Estimates food and beverage costs and ensures costs are maintained within established parameters. Purchases and maintains supplies, equipment, food and beverages at a level that meets current business trends and minimizes waste. Establishes financial goals, prepares budgets, analyzes financial results, maintains solid financial condition, and keeps expenditures within budgetary limits. Implements higher-level directives, franchise requirements and contract specifications. Formulates procedures and programs to ensure high standards of food and beverage operations consistent with AF and franchise expectations. Strict adherence to policies in customer service. Manages real property resources and provides expert advice on renovations, improvements, and any required construction in compliance with AF and franchise standards. Investigates and resolves food and beverage quality and service complaints. Implements, monitors, reviews, and evaluates menu items, food production, and food service.\\n<\/div><\/div><br>\\n<div><div>Develops and implements marketing strategies and special events to maintain market share and grow customer base. Establishes and monitors a cleaning and preventative maintenance program for facilities, equipment and vehicles. Establishes an internal performance management system to ensure proper assignments and reviews evaluation of employee performance. Administers internal control system to preclude or minimize the potential for fraud, waste, and abuse. Arranges for equipment repairs and other services as required. Complies with EEO concepts and security directives, and maintains an appropriate work environment. Communicates ideas, contributions, trends and occurrences to other subordinate supervisors, other franchise locations and HQ AFSVA.\\n<\/div><\/div><br>\\n<\/div><\/div><\/div><p><\/p><div><h3 class=\\\"jobSectionHeader\\\"><b>Travel Required<\/b><\/h3>\\n<p>Occasional travel - You may be expected to travel for this position.<\/p>\\n<\/div><div><div><h5 class=\\\"jobSectionHeader\\\"><b>Supervisory status\\n<\/b><\/h5><p>Yes\\n<\/p><\/div><div><h5 class=\\\"jobSectionHeader\\\"><b>Promotion Potential\\n<\/b><\/h5><p>None\\n<\/p><\/div><\/div><\/div><ul><li><div><h4 class=\\\"jobSectionHeader\\\"><b>Job family (Series)<\/b><\/h4>\\n<p>1101 General Business And Industry\\n<\/p><\/div><\/li><\/ul><ul><li><p>Requirements\\n<\/p><div>\\n<h2 class=\\\"jobSectionHeader\\\"><b>Requirements<\/b><\/h2>\\n<h3 class=\\\"jobSectionHeader\\\"><b>Conditions of Employment<\/b><\/h3>\\n<ul><li>This position requires the incumbent to complete a background investigation with favorable results.<\/li>\\n<li>Must sign the Air Force Mobility agreement form that is required.<\/li>\\n<li>Based on the mobility agreement and meeting the needs of the Air Force. Must be willing to provide information that you are a U.S. citizen.<\/li>\\n<li>Incumbent must satisfactorily complete corporate training and remain in compliance as required by brand or franchise standards.<\/li>\\n<li>Mus be able to work other than normal duty hours which may include evenings, weekends, and\/or holidays.<\/li>\\n<\/ul><div><h3 class=\\\"jobSectionHeader\\\"><b>Qualifications<\/b><\/h3>\\n<div><b>Who May Apply: Open to everyone. Applicants will be categorized by preference(s) and\/or priority consideration eligibilities. An applicant's eligibility will be determined based on eligibility claimed in the questionnaire and proof of eligibility MUST be provided with application by the closing date, <\/b>09\/30\/2021<br>\\n<br>\\nBusiness Based Action, Family Member Preference, Military Spouse Preference, Outside Applicant Veteran, and Transition Hiring Preference<br>\\n<br>\\nIn order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if the position allows for qualifying based on education, your transcripts will be required as part of your application.<br>\\n<br>\\n<b>Qualifying Experience:<\/b><br>\\n<br>\\n<div><div><div><div>GENERAL EXPERIENCE: Must have experience that shows progressively responsible administrative, professional, technical or other work which has provided a general knowledge of management principles and practices,<br>\\nOR progressively responsible experience in the functions managed by a manager of a full service restaurant.\\n<br>\\n<br>\\nSPECIALIZED EXPERIENCE: In addition to general experience, applicant must have specialized experience gained in the operation or management of a government, institutional or civilian restaurant.\\n<br>\\n<br>\\nPREFERRED EXPERIENCE: Experience working in a management role with a name brand casual dining restaurant is preferred. Professional certification and\/or accreditation in hospitality professional management areas is highly desirable.\\n<br>\\nMust be able to work an irregular tour of duty, to include weekends, nights, and holidays. Incumbent is required to be mobile and sign the Air Force Mobility Agreement. Must satisfactorily complete a Tier 1 background investigation. Incumbent must satisfactorily complete corporate training and\\n<\/div><\/div><br>\\n<\/div><\/div><\/div><\/div><div><h3 class=\\\"jobSectionHeader\\\"><b>Education<\/b><\/h3>\\n<p>Some federal jobs allow you to substitute your education for the required experience in order to qualify. This position does not allow for education substitution.<br>\\n<\/p><\/div><div><h3 class=\\\"jobSectionHeader\\\"><b>Additional information<\/b><\/h3>\\n<p><\/p><div><ul><li>Individual must fully meet qualification\/eligibility\/background requirements for this position<\/li>\\n<li>Male applicants born after December 31, 1959 must be registered for Selective Service<\/li>\\n<li>Direct deposit is required<\/li>\\n<li>Satisfactorily complete an employment verification (E-Verify) check<\/li>\\n<li>A probationary period may be required<\/li>\\n<li>Pre-employment requirements must be satisfactorily met prior to Entrance on Duty (EOD)<\/li>\\n<li>Multiple positions may be filled from this job opportunity announcement. And additional selections may also be made from this job opportunity announcement.<\/li>\\n<li>Selection(s) are subject to restrictions resulting from hiring preferences and priority consideration eligible.<\/li><\/ul><br>\\n<p><\/p>\\n<\/div>\\n<\/div><div><h3 class=\\\"jobSectionHeader\\\"><b>How You Will Be Evaluated<\/b><\/h3>\\n<div><p>You will be evaluated for this job based on how well you meet the qualifications above.<\/p>\\n<p>Your resume and supporting document will be evaluated against the qualifications of the position.<br>\\n<br>\\nOnce the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your resume and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your resume and\/or supporting documentation, a determination has been made that you have inflated your responses to meet the position's qualifications and\/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility.<br>\\n<br>\\nYou should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation.<br>\\n<br>\\nTo better expedite the hiring process, we recommend including full contact information (name, address, phone number, email, etc.,) for professional and personal references on your resume.<br>\\n<\/p><\/div><p><\/p>\\n<div><h3 class=\\\"jobSectionHeader\\\"><b>Background checks and security clearance<\/b><\/h3>\\n<div><div><h5 class=\\\"jobSectionHeader\\\"><b>Security clearance<\/b><\/h5>\\n<p>Not Required\\n<\/p><\/div><div><h5 class=\\\"jobSectionHeader\\\"><b>Drug test required<\/b><\/h5>\\n<p>No\\n<\/p><\/div><\/div><div><div><h5 class=\\\"jobSectionHeader\\\"><b>Position sensitivity and risk<\/b><\/h5>\\n<p>Non-sensitive (NS)\/Low Risk\\n<\/p><\/div><div><h5 class=\\\"jobSectionHeader\\\"><b>Trust determination process<\/b><\/h5>\\n<p>Suitability\/Fitness\\n<\/p><\/div><\/div><\/div><\/div><\/div><\/li><\/ul><ul><li><p>Required Documents\\n<\/p><div>\\n<h2 class=\\\"jobSectionHeader\\\"><b>Required Documents<\/b><\/h2>\\n<div><p>Required documents may vary based on the eligibility you are claiming (i.e., applying as a Military Spouse Preference - MSP, applying as a veteran, applying as a current federal employees, applying as a displaced employee, etc.,). The below document(s) are required and<b> MUST<\/b> be submitted with your application by the closing date of this job announcement:<br>\\n<\/p><ul><li>Resume<\/li><\/ul><br>\\n<br>\\nYour resume may be submitted in any format and must support identified the general or specialized experience described in this announcement.<br>\\nIf your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy.<br>\\n<br>\\n<b>Other accepted documents to support a qualification and\/or claimed preference\/priority eligibility may include:<\/b><br>\\n<br>\\n<ul><li>Cover Letter<\/li><li>\\nDD-214\/ Statement of Service<\/li><li>\\nDiploma\/ GED<\/li><li>\\nDisability Letter (VA)<\/li><li>\\nLicense<\/li><li>\\nOther (1)<\/li><li>\\nOther (2)<\/li><li>\\nPCS Orders<\/li><li>\\nProfessional Certification<\/li><li>\\nProof of Marriage Status<\/li><li>\\nResume<\/li><li>\\nSeparation Notice (RIF)<\/li><li>\\nSF-50\/ Notification of Personnel Action<\/li><li>\\nTranscript<\/li><\/ul><br>\\n<br>\\nAs described above, your <b>complete<\/b> application includes your resume, your responses to the online questionnaire, and supporting documents which prove your claimed eligibility. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further.<br>\\n<br>\\nNOTE: Documents submitted as part of the application package to include supplemental documents may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.\\n<\/div><\/div><\/li><\/ul><p><\/p><ul><li><p>Benefits\\n<\/p><div>\\n<h2 class=\\\"jobSectionHeader\\\"><b>Benefits<\/b><\/h2>\\n<p><\/p><div><p>Review our benefits<\/p><\/div><\/div><\/li><\/ul><\/div><p><\/p>\\n<br><div>Help\\n<h3 class=\\\"jobSectionHeader\\\"><b>This job is open to<\/b><\/h3>\\n<div><\/div><ul><li><div><h4 class=\\\"jobSectionHeader\\\"><b>Veterans\\n<\/b><\/h4><\/div><\/li><\/ul><p><\/p><div><h4 class=\\\"jobSectionHeader\\\"><b>Clarification from the agency<\/b><\/h4>\\n<p>Please see the \\\"Who May Apply\\\" section under the Qualifications section.<\/p><\/div><\/div>\"}"
}