{
    "id":"Kaggle::techmap::615605dda6740c534abbf427::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" responsible for making recommendations on the purchase of investigative aids and safety-related equipment. participates in, and contributes to, security-related projects and exercises (Emergency Management\/Lockdown, Life Safety, and Vehicular Traffic and Parking Operations). completes additional duties as assigned by supervisors. QUALIFICATIONS. successful completion of a law and security program at the college level or completion of a police recruit training course. security enforcement and investigation experience (comparable training and experience will also be considered). must possess a security guard license issued under the Private Security and Investigative Services Act. exemplary written and verbal communication skills. excellent judgement and decision-making skills. good working knowledge of current security technologies. ability to identify emergency situations and manage them accordingly. class G drivers license is required. Follow all Covid-19 policies and procedures and complete all required training. EFFORT. job involves considerable travel around campus, including driving, walking, and climbing stairs. some lifting and carrying is required. lengthy periods of time are spent directing traffic. WORKING CONDITIONS. hours are part-time (normal 12 hour shifts involve days, nights, weekends, and evenings). job often involves working alone and in dark areas. seasonal temperature extremes are to be expected. occasionally situations arise where physical and\/or verbal aggression is present. OUR OFFER. Ridley College offers a positive and inclusive workplace community with a competitive compensation package. Innovative, challenging and rewarding opportunities. A learning environment that promotes professional development and personal growth. Active community involvement. And, a beautiful campus setting in the heart of Niagara that engages and inspires our employees to flourish. HOW TO APPLY. Qualified applicants are encouraged to upload their resume in the fields on the right side of this page. Deadline for applications is: October 8, 2021. As a condition of employment, a satisfactory Vulnerable Persons Screening Report must be provided. While all applicants are thanked for their interest, only those chosen for interviews will be contacted. Ridley College is committed to fostering an inclusive, accessible and equitable environment where everyone feels respected, valued and supported. Accommodations are available for applicants with disabilities throughout the recruitment process. If you are selected to participate in the recruitment process, please inform Human Resources of the nature of any accommodation(s) that you may require in respect of any materials or processes used in order to ensure your equal participation. We inspire flourishing lives to transform our globe.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615605dda6740c534abbf427::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Ridley College\", \"position\": \"Security Guard\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Position Title: Part-time Security Guard<\/p> <p>THE RIDLEY DIFFERENCE<\/p> <p>Founded in 1889, Ridley College is a co-educational boarding and day school with over 700 students in JK to grade 12 from more than 50 countries worldwide.&nbsp; The Ridley experience integrates a traditional liberal arts education with individual learning enhanced by the principles of positive psychology, the International Baccalaureate continuum program, a learner-driven culture and campus community, exceptional athletics and dynamic arts programs, and a commitment of service to others.&nbsp; This unique combination prepares meaningful and flourishing lives by teaching the habits of mind, body and spirit, and the values needed to lead in a global society.&nbsp;<\/p> <p>Ridley College is located on 90 acres in St. Catharines, Ontario in the heart of the Niagara Peninsula and is comprised of a stunning blend of century old buildings housing modernized technology.<\/p> <p>OUR TEAM<\/p> <p>Ridley offers the prospect of being part of a high-performance team in a nourishing workplace community that encourages collaboration, innovation, inclusivity and curious minds, and where grit and perseverance are assets.&nbsp; Joining the team at Ridley means you are committed to life-long learning and development, have integrity, and value being of service in a richly diverse community.&nbsp; We cultivate the full potential in each of our students by having a caring, committed and world-class team.&nbsp; Attracting, developing and retaining people who thrive in Ridley\\u2019s positive education culture that recognizes and celebrates individual strengths is critical to our success.<\/p> <p>&nbsp;<\/p> <p>RESPONSIBILITIES<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Regularly patrols the campus property and buildings;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ensures roadways are clear, and vehicles are properly parked;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; assists as a liaison with local law enforcement and partner agencies;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; responsible for apprising the Manager of Campus Safety and Security of any breach in security or safety issues;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; initiates work orders in relation to repairs or maintenance concerns;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; responsible for the preparation of written reports on his\/her activities, including notebooks, timesheets, vehicle logs, incident reports, and daily duty logs;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; preserves and prepares confidential material for the Manager of Campus Safety and Security;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; interacts with trespassers and visitors to the College, and calls for police assistance when necessary;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; responsible for advising various College employees on security matters and instructing them on appropriate responses to calls for assistance;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; performs lock-up procedures on campus as required;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; responsible to apprise himself\/herself of any authorized campus usage by outside groups;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; performs special event security functions and traffic management;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; responsible for making recommendations on the purchase of investigative aids and safety-related equipment;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; participates in, and contributes to, security-related projects and exercises (Emergency Management\/Lockdown, Life Safety, and Vehicular Traffic and Parking Operations);<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; completes additional duties as assigned by supervisors;<\/p> <p><br><\/p> <p>QUALIFICATIONS<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; successful completion of a law and security program at the college level or completion of a police recruit training course;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; security enforcement and investigation experience (comparable training and experience will also be considered);<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; must possess a security guard license issued under the Private Security and Investigative Services Act;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; exemplary written and verbal communication skills;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; excellent judgement and decision-making skills;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; good working knowledge of current security technologies;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ability to identify emergency situations and manage them accordingly;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; class G driver\\u2019s license is required;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Follow all Covid-19 policies and procedures and complete all required training;<\/p> <p>&nbsp;<\/p> <p>EFFORT<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; job involves considerable travel around campus, including driving, walking, and climbing stairs;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; some lifting and carrying is required;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; lengthy periods of time are spent directing traffic;<\/p> <p><br><\/p> <p>WORKING CONDITIONS<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; hours are part-time (normal 12 hour shifts involve days, nights, weekends, and evenings);<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; job often involves working alone and in dark areas;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; seasonal temperature extremes are to be expected;<\/p> <p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; occasionally situations arise where physical and\/or verbal aggression is present.<\/p> <p><a name=\\\"OLE_LINK5\\\"><\/a><a name=\\\"OLE_LINK6\\\">OUR OFFER<\/a><\/p> <p>Ridley College offers a positive and inclusive workplace community with a competitive compensation package; innovative, challenging and rewarding opportunities; a learning environment that promotes professional development and personal growth; active community involvement; and, a beautiful campus setting in the heart of Niagara that engages and inspires our employees to flourish.<\/p> <p>HOW TO APPLY<\/p> <p>Qualified applicants are encouraged to upload their resume in the fields on the right side of this page.&nbsp;<\/p> <p align=\\\"center\\\" style=\\\"margin:0cm 0cm 0cm;font-size:12pt;font-family:'calibri' , sans-serif;color:rgb( 0 , 0 , 0 );text-align:center\\\">&nbsp;<\/p> <p align=\\\"center\\\" style=\\\"margin:0cm 0cm 12pt;font-size:12pt;font-family:'calibri' , sans-serif;color:rgb( 0 , 0 , 0 );text-align:center\\\">Deadline for applications is: October 8, 2021<\/p> <p>As a condition of employment, a satisfactory Vulnerable Persons Screening Report must be provided. While all applicants are thanked for their interest, only those chosen for interviews will be contacted.<\/p> <p>Ridley College is committed to fostering an inclusive, accessible and equitable environment where everyone feels respected, valued and supported.&nbsp; Accommodations are available for applicants with disabilities throughout the recruitment process.&nbsp; If you are selected to participate in the recruitment process, please inform Human Resources of the nature of any accommodation(s) that you may require in respect of any materials or processes used in order to ensure your equal participation.<\/p> <p align=\\\"center\\\" style=\\\"margin:0cm;font-size:12pt;font-family:'calibri' , sans-serif;color:rgb( 0 , 0 , 0 );text-align:center\\\">\\u201cWe inspire flourishing lives to transform our globe.\\u201d<\/p> <\/div>\"}"
}