{
    "id":"Kaggle::techmap::6144a9e385e82a4e390417b2::linkedin_cn::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Basic Qualifications. years design\/implementation\/operations\/consulting experience with distributed applications. Experience managing large scale environments including escalations, incident, problem, and service availability. Demonstrated ability to adapt to new technologies and learn quickly. Customer-facing experience as a technical lead. Exceptional customer focus and bias for action. Candidates must have excellent oral and written communication skills. High level of comfort communicating effectively across internal and external organizations. Presentation skills. High degree of comfort with both large and small audiences. Bachelors degree or equivalent work experience required. Computer Science or Math background highly desired. Working knowledge of software development practices and technologies highly desired. Travel to client locations as needed (including Taiwan, China and other regions). Fluent in both Mandarin and English. Broad Experience Across Several Of The Following Areas. Linux system administration and troubleshooting (Windows experience is a plus. ) Network protocols and troubleshooting (Layer 4  Layer 7 knowledge is a must). Operations Management. Internet technologies including HTTP, SMTP, DNS, TLS\/SSL, SSH, VPN etc. Service Oriented Architecture. Databases administration, troubleshooting and performance tuning (relational and non-relational). Software design, development and deployment. Internet Content distribution network. Scripting \/ Automation. IT Security. Preferred Qualifications. years IT\/Technical Industry experience. Experience with AWS service offering. Passing AWS certifications is a plus. Experience working directly with Enterprise customers. Technical Program Management experience. Ability to manage multiple tasks and projects in a fast-moving environment. Strong written communication skills. This role will require the creation of content such as whitepapers and other written deliverables. Coding experience and knowledge of development methodologies in the internet industry. Developing or administration experience on Big Data\/Hadoop. Large scale and highly distributed environments. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. For individuals with disabilities who would like to request an interpreter or any support on-site, please inform our team. AWSGCR. Company. Amazon Connect Technology Serv. Job ID: A1607196.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144a9e385e82a4e390417b2::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"Amazon Web Services (AWS)\", \"position\": \"Technical Account Manager - Amazon Web Services\", \"notes\": \"\", \"original\": \"<strong><u>Description<br><br><\/u><\/strong>As an increasing number of large enterprises move their critical systems to the cloud, we are in need of high-powered technical leaders to help our largest customers navigate the operational challenges of cloud computing. You will work one-on-one with our top-tier customers, supporting the software development lifecycle for cloud services, operations management of active services, and business relationships with AWS.<br><br>In this role, you will have the opportunity to help shape and execute a strategy to build mindshare and broad use of Amazon Web Services within organizations ranging from new start-ups to large enterprise customers. You must possess customer-facing skills that enable you to represent AWS well within a customer\\u2019s environment and drive discussions with senior personnel regarding incidents, trade-offs, best practices, and risk management. You should also have a demonstrated ability to think strategically about business, product, and technical challenges as you help our customers take advantage of the efficiencies, cost savings and quick innovation available only in the cloud.<br><br>As a Technical Account Manager, you will be the primary operational point of contact for one or more customers, helping to plan, review, and oversee ongoing operations of business critical applications. You will leverage your broad experience, troubleshooting application, network, database, and architectural challenges using the suite of internal AWS tools as well as your existing knowledge and toolkits. You will work across customer organizations to ensure customers\\u2019 applications are well designed and scale to the needs of the world\\u2019s largest events e.g., the Super Bowl, the World Cup and the Olympics. In this role, you will also act as the voice of the customer within AWS to escalate problems and to drive prioritization of business needs for our customers.<br><br>Every day will bring new and exciting challenges on the job while you:<br><ul><li> Champion and advocate for Enterprise customers within Amazon Web Services (be their voice)<\/li><li> Solve technical issues and work directly with AWS engineers to ensure that customer issues are resolved as expediently as possible<\/li><li> Participate in deep architectural discussions to ensure solutions are designed for successful deployment in the cloud<\/li><li> Help Enterprise customers define IT and business processes that work well with cloud deployments<\/li><li> Engage with Director and C-Level executives to translate business needs into technical and operational plans<\/li><li> Provide detailed reviews of service disruptions, metrics, detailed prelaunch planning<\/li><li> Analyze and present operational reviews to customer leadership<br><br><\/li><\/ul><strong><u>Basic Qualifications<br><\/u><\/strong><ul><li> 9+ years design\/implementation\/operations\/consulting experience with distributed applications<\/li><li> Experience managing large scale environments including escalations, incident, problem, and service availability<\/li><li> Demonstrated ability to adapt to new technologies and learn quickly<\/li><li> Customer-facing experience as a technical lead<\/li><li> Exceptional customer focus and bias for action<\/li><li> Candidates must have excellent oral and written communication skills<\/li><li> High level of comfort communicating effectively across internal and external organizations<\/li><li> Presentation skills; high degree of comfort with both large and small audiences<\/li><li> Bachelor\\u2019s degree or equivalent work experience required; Computer Science or Math background highly desired; working knowledge of software development practices and technologies highly desired<\/li><li> Travel to client locations as needed (including Taiwan, China and other regions)<\/li><li> Fluent in both Mandarin and English<br><\/li><\/ul><strong><u>Broad Experience Across Several Of The Following Areas<br><\/u><\/strong><ul><li> Linux system administration and troubleshooting (Windows experience is a plus.)<\/li><li> Network protocols and troubleshooting (Layer 4 \\u2013 Layer 7 knowledge is a must)<\/li><li> Operations Management<\/li><li> Internet technologies including HTTP, SMTP, DNS, TLS\/SSL, SSH, VPN etc.<\/li><li> Service Oriented Architecture<\/li><li> Databases administration, troubleshooting and performance tuning (relational and non-relational)<\/li><li> Software design, development and deployment<\/li><li> Internet Content distribution network.<\/li><li> Scripting \/ Automation<\/li><li> IT Security<br><\/li><\/ul><strong><u>Preferred Qualifications<br><\/u><\/strong><ul><li> 12+ years IT\/Technical Industry experience<\/li><li> Experience with AWS service offering<\/li><li> Passing AWS certifications is a plus<\/li><li> Experience working directly with Enterprise customers<\/li><li> Technical Program Management experience<\/li><li> Ability to manage multiple tasks and projects in a fast-moving environment<\/li><li> Strong written communication skills; this role will require the creation of content such as whitepapers and other written deliverables<\/li><li> Coding experience and knowledge of development methodologies in the internet industry.<\/li><li> Developing or administration experience on Big Data\/Hadoop<\/li><li> Large scale and highly distributed environments<br><\/li><\/ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. For individuals with disabilities who would like to request an interpreter or any support on-site, please inform our team. #AWSGCR<br><br><br><strong>Company<\/strong> - Amazon Connect Technology Serv<br>Job ID: A1607196\"}"
}