{
    "id":"Kaggle::techmap::6155c4186b48ef70cfc42f6d::simplyhired_uk::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Phrases \"Persistent, tenacious . Relentless focus\", \"strategic thinker\" are masculine leaning phrases.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Initial 3 month contract. remote working. INSIDE IR35. Urgent start date. £500-£575 per day. This role is ‘Manager of DX Global Retail”: It’s core purpose is to make ready three (increasing) new Retail value opportunities. In order to do this the following personal attributes and skills are key. Persistent, tenacious. Relentless focus on most efficient route to globalise. Relationship builder and highly effective stakeholder manager. Agile and pragmatic. Strategic thinker that focuses on the value ahead. Brings the whole team with them. Sets the pace and drumbeat for progress. Excellent communicator. Structured meeting management. Background. Driving a local\/regional business opportunity into a global proposition -used to influencing all levels. 10 years Retail management experience. 5 years IT project management experience. Wide coverage of store operations systems such as POS, network, maintenance. Implemented changes in store formats and related technologies. Experience of managing suppliers. Brings together stakeholders\/ business units to deliver a value opportunity\/ sales growth. Typical Routines. Weekly Progress Report (1 pager) for each value opportunity in flight. Lead the Weekly Steering Group (Oversight Governance and Assurance). Value Opportunity Checkpoints (daily\/weekly as appropriate). Following up on next steps \/backlog. Thinking about blockers ahead and taking timely action to avoid\/overcome. Liaise with GRD\/GDC\/GPMO\/ Procurement\/ Legal and Commercial. Networking with key influencers in each of the value opportunities",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155c4186b48ef70cfc42f6d::simplyhired_uk\", \"source\": \"simplyhired_uk\", \"country\": \"UK\", \"company\": \"ECS Recruitment Group\", \"position\": \"Retail IT Project Manager\", \"notes\": \"\", \"original\": \"Initial 3 month contract - remote working\\n<br \/><br \/>\\nINSIDE IR35\\n<br \/><br \/>\\nUrgent start date\\n<br \/><br \/>\\n\\u00a3500-\\u00a3575 per day\\n<br \/><br \/>\\n<b>This role is \\u2018Manager of DX Global Retail\\u201d:<\/b> It\\u2019s core purpose is to make ready three (increasing) new Retail value opportunities\\n<br \/><br \/>\\nIn order to do this the following personal attributes and skills are key\\n<br \/><br \/>\\nPersistent, tenacious\\n<br \/>Relentless focus on most efficient route to globalise\\n<br \/>Relationship builder and highly effective stakeholder manager\\n<br \/>Agile and pragmatic\\n<br \/>Strategic thinker that focuses on the value ahead\\n<br \/>Brings the whole team with them\\n<br \/>Sets the pace and drumbeat for progress\\n<br \/>Excellent communicator\\n<br \/>Structured meeting management\\n<br \/><br \/>\\nBackground\\n<br \/><br \/>\\nDriving a local\/regional business opportunity into a global proposition -used to influencing all levels\\n<br \/>10 years Retail management experience\\n<br \/>5 years IT project management experience\\n<br \/>Wide coverage of store operations systems such as POS, network, maintenance\\n<br \/>Implemented changes in store formats and related technologies\\n<br \/>Experience of managing suppliers\\n<br \/>Brings together stakeholders\/ business units to deliver a value opportunity\/ sales growth\\n<br \/><br \/>\\nTypical Routines\\n<br \/><br \/>\\nWeekly Progress Report (1 pager) for each value opportunity in flight\\n<br \/>Lead the Weekly Steering Group (Oversight Governance and Assurance)\\n<br \/>Value Opportunity Checkpoints (daily\/weekly as appropriate)\\n<br \/>Following up on next steps \/backlog\\n<br \/>Thinking about blockers ahead and taking timely action to avoid\/overcome\\n<br \/>Liaise with GRD\/GDC\/GPMO\/ Procurement\/ Legal and Commercial\\n<br \/>Networking with key influencers in each of the value opportunities\"}"
}