{
    "id":"Kaggle::techmap::61489042cc64c607a3da4673::linkedin_za::1",
    "label_age":true,
    "analysis_age":"The phrase \"15 years of work experience leading multiple consulting assignments\" may introduce age bias by setting an unattainable standard for younger workers, thereby favouring older candidates with more years of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 15 years of work experience leading multiple consulting assignments in the Telco \/IT industry. Expert knowledge of the market, key players and overall requirements. Domain and practice expertise based on the need (e. g., BP, BR, PMO, data analytics) depending upon the role. Validated customer facing experience at the leadership level. Displaying the ability to generate sales leads and opportunities resulting in revenue growth. Being effectively engaged in a sales cycles and in sales-related activities (RFPs, RFIs). Experience leading an autonomous stream within a large program. May be involved in leading and overseeing resources in a matrix environment (matrix can contain one or more resources). Certifications: PMP, PMI preferred, Post Graduate optional. Why You Will Love This Job. You will be challenged to strategize, direct and build a high performance organization. Have the opportunity to use your forward-thinking and critical thinking to carry out regional responsibility or global responsibility based on your job. Coordinate driving penetration into the existing and new opportunities and accounts to grow the overall business. We offer a wide range of stellar benefits including health, dental, vision, and life insurance as well as paid time off, sick time, and parental leave! We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation. Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61489042cc64c607a3da4673::linkedin_za\", \"source\": \"linkedin_za\", \"country\": \"ZA\", \"company\": \"Amdocs\", \"position\": \"Consulting Principal Lead\", \"notes\": \"\", \"original\": \"<strong>Job ID:<\/strong> 119307<br><br><strong>Required Travel<\/strong> : Up to 25%<br><br><strong> Managerial - Yes <br><br><\/strong><strong>Location: South Africa- Johannesburg (Amdocs Site) <br><br><\/strong><strong><strong>Who are we?<br><br><\/strong><\/strong>At Amdocs, our purpose is to enrich lives and progress society. With our creativity and technology, we help make a better connected world. Amdocs and its 25,000 employees serve the leading players in the communications and media industry, enabling next-generation experiences in 85 countries. Our cloud-native, open and dynamic portfolio of digital solutions, platforms and services brings greater choice, faster time to market and flexibility, to better meet the evolving needs of our customers as they drive growth, transform and take their business to the cloud. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.1 billion in fiscal 2019. For more information, visit Amdocs at http:\/\/www.amdocs.com<br><br><strong><strong>In one sentence<br><br><\/strong><\/strong>Develops, leads and sets the direction for the regional execution plan for the Amdocs consulting line of business based on a deep understanding of the consulting marketplace, business needs, priorities and direction.<br><br><strong><strong>What will your job look like?<br><br><\/strong><\/strong><strong><u>You Will<br><\/u><\/strong><ul><li>Promote and coordinate the sales process within regional accounts, validating the accuracy and completeness of the sales pipeline; pre-sales and sales of discrete\/standalone ACS services\/offers; generate thought leadership and Points of View collaterals with marketing support.<\/li><li>Develop the regional annual AOP and update the forecast of the overall regional revenue and billable man-months. Support the CBEs, SDs and CPs in estimations and proposal development for ACS services alongside Amdocs products and other SBG sales activities.<\/li><li>Be matching supply and demand for consulting services, finding and developing the right resources with the right skillsets in the right locations for the projects that need to be executed and will lead all aspects of the consistent, successful execution of projects in the region.<\/li><li>Ensure compliance with the standardized ACS Delivery Model and estimating process. Support ad-hoc management initiatives (training solicitations, cost reduction efforts, etc) and, staffing\/recruitment efforts, and solving staffing disputes. Coordinate regional sales pipelines and resources (supply\/demand). Evaluate the qualitative and quantitative aspects of regional performance.<\/li><li>Work with the region's Account Leads and Engagement Leads in combination with staffing to review resource needs\/changes of the project and, raise concerns (if vital). Co-ordinate the harvesting of Knowledge Management assets for re-use and improved client service. Meet clients to ensure ACS is meeting expectations<br><\/li><\/ul><strong><strong>All you need is...<br><\/strong><\/strong><ul><li>15 years of work experience leading multiple consulting assignments in the Telco \/IT industry.<\/li><li>Expert knowledge of the market, key players and overall requirements.<\/li><li>Domain and practice expertise based on the need (e.g., BP, BR, PMO, data analytics) depending upon the role.<\/li><li>Validated customer facing experience at the leadership level.<\/li><li>Displaying the ability to generate sales leads and opportunities resulting in revenue growth; being effectively engaged in a sales cycles and in sales-related activities (RFPs, RFIs).<\/li><li>Experience leading an autonomous stream within a large program. May be involved in leading and overseeing resources in a matrix environment (matrix can contain one or more resources). Certifications: PMP, PMI preferred, Post Graduate optional<br><\/li><\/ul><strong><u>Why You Will Love This Job<br><\/u><\/strong><ul><li>You will be challenged to strategize, direct and build a high performance organization; have the opportunity to use your forward-thinking and critical thinking to carry out regional responsibility or global responsibility based on your job; coordinate driving penetration into the existing and new opportunities and accounts to grow the overall business.<\/li><li>We offer a wide range of stellar benefits including health, dental, vision, and life insurance as well as paid time off, sick time, and parental leave!<br><\/li><\/ul>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.<br><br><u><strong> Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce<\/strong><\/u>\"}"
}