{
    "id":"Kaggle::techmap::61444361a5224e6280f6b442::careerbuilder_us::1",
    "label_age":true,
    "analysis_age":"Preferring candidates with \"recent clinical experience with the geriatric population\" could potentially exclude younger nurses or those who have only recently returned to nursing and may not have recent experience with this age group.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Description. Employment Type:Full-time. Position Type: Non-Exempt. FTE: 1. 0. Schedule: Weekdays. 8 Hour Shifts. Campus: SCC-SM. Department: Resident Care. Sub: Administration PCS 6010. Interested in working for the Golden Isles' healthcare provider and employer of choice? Throughout the many locations that make up the Southeast Georgia Health System network, there is a common thread that pulls everything together: A team of committed professionals like you. These individuals appreciate the value of every person who walks through our doors, and are the key to our culture of Service Excellence. As a Registered Nurse\/Educator at our Senior Care Center - St. Marys, you will plan, organize, direct, implement and evaluate the facilities internal orientation program and staff education programs to ensure compliance with federal, state and local regulations. You will develop and maintain positive relationships with our patients, guests, other team members, and medical staff by striving for excellence in service and quality. For our team members, this is more than a career - it's a calling. You will be responsible for: Effectively managing the care of residents using knowledge, skills, judgment and decision making skills for the specific area. Effectively carries out nurse supervisory role when assigned. Deliver resident care utilizing guidelines of care and appropriate resources, including personnel, services, supplies and equipment. Review, evaluate and take appropriate action regarding results of diagnostic tests. Supervise and evaluate nursing conformance to facility policies, procedures and regulations. Perform and document a nursing assessment to identify and prioritize physical, psychosocial and cultural needs and develops a plan of care. Evaluate and reassess nursing interventions based on interdisciplinary plan of care and makes revisions as appropriate. Documentation meets compliance with regulatory standards. Plan, implement, direct and evaluate the educational\/orientation program in the facility based on resident needs and federal, state and local regulations. Identifies concerns and challenges related to resident care and facility operation. Provide the Administrator and Director of Nursing comprehensive recommendations concerning the educational needs of all staff. Job Requirements. What you will need:. Graduate of a Diploma, Associate's Degree or Bachelor's Degree Nursing Program. Current RN license to practice in the State of Georgia. •Recent clinical experience with the geriatric population preferred. Why choose Southeast Georgia Health System?..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61444361a5224e6280f6b442::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Southeast Georgia Health System\", \"position\": \"Registered Nurse Educator - Senior Care Center- St. Marys\", \"notes\": \"\", \"original\": \"<b>Job Description<\/b><br \/> <br \/>Employment Type:Full-time <br \/>Position Type: Non-Exempt <br \/>FTE: 1.0 <br \/>Schedule: Weekdays; 8 Hour Shifts <br \/>Campus: SCC-SM <br \/>Department: Resident Care <br \/>Sub: Administration PCS 6010<br \/><br \/>Interested in working for the Golden Isles' healthcare provider and employer of choice?<br \/><br \/>Throughout the many locations that make up the Southeast Georgia Health System network, there is a common thread that pulls everything together: A team of committed professionals like you. These individuals appreciate the value of every person who walks through our doors, and are the key to our culture of Service Excellence.<br \/><br \/>As a Registered Nurse\/Educator at our Senior Care Center - St. Marys, you will plan, organize, direct, implement and evaluate the facilities internal orientation program and staff education programs to ensure compliance with federal, state and local regulations. You will develop and maintain positive relationships with our patients, guests, other team members, and medical staff by striving for excellence in service and quality. For our team members, this is more than a career - it's a calling.<br \/><br \/>You will be responsible for:<br \/><ul><li>Effectively managing the care of residents using knowledge, skills, judgment and decision making skills for the specific area. Effectively carries out nurse supervisory role when assigned.<\/li><li>Deliver resident care utilizing guidelines of care and appropriate resources, including personnel, services, supplies and equipment.<\/li><li>Review, evaluate and take appropriate action regarding results of diagnostic tests.<\/li><li>Supervise and evaluate nursing conformance to facility policies, procedures and regulations.<\/li><li>Perform and document a nursing assessment to identify and prioritize physical, psychosocial and cultural needs and develops a plan of care.<\/li><li>Evaluate and reassess nursing interventions based on interdisciplinary plan of care and makes revisions as appropriate.<\/li><li>Develop and implement an education plan in collaboration with patient and family. Documentation meets compliance with regulatory standards.<\/li><li>Plan, implement, direct and evaluate the educational\/orientation program in the facility based on resident needs and federal, state and local regulations. <br \/>Identifies concerns and challenges related to resident care and facility operation.<\/li><li>Provide the Administrator and Director of Nursing comprehensive recommendations concerning the educational needs of all staff.<\/li><\/ul><br \/><br \/><b>Job Requirements<\/b><br \/> <br \/>What you will need:<br \/>\\u2022 Graduate of a Diploma, Associate's Degree or Bachelor's Degree Nursing Program<br \/><br \/>\\u2022 Current RN license to practice in the State of Georgia. <br \/><br \/>\\u2022Recent clinical experience with the geriatric population preferred.<br \/><br \/>Why choose Southeast Georgia Health System?<br \/>\\u2022 We are mission-focused to provide safe, quality, accessible, and cost-effective care to meet the health needs of the people and communities it serves<br \/>\\u2022 Our workplace is as pleasant and rewarding as the setting we enjoy outside of work -- imagine stepping out of your workspace and into a world of scenic beauty, outdoor recreational activities, mild winters, natural beaches, fine dining, and a full array of cultural and colonial historic attractions<br \/>\\u2022 The chance to work within a culture that is collegial yet professional, has exceptional career-advancement potential, and work\/life balance that is practically unparalleled<br \/>\\u2022 Our facility will allow you to use, sharpen, and add to your skills without having to commute to a large city environment<br \/>\\u2022 We offer competitive salaries and a comprehensive benefits package which includes generous Paid Time Off, tuition reimbursement, and wellness programs (including free 24\/7 access to an onsite gym). Sign-on and relocation bonuses are available for select positions. <br \/>\\u2022 The ability to be a part of the prestigious Coastal Community Health, a regional affiliation between Baptist Health, Flagler Hospital and Southeast Georgia Health System. This collaboration forms a highly-integrated hospital network focused on significant initiatives designed to enhance the quality and value of care provided to our contiguous communities<br \/><br \/>#SP# <br \/><br \/>[Email available when viewing the job]&nbsp;\"}"
}