{
    "id":"Kaggle::techmap::614e294bf4499e0e800ebd30::linkedin_lu::1",
    "label_age":true,
    "analysis_age":"The requirement for a \"minimum of 5 years of corporate, business and management experience\" and \"minimum of 2 years of Sustainability experience in a top management role in a large e-commerce, FMCG or similar company\" might disadvantage younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The statement \"WE ARE UNABLE TO PAY ANY SALARY OR FREELANCER FEES AT THIS TIME\" might exclude candidates from lower socio-economic backgrounds who cannot afford to work without compensation.",
    "verified":true,
    "synthetic":false,
    "text":" 1.25% could represent over 7.5 million EUR at the end of year 5 and this taken after an estimated 25% dilution from future investment rounds. We are ideally looking for someone who is motivated and who is able to put in at least 1 hour per day or rather 7 hours per week. for the interim until such time as we have launched our MVP and gained some traction. PLEASE NOTE - WE ARE UNABLE TO PAY ANY SALARY OR FREELANCER FEES AT THIS TIME AS WE PLAN TO USE THE MONEY THAT WE RECEIVED TO MARKET THE PRODUCT AND SCALE THE COMPANY. This is off course a temporary solution and by the time the company starts generating enough revenue to support its own operations, you could be rewarded with a full time position and a generous salary package. Position Requirements. Bachelor's or Master's degree in an environmental science field or related field required. Masters degree highly preferred. Professional certification preferred. Minimum 5. years of corporate, business and management experience required. Minimum of 2. years of Sustainability experience in a top management role in a large e-commerce, FMCG or similar company is required. Thorough and current knowledge of sustainability practices, and applicable laws and regulations. Ability to analyze and understand research and to identify relevant and valuable information. Position Responsibilities. Oversees the overall execution, mission, and efficacy of the sustainability program and department. Collaborates with appropriate departmental managers to facilitate performance evaluations that are timely and constructive. Proposes and implements strategies to address various environmental concerns including energy use, conservation, reduction of pollution, recycling, building and facility design, and general education on sustainability. Responsible for SaltyLama's environmental impact, resources and plans. Address the organizations approach to environmental responsibility with the goal to minimize the company's environmental impact. Assesses and analyzes company policies and processes to identify areas in and processes to which improvements can be made in accordance with the organizations commitment to sustainability. Drafts and implements sustainable organizational policies that address environmental concerns. Evaluates efficacy of sustainability programs. Recommends and implements improvements as necessary. Conducts research to identify environmental and sustainability concerns, interests, and issues. Deliverables for the team (End state model):. High level deliverables include: Building an all in one sustainability platform which includes the following elements:. Supplier Directory and Geo-location platform for localization. Online e. Commerce marketplace for sustainable and sustainably made products.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614e294bf4499e0e800ebd30::linkedin_lu\", \"source\": \"linkedin_lu\", \"country\": \"LU\", \"company\": \"SaltyLama\", \"position\": \"Chief Sustainability Officer (7 Hours per week exchange for equity)\", \"notes\": \"\", \"original\": \"<p><strong>Background:<\/strong><\/p><p><br><\/p><p>We are a team of 25 highly skilled individuals from multiple locations across the world and have secured initial funding from Investors.<\/p><p><br><\/p><p>Our team comprises of various current and former&nbsp;<strong>Senior employees, Directors and Executives<\/strong>&nbsp;from companies to the likes of&nbsp;<strong>Amazon, Vodafone, Nike, Apple, PwC, Baker McKenzie, Toyota, Maples, Goodyear and Procter &amp; Gamble<\/strong>&nbsp;among others.<\/p><p><br><\/p><p><strong>Our progress to date includes:<\/strong><\/p><p><br><\/p><ul><li>Developed final idea.<\/li><li>Incorporated Business in Luxembourg.<\/li><li>Completed Founder Institute Accelerator Program.<\/li><li>Partnered up with multiple Accelerators.<\/li><li>Recruited Co-Founders (97%).<\/li><li>Recruited team members.<\/li><li>Built prototype \/ wire-frames and development of MVP is underway.<\/li><li>Obtained Initial Funding and Government Grant is underway.<\/li><\/ul><p><br><\/p><p>We are looking for a proven, dynamic, <strong>Sustainability Executive<\/strong>&nbsp;to oversee SaltyLama's sustainability initiatives and implement across departments.&nbsp;This person will join our founding team as our&nbsp;<strong>Chief Sustainability Officer<\/strong>&nbsp;and will be responsible for leading the company\\u2019s Sustainability activities including assessing the on-boarding criteria for suppliers on the SaltyLama Platform, assessing SaltyLama's current and future product ranges for sustainability and impact, creating and calculating impact metrics as well as overseeing, improving and maintaining the companies stance on ESG.<\/p><p><br><\/p><p><strong>Our goal:<\/strong><\/p><p><br><\/p><p>Our business, due to the structure we have planned and of course if executed successfully, could have a value of over EUR 800 million in 5 years\\u2019 time.<\/p><p><br><\/p><p>We have received an amount of EUR 300,000 from an investor to execute the project and we are currently applying for a reimbursive grant from the Government covering 50% of our Research and Development Costs.<\/p><p><br><\/p><p>As a Chartered Accountant and serial entrepreneur, I know that in order to ensure the success of our operations we need to use this money wisely as it can vanish very quickly without having a proper product and without having anything left for marketing which will be our largest expense to scale our operations.<\/p><p><br><\/p><p>We therefore want to partner up with someone who shares our vision and who is willing to sacrifice short term interests for long term success. Someone who is at a stage in their life to create something that will change the world.<\/p><p><br><\/p><p><strong>Compensation for the Chief Sustainability Officer:<\/strong><\/p><p><br><\/p><p>You will form part of the founding team and will have the ability to earn&nbsp; up to 1.25% equity stake in the company.<\/p><p><br><\/p><p>1.25% could represent over 7.5 million EUR at the end of year 5 and this taken after an estimated 25% dilution from future investment rounds.<\/p><p><br><\/p><p>We are ideally looking for someone who is motivated and who is able to put in at least 1 hour per day or rather&nbsp;*7 hours per week*&nbsp;for the interim until such time as we have launched our MVP and gained some traction.<\/p><p><br><\/p><p><strong>**PLEASE NOTE - WE ARE UNABLE TO PAY ANY SALARY OR FREELANCER FEES AT THIS TIME AS WE PLAN TO USE THE MONEY THAT WE RECEIVED TO MARKET THE PRODUCT AND SCALE THE COMPANY.**<\/strong><\/p><p><br><\/p><p>This is off course a temporary solution and by the time the company starts generating enough revenue to support it\\u2019s own operations, you could be rewarded with a full time position and a generous salary package.<\/p><p><br><\/p><p><strong><u>Position Requirements<\/u><\/strong><\/p><p><br><\/p><ul><li>Bachelor's or Master's degree in an environmental science field or related field required; Masters degree highly preferred.<\/li><li>Professional certification preferred.<\/li><li>Minimum 5+ years of corporate, business and management experience required.<\/li><li>Minimum of 2+ years of Sustainability experience in a top management role in a large e-commerce, FMCG or similar company is required.<\/li><li>Thorough and current knowledge of sustainability practices, and applicable laws and regulations.<\/li><li>Ability to analyze and understand research and to identify relevant and valuable information.<\/li><\/ul><p><br><\/p><p><strong><u>Position Responsibilities<\/u><\/strong><\/p><p><br><\/p><ul><li>Oversees the overall execution, mission, and efficacy of the sustainability program and department.<\/li><li>Collaborates with appropriate departmental managers to facilitate performance evaluations that are timely and constructive.<\/li><li>Proposes and implements strategies to address various environmental concerns including energy use, conservation, reduction of pollution, recycling, building and facility design, and general education on sustainability.<\/li><li>Responsible for SaltyLama's environmental impact, resources and plans.<\/li><li>Address the organizations approach to environmental responsibility with the goal to minimize the company's environmental impact.<\/li><li>Assesses and analyzes company policies and processes to identify areas in and processes to which improvements can be made in accordance with the organizations commitment to sustainability.<\/li><li>Drafts and implements sustainable organizational policies that address environmental concerns.<\/li><li>Evaluates efficacy of sustainability programs; recommends and implements improvements as necessary.<\/li><li>Conducts research to identify environmental and sustainability concerns, interests, and issues.<\/li><\/ul><p>&nbsp;<\/p><p><strong>Deliverables for the team (End state model):<\/strong><\/p><p><br><\/p><p><strong>High level deliverables include:<\/strong><\/p><p>Building an all in one sustainability platform which includes the following elements:<\/p><p><br><\/p><ul><li>Supplier Directory and Geo-location platform for localization.<\/li><li>Online eCommerce marketplace for sustainable and sustainably made products.<\/li><li>Eco-verification methodology and certifications (Not ESG but similar methodology).<\/li><li>Social Network platform - Community of Eco-Conscious individuals, Experts, Start-up Founders and Investors.<\/li><li>3rd party integrations.<\/li><li>Crowdfunding platform for green initiatives.<\/li><\/ul><p><br><\/p><p><strong>To apply:<\/strong><\/p><p><br><\/p><p>Should you be interested, please ensure that you have all the necessary skills, capabilities, motivation, and time as well as sharing our vision to create a more sustainable world.<\/p><p><br><\/p><p>Apply to the position with your CV and state why you are suited for the job in a cover letter attached to your CV.<\/p><p><br><\/p><p>Once me and the team deems you as a suitable candidate, we will send you an NDA to sign and contact you for an interview and provide additional detail.<\/p><p><br><\/p><p><strong>Get ready, this is going to be massive!<\/strong><\/p>\"}"
}