{
    "id":"Kaggle::techmap::615956d61ae9f358441520ff::aarp_us::7",
    "label_age":true,
    "analysis_age":"The requirements to \"carry and lift up to 40 lbs. repeatedly\" and \"able to bend, stoop and stand for extended periods\" are not clearly linked to the specifics of the job, potentially leading to implicit bias against older applicants who might not meet these physical criteria, but are still capable of performing the duties effectively.",
    "label_disability":true,
    "analysis_disability":"The requirements to \"carry and lift up to 40 lbs. repeatedly\" and \"able to bend, stoop and stand for extended periods\" are not clearly linked to the specifics of the job, potentially leading to implicit bias against individuals with disabilities who might not meet these physical criteria, but are still capable of performing the duties effectively.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The necessity for access to an Android or iOS device, along with reliable transportation, could inadvertently exclude individuals from lower socioeconomic backgrounds who may not have these resources.",
    "verified":true,
    "synthetic":false,
    "text":"Overview Do you love retail, making money and also need flexibility and variety in your daily life? Being an Independent Contractor working with SFS, Inc. means enjoying a flexible environment. Most of the merchandising work performed for clients is set around a client’s window of time rather than specific hours, allowing you to set your own schedule. You choose when and how much work you want. As an Independent Contractor with SFS, Inc., you can service various products, conduct resets, product cut-ins, returns, POP placement and other general merchandising activities. We have available part-time, on-going work servicing a wide-variety of clients\/retailers for weekly, bi-weekly, and monthly visits. Qualifications Things you should know: Merchandising and\/or retail experience. Available weekday daytime hours. Able to read plan-o-grams. Able to carry and lift up to 40 lbs. repeatedly. Able to bend, stoop and stand for extended periods. Internet access with an active email address. Android or iOS smart phone and\/or tablet for wireless reporting. Report client work completions on the same day as service. Reliable transportation, some travel involved. SFS, Inc. is a leading supplier of field services to Fortune 1000 manufacturers and retailers in the U. S. We contract retail merchandising, auditing, installation and assembly projects in almost every zip code in the country, including Puerto Rico and the Virgin Islands. Our services are critical to sustaining the retail industry and our team of professionals are responsible for advancing it.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615956d61ae9f358441520ff::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"SFS, Inc\", \"position\": \"Retail Merchandiser\", \"notes\": \"\", \"original\": \"Overview\\n\\n\\n<div>\\n<div>\\n<div>\\n<p><strong><span>Do you love retail, making money and also need flexibility and variety in your daily life?<\/span><\/strong><\/p><p><span>Being an Independent Contractor working with SFS, Inc. means enjoying a flexible environment. Most of the merchandising work performed for clients is set around a client\\u2019s window of time rather than specific hours, allowing you to set your own schedule. You choose when and how much work you want.\\u00a0<\/span><\/p><p><span>As an Independent Contractor with SFS, Inc., you can service various products, conduct resets, product cut-ins, returns, POP placement and other general merchandising activities. We have available part-time, on-going work servicing a wide-variety of clients\/retailers for weekly, bi-weekly, and monthly visits.<\/span><\/p>\\n\\n<\/div>\\n<\/div>\\n<\/div>\\n\\n\\n\\nQualifications\\n\\n\\n<div>\\n<div>\\n<div>\\n<p><strong><span>Things you should know:<\/span><\/strong><\/p><ul><li><span>Merchandising and\/or retail experience<\/span><\/li><li><span>Available weekday daytime hours<\/span><\/li><li><span>Able to read plan-o-grams<\/span><\/li><li><span>Able to carry and lift up to 40 lbs. repeatedly<\/span><\/li><li><span>Able to bend, stoop and stand for extended periods<\/span><\/li><li><span>Internet access with an active email address<\/span><\/li><li><span>Android or iOS smart phone and\/or tablet for wireless reporting<\/span><\/li><li><span>Report client work completions on the same day as service<\/span><\/li><li><span>Reliable transportation, some travel involved<\/span><\/li><\/ul><p><span>SFS, Inc. is a leading supplier of field services to Fortune 1000 manufacturers and retailers in the U.S. We contract retail merchandising, auditing, installation and assembly projects in almost every zip code in the country, including Puerto Rico and the Virgin Islands. Our services are critical to sustaining the retail industry and our team of professionals are responsible for advancing it.<\/span><\/p>\\n\\n<\/div>\\n<\/div>\\n<\/div>\"}"
}