{
    "id":"Kaggle::techmap::6152b790e3ded90394b6942e::linkedin_lt::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The repeated emphasis on physical demands such as standing for extended periods, stooping, kneeling, lifting weights, and having \"good vision, including color differentiation\" without sufficiently detailed mention of reasonable accommodations can disadvantage candidates with physical disabilities who might be capable of performing the job with appropriate adjustments.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" This includes spoken, written, electronic, and presentation skills. Communication should be consistently constructive and professional. Must be a good team player. Decision Making and Problem Solving Skills. Ability to define problems, collect data, establish facts, and draw valid conclusions. Uses specialized knowledge to go beyond the routine to solve complex problems that frequently affect areas beyond own functional area. Must be able to approach unfamiliar situations, projects, and opportunities with confidence and curiosity. Qualifications. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and\/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform these functions. Must be at least 18 years or older. Requirements. The minimum requirements include the following but reasonable accommodations may be made as related to an employees religion, ethnicity, or disability. Requires availability during the hours necessary to open and close the store, which includes mornings, days, and nights,. Requires a minimum of 5 days of availability. Requires availability on weekends and holidays. Minimum standard of a 30 hour work week. Punctuality and regular attendance consistent with the companys policies are required for the position. Must have reliable transportation. Must speak English clearly in order to converse with customers and effectively supervise staff. Must be able to read and write English and perform business-related mathematics in order to carry out normal business and understand corporate sales reports. Physical Demands. Requires standing approximately five to 14 hours per day. During peak sale periods (e. g. Holiday, Back-to-School), will work for long periods throughout a one to 12 hour day. Requires stooping and kneeling to place merchandise on customers feet as well as reaching and pulling to obtain or stock merchandise on storage racks. May be required to climb ladder or ascend\/descend stairs in order to stock and\/or acquire merchandise for sale. Required to lift items weighing 5  25 lbs regularly. In certain circumstances, weights may be higher. Must have good vision, including color differentiation. The work environment for this position is a moderately noisy retail setting. Physical Demands  The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6152b790e3ded90394b6942e::linkedin_lt\", \"source\": \"linkedin_lt\", \"country\": \"LT\", \"company\": \"Finish Line\", \"position\": \"Store Management - Gurnee Mills Mall, Gurnee, IL\", \"notes\": \"\", \"original\": \"<strong><strong>Come work for us!<br><br><\/strong><\/strong>We are looking for dedicated employees to join our team to help our customers have the best experience possible every time they enter a JD Finish Line store.<br><br><strong><em>Our employees are key to our success.<br><br><\/em><\/strong><strong>Positions<\/strong>: Assistant Store Manager and Supervisor<br><br><strong><u>Summary<br><br><\/u><\/strong>Store Management positions (Assistant Store Managers and Supervisors) will support the Store Manager in all aspects of daily execution of customer service, sales, and development of personnel while staying true to the JD Finish Line brand while performing the following duties:<br><br><strong><u>Sample Responsibilities<br><\/u><\/strong><ul><li> Assists Store Management in all aspects of daily shift management, including customer relations, inventory control, stock room, till\/point of sale, procedural tasks and paperwork, visual merchandising, opening and closing the store. <\/li><li> Trains and coaches store associates to promote and execute team, store, and company performance. <\/li><li> Partners with management in planning, implementing, and executing change in regards to company initiatives in order to improve organizational performance. <\/li><li> Supervises shipments deliveries, transfers of merchandise, and POS in order to produce accurate inventory results. <\/li><li> Seeks to understand the customer\\u2019s needs and wants to benefit the overall customer experience. <\/li><li> Provides constructive feedback and facilitates conflict to ensure the growth and collaboration of team members. <\/li><li> Maintains both individual and shift sales. <\/li><li> Provides daily shift floor coverage. <\/li><li> Demonstrates sound understanding and judgment of store priorities. <\/li><li> Demonstrates a high business acumen including, but not limited to, an in depth knowledge of the store\\u2019s key performance indicators, inventory movement, and sales performance. <\/li><li> Embraces accountability and sets attainable goals for store sales, metrics, and personnel development. <\/li><li> Accountable for key decision making to influence change, sales, customer service. <\/li><li> Provides security &amp; loss prevention in store for accurate inventory and merchandise flow to minimize company shrink. <\/li><li> Upholds company policies, procedures, and standards regarding personal and store sales\/performance metrics. <\/li><li> Assists management with recruiting and interviewing potential employees. <\/li><li> Accountable for opening and closing store procedures to include cash reconciliation, banking, reporting, and security. <\/li><li> Adhere and uphold all company policies and procedures. <\/li><li> Additional duties and projects as required. <br><\/li><\/ul><strong><u>Required Education And\/or Experience<br><br><\/u><\/strong>High School Diploma or GED equivalent; 2+ years\\u2019 experience in retail leadership strongly preferred; or equivalent combination of education and experience.<br><br><strong><u>Required Computer And\/or Technical Skills<br><br><\/u><\/strong>Should have basic to intermediate knowledge and abilities with Microsoft Word, Excel, and PowerPoint.<br><br><strong><strong>Communication Skills<br><br><\/strong><\/strong>Must be an effective communicator with internal and external individuals at all levels. This includes spoken, written, electronic, and presentation skills. Communication should be consistently constructive and professional. Must be a good team player.<br><br><strong><strong>Decision Making and Problem Solving Skills<br><br><\/strong><\/strong>Ability to define problems, collect data, establish facts, and draw valid conclusions. Uses specialized knowledge to go beyond the routine to solve complex problems that frequently affect areas beyond own functional area. Must be able to approach unfamiliar situations, projects, and opportunities with confidence and curiosity.<br><br><strong><u>Qualifications<br><br><\/u><\/strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and\/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform these functions. Must be at least 18 years or older.<br><br><strong><u>Requirements<br><br><\/u><\/strong>The minimum requirements include the following but reasonable accommodations may be made as related to an employee\\u2019s religion, ethnicity, or disability<br><ul><li> Requires availability during the hours necessary to open and close the store, which includes mornings, days, and nights, <\/li><li> Requires a minimum of 5 days of availability. <\/li><li> Requires availability on weekends and holidays <\/li><li> Minimum standard of a 30 hour work week. <\/li><li> Punctuality and regular attendance consistent with the company\\u2019s policies are required for the position. <\/li><li> Must have reliable transportation <\/li><li> Must speak English clearly in order to converse with customers and effectively supervise staff. <\/li><li> Must be able to read and write English and perform business-related mathematics in order to carry out normal business and understand corporate sales reports. <br><\/li><\/ul><strong><u>Physical Demands<br><\/u><\/strong><ul><li>Requires standing approximately five to 14 hours per day.<\/li><li>During peak sale periods (e.g. Holiday, Back-to-School), will work for long periods throughout a one to 12 hour day.<\/li><li>Requires stooping and kneeling to place merchandise on customer\\u2019s feet as well as reaching and pulling to obtain or stock merchandise on storage racks.<\/li><li>May be required to climb ladder or ascend\/descend stairs in order to stock and\/or acquire merchandise for sale.<\/li><li>Required to lift items weighing 5 \\u2013 25 lbs regularly. In certain circumstances, weights may be higher. <\/li><li>Must have good vision, including color differentiation.<\/li><li>The work environment for this position is a moderately noisy retail setting.<br><\/li><\/ul><strong>Physical Demands \\u2013<\/strong> The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>The company reserves the right to modify this job description with or without notice. Employees may be asked to perform additional duties outside of normal job scope on a temporary basis per company policy.<br><br><strong><u>EEOC Statement<br><br><\/u><\/strong><strong><em>The Finish Line, Inc. is an Equal Opportunity Employer and is committed to complying with all federal, state, and local EEO laws. The Finish Line, Inc. prohibits discrimination against employees and applicants for employment based on the individual's race or color, religion or creed, national origin, alienage or citizenship status, marital status, sex, pregnancy status, age, military status, disability, or any other protected characteristic or class protected by law. The Finish Line, Inc. provides reasonable accommodation for disabilities in accordance with applicable laws.<br><br><\/em><\/strong><strong><strong>Need accessibility assistance to apply?<br><br><\/strong>Applicants who require accessibility assistance to submit an employment application can either call Finish Line at ( 317) 613-6890 or email us at talentacquisition@finishline.com. A member of our Talent Acquisition team will respond as soon as reasonably possible. ( <strong>This email address and phone number is only for individuals seeking accommodation when applying for a job.<\/strong> )<\/strong>\"}"
}