{
    "id":"Kaggle::techmap::614d43d8485c2703de232208::dice_us::12",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description General. Software Engineers build highly secure and scalable software to transform how businesses pay other businesses up and down their supply chain. We are blazing many new trails in this space and has found outstanding product-market fit. Our early success has generated many greenfield product opportunities ahead. As a Software Engineer, you'll contribute high-quality code to our products that are deployed via CICD to a modern stack. You'll build features used by internal and external customers to both modernize, optimize, and monetize payments. Our Product Development organization is made up of small teams of Software Engineers. Each team focuses on a specific aspect of our product: for example, you might be part of a team that builds a customer-facing front-end application, or a backend system that keeps track of complex money flows. We are remote-first and encourage movement among teams to share context, skills, and experience, so you'll learn about many different aspects of our products. If you are looking for a fast-paced startup that is experiencing hyper-growth and plenty more new tech to build, we believe Finexio may be right for you. Essential Responsibilities. Software Engineers are involved throughout the product life cycle, from idea generation, design, and prototyping to execution, and shipping. As a Software Engineer, you'll collaborate closely with technical and non-technical counterparts to understand our customers' problems and build products that solve them. We think the best way to understand what our users need is to meet them, so we encourage our team to get to know our customers directly. What we are looking for the most in a Software Engineer is that you can write clean, effective code and be able to learn new technologies and languages quickly. Our software is constantly evolving, so we need engineers who can do the same. Right now, we use: Python, Django, Node, Typescript, React. Industry-standard build tooling, including CircleCI and Github. Infrastructure-as-code deployed on AWS. Postgress, AWS Aurora. As an Engineer, you will be held directly accountable for delivering optimal and high quality code and meeting or exceeding committed timelines. Requirements: 10 years of demonstrated hands-on experience in software development and a minimum of 3 recent years utilizing technologies. You can expertly architect and build major new software systems.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d43d8485c2703de232208::dice_us\", \"source\": \"dice_us\", \"country\": \"US\", \"company\": \"Bright Water Consulting, LLC\", \"position\": \"Senior Software Engineer\", \"notes\": \"\", \"original\": \"<!DOCTYPE html><html><head><\/head><body><div class=&quot;job-preview-styles__description--2BkR3&quot; data-ui=&quot;job-description&quot;><strong>Description<\/strong><div><p><strong>General<\/strong><\/p><p>Software Engineers build highly secure and scalable software to transform how businesses pay other businesses up and down their supply chain. We are blazing many new trails in this space and has found outstanding product-market fit. Our early success has generated many greenfield product opportunities ahead.<\/p><p>As a Software Engineer, you'll contribute high-quality code to our products that are deployed via CICD to a modern stack. You'll build features used by internal and external customers to both modernize, optimize, and monetize payments.<\/p><p>Our Product Development organization is made up of small teams of Software Engineers. Each team focuses on a specific aspect of our product: for example, you might be part of a team that builds a customer-facing front-end application, or a backend system that keeps track of complex money flows. We are remote-first and encourage movement among teams to share context, skills, and experience, so you'll learn about many different aspects of our products.<\/p><p>If you are looking for a fast-paced startup that is experiencing hyper-growth and plenty more new tech to build, we believe Finexio may be right for you.<\/p><p>&nbsp;<\/p><p><strong>Essential Responsibilities<\/strong><\/p><p>Software Engineers are involved throughout the product life cycle, from idea generation, design, and prototyping to execution, and shipping. As a Software Engineer, you'll collaborate closely with technical and non-technical counterparts to understand our customers' problems and build products that solve them. We think the best way to understand what our users need is to meet them, so we encourage our team to get to know our customers directly.<\/p><p>What we are looking for the most in a Software Engineer is that you can write clean, effective code and be able to learn new technologies and languages quickly. Our software is constantly evolving, so we need engineers who can do the same. Right now, we use:<\/p><ul><li>Python, Django, Node, Typescript, React<\/li><li>Industry-standard build tooling, including CircleCI and Github<\/li><li>Infrastructure-as-code deployed on AWS<\/li><li>Postgress, AWS Aurora<\/li><\/ul><p>As an Engineer, you will be held directly accountable for delivering optimal and high quality code and meeting or exceeding committed timelines.<\/p><p><strong><span style=&quot;font-size: 14px;&quot;>Requirements:<\/span><\/strong><\/p><\/div><\/div><div class=&quot;job-preview-styles__requirements--2kg4_&quot; data-ui=&quot;job-requirements&quot;><div><ul><li>10 years of demonstrated hands-on experience in software development and a minimum of 3 recent years utilizing technologies<\/li><li>You can expertly architect and build major new software systems<\/li><li>Great code reviewing skills and you set a high standard for code quality and a low tolerance for technical dept<\/li><li>Skilled at working with key stakeholders to refine project requirements<\/li><li>Ability to break down complex projects into incremental development efforts<\/li><li>Working knowledge and experience developing backend unattended complex data processing jobs, implementation of job orchestration technologies<\/li><li>Strong API design, development, and utilization experience<\/li><li>Significant experience working with asynchronous processes<\/li><li>Disciplined approach to unit testing and TDD where appropriate<\/li><li>Experience with agile development methodologies and strong knowledge of all phases of system development life cycle<\/li><li>A desire to be challenged by a constantly growing and changing environment.<\/li><\/ul><strong>We also value:<\/strong><ul><li>Ability to manage\/direct more junior developers<\/li><li>Prior experience in the payments space<\/li><li>Working knowledge and hands-on software development experience in AWS, deep knowledge of its tools and products<\/li><li>Strong engineering background in fields such as Computer Science, Mathematics, Software Engineering, and Physics.<\/li><li>Ability to collaborate and empathize with a variety of individuals. You can iterate with users and non-technical stakeholders and understand how your technical decisions impact them.<\/li><li>Understanding and working knowledge of Transactional and NoSQL database technologies<\/li><\/ul><\/div><\/div><div class=&quot;job-preview-styles__benefits--21mG1&quot; data-ui=&quot;job-benefits&quot;><strong>Benefits:<\/strong><div><p>Why You&rsquo;ll Love Working with us:<\/p><ul><li>Culture: We are a humble, client-first team that is focused on collaborative data-driven success.<\/li><li>Speed: We move fast, love new ideas and give you the opportunity to push your limits.<\/li><li>Growth: We are expanding rapidly into new markets, launching new services and creating a world-class company.<\/li><\/ul><p><br \/>What We Offer:<\/p><ul><li>The chance to work in a fast-paced start-up environment with experienced industry leaders.<\/li><li>An environment where you can dive deep into the latest technologies and make a real, measurable impact.<\/li><li>Competitive salary and stock options.<\/li><li>Medical, dental, and vision starting on your first day.<\/li><\/ul><\/div><\/div><\/body><\/html>\"}"
}