{
    "id":"Kaggle::techmap::6148dc404ca8eb4d9076a426::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"Lesbian, Gay, Bisexual, Transgender or Intersex\" could be more inclusive by using \"LGBTQ+\" instead.",
    "label_general":true,
    "analysis_general":"The phrase \"is a Christian movement\" could be interpreted as exclusionary towards individuals who do not identify as Christian or follow other religious beliefs, potentially discouraging diverse candidates from applying.",
    "verified":true,
    "synthetic":false,
    "text":" Start your career with The Salvation Army today! We are looking for compassionate people who share our mission and values, if you have the passion and drive to commit yourself to a challenging and rewarding role. We invite you to review our current vacancies. ABOUT US. The Salvation Army is a Christian movement and one of Australia's largest and most-loved charities, helping thousands of Australians every year find hope in the midst of all kinds of personal hardship. The Salvation Army offers the opportunity to use your professional skills and expertise to make a real difference in the lives of people who need help most. Karratha Youth Accommodation Service is a 24 hour 7 days a week service that provides crisis accommodation service to youth aged 15.25 years. We are seeking a values-driven and proactive Youth and Family Worker, reporting to the Service Manager. You will provide short-term accommodation in a safe environment for young people aged 15 to 25 who are homeless or at risk of homelessness. This is a casual position located in Karratha. You will successfully. Establish relationships with young people and key stakeholders to enhance outcomes for young people facing homelessness. Encourage the self-determination and participation of each individual. Develop case plans with clients including a range of interventions that address client needs. Maintain accurate and up to date client records and data. Identify services gaps and recommend improvements for service delivery. Minimise accidents and incidents by safety plans and self-protection education. You will have. Certificate 4 in Human Services or relevant experience in the Human Services Industry. First Aid Certificate or willingness to obtain. A current WA Driver's licence. A current Working with Children's check. A willingness to undergo a National Police check. What we offer. As a registered not for profit organisation in addition to your remuneration you will enjoy generous tax-free salary packaging benefits. Employee Assistance Program for you and your immediate family members. Corporate Private Health Insurance rates. Supportive and encouraging organisation. TSA Social Mission embraces diversity and encourages applications from. Aboriginal and Torres Strait Islander people,. people who identify as Lesbian, Gay, Bisexual, Transgender or Intersex. people with a culturally or linguistically diverse background. The Salvation Army is an Equal Opportunity Employer who provides an inclusive work environment and embraces the diverse talent of its people.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148dc404ca8eb4d9076a426::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"The Salvation Army\", \"position\": \"Youth and Family Worker\", \"notes\": \"\", \"original\": \"<p><strong>Start your career with The Salvation Army today!<\/strong><\/p><p>We are looking for compassionate people who share our mission and values, if you have the passion and drive to commit yourself to a challenging and rewarding role; we invite you to review our current vacancies.<\/p><p><strong>ABOUT US<\/strong><\/p><p><strong>The Salvation Army is a Christian movement and one of Australia's largest and most-loved charities, helping thousands of Australians every year find hope in the midst of all kinds of personal hardship. The Salvation Army offers the opportunity to use your professional skills and expertise to make a real difference in the lives of people who need help most.<\/strong><\/p><p>Karratha Youth Accommodation Service is a 24 hour 7 days a week service that provides crisis accommodation service to youth aged 15 - 25 years.<br \/> <br \/> We are seeking a values-driven and proactive Youth and Family Worker, reporting to the Service Manager. You will provide short-term accommodation in a safe environment for young people aged 15 to 25 who are homeless or at risk of homelessness. This is a casual position located in Karratha.<br \/> <br \/> <strong>You will successfully<\/strong><\/p><ul><li>Establish relationships with young people and key stakeholders to enhance outcomes for young people facing homelessness<\/li><li>Encourage the self-determination and participation of each individual<\/li><li>Develop case plans with clients including a range of interventions that address client needs<\/li><li>Maintain accurate and up to date client records and data<\/li><li>Identify services gaps and recommend improvements for service delivery<\/li><li>Minimise accidents and incidents by safety plans and self-protection education<\/li><\/ul><p><br \/> <strong>You will have<\/strong><\/p><ul><li>Certificate 4 in Human Services or relevant experience in the Human Services Industry<\/li><li>First Aid Certificate or willingness to obtain<\/li><li>A current WA Driver's licence<\/li><li>A current Working with Children's check<\/li><li>A willingness to undergo a National Police check<\/li><\/ul><p><br \/> <strong>What we offer<\/strong><\/p><ul><li>As a registered not for profit organisation in addition to your remuneration you will enjoy generous tax-free salary packaging benefits<\/li><li>Employee Assistance Program for you and your immediate family members<\/li><li>Corporate Private Health Insurance rates<\/li><li>Supportive and encouraging organisation<br \/><br \/><\/li><\/ul><p><strong>TSA Social Mission embraces diversity and encourages applications from<\/strong><\/p><ul><li>Aboriginal and Torres Strait Islander people,<\/li><li>people who identify as Lesbian, Gay, Bisexual, Transgender or Intersex<\/li><li>people with a culturally or linguistically diverse background<\/li><\/ul><p> <\/p><p><em>The Salvation Army is an Equal Opportunity Employer who provides an inclusive work environment and embraces the diverse talent of its people.<\/em><\/p><p><em>The Salvation Army is a child safe organisation that is committed to ensuring the wellbeing of children and young people, and protecting them from harm. All child facing roles will require the successful completion of a Working with Children Check. Applicants for all other roles require a mandatory National Police Check.<\/em><\/p><p><em>We value Integrity, Compassion, Respect, Diversity, and Collaboration.<\/em><\/p>\"}"
}