{
    "id":"Kaggle::techmap::613b5c37fbaf674bb7aedfaa::linkedin_ca::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Iris's client, one of the world's prominent financial services company is looking to hire a strong Senior Data Scientist for an opportunity. Our client is a Global financial services firm and a market leader in securities, asset management and credit services. If interested, please share resume along with your rate expectation. Title: Senior Data Scientist. Duration: Long term contract (Remote till COVID, onsite once things are back to normal). Location: Mississauga, ON. Client: Banking\/Financial. Job Description:  7. years of overall years in experience is required. Should be currently working as a Data Scientist. Good experience in Artificial Intelligence and Machine Learning is required. Good experience in Python is required. Good business understanding & communication skills. About Iris Software Inc. Iris Software, Inc. is a 25 years old CMMi Level 5 New Jersey based company providing information technology solutions to clients nationwide. Iris has been growing at over 100% annually. In a program sponsored by Price Waterhouse, PNC Bank and Marsh, Iris has been honored for being. One of New Jersey's Finest 25 companies for the year 2001 and 2002. Iris is also ranked 75th among Inc 500 s list of privately held companies for year 2001. - NJ Technology FAST 50 Company for year 2002. In a competitive industry, we distinguish ourselves by reliability, technical expertise and a history of successfully completed projects for clients ranging from mid-sized to Fortune 1000 companies.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613b5c37fbaf674bb7aedfaa::linkedin_ca\", \"source\": \"linkedin_ca\", \"country\": \"CA\", \"company\": \"Iris Software Inc.\", \"position\": \"Senior Data Scientist\", \"notes\": \"\", \"original\": \"<p>Iris's client, one of the world's prominent financial services company is looking to hire a strong&nbsp;<strong>\\u201cSenior Data Scientist<\/strong>\\u201d for an opportunity.<\/p><p>&nbsp;<\/p><p>Our client is a Global financial services firm and a market leader in securities, asset management and credit services.<\/p><p>&nbsp;<\/p><p><strong>If interested, please share resume along with your rate expectation.<\/strong><\/p><p>&nbsp;<\/p><p><strong>Title: Senior Data Scientist<\/strong><\/p><p><strong>Duration: Long term contract (Remote till COVID, onsite once things are back to normal)<\/strong><\/p><p><strong>Location: Mississauga, ON<\/strong><\/p><p><strong>Client: Banking\/Financial<\/strong><\/p><p>&nbsp;<\/p><p><strong>Job Description:<\/strong><\/p><ul><li>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;7+ years of overall years in experience is required.<\/li><li>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Should be currently working as a Data Scientist.<\/li><li>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Good experience in Artificial Intelligence and Machine Learning is required.<\/li><li>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Good experience in Python is required.<\/li><li>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Good business understanding &amp; communication skills.<\/li><\/ul><p>&nbsp;<\/p><p><strong>About Iris Software Inc.<\/strong><\/p><p>Iris Software, Inc. is a 25 years old CMMi Level 5 New Jersey based company providing information technology solutions to clients nationwide. Iris has been growing at over 100% annually. In a program sponsored by Price Waterhouse, PNC Bank and Marsh, Iris has been honored for being<\/p><p>- One of New Jersey's Finest 25 companies for the year 2001 and 2002.<\/p><p>- Iris is also ranked 75th among Inc 500 s list of privately held companies for year 2001.<\/p><p>- NJ Technology FAST 50 Company for year 2002.<\/p><p>In a competitive industry, we distinguish ourselves by reliability, technical expertise and a history of successfully completed projects for clients ranging from mid-sized to Fortune 1000 companies<\/p>\"}"
}