{
    "id":"Kaggle::techmap::61499ae4f976d2317b5ac9f6::itjobslist_us::2",
    "label_age":true,
    "analysis_age":"Terms like \"hungry\" and \"passion\" often imply a preference for candidates who exhibit a high level of energy or youthful enthusiasm. While \"hungry\" might be intentionally used due to the employer's name, suggesting less implicit bias, \"passion\" could subtly discourage equally skilled candidates who do not identify with this characteristic, potentially affecting older applicants. Furthermore, the term \"mid-level\" is commonly used in job descriptions to denote experience, but could be perceived as seeking someone not too advanced in their career, indirectly favouring younger applicants. Additionally, describing the ideal candidate as \"(at times) cheerleader\" might favour a particular type of enthusiastic personality. This could fail to resonate across different cultures or personality types, subtly indicating a bias towards candidates who fit a specific social style.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The term \"culture fit\" is particularly problematic, as it is often linked to maintaining the demographic status quo and can lead to homogeneity, potentially excluding candidates who could offer valuable diverse perspectives, but may not closely match the existing company culture. A more inclusive alternative to \"culture fit\" could be \"Team compatibility,\" which focuses on shared professional values rather than personal similarities.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"HelloFresh is looking for a hungry mid-level copywriter (pun always intended). They'll join a team of talented, driven creatives who have a knack for problem-solving and a passion for storytelling. The work you'll create will meet business needs, yet satisfy your need to make awe-worthy creative that's grounded in solid strategy. Reporting to the Associate Director, you'll concept, write, and develop work from TVCs to OLVs, and every acronym in between. These projects will range from large conceptual campaigns to quick-turnaround performance-driven marketing. And throughout it all, you'll appreciate the importance of teamwork: not just among your creative team but between all the different departments that make up HelloFresh. You Will. Concept, write, and develop a range of creative work. From performance-driven marketing to larger conceptual campaigns. Work on branding projects and product-focused initiatives. Collaborate with different designers and copywriters, as well work independently at times. Work with different departments to understand and execute on the business needs and objectives. Present your work, pitching and selling your ideas with both enthusiasm and clarity. Continue to learn and to grow as a professional and as a creative. You Are. Someone who loves words and wields them well. Storytelling is your forte, yet you appreciate brevity and can skillfully execute on it. Highly conceptual and have experience in creating strategic creative concepts that can transcend mediums while meeting business objectives. A versatile writer who has experience with-or is eager to learn-both advertising and branding. You can also execute across platforms and tailor your copy accordingly. A strong presenter who can articulate ideas clearly and passionately. Not just on the page, but also in person. A great collaborator, communicator, and (at times) cheerleader. You work well with members of different departments and your fellow team members. You're also supportive and encouraging of your teammates. A culture fit. Someone who interacts with positivity, professionalism, passion, and kindness. You Have. 3. years experience as a copywriter, ideally in-house (or at an agency). A portfolio with relevant work. The ability to thrive in a fast-paced, collaborative environment. You'll get. Competitive Salary & 401k company match that vests immediately upon participation. Generous parental leave of 16 weeks & PTO policy.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61499ae4f976d2317b5ac9f6::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"HelloFresh\", \"position\": \"Mid-level Copywriter\", \"notes\": \"\", \"original\": \"<p>HelloFresh is looking for a hungry mid-level copywriter (pun always intended).<\/p><p>They'll join a team of talented, driven creatives who have a knack for problem-solving and a passion for storytelling. The work you'll create will meet business needs, yet satisfy your need to make awe-worthy creative that's grounded in solid strategy.<\/p><p>Reporting to the Associate Director, you'll concept, write, and develop work from TVCs to OLVs, and every acronym in between. These projects will range from large conceptual campaigns to quick-turnaround performance-driven marketing.<\/p><p>And throughout it all, you'll appreciate the importance of teamwork: not just among your creative team but between all the different departments that make up HelloFresh.<\/p><p>You Will<\/p><ul><li>Concept, write, and develop a range of creative work; from performance-driven marketing to larger conceptual campaigns.<\/li><li>Work on branding projects and product-focused initiatives.<\/li><li>Collaborate with different designers and copywriters, as well work independently at times.<\/li><li>Work with different departments to understand and execute on the business needs and objectives.<\/li><li>Present your work, pitching and selling your ideas with both enthusiasm and clarity.<\/li><li>Continue to learn and to grow as a professional and as a creative.<\/li><\/ul><p>You Are<\/p><ul><li>Someone who loves words and wields them well. Storytelling is your forte, yet you appreciate brevity and can skillfully execute on it.<\/li><li>Highly conceptual and have experience in creating strategic creative concepts that can transcend mediums while meeting business objectives.<\/li><li>A versatile writer who has experience with-or is eager to learn-both advertising and branding. You can also execute across platforms and tailor your copy accordingly.<\/li><li>A great communicator who understands the importance of managing up, time management, and prioritization.<\/li><li>A strong presenter who can articulate ideas clearly and passionately; not just on the page, but also in person.<\/li><li>A great collaborator, communicator, and (at times) cheerleader. You work well with members of different departments and your fellow team members. You're also supportive and encouraging of your teammates.<\/li><li>A culture fit; someone who interacts with positivity, professionalism, passion, and kindness.<\/li><\/ul><p>You Have<\/p><ul><li>3+ years experience as a copywriter, ideally in-house (or at an agency).<\/li><li>A portfolio with relevant work.<\/li><li>The ability to thrive in a fast-paced, collaborative environment.<\/li><\/ul><p>You'll get<\/p><ul><li>Competitive Salary & 401k company match that vests immediately upon participation<\/li><li>Generous parental leave of 16 weeks & PTO policy<\/li><li>$0 monthly premium and other flexible health plans effective first day of employment<\/li><li>75% discount on your subscription to HelloFresh (as well as other product initiatives)<\/li><li>Snacks, cold brew on tap & monthly catered lunches<\/li><li>Company sponsored outings & Employee Resource Groups<\/li><li>Collaborative, dynamic work environment within a fast-paced, mission-driven company<\/li><\/ul>\"}"
}