{
    "id":"Kaggle::techmap::6150e821f12ddd78d1bee3ab::linkedin_ke::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The use of the term \"his \/ her\" and \"S\/he\" can be seen as exclusionary by those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" The incumbent maintains an electronic system to track Office actions, provides weekly reports to the supervisor, and advises staff of any upcoming reports. S\/he uses PC-based word processing, spreadsheets, and charting software as the fundamental part of his\/her document management responsibilities. The incumbent establishes and maintains files according to standards set by the Missions Communications and Records Office and by USAID\/Washington. Marks correspondence and other documents for filing, and files them accordingly. Reviews all correspondence in advance of the supervisors signature, corrects errors by drafters and edits correspondence, and assures that documents meet the requirements posed by incoming correspondence to which it pertains. POSITION ELEMENTS. Supervision Received: The Administrative Assistant receives supervision from the Office Director, and\/or his\/her designee, who provides assignments and priority work tasks to be performed. Most work derives from normal Office operations, but special activities may be assigned at any time. S\/he independently plans and carries out assignments and is responsible for the accuracy of her\/his personal work. Work is normally reviewed in terms of results achieved and in meeting Office objectives. Supervision Exercised: Full supervision of other USAID staff is not contemplated. Available Guidelines: In addition to oral and written instructions from the supervisor, guidelines include Agency Notices and policies, USAID Mission Orders, USG Regulations, and other guidance and directives from the Automated Directives System (ADS) (specifically ADS Series 500 chapters and ADS 109, Ethics and Standards of Conduct) USAID Fact Sheets, E-mails, and other sources. Exercise of Judgment: The Administrative Assistant must use sound judgment in addressing tasks and responsibilities, and in setting work-related priorities. This is particularly important in dealing with working-level contacts within the Embassy, and with contractors, I. Ps, other donors, and GOK officials. Authority to Make Commitments: S\/he is not authorized to commit the USG to the expenditure of funds. However, the Administrative Assistant is regularly called upon to maintain calendars and\/or schedule meetings on behalf of the supervisor and staff. Nature, Level, and Purpose of Contacts: Contacts will be maintained in-person, by phone, or by written or electronic communication with Office and Mission staff, and with relevant Embassy and GOK officials, private-sector representatives, and staffs of other donor institutions. The nature of these contacts will be principally administrative. Time Expected to Reach Full Performance Level: Twelve months. Iii. Minimum Qualifications Required For This Position.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6150e821f12ddd78d1bee3ab::linkedin_ke\", \"source\": \"linkedin_ke\", \"country\": \"KE\", \"company\": \"USAID\", \"position\": \"Administrative Assistant (DGPS)\", \"notes\": \"\", \"original\": \"The Administrative Assistant is located in USAID\/Kenya and East Africa (KEA), Democracy, Governance, Peace and Security (DGPS) Office. S\/he serves as the principal administrative support person for the Office Director and DGPS staff, operating independently of other positions to ensure that administrative, logistical and information technology support functions are performed effectively, efficiently, and in a manner that promotes harmony and problem-solving, so that other DGPS staff remain fully focused on fulfilling their various technical and advisory responsibilities.<br><br>The Administrative Assistant is responsible for providing responsive customer service to internal and external partners, including Embassy and Mission staff, contractors, implementing partners (IPs), Government of Kenya (GOK) officials, USAID\/Washington interlocutors, and other stakeholders. In this capacity, the Administrative Assistant is responsible for managing DGPS information flows, its business processes, and sponsored events ensuring that submission and approval deadlines are met so that effective development initiatives ensue, and planned proceedings occur in a successful and professional manner.<br><br><strong><u>I. Major Duties And Responsibilities<br><\/u><\/strong><ul><li> SECRETARIAL, ADMINISTRATIVE AND CLERICAL SUPPORT 60%<\/li><li>The Administrative Assistant maintains the supervisor\\u2019s calendar, advising of, and preparing her\/ him for upcoming commitments. S\/he makes appointments, receives and places phone calls, sends and receives E-mails and Faxes, arranges meetings. These services facilitate contacts with Mission and Embassy staff, GOK officials, donors, IIPs, non-governmental organizations (NGO), and the private sector.<\/li><li>Establishes and maintains close working relationships with the Front Office Administrative Assistants, Executive Office staff, and administrative counterparts in other technical and support offices to coordinates activities, share knowledge, and devise innovative solutions to improve Office and Mission business practices.<\/li><li>Assists in procurement actions to support DGPS outreach initiatives with implementing partners, development partners, the private sector, and GOK officials. This task includes working with the event sponsor in planning and execution. Activities include market research and making reservations for use of on- and off-site venues, inviting guests, preparing welcome packets, site set-up, and ensuring availability of adequate logistics and information technology assets throughout the event. Additionally, secures any necessary RSO approvals, coordinates motor pool support and ensures all event close-out activities are accomplished in an expeditious and efficient fashion.<\/li><li>Supports TDYers travel logistics before they leave their home office and upon arrival to Post. Secures Front Office approval for official travel and shares eCC POC, RSO link\/form, coordinates accommodations, airport transfers and compound access. Additionally, coordinates staff travel logistics both in-county and abroad with Travel Authorization (TA) preparation\/approvals in E2, visa(s), motor pool, eCC clearance, tickets, and RSO travel notification. Upon travel completion assists the traveler in submitting travel voucher and settle travel claims.<\/li><li>Works as the timekeeper to the team responsible for keeping track of staff time and attendance, annual leave, sick-days, compensatory\/travel time and overtime. Inputs data into WebTA and prepares timecards for the certifying official in a timely fashion, ensuring all entries are timely and accurate. Tracks leave calendars and office coverage and keeps the Front Office apprised of the absence of the Office Director and Deputy. Drafts and coordinates requisite Mission notices with EXO.<\/li><li>Ensures all DGPS Office equipment and peripheries are well-maintained an in good working order. Requests maintenance and\/or replacements as necessary. Also, ensures that the DGPS staff is well-supplied with expendable office materials, and requests resupply as needed.<\/li><li>Arranges weekly staff meetings and serves a recorder\/notetaker for this, and other, regular and ad hoc meetings as required. Maintains record all meeting minutes.<\/li><li>The Administrative Assistant may be called upon to backstop the Executive Assistant in the Mission Director's Office as needed.<\/li><li> MAIL, CORRESPONDENCE AND REPORT PROCESSING 20%<\/li><li>The Administrative Assistant maintains control of all correspondence for the DGPS Office, including program\/project\/activity files provided by CORs\/AORs. Receives and distributes official mail and correspondence. S\/he drafts non-technical responses to routine correspondence and letters in English and, as necessary, in Kiswahili, for the supervisor\\u2019s review and signature.<\/li><li>The incumbent manages the DGPS training plan, schedule of annual performance evaluations, and calendar of other cyclical and periodic reports (e.g., Operational Plan, Performance Plan and Review, Contractor Reporting Performance Assessment Reporting System (CPARS), etc.)<\/li><li>S\/he maintains and updates Office Handbooks and other documents, such as visitors\\u2019 lists, welcome packets, contact lists, telephone listings, personnel rosters, leave calendars, etc., as necessary.<\/li><li>S\/he reviews outgoing mail for the correct format, address, routing, attachments, etc., prior to dispatch. S\/he distributes internal policies and procedures and, as necessary, maintains a record of when staff received notice of new policies and\/or procedures.<\/li><li> DOCUMENT MANAGEMENT 20%<\/li><li>The Administrative Assistant manages DGPS\\u2019s official documents and files related to development programs, personnel and administrative issues, along with other logistical and support matters. The incumbent maintains an electronic system to track Office actions, provides weekly reports to the supervisor, and advises staff of any upcoming reports.<\/li><li>S\/he uses PC-based word processing, spreadsheets, and charting software as the fundamental part of his\/her document management responsibilities.<\/li><li>The incumbent establishes and maintains files according to standards set by the Mission\\u2019s Communications and Records Office and by USAID\/Washington; marks correspondence and other documents for filing, and files them accordingly.<\/li><li>Reviews all correspondence in advance of the supervisor\\u2019s signature, corrects errors by drafters and edits correspondence, and assures that documents meet the requirements posed by incoming correspondence to which it pertains.<br><\/li><\/ul><strong>II.<\/strong> <strong>POSITION ELEMENTS<br><\/strong><ul><li>Supervision Received: The Administrative Assistant receives supervision from the Office Director, and\/or his\/her designee, who provides assignments and priority work tasks to be performed. Most work derives from normal Office operations, but special activities may be assigned at any time. S\/he independently plans and carries out assignments and is responsible for the accuracy of her\/his personal work. Work is normally reviewed in terms of results achieved and in meeting Office objectives.<\/li><li>Supervision Exercised: Full supervision of other USAID staff is not contemplated. <\/li><li>Available Guidelines: In addition to oral and written instructions from the supervisor, guidelines include Agency Notices and policies, USAID Mission Orders, USG Regulations, and other guidance and directives from the Automated Directives System (ADS) (specifically ADS Series 500 chapters and ADS 109, Ethics and Standards of Conduct) USAID Fact Sheets, E-mails, and other sources. <\/li><li>Exercise of Judgment: The Administrative Assistant must use sound judgment in addressing tasks and responsibilities, and in setting work-related priorities. This is particularly important in dealing with working-level contacts within the Embassy, and with contractors, IPs, other donors, and GOK officials. <\/li><li>Authority to Make Commitments: S\/he is not authorized to commit the USG to the expenditure of funds. However, the Administrative Assistant is regularly called upon to maintain calendars and\/or schedule meetings on behalf of the supervisor and staff. <\/li><li>Nature, Level, and Purpose of Contacts: Contacts will be maintained in-person, by phone, or by written or electronic communication with Office and Mission staff, and with relevant Embassy and GOK officials, private-sector representatives, and staffs of other donor institutions. The nature of these contacts will be principally administrative.<\/li><li>Time Expected to Reach Full Performance Level: Twelve months. <br><\/li><\/ul><strong><u>Iii. Minimum Qualifications Required For This Position<br><br><\/u><\/strong>Any application that does not meet the minimum requirements stated below will not be evaluated. Only short-listed applicants will be contacted. If you have not been contacted within one month from the closing date of this advertisement, please consider your application unsuccessful.<br><br><strong><u>Required Qualifications<br><\/u><\/strong><ul><li>Education: At least two or more years of post-secondary education in Business Administration, Communications, English, Secretarial Studies or related field, equivalent to a U.S. junior college or community college diploma, is required. <\/li><li>Prior Work Experience: A minimum of three years of progressively responsible work experience in a professional setting, which includes one year of employment at an international or development-related organization or office is required. <\/li><li>Post Entry Training: The incumbent will be provided familiarization training on USAID operations, and on specific regulations and procedures such as: travel, correspondence management, information systems, myServices, GLAAS, etc. Mandatory trainings will include the Introduction to Program Cycle (IPC) and Records Management. Additional training in-country may be provided from time to time, depending on work demands, course offerings, availability, and funds. **<\/li><li>Language Proficiency: Fluency (Level IV, speaking, reading and writing ability) in English and Kiswahili is required. **<\/li><li>Job Knowledge: The Administrative Assistant must possess advanced knowledge of standard office procedures and practices. S\/he must have sound knowledge of, and adherence to, acceptable work protocols common in an international work setting (e.g., respectful dialogue, non-discrimination, equal opportunity, internal controls, etc.). **<\/li><li>Skills And Abilities: The incumbent must have excellent communication and interpersonal skills, adept organizational and time management skills and be highly proficient in keyboarding and in operating computers with standard software. These include Microsoft Word, Excel, PowerPoint, Outlook, and other software programs as designated. S\/he must be conversant with virtual work platforms (such as: Google Meet, Microsoft Teams, WebEx, etc.) and utilizing collaborate workspaces (such as: Google.doc, Huddle, etc.). Must possess advanced ability using the Internet and Google Workspaces (especially mail, calendar, contacts, hangouts, etc.)<br><\/li><\/ul><strong>Step 1:<\/strong> Register in MyJobsInKenya at www.myjobsinkenya.com<br><br><strong>Step 2:<\/strong> Qualified Current USG Employees: Attach an updated curriculum vitae\/resume (no more than five pages) , a copy of your most recent Performance Evaluation Report, and copies of all relevant certificates. <strong>Scan and attach all the documents and upload to<\/strong> MyJobsInKenya <strong>.<br><br><\/strong><strong>OR<br><br><\/strong>External Applicants\/Not Current USG Employees: Attach an updated curriculum vitae\/resume (no more than five pages) and copies of all relevant certificates. <strong>Scan and attach all the documents and upload to<\/strong> MyJobsInKenya <strong>.<br><br><\/strong><strong><u>Note To Applicants<br><\/u><\/strong><ul><li>Applications must be received by the closing date and time specified in Section I, item 3, and submitted through myjobsinkenya.com as stated in Section IV.<\/li><li>Submissions will only be accepted through www.myjobsinkenya.com\/usaid . Late and Incomplete applications (those that do not contain the applicant\\u2019s most current and up to date detailed CV and relevant education certificates) will not be considered for the position. The closing date for receipt of applications is indicated above.<\/li><li>USAID provides equal opportunity and equitable treatment for employment of all people without regard to race, color, religion, sex, national origin, age, disability, political affiliation, marital status or sexual orientation.<\/li><li>Only short-listed candidates will be contacted. Any form of canvassing will lead to automatic disqualification.<\/li><li>USAID DOES NOT CHARGE A FEE AT ANY STAGE OF THE RECRUITMENT PROCESS (APPLICATION, INTERVIEW MEETING, PROCESSING, OR TRAINING) AND DOES NOT CONCERN ITSELF WITH INFORMATION ON APPLICANTS' BANK ACCOUNTS.<\/li><\/ul>\"}"
}