{
    "id":"Kaggle::techmap::615585766aade72f839ec08d::linkedin_es::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"While reasonable accommodations are mentioned, the emphasis on physical tasks without specifying the potential accommodations might discourage applicants with disabilities.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Come work for us! We are looking for dedicated employees to join our team to help our customers have the best experience possible every time they enter a JD Finish Line store. Our employees are key to our success. Position Title: Store Associate. Summary: Performs sales and customer service tasks by performing the following duties. Sample Responsibilities. Performs sales and customer service responsibilities. Performs cashiering, stockroom upkeep and store upkeep as needed. Maintains company standards regarding personal sales metrics. This is a summary of some of the key duties, responsibilities, and physical demands expected of this position. It is not intended to be a complete job description. Physical Demands. Requires standing approximately 5  8 hours per day usually 3  5 days per week. During peak sale periods (e. g. Holiday, Back-to-School), will work for long periods throughout a 1  12 hour day. Requires stooping and kneeling to place merchandise on customers feet as well as reaching and pulling to obtain or stock merchandise on storage racks. May be required to climb ladder or ascend\/descend stairs in order to stock and\/or acquire merchandise for sale. Required to lift items weighing 5  25 lbs regularly. In certain circumstances, weights may be higher. Physical Demands  The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The company reserves the right to modify this job description with or without notice. Employees may be asked to perform additional duties outside of normal job scope on a temporary basis per company policy. EEOC Statement. The Finish Line, Inc. is an Equal Opportunity Employer and is committed to complying with all federal, state, and local EEO laws. The Finish Line, Inc. prohibits discrimination against employees and applicants for employment based on the individual's race or color, religion or creed, national origin, alienage or citizenship status, marital status, sex, pregnancy status, age, military status, disability, or any other protected characteristic or class protected by law. The Finish Line, Inc. provides reasonable accommodation for disabilities in accordance with applicable laws. Need accessibility assistance to apply? Applicants who require accessibility assistance to submit an employment application can either call Finish Line at ( 317) 613-6890 or email us at finishline. com.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615585766aade72f839ec08d::linkedin_es\", \"source\": \"linkedin_es\", \"country\": \"ES\", \"company\": \"Finish Line\", \"position\": \"Store Associate - Freehold Raceway Mall, Freehold, NJ\", \"notes\": \"\", \"original\": \"<strong><strong>Come work for us!<br><\/strong><\/strong>We are looking for dedicated employees to join our team to help our customers have the best experience possible every time they enter a JD Finish Line store.<br><br><strong><em>Our employees are key to our success.<br><br><\/em><\/strong><strong>Position Title: <\/strong> Store Associate<br><br><strong>Summary:<\/strong> Performs sales and customer service tasks by performing the following duties.<br><br><strong><u>Sample Responsibilities<br><\/u><\/strong><ul><li>Performs sales and customer service responsibilities.<\/li><li>Performs cashiering, stockroom upkeep and store upkeep as needed.<\/li><li>Maintains company standards regarding personal sales metrics.<br><\/li><\/ul><u><strong>This is a summary of some of the key duties, responsibilities, and physical demands expected of this position. It is not intended to be a complete job description.<br><br><\/strong><\/u><strong><u>Physical Demands<br><\/u><\/strong><ul><li>Requires standing approximately 5 \\u2013 8 hours per day usually 3 \\u2013 5 days per week.<\/li><li>During peak sale periods (e.g. Holiday, Back-to-School), will work for long periods throughout a 1 \\u2013 12 hour day.<\/li><li>Requires stooping and kneeling to place merchandise on customer\\u2019s feet as well as reaching and pulling to obtain or stock merchandise on storage racks.<\/li><li>May be required to climb ladder or ascend\/descend stairs in order to stock and\/or acquire merchandise for sale.<\/li><li>Required to lift items weighing 5 \\u2013 25 lbs regularly. In certain circumstances, weights may be higher.<br><\/li><\/ul><strong>Physical Demands \\u2013<\/strong> The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>The company reserves the right to modify this job description with or without notice. Employees may be asked to perform additional duties outside of normal job scope on a temporary basis per company policy.<br><br><strong><u>EEOC Statement<br><br><\/u><\/strong><strong><em>The Finish Line, Inc. is an Equal Opportunity Employer and is committed to complying with all federal, state, and local EEO laws. The Finish Line, Inc. prohibits discrimination against employees and applicants for employment based on the individual's race or color, religion or creed, national origin, alienage or citizenship status, marital status, sex, pregnancy status, age, military status, disability, or any other protected characteristic or class protected by law. The Finish Line, Inc. provides reasonable accommodation for disabilities in accordance with applicable laws.<br><br><\/em><\/strong><strong><strong>Need accessibility assistance to apply?<br><\/strong>Applicants who require accessibility assistance to submit an employment application can either call Finish Line at ( 317) 613-6890 or email us at talentacquisition@finishline.com. A member of our Talent Acquisition team will respond as soon as reasonably possible. ( <strong>This email address and phone number is only for individuals seeking accommodation when applying for a job.<\/strong> )<\/strong>\"}"
}