{
    "id":"Kaggle::techmap::615608a5a6740c534abc0d6a::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" This position requires the willingness to travel to events and locations across the greater Edmonton region and our regional stewardship campuses. A valid Drivera€s License and reliable transportation is recommended to be successful in this role. Along with some travel, the ability to be available and flexible outside of normal business hours will be vital to fulfill obligations of the position. WHAT MAKES YOU A DIFFERENCE MAKER. Highly engaged writing and communication skills to create impactful storytelling. Creativity, innovation, and the willingness to be bold and share ideas to support alumni programs. Demonstrated success initiating stakeholder engagement programs designed to grow audience, achieve goals, and increase revenue. Authentic interest in engaging alumni in relationship building conversations and activities. Ability to convert engagement data into actionable items. An affinity for building and cultivating meaningful relationships. Flexibility and the ability to lead from where you are as an integral team member. Recognition that we are greater than they and that all initiatives support Advancement and college. Proven ability to create inclusion while working with diverse groups of people. SALARY: $75, 044 TO $93, 777 reflective upon what you bring. AKA your education and experience. Plus, immediate access to our great pension and benefit programs. Nor. Quest College offers flexible work options that include working on campus, working from anywhere or a blend of both! In our ongoing commitment to keep all Nor. Quest employees safe, our campus and work environments have a full COVID-19 vaccination mandate in place. Ensuring that all Nor. Quest employees are fully vaccinated is an approach to health and safety that is best suited for the learning, working, and living environments of our college. COMPETITION NUMBER: 2021-3174. CLOSING DATE: October 6, 2021. APPLY TO BECOME A NORQUESTER:If this opportunity delights you and your expertise will shine in this role, we invite you to apply for this position online by uploading your resume and cover letter combined as one document. PSST:Only candidates shortlisted for an interview will be contacted and wea€ll make sure to do this within 28 days of the closing date. Difference Makers. If we were to describe what Nor. Quest College is, wea€d say these two words. We are so fundamentally driven in our mission to make a difference to our students, our community, and to our fellow Nor.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615608a5a6740c534abc0d6a::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"NORQUEST COLLEGE\", \"position\": \"ALUMNI RELATIONS OFFICER\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Job Description: <p style=\\\"margin:0px\\\"><strong>ALUMNI RELATIONS OFFICER<\/strong><\/p> <p style=\\\"margin:0px\\\"><strong>ADVANCEMENT<\/strong><\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin-bottom:0.0001pt\\\">NorQuesters are difference makers and we\\u00e2\\u20ac\\u2122re searching for someone dedicated to making a difference to join our Advancement team as an Alumni Relations Officer. The successful candidate will thrive in showcasing our values of starting small and thinking big as they develop, coordinate and manage all areas with Alumni Relations. &nbsp; <\/p> <p style=\\\"margin-bottom:0.0001pt\\\"> &nbsp;<\/p> <p style=\\\"margin-bottom:0.0001pt\\\">You will be an integral part of the team as you prepare the annual Alumni plan and work with our Marketing and Communications team to market the exciting programs throughout the year. &nbsp; You\\u00e2\\u20ac\\u2122ll be boldly curious and intentionally courageous as you create, market, and coordinate events and workshops, celebrate amazing NorQuester Alumni, and manage day to day administration and operations of alumni related tasks.<\/p> <p style=\\\"margin-bottom:0.0001pt\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin-bottom:0.0001pt\\\"><strong>HOW YOU'LL MAKE A DIFFERENCE<\/strong><\/p> <div style=\\\"margin:0px\\\"> <ul> <li style=\\\"margin-bottom:0.0001pt\\\">Evolve and maintain a model for an alumni program suitable for the long-term development of the College<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Plan and implement marketing, communications and engagement strategies with key alumni audiences<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Recognize, celebrate, and profile the achievements of NorQuest alumni<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Track and update alumni records and engagement activities<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Research, implement and measure alumni industry best practices<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Effectively manage financial resources<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Work as the lead for alumni focused projects that require cross-faculty and department collaboration and project management skills<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Promote alumni engagement opportunities to academic units, graduating students, industry partners and alumni; and campaigning alumni groups and volunteers to obtain potential speakers, mentors and new alumni volunteers<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Coordinate alumni volunteer and mentorship opportunities across campus<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Develop and coordinate alumni communications and key messaging<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Provide input to the Manager, Gifts &amp; Campaign plans in the development of the fundraising plan related to alumni engagement<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Expand, promote, and evaluate value-added alumni benefits and services<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Establish and sustain external affinity partnerships with the Alumni program<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Work with the Advancement Team to support achieving fundraising objectives<\/li> <\/ul> <p style=\\\"margin-bottom:0.0001pt\\\"> &nbsp;<\/p> <\/div> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin-bottom:0.0001pt\\\"><strong>WHAT YOU BRING &nbsp;<\/strong><\/p> <ul> <li style=\\\"margin-bottom:0.0001pt\\\">Diploma or degree in a related field<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">3 years of recent experience in a similar position that includes: interaction with stakeholders such as alumni, donors and students; project management; and knowledge of marketing and communications strategies and processes<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Working knowledge of information systems to ensure technology needs for development are met (Raiser\\u00e2\\u20ac\\u2122s Edge. iWave)<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Proficient in a variety of Microsoft Office programs<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Experience working in a large organization, preferably in post-secondary education or member association is an asset<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">This position requires the willingness to travel to events and locations across the greater Edmonton region and our regional stewardship campuses. &nbsp; A valid Driver\\u00e2\\u20ac\\u2122s License and reliable transportation is recommended to be successful in this role.<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Along with some travel, the ability to be available and flexible outside of normal business hours will be vital to fulfill obligations of the position<\/li> <\/ul> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong style=\\\"font-size:10pt\\\">WHAT MAKES YOU A DIFFERENCE MAKER<\/strong><\/p> <ul> <li style=\\\"margin-bottom:0.0001pt\\\">Highly engaged writing and communication skills to create impactful storytelling<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Creativity, innovation, and the willingness to be bold and share ideas to support alumni programs<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Demonstrated success initiating stakeholder engagement programs designed to grow audience, achieve goals, and increase revenue<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Authentic interest in engaging alumni in relationship building conversations and activities<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Ability to convert engagement data into actionable items.<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">An affinity for building and cultivating meaningful relationships<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Flexibility and the ability to lead from where you are as an integral team member<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Recognition that we are greater than they and that all initiatives support Advancement and college<\/li> <li style=\\\"margin-bottom:0.0001pt\\\">Proven ability to create inclusion while working with diverse groups of people.<\/li> <\/ul> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>SALARY: <\/strong>$75,044 TO $93,777 reflective upon what you bring. AKA your education and experience. Plus, immediate access to our great pension and benefit programs. &nbsp; &nbsp;<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">NorQuest College offers flexible work options that include working on campus, working from anywhere or a blend of both! &nbsp;<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\">In our ongoing commitment to keep all NorQuest employees safe, our campus and work environments have a full COVID-19 vaccination mandate in place. &nbsp;Ensuring that all NorQuest employees are fully vaccinated is an approach to health and safety that is best suited for the learning, working, and living environments of our college.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>COMPETITION NUMBER:<\/strong> 2021-3174<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>CLOSING DATE: <\/strong>October 6, 2021<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>APPLY TO BECOME A NORQUESTER:<\/strong>If this opportunity delights you and your expertise will shine in this role, we invite you to apply for this position online by uploading your resume and cover letter combined as one document.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong>PSST:<\/strong>Only candidates shortlisted for an interview will be contacted and we\\u00e2\\u20ac\\u2122ll make sure to do this within 28 days of the closing date.<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"> &nbsp;<\/p> <p style=\\\"margin:0px\\\"><strong><em>Difference Makers.<\/em><\/strong> If we were to describe what NorQuest College is, we\\u00e2\\u20ac\\u2122d say these two words. We are so fundamentally driven in our mission to make a difference to our students, our community, and to our fellow NorQuesters, that it guides what we do, who we meet, and where we are headed. <\/p> <p style=\\\"margin:0px\\\">So how do we make differences? <\/p> <ul> <li><strong>We empower NorQuesters. <\/strong>When it comes to working, it\\u00e2\\u20ac\\u2122s up to you to decide where (on campus or from another location) and how you work. NorQuesters are expected to embody our Qs\\u00e2\\u20ac\\u201dlead from where you are, be dependable, find ways forward\\u00e2\\u20ac\\u201dto name a few, but how you do that is your choice!<\/li> <li><strong>We unlock potential. <\/strong>Whether its newcomers to Canada who want to improve their English, students who want to complete their academic upgrading, learners pursuing post-secondary education, or anyone who wishes to strengthen their skills through professional development, our passion to educate touches people of all levels and all backgrounds.<\/li> <li style=\\\"margin-bottom:0.0001pt\\\"><strong>We strengthen Alberta.<\/strong> From our graduates who hit the ground running, to our partnerships with government, industry, and business, to our commitment to communities, including a dedicated focus on Indigenous communities, we contribute to our province and make it stronger. We strive to be an employer of choice for First Nations, Metis and Inuit people in Canada by leading, supporting, and being an ally through our work toward decolonization, reconciliation, and Indigenization. <br><br><\/li> <\/ul> <p style=\\\"margin:0px\\\">And that\\u00e2\\u20ac\\u2122s a snapshot of how we are Difference Makers. But there\\u00e2\\u20ac\\u2122s so much more to us and we invite you to <a href=\\\"https:\/\/www.norquest.ca\/home.aspx\\\" rel=\\\"noopener nofollow noopener noreferrer\\\" target=\\\"_blank\\\">explore further<\/a>!<\/p> <p style=\\\"margin-bottom:0.0001pt\\\"><strong> &nbsp;<\/strong><\/p> <\/div>\"}"
}