{
    "id":"Kaggle::techmap::6142c246a6477d0d25321b7a::monsterasia_hk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Lead a strategic fundraising strategy and development for sustainability and expansion of the project. Steer the project team's application for R&D and knowledge transfer funding at a later stage, driving the project to a new height of research achievement and. Undertake any other duties as assigned by the Project Leadership. Applicants should have a higher degree with at least 15 years of work experience in major project management, preferably in the field of creative arts industry or technology management. Demonstrated expertise or insights on A. I technology, data science, and creative arts is necessary. Hands-on management experience on major Art Tech projects is highly preferred. Holding PMP or equivalent qualifications would be an added advantage. The right candidate should have a high level of proficiency in both written and spoken English and Chinese (Cantonese and Putonghua) mature and detail-minded highly self-motivated with strong communication and interpersonal skills and strong analytical and problem-solving abilities. Rich experience in leading international teams will be highly desirable. Working outside normal office hours and business trips may be required. Shortlisted candidates will be invited to give a presentation in the selection interview. Initial appointment will be made on a fixed-term contract of two years. Re-appointment thereafter will be subject to mutual agreement and availability of funding. Salary will be commensurate with qualifications and experience. Fringe benefits including annual leave, medical and dental benefits will be provided. A gratuity will be payable upon successful completion of contract. Application Procedure: Applications are invited to submit their applications at the HKBU e-Recruitment System (). Those not invited for interview 4 months after the closing date may consider their applications unsuccessful. Details of the University's Personal Information Collection Statement can be found at. The University reserves the right not to make an appointment for the post advertised, and the appointment will be made according to terms and conditions then applicable at the time of offer. Review of applications will begin in early September and will continue until the position is filled.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6142c246a6477d0d25321b7a::monsterasia_hk\", \"source\": \"monsterasia_hk\", \"country\": \"HK\", \"company\": \"Hong Kong Baptist University\", \"position\": \"Project Manager (PR0100\/21-22)\", \"notes\": \"\", \"original\": \"<br><strong>AUGMENTED CREATIVITY LAB<\/strong><br>Aspiring to be a leading, research-led, and liberal arts University in Asia, Hong Kong Baptist University is committed to conducting world-leading research that extends the frontiers of knowledge, tackles global challenges, and benefits the community locally and internationally. Toward this end, the University formed 6 Interdisciplinary Research Labs to underpin interdisciplinary and theme-based research, leveraging on its existing strength in humanistic research.<br>The Augmented Creativity Lab, one of the 6 Labs, spearheading the research on human and AI creativity, has recently won the Theme-based Research Scheme (TRS) 2021\/22 (Eleventh Round) under the Research Grants Council (RGC) with a grant of HK$ 52.8M for a five-year project entitled \\\"Building Platform Technologies for Symbiotic Creativity in Hong Kong\\\". This is the first time that major funding has been allocated by the RGC for an Art Tech project.<br>This research team will develop platform technologies for symbiotic creativity, providing unlimited art content for humans, including an art data repository, an AI creative algorithm system, a research theatre, a digital art and policy network, and some unique and innovative application projects, to usher in a new era of Art Tech.<br>Members of the multidisciplinary research team led by HKBU include cognitive scientists, AI and data scientists, media scientists, ethicists, and art policy scholars from several locally and worldly renowned universities. The team will also collaborate closely with partners from industry and arts community. Targeting to commence the project from the fourth quarter of 2021, HKBU is setting up a group of project management talents to take forward this research endeavor.<br><strong>Project Manager (PR0100\/21-22)<\/strong><br>Reporting to the Project Leadership, the Project Manager will:<br>1. Drive the success of the entire project through the execution of cutting-edge research in the arts and science nexus by orchestrating the expertise of the team<br>2. Deliver and implement an integrated project plan towards the phased and ultimate project objectives, deliverables and impact<br>3. Lead the team's execution of the plan, provide issue resolution and direct the team in working through project changes and risks<br>4. Propel the project's communication and connection with key stakeholders including the government, industry partners, arts community, etc<br>5. Manage the project achievement dissemination to the research community and beyond, including organising public symposia and major activities to the public, and presenting the project accomplishment to internal and external stakeholders<br>6. Lead a strategic fundraising strategy and development for sustainability and expansion of the project<br>7. Steer the project team's application for R&D and knowledge transfer funding at a later stage, driving the project to a new height of research achievement and<br>8. Undertake any other duties as assigned by the Project Leadership.<br>Applicants should have a higher degree with at least 15 years of work experience in major project management, preferably in the field of creative arts industry or technology management. Demonstrated expertise or insights on AI technology, data science, and creative arts is necessary. Hands-on management experience on major Art Tech projects is highly preferred. Holding PMP or equivalent qualifications would be an added advantage. The right candidate should have a high level of proficiency in both written and spoken English and Chinese (Cantonese and Putonghua) mature and detail-minded highly self-motivated with strong communication and interpersonal skills and strong analytical and problem-solving abilities. Rich experience in leading international teams will be highly desirable. Working outside normal office hours and business trips may be required.<br>Shortlisted candidates will be invited to give a presentation in the selection interview.<br>Initial appointment will be made on a fixed-term contract of two years. Re-appointment thereafter will be subject to mutual agreement and availability of funding.<br>Salary will be commensurate with qualifications and experience.<br>Fringe benefits including annual leave, medical and dental benefits will be provided. A gratuity will be payable upon successful completion of contract.<br><strong>Application Procedure:<\/strong><br>Applications are invited to submit their applications at the HKBU e-Recruitment System (). Those not invited for interview 4 months after the closing date may consider their applications unsuccessful. Details of the University's Personal Information Collection Statement can be found at .<br>The University reserves the right not to make an appointment for the post advertised, and the appointment will be made according to terms and conditions then applicable at the time of offer.<br><strong>Review of applications will begin in early September and will continue until the position is filled.<\/strong>\"}"
}