{
    "id":"Kaggle::techmap::6145ec517fc29a0be9bb8853::linkedin_se::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The job description emphasizes the company's mission to build \"quality games and entertainment experiences for girls\" and highlights a workplace that is \"more than 50% female identifying\" with an affirmative \"YES to WomenInTech!\" This language suggests a preference for female candidates and can subtly discourage male candidates from applying.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Project management experience and can plan and keep both long-term and short-term deliverables going. Strong business acumen that enables you to evaluate business cases and\/or opportunities and prioritize actions. Open to feedback. You are able to pick up great ideas and can put forward suggestions based on feedback from internal and external sources. Passion for insights. You continuously identify target audience insights, youth-focused trends, marketplace best practices\/opportunities, and competitive insights to translate into meaningful product updates and experiences. A player-centric approach and understanding of the importance of maintaining a good understanding of the products, services and target audience. Experience guiding consumer facing brand communications, including brand identity visuals, copy and videos. What we offer you. A pretty sweet mission. We want to build quality games and entertainment experiences for girls and we take that vision very seriously. We strive to hit that mark every single day. We may be a big group, but were a tight-knit team! A diverse team of friendly, fun, and supportive co-workers from 20 different countries! Were more than 50% female identifying! YES to WomenInTech! Flexible working opportunities. Were known to throw good parties from time to time. 30 Vacation Days. ITP1 Insurance plan. Parental pay top up to 90%. 5, 000 SEK per year Health allowance. Curious to know more? Apply now! Wed love to talk to you!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145ec517fc29a0be9bb8853::linkedin_se\", \"source\": \"linkedin_se\", \"country\": \"SE\", \"company\": \"Star Stable Entertainment AB\", \"position\": \"Senior Product Marketing Manager\", \"notes\": \"\", \"original\": \"<p>We're the<strong>&nbsp;Project Curie<\/strong>&nbsp;Team, and we\\u2019re creating new magic. Like Star Stable Online before us, we aim to build an entertainment franchise with multiple touchpoints including games, books, music, animation and stories with our community, celebrating self-expression and the strength in close friendships.&nbsp;<\/p><p><br><\/p><p>We are now looking for an experienced&nbsp;<strong>Sr. Product\/Brand Marketing Manager<\/strong>&nbsp;who will lead the brand and marketing efforts as a member of the franchise leadership team, helping to shape the future of the Project Curie franchise. This includes setting the long-range brand strategy and working with consumer, competitive and market insights to best position and guide the franchise in the marketplace.&nbsp;&nbsp;<\/p><p><br><\/p><p>If you are a marketing leader with experience working in a cross-functional team building a new brand and bringing a new game to market, translating player and business insight into marketable and commercial recommendations to shape the future of our next entertainment franchise to a new audience of players, read on!&nbsp;&nbsp;&nbsp;<\/p><p><br><\/p><p><strong>In this role<\/strong>, you will collaborate with cross-functional marketing teams to craft the launch and go-to-market strategy and plans for stand-alone Curie experiences and games.&nbsp;You will work closely with the brand design and game team to guide the consumer-facing elements of the master brand identity, style, and tone.<\/p><p><br><\/p><p>We have a vision for this new game, but we need more than that. This is where we hope you will build some magic together with us.&nbsp;Our Product Marketing Manager will ensure that our game and entertainment ecosystem are set up for commercial success. You will work closely with our game team on shaping the multi-touch product strategy and roadmap as we build experiences to attract and engage a new community of passionate fans and future players.&nbsp;&nbsp;<\/p><p><br><\/p><p>We want you to bring your experience in collaborating with game teams early in the product development process with a goal of creating a clear product vision, reasons to play and interact with our brand that resonates with our target audience and building a&nbsp;long-range brand strategy that supports our ambitious vision.&nbsp;<\/p><p><br><\/p><p><strong>We believe that the profile we are looking for has<\/strong><\/p><ul><li>A background as a product marketing manager in the gaming and\/or entertainment industry.&nbsp;&nbsp;<\/li><li>Strong experience within product strategy which includes product positioning, player insights, competitive analysis and go to market planning.&nbsp;<\/li><li>Great communication skills and an ability to influence and inspire others.<\/li><li>Project management experience and can plan and keep both long-term and short-term deliverables going.&nbsp;<\/li><li>Strong business acumen that enables you to evaluate business cases and\/or opportunities and prioritize actions.&nbsp;<\/li><li>Open to feedback. You are able to pick up great ideas and can put forward suggestions based on feedback from internal and external sources.<\/li><li>Passion for insights. You continuously identify target audience insights, youth-focused trends, marketplace best practices\/opportunities, and competitive insights to translate into meaningful product updates and experiences.<\/li><li>A player-centric approach and understanding of the importance of maintaining a good understanding of the products, services and target audience.<\/li><li>Experience guiding consumer facing brand communications, including brand identity visuals, copy and videos..<\/li><\/ul><p><br><\/p><p><strong>What we offer you<\/strong><\/p><ul><li>A pretty sweet mission. We want to build quality games and entertainment experiences for girls and we take that vision very seriously. We strive to hit that mark every single day.<\/li><li>We may be a big group, but we\\u2019re a tight-knit team! A diverse team of friendly, fun, and supportive co-workers from 20 different countries!&nbsp;<\/li><li>We\\u2019re more than 50% female identifying! #YES to #WomenInTech!<\/li><li>Flexible working opportunities.<\/li><li>We\\u2019re known to throw good parties from time to time.<\/li><li>30 Vacation Days.<\/li><li>ITP1 Insurance plan.&nbsp;<\/li><li>Parental pay top up to 90%<\/li><li>5,000 SEK per year Health allowance.<\/li><\/ul><p><br><\/p><p>Curious to know more? Apply now! We\\u2019d love to talk to you!<\/p>\"}"
}