{
    "id":"Kaggle::techmap::6144b4a17ea9bc0ff35126c0::seek_au::2",
    "label_age":true,
    "analysis_age":"\"A role that will keep you active and fit\" could be seen as favouring younger candidates",
    "label_disability":true,
    "analysis_disability":"\"A role that will keep you active and fit\" could be seen as biased against anyone with a disability.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"About the business. Credo is a thriving and vibrant company delivering project solutions that enable retailers to execute change. Our customers are leading retailers, with national store networks across the country. We pride ourselves in finding good people who deliver quality and share a common goal. Working at Credo is all about teamwork. About the role. We are currently seeking General Hands with trade experience to facilitate change within retail outlets. Duties: New store and refurbishment internal fixturing works: Interior signage installation, registers and shelving fittings. Display and Point of Sale fixture builds. Trade qualification and experience with hand tools desirable. You will need to be fit, enthusiastic, able to take direction as well as have initiative. Hours of Work: Must be available Monday. Sunday for metropolitan and regional work, throughout Brisbane. Must be willing to travel to different locations for work (travel allowances will be provided where applicable). Shifts will be a combination of day and night works. Night shift: 6:00pm - 6:00am. Day shift: 6:00am- 6:00pm. weekend work will also be available. Benefits and perks. Excellent hourly rates and travel allowances. Rewarding work life – enjoyment from a collaborative team environment. Training and career progression provided. A role that will keep you active and fit. If this sounds like the job for you, apply now and we will be in contact with you! Skills and experience. White Card. Current drivers licence and reliable means of transportation, own car. Experience in construction industry is a MUST.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144b4a17ea9bc0ff35126c0::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Credo National 2 Pty Ltd\", \"position\": \"General Hands - Day & Night Shift- Logan and Surrounds\", \"notes\": \"\", \"original\": \"<p><strong>About the business<\/strong><\/p>  <p>Credo is a thriving and vibrant company delivering project solutions that enable retailers to execute change.Our customers are leading retailers,with national store networks across the country.We pride ourselves in finding good people who deliver quality and share a common goal.Working at Credo is all about teamwork.<\/p>  <p><strong>About the role<\/strong><\/p>  <p><strong>We are currently seeking\\u00a0General Hands with trade experience to facilitate change within retail outlets.<\/strong><\/p>  <p><strong>Duties:<\/strong><\/p>  <p>New store and refurbishment internal fixturing works:<\/p> <ul> <li>Interior signage installation, registers and shelving fittings<\/li> <li>Display and Point of Sale fixture builds<\/li> <li>Trade qualification and experience with hand tools desirable<\/li><\/ul> <p>You will need to be fit, enthusiastic, able to take direction as well as have initiative.<\/p>  <p><strong>Hours of Work:<\/strong><\/p> <ul> <li>Must be available Monday- Sunday for metropolitan and regional work, throughout Brisbane<\/li> <li>Must be willing to travel to different locations for work (travel allowances will be provided where applicable)<\/li> <li>Shifts will be a combination of day and night works<\/li> <li>Night shift: 6:00pm - 6:00am<\/li> <li>Day shift: 6:00am- 6:00pm<\/li> <li>weekend work will also be available.<\/li><\/ul> <p><strong>Benefits and perks<\/strong><\/p> <ul> <li>Excellent hourly rates and travel allowances<\/li> <li>Rewarding work life \\u2013 enjoyment from a collaborative team environment<\/li> <li>Training and career progression provided<\/li> <li>A role that will keep you active and fit<\/li><\/ul> <p>If this sounds like the job for you, apply now and we will be in contact with you!<\/p>  <p><strong>Skills and experience<\/strong><\/p> <ul> <li>White Card<\/li> <li>Own your own\\u00a0basic set of hand and power tools<\/li> <li>Current drivers licence and reliable means of transportation, own car<\/li> <li>Experience in construction industry is a MUST<\/li><\/ul> <p>\\u00a0<\/p>\"}"
}