{
    "id":"Kaggle::techmap::616f5c7e210ee81bafb85c28::linkedin_ie::10",
    "label_age":true,
    "analysis_age":"The phrase \"fast-based\" could be seen as implicitly biased in favour of younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". South Raleigh. Under general supervision, Admissions Officers are responsible for handling all aspects of the campus’ student recruitment efforts in a fast-paced, service and compliance-driven environment. This position is responsible for helping individuals interested in attending Strayer enroll in the University by responding to inquiries, interviewing prospective students over the phone and in person, conducting campus tours, and walking students through the entire application and enrollment process. This also includes partnering with other functions to provide prospective students with the information necessary to determine if Strayer would meet their educational needs, such as program offerings, financial options, and satisfying academic prerequisites. Essential Duties. Effectively respond to all prospective student inquiries. Set up face-to-face and\/or phone interview appointments and conduct campus tours as appropriate. Interview prospective students to determine their educational background and future goals and objectives. Educate prospective students on the benefits of attending Strayer University, including our high-quality academic programs, convenient locations, flexible online and on-campus course offerings, and recommend appropriate course(s) of study. Assist prospective students with the application process and review qualifications for admission. Enroll new students and ensure appropriate basis of admission is obtained, all prerequisites are satisfied, and previous college transcripts are ordered if applicable. Ensure prospective students’ admissions files are complete and assist students with initial registration process. Partner with other departments as necessary to finalize enrollment process, including SAS, SFS, Academics, and the University Registrar’s Office. Education. Bachelor’s degree or equivalent highly preferred. Work Experience. 2-5 years proven customer service and\/or sales experience highly preferred. Skills. Must be detail-oriented and have a focus on informing and assisting prospective students, and maintaining high ethical standards and attention to compliance with University policies and regulations. Must possess the energy and determination necessary to provide valuable and timely services to prospective and newly enrolling students. Must have strong computer skills (Excel, Power. Point, etc. ). Excellent oral and written communication skills. Certificates, Licenses And Registrations. None. Mobility. Must be able to travel 10% of time. Must be able to lift 10 lbs. Work Environment. Typical office setting. Physical And Mental Demands. Mobility within the office including movement from floor to floor. Travel via plane, car, and metro is required to perform this job. Access information using a computer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::616f5c7e210ee81bafb85c28::linkedin_ie\", \"source\": \"linkedin_ie\", \"country\": \"IE\", \"company\": \"Strayer University\", \"position\": \"Admissions Officer\", \"notes\": \"\", \"original\": \"<br><br>South Raleigh<br><br>Under general supervision, Admissions Officers are responsible for handling all aspects of the campus\\u2019 student recruitment efforts in a fast-paced, service and compliance-driven environment. This position is responsible for helping individuals interested in attending Strayer enroll in the University by responding to inquiries, interviewing prospective students over the phone and in person, conducting campus tours, and walking students through the entire application and enrollment process. This also includes partnering with other functions to provide prospective students with the information necessary to determine if Strayer would meet their educational needs, such as program offerings, financial options, and satisfying academic prerequisites.<br><br><strong><u>Essential Duties<br><\/u><\/strong><ul><li>Effectively respond to all prospective student inquiries.<\/li><li>Set up face-to-face and\/or phone interview appointments and conduct campus tours as appropriate.<\/li><li>Interview prospective students to determine their educational background and future goals and objectives.<\/li><li>Educate prospective students on the benefits of attending Strayer University, including our high-quality academic programs, convenient locations, flexible online and on-campus course offerings, and recommend appropriate course(s) of study.<\/li><li>Assist prospective students with the application process and review qualifications for admission.<\/li><li>Enroll new students and ensure appropriate basis of admission is obtained, all prerequisites are satisfied, and previous college transcripts are ordered if applicable.<\/li><li>Ensure prospective students\\u2019 admissions files are complete and assist students with initial registration process.<\/li><li>Partner with other departments as necessary to finalize enrollment process, including SAS, SFS, Academics, and the University Registrar\\u2019s Office.<\/li><li>Adhere to all University policies and procedures and federal, state, and accrediting agency rules with respect to recruitment.<br><\/li><\/ul><strong><u>Education<br><\/u><\/strong><ul><li>Bachelor\\u2019s degree or equivalent highly preferred.<br><\/li><\/ul><strong><u>Work Experience<br><\/u><\/strong><ul><li>2-5 years proven customer service and\/or sales experience highly preferred<br><\/li><\/ul><strong><u>Skills<br><\/u><\/strong><ul><li>Must be detail-oriented and have a focus on informing and assisting prospective students, and maintaining high ethical standards and attention to compliance with University policies and regulations.<\/li><li>Must possess the energy and determination necessary to provide valuable and timely services to prospective and newly enrolling students<\/li><li>Must have strong computer skills (Excel, PowerPoint, etc.)<\/li><li>Excellent oral and written communication skills<br><\/li><\/ul><strong><u>Certificates, Licenses And Registrations<br><\/u><\/strong><ul><li>None<br><\/li><\/ul><strong><u>Mobility<br><\/u><\/strong><ul><li>Must be able to travel 10% of time<\/li><li>Must be able to lift 10 lbs<br><\/li><\/ul><strong><u>Work Environment<br><\/u><\/strong><ul><li> Typical office setting<br><\/li><\/ul><strong><u>Physical And Mental Demands<br><\/u><\/strong><ul><li>Mobility within the office including movement from floor to floor<\/li><li>Travel via plane, car, and metro is required to perform this job.<\/li><li>Access information using a computer<\/li><li>Effectively communicate, both up and down the management chain<\/li><li>Effectively cope with stressful situations<\/li><li>Strong mental acuity<br><\/li><\/ul><em>If you require a reasonable accommodation to complete our application process, please contact our Human Resources Department at Careers@strategiced.com. <br><br><\/em>Posted Today Full time R14568<br><br><strong>At Strayer University, we\\u2019ve been educating working adults since 1892. That\\u2019s over 120 years of helping people earn their degrees and advance their lives. Today, we know working adults are busier than ever. That\\u2019s why we make education work with their schedule. Not the other way around. We offer convenient campus locations close to home or work in many states across the country, evening and weekend campus hours, and the flexibility to learn online, anytime. And we\\u2019re not just flexible. We\\u2019re accredited, respected, and recognized.<br><br><\/strong>We honor and celebrate diversity, equity, and inclusion as core institutional principles. We hold ourselves accountable for cultivating an innovative environment that reflects all stakeholders , building our foundation as a culturally competent, diverse organization .<br><br><em>Strayer University is an equal opportunity employer and employs qualified individuals regardless of race, religion, color, sex, national origin, age, disability, or any other classification proscribed under applicable law.<\/em>\"}"
}