{
    "id":"Kaggle::techmap::615719d697804c4b8c1faa78::linkedin_bo::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The terms \"requiring accurate perception of speech\" and \"Extensive use of keyboard requiring repetitive motion of fingers\", could inadvertently exclude candidates with certain disabilities related to hearing, speech, or physical dexterity, even if they are otherwise qualified for the role and could perform the essential functions with reasonable accommodations.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement for candidates to be \"Able to qualify for a major credit card, rent an automobile\" could be seen as exclusionary based on socio-economic factors or personal financial circumstances that may prevent a qualified candidate from meeting these criteria, even if they are otherwise well-suited for the role.",
    "verified":true,
    "synthetic":false,
    "text":" There may be additional tracking required as a result of CDRCs review. KNOWLEDGE, SKILLS AND ABILITIES: Strong knowledge of clinical research process, including working knowledge of all functional areas of clinical trials and medical terminology. Four. years of oncology experience and\/or medical device. Experience In Monitoring And\/or Coordinating Clinical Trials Required. Excellent written and verbal communication skills to express complex ideas to study personnel at research and clinical institutions. Demonstrated ability to form strong functional relationships. Excellent, presentation, organizational and interpersonal skills. Ability to interact with all levels of staff to coordinate\/execute study activities. Ability to handle several priorities within multiple, complex trials. Ability to reason independently and recommend specific solutions in clinical settings. Ability to work independently, prioritize, and work within a matrix team environment. Ability To Mentor Other CRAs And Co-monitor, As Required. Knowledge of electronic data capture including basic data processing functions. Knowledge of current GCP\/ICH guidelines applicable to the conduct of clinical research. Able to qualify for a major credit card, rent an automobile. For the Technical CTM role, the CRA must have a deep understanding of IQVIA Biotech systems with the ability to learn even more. PHYSICAL REQUIREMENTS: Very limited physical effort required to perform normal job duties. Extensive use of telephone and face-to-face communication requiring accurate perception of speech. Extensive use of keyboard requiring repetitive motion of fingers. Regular sitting for extended periods of time. MINIMUM RECRUITMENT STANDARDS: BS\/BA\/BSc (or equivalent) in one of the life sciences or health care background (RPh, RN, etc) and a minimum of four (4) years of monitoring\/site management experience is required. Or equivalent combination of education, training and experience. Prior Project Team Leadership Experience Preferred. Prior Clinical Research Organization (CRO) experience preferred. Working knowledge of budget management preferred. Must be able to travel domestically and internationally approximately 6585%. Valid drivers license. Computer skills including proficiency in use of Microsoft Word, Excel and Power. Point and use of a laptop computer. CLASSIFICATION (US): This position is classified as exempt under the Fair Labor Standards Act. Employees are not eligible for overtime compensation. CRAIBAJD. At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible  to help our customers create a healthier world.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615719d697804c4b8c1faa78::linkedin_bo\", \"source\": \"linkedin_bo\", \"country\": \"BO\", \"company\": \"IQVIA\", \"position\": \"Senior Clinical Research Associate, Internal Medicine (Central\/ West US) - IQVIA Biotech\", \"notes\": \"\", \"original\": \"<strong>IQVIA Biotech is now hiring a Sr Clinical Research Associate who specializes in Infectious disease. Should also have experience in at least 2 of the following 5 TAs: Infectious disease, diabetes\/endocrinology, ophthalmology, Cardiovascular, or CNS.<br><br><\/strong>This is for sites in Central and West Coast United States<br><br>BASIC FUNCTIONS:<br><br><br>Participates in the preparation and execution of Phase I-IV clinical trials. Oversees the progress of clinical investigations by conducting site evaluation, initiation, and interim close out visits to sites. Monitors clinical trials in accordance with Good Clinical Practices and procedures set forth by IQVIA Biotech and sponsors. Works closely with the Clinical Trial Manager (CTM) and\/or Lead CRA t0 ensure all monitoring activities are conducted according to study requirements. The Senior CRA may also serve in the Lead CRA role.<br><br>ESSENTIAL JOB FUNCTIONS, DUTIES AND RESPONSIBILITIES:<br><br><br>Participates in the investigator recruitment process. Performs site evaluation visits of potential investigators. Evaluates the capability of the site to successfully manage and conduct the clinical study.<br><br>Collaborates with the ISS department to coordinate activities with the site in preparation for the initiation of the study. Obtains regulatory documentation for successful implementation, monitoring, and evaluation of clinical trials. Works with ISS and site staff to obtain regulatory (IRB\/IEC) approval of study specific documents<br><br>Performs study initiation activities, reviewing with the site personnel the protocol, regulatory issues, study procedures, and provides training on completion of the eCRF; monitoring activities and study close-out activities.<br><br>Trains site staff on the EDC system and verifies site computer system.<br><br>Assists in resolving any issues to ensure compliance with site file audits in conjunction with ISS.<br><br>Assures adherence to Good Clinical Practices, investigator integrity, and compliance with all study procedures through on-site monitoring visits. Performs validation of source documentation as required by sponsor. Prepares monitoring reports and letters per the timelines defined in IQVIA Biotech SOPs by using approved IQVIA Biotech\/sponsor templates and reports.<br><br>Documents accountability, stability and storage conditions of clinical trial materials as required by sponsor. Performs investigational product inventory. Ensures return of unused materials to designated location or verifies destruction as required.<br><br>Reviews the quality and integrity of the clinical data through (1) in house review of electronic CRF data and (2) on-site source verification. Works with sites to resolve data queries.<br><br>May review protocols, eCRFs, study manuals and other related documents, as requested by the Clinical Trial Manager and\/or Lead CRA.<br><br>Serves as primary contact between IQVIA Biotech and investigator; coordinates all correspondence; ensures timely transmission of clinical data with the study site and technical reporting, as requested.<br><br>Performs study close-out visits per the study specific Clinical Monitoring Plan including final investigational product reconciliation and disposition, site study file reconciliation, data query resolution through to database lock and resolution of outstanding action items.<br><br>Assists with, and attends, Investigator Meetings for assigned studies.<br><br>Authorized to request site audits due to data integrity concerns.<br><br><strong><u>Attends Study-related, Company, Departmental, And External Meetings, As Required.<br><br><\/u><\/strong>Ensures internal and study-related trainings are completed per IQVIA Biotech and\/or study timelines; CTMS should always be current with the pertinent site updates\/contacts.<br><br>Ensures all study deliverables are completed per IQVIA Biotech and study timelines<br><br>Conducts Field Evaluation Visits and field training of CRA Is, IIs and other Sr. CRAs.<br><br>Serves as mentor for junior CRAs and those new to the company and\/or study.<br><br>Performs other duties, as requested.<br><br>LEAD CRA ESSENTIAL JOB FUNCTIONS, DUTIES AND RESPONSIBILITIES:<br><br><br>The Lead Clinical Research Associate may perform any of the following tasks:<br><br><br>Participate in the investigator recruitment process. Perform site evaluation visits, as needed, of potential investigators. Evaluates the capability of the site to successfully manage and conduct the clinical study.<br><br>Collaborate with the ISS department to coordinate activities with the site in preparation for the initiation of the study. Obtains regulatory documentation for successful implementation, monitoring, and evaluation of clinical trials. Works with ISS and site staff to obtain regulatory (IRB\/IEC) approval of study specific documents<br><br>Perform study initiation activities, reviewing with the site personnel the protocol, regulatory issues, study procedures, and provides training on completion of the eCRF; monitoring activities and study close-out activities.<br><br>Assists with, and attends, Investigator Meetings for assigned studies.<br><br>Train site staff on the EDC system and verify site computer system.<br><br>Assist in resolving any issues to ensure compliance with site file audits in conjunction with ISS.<br><br>Assure adherence to Good Clinical Practices, investigator integrity, and compliance with all study procedures through on-site monitoring visits. Performs validation of source documentation as required by sponsor. Prepares monitoring reports and letters per the timelines defined in IQVIA Biotech SOPs by using approved IQVIA Biotech\/sponsor templates and reports.<br><br>Document accountability, stability and storage conditions of clinical trial materials as required by sponsor. Performs investigational product inventory. Ensures return of unused materials to designated location or verifies destruction as required.<br><br>Review the quality and integrity of the clinical data through (1) in house review of electronic CRF data and (2) on-site source verification. Work with sites to resolve data queries.<br><br>May review draft protocols, eCRFs, monitoring reports and follow-up letters, study manuals and other prepare study-related documents and templates, as requested by the CTM and\/or PM.<br><br>May serve as primary contact between IQVIA Biotech and investigator; coordinates all correspondence; ensures timely transmission of clinical data with the study site and technical reporting, as requested.<br><br>Assist CTM and\/or PM in review of project budgets, monitoring costs, potential overruns and propose\/implement cost effective solutions.<br><br>Assist the study management in identifying and generating changes in scope<br><br>Perform study close-out visits per the study specific Clinical Monitoring Plan including final investigational product reconciliation and disposition, site study file reconciliation, data query resolution through to database lock and resolution of outstanding action items.<br><br>Authorized to request site audits due to data integrity concerns.<br><br><strong><u>Attends Study-related, Company, Departmental, And External Meetings, As Required.<br><br><\/u><\/strong>Ensure internal and study-related trainings are completed per IQVIA Biotech and\/or study timelines; CTMS should always be current with the pertinent site updates\/contacts.<br><br>Ensure all study deliverables are completed per IQVIA Biotech and study timelines<br><br>May conduct Field Evaluation Visits and field training of CRA Is, IIs and Sr CRAs.<br><br>Serve as mentor for junior CRAs and those new to the company and\/or study.<br><br>Participate in the performance appraisal program by providing timely and accurate feedback regarding the performance of a perspective CRA.<br><br>Review and approve CRA travel expenses and time sheets.<br><br>Perform other duties, as requested.<br><br>TECHNICAL CTM ESSENTIAL JOB FUNCTIONS, DUTIES AND RESPONSIBILITIES:<br><br><br>The Technical CTM may perform any of the following tasks for oncology studies:<br><br><br>Create master tracker(s) to house information generated from various reports such as:<br><br><br>and CM_Data_Cleaning_Report_By_Subject both Business Objects reports<br><br>Reconcile patients that have come off treatment and off study<br><br>Generate and review various IL2 reports<br><br>Works closely with CDRC to ensure data is further reviewed and discrepancies documented.<br><br>The Technical CTM may participate in CDRC review and aid in Patient Profile review, as necessary.<br><br>There may be additional tracking required as a result of CDRC\\u2019s review.<br><br>KNOWLEDGE, SKILLS AND ABILITIES:<br><br><br>Strong knowledge of clinical research process, including working knowledge of all functional areas of clinical trials and medical terminology.<br><br>Four+ years of oncology experience and\/or medical device.<br><br><strong><u>Experience In Monitoring And\/or Coordinating Clinical Trials Required.<br><br><\/u><\/strong>Excellent written and verbal communication skills to express complex ideas to study personnel at research and clinical institutions.<br><br>Demonstrated ability to form strong functional relationships.<br><br>Excellent, presentation, organizational and interpersonal skills.<br><br>Ability to interact with all levels of staff to coordinate\/execute study activities.<br><br>Ability to handle several priorities within multiple, complex trials.<br><br>Ability to reason independently and recommend specific solutions in clinical settings.<br><br>Ability to work independently, prioritize, and work within a matrix team environment.<br><br><strong><u>Ability To Mentor Other CRAs And Co-monitor, As Required.<br><br><\/u><\/strong>Knowledge of electronic data capture including basic data processing functions.<br><br>Knowledge of current GCP\/ICH guidelines applicable to the conduct of clinical research.<br><br>Able to qualify for a major credit card, rent an automobile<br><br>For the Technical CTM role, the CRA must have a deep understanding of IQVIA Biotech systems with the ability to learn even more.<br><br>PHYSICAL REQUIREMENTS:<br><br><br>Very limited physical effort required to perform normal job duties<br><br>Extensive use of telephone and face-to-face communication requiring accurate perception of speech<br><br>Extensive use of keyboard requiring repetitive motion of fingers<br><br>Regular sitting for extended periods of time<br><br>MINIMUM RECRUITMENT STANDARDS:<br><br><br>BS\/BA\/BSc (or equivalent) in one of the life sciences or health care background (RPh, RN, etc) and a minimum of four (4) years of monitoring\/site management experience is required; or equivalent combination of education, training and experience.<br><br><strong><u>Prior Project Team Leadership Experience Preferred.<br><br><\/u><\/strong>Prior Clinical Research Organization (CRO) experience preferred.<br><br>Working knowledge of budget management preferred.<br><br>Must be able to travel domestically and internationally approximately 65%-85%.<br><br>Valid driver\\u2019s license<br><br>Computer skills including proficiency in use of Microsoft Word, Excel and PowerPoint and use of a laptop computer<br><br>CLASSIFICATION (US):<br><br><br>This position is classified as exempt under the Fair Labor Standards Act; employees are not eligible for overtime compensation.<br><br>#CRAIBAJD<br><br>At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible \\u2013 to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70,000+ employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs.iqvia.com.<br><br>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other status protected by applicable law.<br><br>IQVIA, Inc. provides reasonable accommodations for applicants with disabilities. Applicants who require reasonable accommodation to submit an application for employment or otherwise participate in the application process should contact IQVIA\\u2019s Talent Acquisition team at workday_recruiting@iqvia.com to arrange for such an accommodation.<br><br>\"}"
}