{
    "id":"Kaggle::techmap::6144658021deaa373d529496::monsterasia_in::12",
    "label_age":true,
    "analysis_age":"Phrases \"digital natives\" and \"dexterity in utilizing technology\" could be seen as exclusionary in relation to older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase \"is motivated to take strong ownership on actions, to find innovative ways\" has masculine leaning connotations.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"Use of the phrase \"he\/she\" could be interpreted as exclusionary in relation to those that do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". NET Senior Engineer. Description. DXC Technology India is seeking great talent to join the Digital Design group. The Digital Design group works on latest and emerging digital technologies to bring to life large digital transformations for our clients. We look for candidates who are digital natives and demonstrate dexterity in utilizing technology to solve real world problems. The. NET Senior Support Engineer is an experienced multi-skilled professional, with experience in enhancements, maintenance & development of. NET applications. He\/she is a good team player, who is part of a team responsible for delivering end-to-end application services to customers. He\/she collaborates with professionals in the regional and worldwide DXC Application Services community to leverage modern solutions and brings. NET Senior expertise to ensure the customer Solution & Design. The main goal is to ensure DXC delivers application services and to continuously improve our maturity in processes and technology, resulting in best in class technology implementation. The Engineer is motivated to take strong ownership on actions, to find innovative ways to improve the services’ agility and efficiency, and to continuously gain more skills. As a team member, good exposure will be provided to you on latest technologies like, Microservices, API & Cloud native development. Responsibilities. Work in cross functional teams to drive effective creation of Minimum Viable Products that bring business value faster. Design, develop, test, deploy, maintain and improve software. Think creatively to solve the user problem with holistic and simple solution. Support to maintain and improve the application functionality. Drive best practices within teams with respect to coding standards and guidelines. Develops \/Write code and tests, deploy application functionality to meet requirement specification \/ In-Scope User Stories. Manage individual project priorities, deadlines and deliverables. Build products aligned to help our clients succeed in the industry. Ability to learn and adapt to new frameworks\/technologies. Ensure compliance with the documented software processes and procedures throughout the life cycle. Constantly review the code to ensure the quality of the design by avoiding complexity, advocating clarity and to do this with the team. Contribute to each step of the product development process from ideation to implementation to release using Dev. Ops best practices such as continuous Integration, Automated Testing and Continuous Delivery. Create software documentation and update existing documentation Implement best practices, standards and procedures including quality and delivery methodologies.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144658021deaa373d529496::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"DXC Technology India\", \"position\": \"NET Engineer (Cat3- Cat1+ React JS)\", \"notes\": \"\", \"original\": \"<b>.NET Senior Engineer<\/b><div><b><br>Description<\/b><br>DXC Technology India is seeking great talent to join the Digital Design group.<\/div><div><br>The Digital Design group works on latest and emerging digital technologies to bring to life large digital transformations for our clients. We look for candidates who are digital natives and demonstrate dexterity in utilizing technology to solve real world problems<\/div><div><br>The .NET Senior Support Engineer is an experienced multi-skilled professional, with experience in enhancements, maintenance & development of .NET applications. He\/she is a good team player, who is part of a team responsible for delivering end-to-end application services to customers. He\/she collaborates with professionals in the regional and worldwide DXC Application Services community to leverage modern solutions and brings .NET Senior expertise to ensure the customer Solution & Design<\/div><div><br>The main goal is to ensure DXC delivers application services and to continuously improve our maturity in processes and technology, resulting in best in class technology implementation<\/div><div><br>The Engineer is motivated to take strong ownership on actions, to find innovative ways to improve the services\\u2019 agility and efficiency, and to continuously gain more skills.<\/div><div><br>As a team member, good exposure will be provided to you on latest technologies like, Microservices, API & Cloud native development.<\/div><div><br><b> Responsibilities<\/b><br>\\u2022  Work in cross functional teams to drive effective creation of Minimum Viable Products that bring business value faster.<br>\\u2022  Design, develop, test, deploy, maintain and improve software.<br>\\u2022  Think creatively to solve the user problem with holistic and simple solution<br>\\u2022  Support to maintain and improve the application functionality<br>\\u2022  Drive best practices within teams with respect to coding standards and guidelines<br>\\u2022  Develops \/Write code and tests, deploy application functionality to meet requirement specification \/ In-Scope User Stories<br>\\u2022  Manage individual project priorities, deadlines and deliverables.<br>\\u2022  Build products aligned to help our clients succeed in the industry<br>\\u2022  Ability to learn and adapt to new frameworks\/technologies<br>\\u2022  Ensure compliance with the documented software processes and procedures throughout the life cycle<br>\\u2022  Constantly review the code to ensure the quality of the design by avoiding complexity, advocating clarity and to do this with the team<br>\\u2022  Contribute to each step of the product development process from ideation to implementation to release using DevOps best practices such as continuous Integration, Automated Testing and Continuous Delivery<br>\\u2022  Create software documentation and update existing documentation Implement best practices, standards and procedures including quality and delivery methodologies<\/div><div><br><\/div><div><br><b>Desired Skills and Qualifications<\/b><br>\\u2022  Degree in Computer Science or Information Technology-related field (or equivalent combination of education and experience)<br>\\u2022  Should have expertise in .NET such as OOPS concepts, Exception handling, collections, Data structure and algorithms<br>\\u2022  Hands on experience in Net Framework, C#, .NET, ASP.NET MVC, Web API frameworks, & VB.NET<br>\\u2022  Hands on experience in ReactJS<br>\\u2022  Hands on experience in front end technologies, Bootstrap, JQuery, Javascript, HTML, XML<br>\\u2022  Hands on experience in SQL Server & Oracle Database<br>\\u2022  Good Oral and written communication<br>\\u2022  DevOps & Agile methodology experience, working with small agile teams with strong ownership and drive<br>\\u2022  Experience working in both Agile and Waterfall software development environments<br>\\u2022  Adaptable to work in shift to provide partial coverage for EMEA and US timezones<\/div><div><br><\/div><div><br><b>Nice to have skills:<\/b><br>\\u2022  Knowledge \/ Development experience on Cloud \\u2013 Azure<br>\\u2022  Experience of one or more high level managed frameworks (React.JS, Angular.JS)<br>\\u2022  Knowledge in Linux\/Unix Environment, BASH Shell Scripting, Setup\/Scheduling (i.e., Autosys).<\/div><div><br><\/div><div><br><b>About DXC Technology<\/b><br>DXC Technology (NYSE: DXC) is the world\\u2019s leading independent, end-to-end IT services company, helping clients harness the power of innovation to thrive on change. Created by the merger of CSC and the Enterprise Services business of Hewlett Packard Enterprise, DXC Technology serves nearly 6,000 private and public sector clients across 70 countries. The company\\u2019s technology independence, global talent and extensive partner alliance combine to deliver powerful next-generation IT services and solutions. DXC Technology is recognized among the best corporate citizens globally. For more information, visit www.dxc.technology.<\/div><div><br>Please note the above statements describe the general nature and level of work only. They are not a complete list of all required responsibilities, duties and skills. Other duties may be added, or this description amended at any time.<\/div><div><br><\/div><div><br><b> Please Note<\/b><br>To satisfy our contractual obligations with clients, the candidate will be required to pass standard Criminal Records checks. Additional background checks may be required by certain customers. You will also be required to agree to DXC\\u2019s Confidentiality, Non-Solicitation, and Conflict of Interest Agreements.<\/div><div><br>DXC Technology is an Equal Opportunity\/Affirmative Action employer. All qualified candidates will receive consideration for employment without regard to disability, protected veteran status, race, color, religious creed, national origin, marital status, sex, sexual orientation\/gender identity, age (40 or over), or genetic information. DXC's commitment to diversity and inclusive selection practices includes ensuring qualified long-term unemployed job seekers receive equal consideration for employment.<\/div><div><br>Accommodation of special needs for qualified candidates may be considered within the framework of the DXC Accommodation Policy.<\/div><div><br><\/div><div><br>Job \\u2013 Services \\u2013 DXC Level 4<\/div><div><br>Primary Location \\u2013 IN<\/div><div><br>Schedule - Full-time<\/div><div><br>Shift \\u2013 Occasional shift work required<\/div><div><br>Travel \\u2013 Yes; 10% or less<\/div>\"}"
}