{
    "id":"Kaggle::techmap::6148370e29a7677d65c25a53::monster_cz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" LEGO Trading  Associate Brand Manager. Location. Czech Republic, Praha 8, Praha. Job ID CZ3037. Category. Marketing. Language EN. We are looking for Associate Brand Manager to join an international company LEGO. Associate Brand Manager will be responsible for planning marketing campaigns, implementing new portfolio of products as well. as setting strategic direction based on global recommendations. Do you want to develop your professional skills in the successfull company? Are you fluent in English and Czech? Do you have perfect communication and presentation skills? This opportunity is for you! JOB DESCRIPTION. Set strategic direction for LEGO communication towards girls audiences based on global and regional recommendations. Plan and implement marketing campaigns across different touchpoints (TV, digital, Social Media, PR, influencers, events, print) in close touch with local media agency. Actively work with dedicated product portfolio in order to recruit new consumers. Jointly with trade team drive impactful BTL activations at our key retail partners (ecom, grocery, toy specialists). Plan dedicated LEGO themes (Friends, Disney Princess, DOTS) sales performance and act to deliver the plan. CANDIDATE PROFILE. University degree. 4 years experience in the Brand Marketing field of a international global company is required. Fluent in English and Czech\/Slovak (B2). Analytical skills  being able to analyse an impact of marketing campaigns and identify key learnings and actions. Ambitious profile with strong communication and presentation skills. Hands-on, independent and flexible working style. Knowledge of MS Office and ability to learn new software systems. WE OFFER. 5 weeks of holiday. Meal vouchers  100 CZK\/ working day. 5 sick days. Opportunity to develop your professional skills daily. 50% discount for LEGO products. Possiblity to work from home. Modern office are located nearby city centre. CONTACT INFORMATION. Do you want to get more information about this position? Please, send us your CV in Czech and English and we will contact you. Follow the link: httpswww. manpower. cz\/hledam-praci\/detail-pozice\/? idposition31846.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148370e29a7677d65c25a53::monster_cz\", \"source\": \"monster_cz\", \"country\": \"CZ\", \"company\": \"The LEGO Group\", \"position\": \"LEGO Trading \\u2013 Associate Brand Manager - The LEGO Group\", \"notes\": \"\", \"original\": \"LEGO Trading \\u2013 Associate Brand Manager <br> <br> <br>+ <strong>Location<\/strong> <br> <br>+ - Czech Republic, Praha 8, Praha <br> <br>+ <strong>Job ID<\/strong> CZ3037 <br> <br>+ <strong>Category<\/strong> <br> <br>+ - Marketing <br> <br>+ <strong>Language<\/strong> EN <br> <br> <br><strong>We are looking for Associate Brand Manager to join an international company LEGO.<\/strong> <br> <br>Associate Brand Manager will be responsible for planning marketing campaigns, implementing new portfolio of products as well. as setting strategic direction based on global recommendations.Do you want to develop your professional skills in the successfull company? <br> <br>Are you fluent in English and Czech? <br> <br>Do you have perfect communication and presentation skills? This opportunity is for you! <br> <br><strong>JOB DESCRIPTION<\/strong> <br> <br> <br>\\u2022 Set strategic direction for LEGO communication towards girls audiences based on global and regional recommendations <br> <br>\\u2022 Plan and implement marketing campaigns across different touchpoints (TV, digital, Social Media, PR, influencers, events, print) in close touch with local media agency <br> <br>\\u2022 Actively work with dedicated product portfolio in order to recruit new consumers <br> <br>\\u2022 Jointly with trade team drive impactful BTL activations at our key retail partners (ecom, grocery, toy specialists) <br> <br>\\u2022 Plan dedicated LEGO themes (Friends, Disney Princess, DOTS) sales performance and act to deliver the plan <br> <br> <br><strong>CANDIDATE PROFILE<\/strong> <br> <br> <br>\\u2022 University degree <br> <br>\\u2022 4 years experience in the Brand Marketing field of a international global company is required <br> <br>\\u2022 Fluent in English and Czech\/Slovak (B2+) <br> <br>\\u2022 Analytical skills \\u2013 being able to analyse an impact of marketing campaigns and identify key learnings and actions <br> <br>\\u2022 Ambitious profile with strong communication and presentation skills <br> <br>\\u2022 Hands-on, independent and flexible working style <br> <br>\\u2022 Knowledge of MS Office and ability to learn new software systems <br> <br> <br><strong>WE OFFER<\/strong> <br> <br> <br>\\u2022 5 weeks of holiday <br> <br>\\u2022 Meal vouchers \\u2013 100 CZK\/ working day <br> <br>\\u2022 5 sick days <br> <br>\\u2022 Opportunity to develop your professional skills daily <br> <br>\\u2022 50% discount for LEGO products <br> <br>\\u2022 Possiblity to work from home <br> <br>\\u2022 Modern office are located nearby city centre <br> <br> <br>CONTACT INFORMATION <br> <br> <br>Do you want to get more information about this position? Please, send us your CV in Czech and English and we will contact you. <br> <br> <br>Follow the link: https:\/\/www.manpower.cz\/hledam-praci\/detail-pozice\/?id_position=31846\"}"
}