{
    "id":"Kaggle::techmap::614d250f463aa27e3dae2d7f::seek_au::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Randstad is seeking a storeperson \/ General labourers for an ongoing position that will look to move to permanancy. This role requires someone who is a hard worker, able to work in a team and independently, reliable and is available for full-time hours Monday. Friday with possible overtime. Responsibilities: Pick\/packing all orders for the day and having them prepared for pick up. Stack deliveries as required. use of forklift. Manual lifting of products up to 20kgs. Load and unload containers and freight. Maintain warehouse cleanliness. Customer service and advising on products. Ensure correct protocol is followed when stacking, pick\/packing. Selection Criteria: Experience in a similar role. Forklift licence ( advantage ). Car and license. be reliable. Looking for a long term career option. Good in personal and communication skills. Physically fit ( lifting upto 20kg ). Please apply now or alternatively you can send your resume to ***@randstad. com. au. At Randstad, we are passionate about providing equal employment opportunities and embracing diversity to the benefit of all. We actively encourage applications from any background.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d250f463aa27e3dae2d7f::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Randstad - Industrial\", \"position\": \"storeperson \/ General labourer\", \"notes\": \"\", \"original\": \"<p>Randstad is seeking a storeperson \/ General labourers for an ongoing position that will look to move to permanancy. This role requires someone who is a hard worker, able to work in a team and independently, reliable and is available for full-time hours Monday - Friday with possible overtime. <\/p><p> <\/p><p><strong>Responsibilities:<\/strong><\/p><ul><li>Pick\/packing all orders for the day and having them prepared for pick up<\/li><li>Stack deliveries as required - use of forklift<\/li><li>Manual lifting of products up to 20kgs<\/li><li>Load and unload containers and freight<\/li><li>Maintain warehouse cleanliness<\/li><li>Customer service and advising on products<\/li><li>Ensure correct protocol is followed when stacking, pick\/packing<\/li><\/ul><p><strong>Selection Criteria:<\/strong><\/p><ul><li>Experience in a similar role<\/li><li>Forklift licence ( advantage ) <\/li><li>Car and license - be reliable<\/li><li>Looking for a long term career option<\/li><li>Good in personal and communication skills<\/li><li>Physically fit ( lifting upto 20kg )<\/li><\/ul><p>Please apply now or alternatively you can send your resume to sean.rooney@randstad.com.au<\/p><p>At Randstad, we are passionate about providing equal employment opportunities and embracing diversity to the benefit of all. We actively encourage applications from any background.<\/p>\"}"
}