{
    "id":"Kaggle::techmap::6148cae5b806655655a7feb0::cvlibrary_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Protocol are currently working closely with a Further Education college based in Stoke-on-Trent in their search for an Engineering Lecturer to deliver on their level 3 engineering courses. As an Engineering Teacher, you will primarily provide high-quality teaching within the Engineering Department on Engineering courses to a range of learners including full time, part time and apprentices, and in addition to undertaking associated tutorial duties. This is an exciting position with the possibility of progressing to take the Curriculum Coordinator role within the department. This role is offering full time hours and will run on a permanent basis. Do you have what it takes? Level 3 teaching qualification or higher. Recent and relevant industrial experience within Engineering. Recent and relevant teaching experience at levels 1-3. If this sounds like you or something you would like more information about, Hit apply now to speak to one of the consultants! About Protocol. Protocol are the specialist full-service recruiter dedicated to education, training and skills. People are at the heart of everything we do. We place people first. We're more than a recruitment agency. we pride ourselves on our ongoing support and aftercare delivered by our expert team, and all our candidates benefit from free access to our exclusive online CPD portal, Learning Zone. Whatever your career goals, we've got the right role for you. With a wide range of temporary and permanent positions available, from lecturing and training jobs. The legal bit. Protocol National ltd trading as Protocol are acting as an employment agency for this vacancy. As a result of the volume of applications we are currently receiving we regret that we may be unable to respond with individual feedback.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148cae5b806655655a7feb0::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Protocol\", \"position\": \"Engineering Lecturer\", \"notes\": \"\", \"original\": \"Protocol are currently working closely with a Further Education college based in Stoke-on-Trent in their search for an Engineering Lecturer to deliver on their level 3 engineering courses. <br><br>As an Engineering Teacher, you will primarily provide high-quality teaching within the Engineering Department on Engineering courses to a range of learners including full time, part time and apprentices, and in addition to undertaking associated tutorial duties. This is an exciting position with the possibility of progressing to take the Curriculum Coordinator role within the department.<br><br>This role is offering full time hours and will run on a permanent basis. <br><br>Do you have what it takes? <br><br>Level 3 teaching qualification or higher<br>Recent and relevant industrial experience within Engineering <br>Recent and relevant teaching experience at levels 1-3<br>If this sounds like you or something you would like more information about, Hit apply now to speak to one of the consultants! <br><br>About Protocol<br><br>Protocol are the specialist full-service recruiter dedicated to education, training and skills. People are at the heart of everything we do. We place people first.<br><br>We&#39;re more than a recruitment agency - we pride ourselves on our ongoing support and aftercare delivered by our expert team, and all our candidates benefit from free access to our exclusive online CPD portal, Learning Zone.<br><br>Whatever your career goals, we&#39;ve got the right role for you. With a wide range of temporary and permanent positions available, from lecturing and training jobs<br><br>The legal bit...<br><br>Protocol National ltd trading as Protocol are acting as an employment agency for this vacancy. As a result of the volume of applications we are currently receiving we regret that we may be unable to respond with individual feedback. If we have not contacted you within two weeks of your application being received then regretfully your application will not be taken forward on this occasion.\"}"
}