{
    "id":"Kaggle::techmap::6159f83b18f7cb1aa2ceeb2a::monsterasia_sg::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The masculine pronoun \"he\" introduces a male bias.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Property Manager. Established facilities management company. Salary  AWS. 5 day work week. Our client is a leading and established facilities management company and is looking for an experienced Facility Manager to manage a mall. This person will report to the General Manager and assist to lead and supervise a team of Property Executives for them to carry out their functions and duties assigned effectively. He will supervise a team on daily works and do inspection on the works including liaising and supervising with the contractors. He will also recommend and implement the improvements and attend to feedback, complaints and services by the clients. Job responsibilities :. Ability to manage a team of Property Executives. Ability to ensure the team carry out their functions and duties assigned including supervising the contractors. Ability to perform and oversee daily activities of facilities management operations. Ability to suggest and provide advisory on facilities management matters including improvement maintenance\/improvement works etc. Ability to do inspection on routine maintenance\/improvement works. Ability to develop, implement, review and maintain regime and process review at the same time. Ability to oversee the works and carry out works with minimum disruption to the building operation. Ability to work independent and cohesively with various stakeholders for the management and maintenance of the facilities management operations. Ability to handle feedback, complaints and services requested by clients. Ability to establish and maintain good rapport and partnership with relevant agencies and contractors. Job requirements :. Candidates to possess a minimum Degree Qualification in Building \/Estate Management \/ Real Estate \/ Engineering or related discipline. Minimum 3 years of working experience with strong practical background with knowledge of real estate management operations with township experience and 8-10 years of managerial experience in real estate management. A strong team leader to manage the property executives with good interpersonal and organisation skills. Ability to work and handle work pressure with a positive and can-do work attitude. An independent contributor and ability to multi-task and working in the fast-paced and team-based working environment. Good organisation skills and able to track overlapping tasks and assignments, with frequent priority changes. Good knowledge of accounting, contracts administration, legislations and statutory requirements with regards to township properties. Good working aptitude for managing changes and uncertainties whenever required and able to work beyond normal working hours\/weekends\/public holiday. Good customer service oriented mindset to serve the clients.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6159f83b18f7cb1aa2ceeb2a::monsterasia_sg\", \"source\": \"monsterasia_sg\", \"country\": \"SG\", \"company\": \"Gough Recruitment (singapore) Pte. Ltd.\", \"position\": \"Property Manager\", \"notes\": \"\", \"original\": \"<div><p><strong>Property Manager<\/strong><\/p><p><br><\/p><p>\\u2022 Established facilities management company<br>\\u2022 Salary + AWS<br>\\u2022 5 day work week<\/p><p><br><\/p><p>Our client is a leading and established facilities management company and is looking for an experienced Facility Manager to manage a mall.<\/p><p>This person will report to the General Manager and assist to lead and supervise a team of Property Executives for them to carry out their functions and duties assigned effectively.<\/p><p><br><\/p><p>He will supervise a team on daily works and do inspection on the works including liaising and supervising with the contractors.<\/p><p><br><\/p><p>He will also recommend and implement the improvements and attend to feedback, complaints and services by the clients.<br><strong>Job responsibilities :<\/strong><\/p><p><br><\/p><p>\\u2022 Ability to manage a team of Property Executives<br>\\u2022 Ability to ensure the team carry out their functions and duties assigned including supervising the contractors.<br>\\u2022 Ability to perform and oversee daily activities of facilities management operations.<br>\\u2022 Ability to suggest and provide advisory on facilities management matters including improvement maintenance\/improvement works etc.<br>\\u2022 Ability to do inspection on routine maintenance\/improvement works.<br>\\u2022 Ability to develop, implement, review and maintain regime and process review at the same time.<br>\\u2022 Ability to oversee the works and carry out works with minimum disruption to the building operation.<br>\\u2022 Ability to work independent and cohesively with various stakeholders for the management and maintenance of the facilities management operations.<br>\\u2022 Ability to handle feedback, complaints and services requested by clients.<br>\\u2022 Ability to establish and maintain good rapport and partnership with relevant agencies and contractors<\/p><p><br><\/p><p><strong>Job requirements :<\/strong><\/p><p><br><\/p><p>\\u2022 Candidates to possess a minimum Degree Qualification in Building \/Estate Management \/ Real Estate \/ Engineering or related discipline.<br>\\u2022 Minimum 3 years of working experience with strong practical background with knowledge of real estate management operations with township experience and 8-10 years of managerial experience in real estate management.<br>\\u2022 A strong team leader to manage the property executives with good interpersonal and organisation skills<br>\\u2022 Ability to work and handle work pressure with a positive and can-do work attitude<br>\\u2022 An independent contributor and ability to multi-task and working in the fast-paced and team-based working environment<br>\\u2022 Good organisation skills and able to track overlapping tasks and assignments, with frequent priority changes.<\/p><p>\\u2022 Good knowledge of accounting, contracts administration, legislations and statutory requirements with regards to township properties.<\/p><p>\\u2022 Good working aptitude for managing changes and uncertainties whenever required and able to work beyond normal working hours\/weekends\/public holiday.<br>\\u2022 Good customer service oriented mindset to serve the clients<br>\\u2022 Ability to work on tight time-line and handle work pressure with a positive and can-do work attitude<\/p><p><br><\/p><p>To express your interest for the role, send your application through this advertisement :<\/p><p><br><\/p><p><strong>Elaine Goh (Reg. ID R198405)<br>Vice President<br>Gough Recruitment (EA Lic. No 11C3753)<\/strong><\/p><p><strong>Phone : 92272183<br>Email : [HIDDEN TEXT]<\/strong><\/p><p><br><\/p><p>To receive job opportunities that suit as soon as they become available, set up a Job Alert on our website :<\/p><p>http:\/\/www.goughrecruitment.com\/member\/createjobalert.aspx<\/p><\/div>\"}"
}