{
    "id":"Kaggle::techmap::6137b5717d4ffc16c87fe0d7::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"A nursing coordinator need not have the physical abilities noted in the description.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"PURPOSE OF THIS POSITION. Coordinates total nursing care for patients. Participates inpatient and family teaching and provides leadership by working cooperatively in maintaining standards for professional nursing practice in the clinical setting. JOB DUTIES\/RESPONSIBILITIES. Duty 1: Uses the nursing process to assess, plan, implement, and evaluate patient care to provide for the unique physical and emotional needs of each patient. Duty 2: Establishes and maintains communication, and utilizes teaching opportunities to provide for the specific learning needs of each patient and their significant other(s). Duty 3: Demonstrates knowledge and skills necessary to provide age appropriate care to the patients served on their unit. Duty 4: Collaborates with Physician regarding patient condition, orders, treatment plan, and anticipated needs to ensure exceptional patient care. Duty 5: Demonstrates accountability and leadership in the performance of LPN’s, Nurse Aides, Orderlies, and Secretaries to ensure quality of patient care and promotion of team collaboration. Duty 6: Complies with organizational policies, procedures, and practices to ensure quality job performance and hospital compliance. Duty 7: Maintains all department and unit specific competencies for provision of patient care. REQUIRED QUALIFICATIONS. Licensed by the Ohio Board of Nursing as a Registered Nurse. BLS (within 5 weeks of hire). Maximum exposure in regard to universal precautions. Positive service-oriented interpersonal and communication skills. The individual must demonstrate knowledge of the principles of growth and development over the life span and possess the ability to assess data reflective of the patient status and interpret the appropriate information needed to identify each patient’s requirements relative to their age-specific needs and to provide the care needed as described in the area’s policies and procedures under the direction of the Medical Director. PREFFERED QUALIFICATIONS. 2 year of general nursing experience. Previous psychiatric experience. Certification in psychiatric, mental health nursing. PHYSICAL DEMANDS. This position requires a full range of body motion with intermittent activities in walking, sitting, lifting, bending, squatting, climbing, kneeling, twisting and standing. The associate will be required to lift 50 pounds or more. This position requires individuals to lift work above the Shoulder. The associate must have corrected vision and hearing in the normal range. Individual must have excellent verbal communication skills to perform daily tasks.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137b5717d4ffc16c87fe0d7::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Blanchard Valley Hospital\", \"position\": \"RN - Orchard Hall\", \"notes\": \"\", \"original\": \"<p><strong>PURPOSE OF THIS POSITION<\/strong><\/p> <p>Coordinates total nursing care for patients. Participates inpatient and family teaching and provides leadership by working cooperatively in maintaining standards for professional nursing practice in the clinical setting.<\/p> <p><strong>JOB DUTIES\/RESPONSIBILITIES<\/strong><\/p> Duty 1: Uses the nursing process to assess, plan, implement, and evaluate patient care to provide for the unique physical and emotional needs of each patient. Duty 2: Establishes and maintains communication, and utilizes teaching opportunities to provide for the specific learning needs of each patient and their significant other(s). Duty 3: Demonstrates knowledge and skills necessary to provide age appropriate care to the patients served on their unit. Duty 4: Collaborates with Physician regarding patient condition, orders, treatment plan, and anticipated needs to ensure exceptional patient care. Duty 5: Demonstrates accountability and leadership in the performance of LPN\\u2019s, Nurse Aides, Orderlies, and Secretaries to ensure quality of patient care and promotion of team collaboration. Duty 6: Complies with organizational policies, procedures, and practices to ensure quality job performance and hospital compliance. Duty 7: Maintains all department and unit specific competencies for provision of patient care. <p><strong>REQUIRED QUALIFICATIONS<\/strong><\/p> <ul> <li>Licensed by the Ohio Board of Nursing as a Registered Nurse<\/li> <li>BLS (within 5 weeks of hire)<\/li> <li>Maximum exposure in regard to universal precautions.<\/li> <li>Positive service-oriented interpersonal and communication skills<\/li> <li>Individual must be able to demonstrate the knowledge and skills necessary to provide care appropriate to the age of the patient served on his\/her assigned unit\/department. The individual must demonstrate knowledge of the principles of growth and development over the life span and possess the ability to assess data reflective of the patient status and interpret the appropriate information needed to identify each patient\\u2019s requirements relative to their age-specific needs and to provide the care needed as described in the area\\u2019s policies and procedures under the direction of the Medical Director.<\/li> <\/ul> <p><strong>PREFFERED QUALIFICATIONS<\/strong><\/p> <ul> <li>2 year of general nursing experience<\/li> <li>Previous psychiatric experience<\/li> <li>Certification in psychiatric, mental health nursing<\/li> <\/ul> <p><strong>PHYSICAL DEMANDS<\/strong><\/p> <p>This position requires a full range of body motion with intermittent activities in walking, sitting, lifting, bending, squatting, climbing, kneeling, twisting and standing. The associate will be required to lift 50 pounds or more. This position requires individuals to lift work above the Shoulder. The associate must have corrected vision and hearing in the normal range. Individual must have excellent verbal communication skills to perform daily tasks.<\/p> <p><strong>This position is classified at risk for possible occupational exposure to bloodborne pathogens (HBV, HIV, etc.)<\/strong><\/p> <p><strong>*BVHS PRN<\/strong><\/p>&nbsp;\"}"
}