{
    "id":"Kaggle::techmap::6131c24d566a6c33572024bf::britishjobs_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Butlin's is looking for new recruits to come and join them. We offer £9.38\/hour on completion of training. If you enjoy working with others, are ready to learn something new, roll up your sleeves, get stuck in and have some fun. we might have your next job waiting for you. Working at Butlin's accommodation department means being part of a big-hearted team of people who are responsible for providing our guests with an altogether more fun and entertaining holiday. We know that It takes a team effort to put on the show here and we're looking for like minded people who -. like to work as part of a team. are comfortable and confident to talk to our guests. are comfortable to work in a busy environment and can dial up the energy when it is required. Have a positive outlook and a 'can do' attitude. Can deliver a high level of service and will always strive to exceed the guest's expectations. As an accommodation team member, you will be responsible for preparing our guests accommodation, this is after all going to be a family's home for the duration of their holiday, so you need to ensure it is to the highest standard of cleanliness to make a great first impression. You will need to be able to maintain high standards of cleanliness including cleaning bathrooms, vacuuming and bed making. Report any maintenance issues. We need to turn the Accommodation around in just a few hours, so keeping to a tight deadline is crucial. Normal Working hours: You must be available to work on our check-in days which are a Monday and Friday. A normal working day would be 9am until 5pm, however we may be able to offer flexibility to support school hours, further options will be discussed at the interview. We think working at Butlin's is a pretty special place to be and here are just a few of the benefits for working with us: Resort discounts on food and drink in our retail outlets. Free use of many of the resort facilities for you, and significantly discounted rate for your friends and family. Subsidised OFSTED Nursery facilities available on resort. Discounted Bourne Leisure holidays for you, your family and friends. Free parking on resort.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6131c24d566a6c33572024bf::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Butlin's\", \"position\": \"Cleaner\", \"notes\": \"\", \"original\": \"Butlin&#39;s is looking for new recruits to come and join them.<br><br>We offer &pound;9.38\/hour on completion of training  <br><br>If you enjoy working with others, are ready to learn something new, roll up your sleeves, get stuck in and have some fun - we might have your next job waiting for you.<br>Working at Butlin&#39;s accommodation department means being part of a big-hearted team of people who are responsible for providing our guests with an altogether more fun and entertaining holiday.<br><br>We know that It takes a team effort to put on the show here and we&#39;re looking for like minded people who - <br>like to work as part of a team.<br>are comfortable and confident to talk to our guests. <br>are comfortable to work in a busy environment and can dial up the energy when it is required.<br>Have a positive outlook and a &#39;can do&#39; attitude.<br>Can deliver a high level of service and will always strive to exceed the guest&#39;s expectations.<br><br>As an accommodation team member, you will be responsible for preparing our guests accommodation, this is after all going to be a family&#39;s home for the duration of their holiday, so you need to ensure it is to the highest standard of cleanliness to make a great first impression. <br><br>You will need to be able to maintain high standards of cleanliness including cleaning bathrooms, vacuuming and bed making. <br>Report any maintenance issues.<br>We need to turn the Accommodation around in just a few hours, so keeping to a tight deadline is crucial. <br><br>Normal Working hours:<br>You must be available to work on our check-in days which are a Monday and Friday. A normal working day would be 9am until 5pm, however we may be able to offer flexibility to support school hours, further options will be discussed at the interview. <br><br>We think working at Butlin&#39;s is a pretty special place to be and here are just a few of the benefits for working with us:<br><br>Resort discounts on food and drink in our retail outlets. <br>Free use of many of the resort facilities for you, and significantly discounted rate for your friends and family.<br>Subsidised OFSTED Nursery facilities available on resort<br>Discounted Bourne Leisure holidays for you, your family and friends<br>Free parking on resort <br>Reward and recognition schemes including long service and team member of the month as well as lots of other team incentives.<br><br>If you think you have what it takes to come and be part of our team, we&#39;d love to hear from you.<br><br>\"}"
}