{
    "id":"Kaggle::techmap::61378826830f2823e922ec61::monster2_nl::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" FunctieomschrijvingAre you looking for a fulltime or parttime job? Do you like working in a nice team and are you looking for something for a long period of time? Than you should definitely read on! Sano. Rice in Veenendaal is looking for you in the function as packer! At Sano. Rice we produce various rice crackers, so read on and join our team! what we offer€12, 33 per hour excl. allowancesprospect of a permanent contract at Sano. Ricetill 39% allowancesfulltime jobworking in 3 shiftsday off on every Saturday & Sundaywho are you. You like to get things done! You enjoy working with your colleagues, but you can also work independently. Do you have experience as a production employee (in the food industry)? We certainly see that as an advantage! you are willing to work in three shifts (working hours from 6 a. m. to 2 p. m., 2 p. m. to 10 p. m. and 10 p. m. to 6 a. m. ). You are physically fit. You have your own transport. You master the English or Dutch language. what will you do. As a packer at Sano. Rice you work together with your colleagues in the production section. Every kind of rice cracker will be there. you ensure that these different rice cakes are all packed in the right way. Consider, for example, chocolate rice crackers, square rice crackers, multigrain rice crackers or corn crackers. Everything will pass! You're in luck, because the temperature at Sano. Rice is nice and the environment where you work is clean and tidy. What are you waiting for? Sign up and together we will ensure a great time at SanoRice. working with colleagues. Working with different types of rice crackers. Work in a neat and clean environment with a normal temperature. Work according to a fixed schedule, so you can plan your private appointments well next to your work. where will you workSanoRice in Veenendaal makes different types of rice crackers. Sano. Rice can offer you a structural workplace so that you can work for a longer period of time, if you perform your work well you are even eligible to receive a permanent contract. Together we would like to look at the possibilities to offer you training and there are even possibilities to increase your salary after 26 weeks worked. Do you want to grow? We also offer these options at Sano.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61378826830f2823e922ec61::monster2_nl\", \"source\": \"monster2_nl\", \"country\": \"NL\", \"company\": \"Randstad\", \"position\": \"Packer\", \"notes\": \"\", \"original\": \"<b>Functieomschrijving<\/b>Are you looking for a fulltime or parttime job? Do you like working in a nice team and are you looking for something for a long period of time? Than you should definitely read on! SanoRice in Veenendaal is looking for you in the function as packer! At SanoRice we produce various rice crackers, so read on and join our team!what we offer\\u20ac12,33 per hour excl. allowancesprospect of a permanent contract at SanoRicetill 39% allowancesfulltime jobworking in 3 shiftsday off on every Saturday &amp; Sundaywho are youYou like to get things done! You enjoy working with your colleagues, but you can also work independently. Do you have experience as a production employee (in the food industry)? We certainly see that as an advantage!you are willing to work in three shifts (working hours from 6 a.m. to 2 p.m., 2 p.m. to 10 p.m. and 10 p.m. to 6 a.m.);you are physically fit;you have your own transport;you master the English or Dutch language.what will you doAs a packer at SanoRice you work together with your colleagues in the production section. Every kind of rice cracker will be there. you ensure that these different rice cakes are all packed in the right way. Consider, for example, chocolate rice crackers, square rice crackers, multigrain rice crackers or corn crackers. Everything will pass! You're in luck, because the temperature at SanoRice is nice and the environment where you work is clean and tidy. What are you waiting for? Sign up and together we will ensure a great time at SanoRice.working with colleagues;working with different types of rice crackers;work in a neat and clean environment with a normal temperature;work according to a fixed schedule, so you can plan your private appointments well next to your work.where will you workSanoRice in Veenendaal makes different types of rice crackers. SanoRice can offer you a structural workplace so that you can work for a longer period of time, if you perform your work well you are even eligible to receive a permanent contract. Together we would like to look at the possibilities to offer you training and there are even possibilities to increase your salary after 26 weeks worked. Do you want to grow? We also offer these options at SanoRice, such as a position as operator.prospect of permanent employment;fixed working hours;grow to become operator.job applicationDo you already see yourself working as a packer among the rice crackers at SanoRice in Veenendaal? Then apply immediately! Do you have a few questions first? Please contact me by email or give me a call. After a telephone introduction, we introduce you to SanoRice so that you can get a tour and get started as soon as possible! Uiteraard staat deze vacature open voor iedereen die zich hierin herkent.<b>Sollicitatieprocedure<\/b>Je maakt een 'mijn Randstad' account aan om te kunnen reageren op onze vacatures. Dit doe je automatisch wanneer je voor het eerst een sollicitatie afrond bij Randstad, heel eenvoudig dus. Via je 'mijn Randstad' account beheer je gemakkelijk je gegevens en gaan je volgende sollicitaties nog sneller!\"}"
}