{
    "id":"Kaggle::techmap::61311bbdaded7d5536f23721::reed_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Are you looking to make an immediate impact at a company that welcomes bold and diverse thinking? Our client is currently looking for a Product Manager to join their team in Sweden and build their future solutions. The company. Our client is at a transformational moment in their company journey as they continue to find ways to strengthen their award-winning culture and accelerate innovation, creativity, and growth. Their purpose is to help their customers grow the most valuable relationships in business by uncovering truth and meaning in data. Global companies of all sizes rely on their data to transform their businesses. The role. As Product Manager, you’ll be responsible for driving our clients’ core credit offering in the Nordic market. Within this role, you will lead a product team and set the direction of developing leading products, the strategic plans and vision for the Nordic market and other countries. Responsibilities include: Understanding and executing the product roadmap and the core offering. Working with product development, value proposition and USPs to fulfil objects. Becoming the leading expert in the company for their core credit products. Understanding the customer journey and their needs across the markets. Ensuring product-market fit is reached for new products and features. The requirements. You’ll have at least 5+ years’ experience in a product management role. Other requirements include: Degree educated in Business, Engineering, Computer Science or similar. Proven track record in product management, ideally in the credit space. A passion for analytics, digitalization, and data. Business-oriented and agile. A problem-solver with a positive can-do attitude. Experience working in cross-functional teams. Excellent communication skills both written and verbal. Professional Swedish and English language skills. Important information. Reference number: 10567. FMC contact for this role: Liz Rainey.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61311bbdaded7d5536f23721::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"FMC Global Talent\", \"position\": \"Product Manager\", \"notes\": \"\", \"original\": \"<p>Are you looking to make an immediate impact at a company that welcomes bold and diverse thinking? Our client is currently looking for a Product Manager to join their team in Sweden and build their future solutions.<\/p> <p><strong>The company <\/strong><\/p> <p>Our client is at a transformational moment in their company journey as they continue to find ways to strengthen their award-winning culture and accelerate innovation, creativity, and growth. Their purpose is to help their customers grow the most valuable relationships in business by uncovering truth and meaning in data. Global companies of all sizes rely on their data to transform their businesses. <br><\/p> <p><strong>The role <\/strong><\/p> <p>As Product Manager, you\\u2019ll be responsible for driving our clients\\u2019 core credit offering in the Nordic market. Within this role, you will lead a product team and set the direction of developing leading products, the strategic plans and vision for the Nordic market and other countries. <br><\/p> <p><em>Responsibilities include: <\/em><\/p> \\n<ul> \\n <li> <p>Understanding and executing the product roadmap and the core offering <\/p> <\/li>\\n <li> <p>Working with product development, value proposition and USPs to fulfil objects <\/p> <\/li>\\n <li> <p>Becoming the leading expert in the company for their core credit products <\/p> <\/li>\\n<\/ul> \\n<ul> \\n <li> <p>Understanding the customer journey and their needs across the markets <\/p> <\/li>\\n <li> <p>Ensuring product-market fit is reached for new products and features <\/p> <\/li>\\n<\/ul> <p><strong>The requirements <\/strong><\/p> <p><em>You\\u2019ll have at least 5+ years\\u2019 experience in a product management role. Other requirements include: <\/em><\/p> \\n<ul> \\n <li> <p>Degree educated in Business, Engineering, Computer Science or similar <\/p> <\/li>\\n <li> <p>Proven track record in product management, ideally in the credit space <\/p> <\/li>\\n <li> <p>Strong knowledge and understanding of PSD2 <\/p> <\/li>\\n <li> <p>A passion for analytics, digitalization, and data <\/p> <\/li>\\n <li> <p>Business-oriented and agile <\/p> <\/li>\\n<\/ul> \\n<ul> \\n <li> <p>A problem-solver with a positive can-do attitude <\/p> <\/li>\\n <li> <p>Experience working in cross-functional teams <\/p> <\/li>\\n <li> <p>Excellent communication skills both written and verbal <\/p> <\/li>\\n <li> <p>Professional Swedish and English language skills <\/p> <\/li>\\n<\/ul> <p><strong>Important information <\/strong><\/p> <p>Reference number: 10567 <\/p> <p>FMC contact for this role: Liz Rainey<\/p>\"}"
}