{
    "id":"Kaggle::techmap::613243b515a94643b5e15067::monsterasia_in::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The use of the term \"he\/she\" can be seen as exclusionary by those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Description. Requestor name : Nirupama Saxena. JD . Collateral Management. Senior Java Developer. Role: The role is for an excellent Senior Java Developer to contribute to projects for technical enhancements and functional changes within the Collateral Management IT department. The successful candidate will be working with highly motivated professionals who take pride in the quality of their output and this will be expected to be continued. He\/She will be involved in the full Software Development Lifecycle applying Agile methodologies, tools and techniques. For this role the candidate is required to have, as equal priorities, very good Java and SQL skills. Responsibilities: The responsibilities of the candidate include the following, though note this is not an exhaustive list:. Reviewing functional specifications. Contributing to design the best solution that meets the functional needs while respecting the overall workflow of the existing application. Writing technical specifications. Writing\/Amending code that conforms to the best practice standards, both documented and de-facto. Unit testing every produced or changed code. Following the team's Software Configuration Management process with the highest discipline. Supporting User Acceptance Testing, proactively ensuring that the applications and the environments are in an optimal state, and promptly reacting to any issue or difficulty. Ensuring that all pertinent actions are diligently taken during the release process and that the related documentation is available and updated. Escalation of barriers to progress via his\/her team leader in a timely and succinct manner. Providing Technical guidance to other developers assisting other team members in design related discussions. Provide L3 support on rotation basis covering London timezone till 9.30 PM IST on normal days and on public holidays. Project Background: The bank is in the process of significantly enhancing its Collateral Management solution. Currently the solution integrates a number of systems that rely on different technologies i. e., web application, databases, scripts and third party products. The bank is committed to satisfying client needs and new demands coming from users and regulators. Preferred business skills: Good knowledge of financial markets concepts, terminology and practice, including the collateral management business. Essential technical skills: We expect the successful candidate to: Have excellent proven knowledge of the following technologies:. Java Core, 1.7 or above. Database development, SQL and Stored Procedures in Sybase or Oracle. Web development, MVC patter with Struts or similar, JSP, XML, AJAX. Hibernate, Spring framework. JUnit, mocking techniques (e. g., easymock, jmock, mockito,. )",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613243b515a94643b5e15067::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"Hexaware\", \"position\": \"Java Full Stack Engineer - Professional\", \"notes\": \"\", \"original\": \"<br>Job Description<br>Requestor name : Nirupama Saxena<br>JD :-<br>Collateral Management - Senior Java Developer<br><b>Role:<\/b><br>The role is for an excellent Senior Java Developer to contribute to projects for technical enhancements and functional changes within the Collateral Management IT department.<br>The successful candidate will be working with highly motivated professionals who take pride in the quality of their output and this will be expected to be continued.<br>He\/She will be involved in the full Software Development Lifecycle applying Agile methodologies, tools and techniques.<br>For this role the candidate is required to have, as equal priorities, very good Java and SQL skills.<br><b>Responsibilities:<\/b><br>The responsibilities of the candidate include the following, though note this is not an exhaustive list:<br>?Reviewing functional specifications.<br>?Contributing to design the best solution that meets the functional needs while respecting the overall workflow of the existing application.<br>?Writing technical specifications.<br>?Writing\/Amending code that conforms to the best practice standards, both documented and de-facto.<br>?Unit testing every produced or changed code.<br>?Following the team's Software Configuration Management process with the highest discipline.<br>?Supporting User Acceptance Testing, proactively ensuring that the applications and the environments are in an optimal state, and promptly reacting to any issue or difficulty.<br>?Ensuring that all pertinent actions are diligently taken during the release process and that the related documentation is available and updated.<br>?Escalation of barriers to progress via his\/her team leader in a timely and succinct manner.<br>?Providing Technical guidance to other developers assisting other team members in design related discussions<br>?Provide L3 support on rotation basis covering London timezone till 9.30 PM IST on normal days and on public holidays.<br><b>Project Background:<\/b><br>The bank is in the process of significantly enhancing its Collateral Management solution. Currently the solution integrates a number of systems that rely on different technologies i.e., web application, databases, scripts and third party products.<br>The bank is committed to satisfying client needs and new demands coming from users and regulators.<br><b>Preferred business skills:<\/b><br>Good knowledge of financial markets concepts, terminology and practice, including the collateral management business.<br><b>Essential technical skills:<\/b><br>We expect the successful candidate to:<br>Have excellent proven knowledge of the following technologies:<br>?Java Core, 1.7 or above.<br>?Database development, SQL and Stored Procedures in Sybase or Oracle.<br>?Web development, MVC patter with Struts or similar, JSP, XML, AJAX.<br>?Hibernate, Spring framework<br>?JUnit, mocking techniques (e.g., easymock, jmock, mockito,..)<br>?Experience with continuous integration and versioning control tools.<br>?Knowledge of Agile methodologies e.g., TDD, XP, Scrum.<br>Knowledge of the following technologies would be desirable:<br>?IntelliJ or Eclipse.<br>?WebWork, FreeMarker.<br>?Subversion, Hudson.<br>?Groovy and Shell scripting.<br>?HTML and CSS.<br>?Tomcat.<br>?Selenium.<br>?Business Object.<br>Be able to demonstrate experience of understanding complex systems, analysing and resolving issues.<br><b>Essential personality skills:<\/b><br>Good interpersonal and communication skills.<br>Be self-driven,able to work under pressure, in a sometimes challenging environment, and to work to deadlines.<br>Providing Technical guidance to other developers assisting other team members in design related discussions<br>Pro-active in rearranging his\/her priorities and resolving issues where requested<br>Be able to work as part of a team.<br>Be able to articulate technical issues and solutions to non technical members of the team.<br><b>Location:<\/b><br>Based in Mumbai.\"}"
}