{
    "id":"Kaggle::techmap::61447e8770d0ad15aec84f21::linkedin_cr::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"Competitive salary\" - this has been shown to decrease diversity in the candidate pool.",
    "verified":true,
    "synthetic":false,
    "text":" We are a transparent company both internally and externally and do not believe in operating in \"stealth mode. \" Lastly, we don't work 60 hour weeks, and don't expect you to either. In this role you will have a great deal of responsibility, earn a competitive salary and benefits, and contribute to the development of groundbreaking technology. Responsibilities. Train and assist customers with Pyka Pelican flight operations and maintenance. Work closely with Pyka's engineering team to report technical and operational issues and suggest improvements. Install and test avionics software upgrades. Collect data and run tests in the field to troubleshoot issues and find solutions. Preferred Qualifications. Experience with software development and version control. Experience with Linux OS. Experience with mechanical, electrical and robotic systems. Passion for aviation. Strong physical intuition. Experience tinkering with things in the real world. Great communication skills. Fluent in English and Spanish. Highly detail oriented and comfortable in unfamiliar situations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61447e8770d0ad15aec84f21::linkedin_cr\", \"source\": \"linkedin_cr\", \"country\": \"CR\", \"company\": \"Pyka\", \"position\": \"Applications Engineer\", \"notes\": \"\", \"original\": \"Pyka is looking for an Applications Engineer to join our commercial launch team in Costa Rica . You will be the hands-on interface between Pyka's customers operating our autonomous agricultural aircraft in Costa Rica and Pyka's engineering teams in California.<br><br>Your primary objectives will be to:<br><ul><li>Support our launch customers with flight operations, maintenance, and training.<\/li><li>Provide essential feedback to Pyka's engineering teams to drive product improvements. <\/li><li>Develop and iterate on the systems necessary to maintain a fleet of autonomous electric aircraft.<br><br><\/li><\/ul>This is an operational role, and you will spend most of your time in the field participating in flight operations. During your first weeks you will join our flight test team to train and learn the ins and outs of the Pyka Pelican aircraft, before working alongside our customers at their operation sites.<br><br><strong><u>About Pyka<br><br><\/u><\/strong>At Pyka we develop autonomous electric aircraft to provide people with an affordable and safe air transport option for regional trips. We're building a future where everyone can visit a friend, partner, family member, or colleague in a nearby city by air --- where the trip is a beautiful, traffic-free, and environmentally responsible adventure.<br><br>To get there, we're taking a different approach than most. We're applying our technologies to every industry where electric aircraft can be useful, starting with the highest value and most dangerous jobs. In doing so, we're building useful, game-changing products manufactured at scale, while perfecting the safety, reliability, and capabilities of our autonomy engine and electric propulsion systems.<br><br>Today, we supply our aircraft to agricultural service providers and farmers as an autonomous tool that makes aerial crop protection safer, more targeted and less harmful to surrounding environments. Our vehicles are highly economical to operate and easy to deploy. What you work on at Pyka makes people's lives better now and brings the future of electric aviation one-step closer each day.<br><br>We design, develop and manufacture an ecosystem of core-technologies including proprietary flight control software, avionics, high power density motors, motor controllers, batteries, and custom carbon-fiber composite airframes. Our full-stack team is from Wisk, Joby Aviation, Waymo, Google[x], and Saildrone.<br><br>We foster a welcoming community within our company that promotes experimentation, asking questions, making simple solutions to complex problems, and expressing different views and opinions. We are a transparent company both internally and externally and do not believe in operating in \\\"stealth mode.\\\" Lastly, we don't work 60 hour weeks, and don't expect you to either. In this role you will have a great deal of responsibility, earn a competitive salary and benefits, and contribute to the development of groundbreaking technology.<br><br><strong><u>Responsibilities<br><\/u><\/strong><ul><li>Train and assist customers with Pyka Pelican flight operations and maintenance<\/li><li>Work closely with Pyka's engineering team to report technical and operational issues and suggest improvements<\/li><li>Install and test avionics software upgrades<\/li><li>Collect data and run tests in the field to troubleshoot issues and find solutions<br><br><\/li><\/ul><strong><u>Preferred Qualifications<br><\/u><\/strong><ul><li>Experience with software development and version control<\/li><li>Experience with Linux OS<\/li><li>Experience with mechanical, electrical and robotic systems<\/li><li>Passion for aviation<\/li><li>Strong physical intuition<\/li><li>Experience tinkering with things in the real world<\/li><li>Great communication skills<\/li><li>Fluent in English and Spanish<\/li><li>Highly detail oriented and comfortable in unfamiliar situations<\/li><\/ul>\"}"
}