{
    "id":"Kaggle::techmap::6154e7073cce3a2912ddfd33::linkedin_kr::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Is an escalation channel in the local account team. Gets involved if issues (technical & non-technical) cannot be resolved by normal functional channel and ensures the appropriate priority given to the issue. Balances the customers needs verses ASML's resource\/priority. Education. Bachelor degree or above in related field. Experience. More than 15 years in related area. Experience in Semi-industry is preferred. Personal skills. Proven organizational skills to alignmultiple stakeholders. Excellent Customer Relationship Skills. Exceptional strategic thinking, determinespriorities and organizes actions effectively. Strongly influences all levels of theorganization: able to motivate, drive, steer and convince others. Excellent communication and PresentationSkills. Ability to explain complextechnical matters in simple terms. Ability to escalate and effectivelycommunicate to upper management, including Executive Committee (ExCom)with the insight of impact on business and options for solutions. Fluency in English.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6154e7073cce3a2912ddfd33::linkedin_kr\", \"source\": \"linkedin_kr\", \"country\": \"KR\", \"company\": \"ASML\", \"position\": \"SK Hynix Sales Account Manager\", \"notes\": \"\", \"original\": \"<strong>Introduction<br><br><\/strong><strong>Job Description<br><br><\/strong><ul><li>Manages multi-level activities related to regional accounts or for segments of global accounts to positively impact customer relationships, and future growth in products. <\/li><li>Assists in the development and implementation of strategic business plans. Takes a leadership role in managing company resources to ensure total customer satisfaction.<br><br><\/li><\/ul>Commercial Responsibility<br><br>Accountable for site\/account level execution of VPA(volume purchasing agreement), Systems Sales, Enhancements, Options and Upgrades<br><br><ul><li> Develops customer specific product sales\/marketing strategies in a dynamic commercial environment<\/li><li> Gathers and communicates customer and market information to ASML management, BL\\u2019s and marketing, including competition<\/li><li> Negotiation and closure of site\/account level commercial agreements - aligned with the business manager (as applicable)<\/li><li> Development and entry of accurate site\/account level sales forecast\\u2013 to be rolled up to business manager (as applicable)<\/li><li> Ensures that site\/account level quotations, orders and all other customer communication are to be handled promptly and accurate<\/li><li> Manage site\/account level sales order to closure (quote to cash)<br><br><\/li><\/ul>Business management and Operational Responsibility<br><br>Business Alignment &amp; Relationship Development :<br><br><ul><li> Manages business alignment for customer accounts by identifying gaps in customer expectation and ASML\\u2019s offerings and working to reduce those gaps.<\/li><li> Develops and maintains an excellent customer relationship to ensure ASML\\u2019s position as the continued vendor of choice. This is accomplished by creating strong interface between multiple levels of the customer and ASML including engineering, purchasing, planning, R&amp;D \/ D&amp;E, management,<br><br><\/li><\/ul>operations, accounting, finance, product groups and marketing, corporate auditors, deal structure team, legal\/contract, etc.<br><br><ul><li> Conveys a strong understanding of the customer\\u2019s expectation; recognizes the business linkages and strategies with present and future customers\\u2019 needs effectively to ensure customer satisfaction and account profitability.<\/li><li> Proactively looks for ways to improve value, quality and service to customers through appropriate relationships and feedback mechanisms.<br><br><\/li><\/ul>Business Goals &amp; Strategy:<br><br><ul><li> Helps to develop clear goals and success factors directly linked to the achievement of business strategies long\/short term for applicable accounts.<\/li><li> Ensures ASML strategies are translated into specific objectives, action plans and metrics for the Local Account.<\/li><li> Assigns clear accountabilities to the Local Account Team by providing appropriate guidance.<\/li><li> Proactively looks for ways to improve value, quality, and service to existing customers through appropriate relationships and feedback mechanisms.<\/li><li> Looks for ways to develop and build potential new customers and markets for ASML products.<br><br><\/li><\/ul>Account Escalation Support:<br><br><ul><li> Responsible for operational success, strategic alignment and integration of activities with CS to ensure integrated customer account management.<\/li><li> Is an escalation channel in the local account team.<\/li><li> Gets involved if issues (technical &amp; non-technical) cannot be resolved by normal functional channel and ensures the appropriate priority given to the issue.<\/li><li> Balances the customer\\u2019s needs verses ASML's resource\/priority<br><br><\/li><\/ul><strong>Education<br><br><br><\/strong><ul><li>Bachelor degree or above in related field<br><\/li><\/ul> <strong>Experience<br><br><\/strong><ul><li>More than 15 years in related area. <\/li><li>Experience in Semi-industry is preferred. <br><\/li><\/ul> <strong>Personal skills<br><br><br><\/strong><ul><li>Proven organizational skills to alignmultiple stakeholders<\/li><li>Excellent Customer Relationship Skills<\/li><li>Exceptional strategic thinking, determinespriorities and organizes actions effectively <\/li><li>Strongly influences all levels of theorganization: able to motivate, drive, steer and convince others.<\/li><li>Excellent communication and PresentationSkills.Ability to explain complextechnical matters in simple terms. <\/li><li>Ability to escalate and effectivelycommunicate to upper management, including Executive Committee (ExCom)with the insight of impact on business and options for solutions.<\/li><li>Fluency in English<br><\/li><\/ul>\"}"
}