{
    "id":"Kaggle::techmap::615b2005ddb0a50139a03106::linkedin_ie::1",
    "label_age":true,
    "analysis_age":"\"Recent graduates\" will dissuade older graduates from applying.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Who we are. With TCS you will be exposed to the future of technology, work with some of the brightest global minds in the industry, and support many of the biggest brands in the UK and worldwide. Recognized as an employer of choice, having won numerous awards in the UK and Ireland, TCS is a fast-growing global IT powerhouse at the forefront of innovation and transformation. What we need . We are looking for Graduate Cyber Security Engineer. Job Purpose and Primary Objectives: TCS Letterkenny is offering a Graduate Programme for cyber-savvy graduates who are enthusiastic about pursuing a career in information security. Recent graduates and post-graduates with a minimum 2:1 degree in Forensics, IT, computer science or an alternative cyber tech-related subject are encouraged to apply. Prerequisite requirements for selection include: A deep interest and passion for cyber technology and an ability to speak knowledgeably about the subject. An enquiring and innovative mindset and willingness to raise and explore new ideas. Curiosity and a desire to learn and meet new challenges. A technical aptitude for Cyber Security. Key responsibilities: Learning about the role's responsibilities and functions within a Threat Center Or Security Operations Center. Supporting the implementation, management, monitoring and upgrading of security measures for the protection of the organizations data, systems and networks. Involvement in troubleshooting security and network problems. Participating in the change management process. Testing and identifying network and system vulnerabilities. Daily administrative tasks including reporting and communication. Technical Skills: Fundamental Computer Forensics Skills. An Understanding of Hacking. A certification in Comp. Tia Network. or Security. is desirable but not essential. Other Skills. Resourcefulness. Analytical and problem-solving skills. Ability to work as part of a team. Attention to detail. Strong communication skills. Potential start date: October 2021. What you get. TCS is one of the fastest growing companies in the UK & Ireland. Joining TCS at this pivotal time will expose you to numerous domains and projects. We are consistently voted number one in customer satisfaction and Top Employer in the UK and globally. We provide competitive salaries which include pension, health care, life insurance, laptop, phone, access to extensive training resources, and discounts within the larger Tata network.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615b2005ddb0a50139a03106::linkedin_ie\", \"source\": \"linkedin_ie\", \"country\": \"IE\", \"company\": \"Tata Consultancy Services\", \"position\": \"Graduate Cyber Security Engineer\", \"notes\": \"\", \"original\": \"<p><strong>Who we are<\/strong><\/p><p>With TCS you will be exposed to the future of technology, work with some of the brightest global minds in the industry, and support many of the biggest brands in the UK and worldwide. Recognized as an employer of choice, having won numerous awards in the UK and Ireland, TCS is a fast-growing global IT powerhouse at the forefront of innovation and transformation.<\/p><p><br><\/p><p><strong>What we need\\u202f<\/strong><\/p><p>We are looking for\\u202f<strong>Graduate Cyber Security Engineer<\/strong><\/p><p><br><\/p><p><strong>Job Purpose and Primary Objectives:<\/strong><\/p><p>TCS Letterkenny is offering a Graduate Programme for cyber-savvy graduates who are enthusiastic about pursuing a career in information security.<\/p><p>Recent graduates and post-graduates&nbsp;with a minimum 2:1 degree in Forensics, IT, computer science or an alternative cyber tech-related subject are encouraged&nbsp;to apply.&nbsp;Prerequisite requirements for selection include:<\/p><ul><li>A deep interest and passion for cyber technology and an ability to speak knowledgeably about the subject&nbsp;<\/li><li>An enquiring and innovative mindset and willingness to raise and explore new ideas&nbsp;<\/li><li>Curiosity and a desire to learn and meet new challenges<\/li><li>A technical aptitude for Cyber Security<\/li><\/ul><p><br><\/p><p><strong>Key responsibilities:<\/strong><\/p><ul><li>Learning about the role's responsibilities and functions within a Threat Center Or Security&nbsp;Operations Center<\/li><li>Supporting the implementation, management, monitoring and upgrading of&nbsp;security measures for the protection of the organizations data, systems and&nbsp;networks<\/li><li>Involvement in troubleshooting security and network problems<\/li><li>Participating in the change management process<\/li><li>Testing and identifying network and system vulnerabilities<\/li><li>Daily administrative tasks including reporting and communication&nbsp;<\/li><li>&nbsp;<\/li><\/ul><p><strong>Technical&nbsp;Skills:<\/strong><\/p><ul><li>Knowledge of Security Across Various Platforms.<\/li><li>Fundamental Computer Forensics&nbsp;Skills<\/li><li>An Understanding of Hacking.<\/li><li>A certification in&nbsp;CompTia&nbsp;Network + or Security+ is desirable but not essential<\/li><\/ul><p><br><\/p><p><strong>Other Skills<\/strong><\/p><ul><li>Resourcefulness<\/li><li>Analytical and problem-solving skills<\/li><li>Ability to work as part of a team<\/li><li>Attention to detail<\/li><li>Strong communication&nbsp;skills<\/li><\/ul><p><br><\/p><p><strong>Potential start date:<\/strong><\/p><p>October 2021&nbsp;<\/p><p><br><\/p><p><strong>What you get<\/strong><\/p><p>TCS is one of the fastest growing companies in the UK &amp; Ireland. Joining TCS at this pivotal time will expose you to numerous domains and projects. We are consistently voted number one in customer satisfaction and Top Employer in the UK and globally.<\/p><p>We provide competitive salaries which include pension, health care, life insurance, laptop, phone, access to extensive training resources, and discounts within the larger Tata network.<\/p><p>Our internal volunteering and social network allowing you to take at least one paid volunteering day per year, as well as take part in social networks, Health and wellness initiatives such as fit4life and purpose4life internal sports events, we also sponsor Marathons internationally, Initiatives in mental health, LGBTQ among other diversity and inclusion awareness and support<\/p><p><br><\/p><p>Due to a high volume of applications, we will be unable to contact each applicant individually regarding the status of their application. If you have not received a direct response within 30 days, then the application should be deemed unsuccessful.<\/p>\"}"
}