{
    "id":"Kaggle::techmap::6137aea17d4ffc16c87f9f47::careerbuilder_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" $3000 Driver Retention Bonus Payout! $1000 paid out after 30, 60, and 90 days while being employed! Terms and conditions may apply to qualify. SUMMARY: To contribute to your areas sales objectives by transporting and delivering products to stores and supermarkets on your assigned route in a safe and efficient manner. RESPONSIBILITIES: The following responsibilities are general duties that a particular employee in this position may or may not be required to perform. The actual duties required of this position will vary. Obtain routing information, stops and customer billing daily. Organize route. Transport products to the customers and unload product from truck. Merchandise product where required. Collect money from billing if required. Performs other job-related duties as assigned. EXPERIENCE, EDUCATION, CERTIFICATION: Required: 6 months commercial truck driving experience, including standard transmission (if applicable). Valid Class B CDL with air brakes endorsement. As verified by a current MVR\/driver abstract, must meet all qualifications as defined under DOT Regulation 49 CFR 383.51. Must meet Company Driver MVR Qualification Standards. Must be experienced with working with a Pallet Jack, Store Dolly and Store Jacks. Preferred: Related training or certification. Experience working in a team environment. We do not provide application status due to overwhelming volume. If your skills meet our needs, we will contact you to move forward in the process. EOE without regard to race, color, religion, creed, affectional or sexual orientation or sex, national origin, ancestry, age, disability, genetics, veteran status, gender, gender identity, citizenship status, marital status, VEVRAA Federal Contractor. If you have a disability and you need an accommodation to apply, please contact the Sr. Director of Talent and Development at [Phone number shown when applying] ext. 2975.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137aea17d4ffc16c87f9f47::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Beverage Distribution Center, Inc.\", \"position\": \"Delivery Driver - CDL Class B (Glen Burnie)\", \"notes\": \"\", \"original\": \"<p><strong> <strong> <strong>***$3000 Driver Retention Bonus Payout!***<br \/>***<\/strong><\/strong> <strong> <strong>$1000 paid out after 30, 60, and 90 days while being employed!***<\/strong><\/strong><\/strong> <br \/> <strong> <strong>***Terms and conditions may apply to qualify***<\/strong><\/strong> <br \/> <br \/> <strong>SUMMARY: <\/strong> <br \/> <br \/>To contribute to your areas sales objectives by transporting and delivering products to stores and supermarkets on your assigned route in a safe and efficient manner.<br \/> <br \/> <strong>RESPONSIBILITIES:<\/strong> <br \/>The following responsibilities are general duties that a particular employee in this position may or may not be required to perform. The actual duties required of this position will vary.<br \/> <\/p><ul><li>Obtain routing information, stops and customer billing daily.<\/li><li>Organize route.<\/li><li>Transport products to the customers and unload product from truck.<\/li><li>Merchandise product where required.<\/li><li>Collect money from billing if required.<\/li><li>Performs other job-related duties as assigned.<\/li><\/ul><p><br \/> <br \/> <strong>EXPERIENCE, EDUCATION, CERTIFICATION:<\/strong> <br \/> <br \/> <strong>Required:<\/strong> <\/p><ul><li>6 months commercial truck driving experience, including standard transmission (if applicable).<\/li><li>Valid Class B CDL with air brakes endorsement. As verified by a current MVR\/driver abstract, must meet all qualifications as defined under DOT Regulation 49 CFR 383.51.<\/li><li>Must meet Company Driver MVR Qualification Standards.<\/li><li>Must be experienced with working with a Pallet Jack, Store Dolly and Store Jacks.<\/li><\/ul><p><br \/> <br \/> <strong>Preferred:<\/strong> <\/p><ul><li>Related training or certification.<\/li><li>Experience working in a team environment.<\/li><\/ul><p><br \/> <br \/> <strong>* We do not provide application status due to overwhelming volume. If your skills meet our needs, we will contact you to move forward in the process.*<\/strong> <br \/> <br \/> <strong>**EOE without regard to race, color, religion, creed, affectional or sexual orientation or sex, national origin, ancestry, age, disability, genetics, veteran status, gender, gender identity, citizenship status, marital status, VEVRAA Federal Contractor.**<br \/> <br \/>***If you have a disability and you need an accommodation to apply, please contact the Sr. Director of Talent and Development at [Phone number shown when applying] ext. 2975*** <\/strong><\/p>&nbsp;\"}"
}