{
    "id":"Kaggle::techmap::615002628130f2048c8eef8c::aarp_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"About Us. Napleton Automotive Group owns and operates 55. retail automotive dealerships in eight states. Our group employs 3, 500 people nationwide and has rental car facilities, body shops, and a large real estate portfolio as well. Napleton ranked as 13th out of top 150 automotive groups in the U. S. for 2020 based on new car volume. Napleton's Ellwood City Chrysler Dodge Jeep Ram dealership is looking to fill this position which will be responsible for processing vehicles for registration. What We Offer:. Family Owned and Operated. Free Collage Tuition For Employees and Family. Growth Opportunities. Medical, Dental, and Vision Insurance. Accrued Vacation Time. Employee vehicle purchase plans. * 401K and additional benefits. Job Responsibilities. Check and communicate oil level to other teammates. Ensure tire pressure for proper inflation. Inspect and refill fluid levels as necessary. Complete vehicle inspection. Install a new oil drain plus and a new oil filter. Clean and lubricate fittings as needed. Ensure that the service center is clean and presentable. Other duties as assigned. Job Requirements. High School diploma or equivalent. Automotive technical training or experience, a plus. Valid in-state driver's license and clean driving record. Willingness to undergo a background check in accordance with local law\/regulations. Physical Demands. Frequent bending, reaching, standing, walking, carrying, kneeling, pushing, pulling.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615002628130f2048c8eef8c::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Ed Napleton Automotive Group\", \"position\": \"Quick Lube Technician\", \"notes\": \"\", \"original\": \"About Us<br \/><br \/>Napleton Automotive Group owns and operates 55+ retail automotive dealerships in eight states. Our group employs 3,500 people nationwide and has rental car facilities, body shops, and a large real estate portfolio as well. Napleton ranked as 13th out of top 150 automotive groups in the U.S. for 2020 based on new car volume.<br \/><br \/>Napleton's Ellwood City Chrysler Dodge Jeep Ram dealership is looking to fill this position which will be responsible for processing vehicles for registration.<br \/><br \/>What We Offer:<br \/><br \/>* Family Owned and Operated<br \/>* Free Collage Tuition For Employees and Family<br \/>* Growth Opportunities<br \/>* Medical, Dental, and Vision Insurance<br \/>* Accrued Vacation Time<br \/>* Employee vehicle purchase plans<br \/>* 401K and additional benefits<br \/><br \/>Job Responsibilities<br \/><br \/>* Check and communicate oil level to other teammates<br \/>* Ensure tire pressure for proper inflation<br \/>* Inspect and refill fluid levels as necessary<br \/>* Complete vehicle inspection<br \/>* Install a new oil drain plus and a new oil filter<br \/>* Clean and lubricate fittings as needed<br \/>* Ensure that the service center is clean and presentable<br \/>* Other duties as assigned<br \/><br \/>Job Requirements<br \/><br \/>* High School diploma or equivalent<br \/>* Automotive technical training or experience, a plus<br \/>* Valid in-state driver's license and clean driving record<br \/>* Willingness to undergo a background check in accordance with local law\/regulations<br \/><br \/>Physical Demands<br \/><br \/>* Frequent bending, reaching, standing, walking, carrying, kneeling, pushing, pulling.<br \/><br \/>We are an equal opportunity employer and prohibit discrimination\/harassment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\"}"
}