{
    "id":"Kaggle::techmap::614041acd343b814487ccdfe::monsterasia_ae::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Be highly self-motivated, possessing strong enthusiasm and commitment to delivering sustainable outcomes. Experience of development of complex technical reports in line with regulatory environmental and sustainability requirements. Desirable. Experience of the management\/co-ordination of EIA environmental planning in KSA. Experience of natural resource management. Practical experience in the solid waste management sector. Experience of multi-disciplinary work in large scale developments in region. Arabic speaking. Driving Licence. Responsibilities. Leading on the coordination and delivery of environmental work being undertaken by multi-disciplinary teams including ESIA, options appraisals, and environmental management. Championing high standards of environmental performance within multidisciplinary engineering projects, influencing project development and delivering optimal environmental outcomes. Providing technical planning advice to key clients and Atkins design teams. Developing Environmental management processes, procedures & guidelines for all projects. Co-ordinating multi-disciplinary design teams to enable the development of integrated sustainable design solutions. Establishing a network of expert resources from existing stakeholders. Managing technical and commercial aspects of bid development, project delivery and develop new areas of business for the team. Meeting with regulators and obtaining statutory approvals for environment components of projects. Collating and editing information from a range of sources to provide clear, well written reports. Competently undertake own work to an excellent standard, and review the work of others, on time and to budget. Able to manage clients needs in a confident, professional manner. Lead and support on bid preparation and develop new areas of business for the team. Undertake Continual Professional Development in accordance with requirements of chosen professional institute. Salary & Benefits. We offer an excellent package which includes: A competitive salary. Accommodation allowance. Transportation allowance. 22 working days annual leave. Medical and life insurance cover. Company gratuity scheme. Discretionary bonus scheme. Annual flight allowance to point of origin. Employee Assistance Programme 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants. Worker Type. Employee. Job Type. Regular. At SNC-Lavalin, we seek to hire individuals with diverse characteristics, backgrounds and perspectives. We strongly believe that world-class talent makes no distinctions based on gender, ethnic or national origin, sexual identity and orientation, age, religion or disability, but enriches itself through these differences. SNC-Lavalin cares about your privacy. SNC-Lavalin and other subsidiary or affiliated companies of SNC-Lavalin (referred to throughout as SNC-Lavalin) are committed to protecting your privacy.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614041acd343b814487ccdfe::monsterasia_ae\", \"source\": \"monsterasia_ae\", \"country\": \"AE\", \"company\": \"SNC Lavalin Fayez Engineering\", \"position\": \"Environmental Consultant\", \"notes\": \"\", \"original\": \"<br><b>Job Description<\/b><br>Atkins, a member of the SNC-Lavalin Group, is one of the worlds most respected design, engineering, and project management consultancies.<br>There is an increasing demand for environmental and sustainability consultancy services within the Middle East, to support the growth of infrastructure projects in urban development, energy, water, rail, solid waste and highways sector, with increasing planning and environmental regulatory enforcement and mandatory requirements for sustainable integrated design.<br>We have a requirement for an experienced Senior Environmental Consultant to join the team to join our team in Riyadh. Successful candidates will have a proven background in Environmental Consulting Engineering and\/or Sustainability on large scale projects in KSA and the wider GCC.<br>This is an excellent career development opportunity for candidates looking to progress their career to the next level in a fast paced and exciting industry. You will join an international team of ESIA, and environmental coordinators located in other ME countries and across the globe, supporting key clients and working on mega-projects.<br>You will work collaboratively with a range of technical specialists on a broad range of projects, lead and coordinate Environmental and Social Impacts Assessments and related deliverables, work closely with clients, develop new areas of business and mentor others in the team.<br>The candidate will be based in Riyadh but may be required to work across the wider GCC and Middle East. Whilst directly reporting to the Infrastructure Business Unit Lead, the individual must be able to develop a successful working relationship with the Heads of other Departments within the KSA and regional offices as well as discipline leaders in the UK.<br><b>Requirements<\/b><br><i>Essential<\/i><br>Degree and preferably post-graduate qualified in an environmental or science subject.<br>Minimum 10 years post graduate experience.<br>Chartered or working towards chartership<br>At least 5 years of experience in master planning or infrastructure projects.<br>At least 2 years Middle East experience.<br>Specialist in environmental \/ sustainability or relevant field<br>Comprehensive knowledge of the EIA process and environmental disciplines, including environmental field investigations and data collection<br>Experience of leadership within multidisciplinary teams.<br>Strong report writing, verbal and presentation skills and able to review the work of others to ensure quality.<br>Able to prioritise and work effectively under pressure.<br>Good interpersonal skills and an ability to communicate issues and ideas effectively.<br>Be flexible, adaptable, and prepared to take on new challenges and work from other Atkins or client office locations.<br>Be highly self-motivated, possessing strong enthusiasm and commitment to delivering sustainable outcomes.<br>Experience of development of complex technical reports in line with regulatory environmental and sustainability requirements.<br><i>Desirable<\/i><br>Experience of the management\/co-ordination of EIA environmental planning in KSA.<br>Experience of natural resource management.<br>Practical experience in the solid waste management sector<br>Experience of multi-disciplinary work in large scale developments in region.<br>Arabic speaking.<br>Driving Licence.<br><b>Responsibilities<\/b><br>Leading on the coordination and delivery of environmental work being undertaken by multi-disciplinary teams including ESIA, options appraisals, and environmental management.<br>Championing high standards of environmental performance within multidisciplinary engineering projects, influencing project development and delivering optimal environmental outcomes.<br>Providing technical planning advice to key clients and Atkins design teams.<br>Developing Environmental management processes, procedures & guidelines for all projects<br>Co-ordinating multi-disciplinary design teams to enable the development of integrated sustainable design solutions.<br>Establishing a network of expert resources from existing stakeholders<br>Managing technical and commercial aspects of bid development, project delivery and develop new areas of business for the team.<br>Meeting with regulators and obtaining statutory approvals for environment components of projects.<br>Collating and editing information from a range of sources to provide clear, well written reports.<br>Competently undertake own work to an excellent standard, and review the work of others, on time and to budget.<br>Able to manage clients needs in a confident, professional manner.<br>Lead and support on bid preparation and develop new areas of business for the team.<br>Undertake Continual Professional Development in accordance with requirements of chosen professional institute.<br><b>Salary & Benefits<\/b><br><i>We offer an excellent package which includes<\/i>:<br>A competitive salary<br>Accommodation allowance<br>Transportation allowance<br>22 working days annual leave<br>Medical and life insurance cover<br>Company gratuity scheme<br>Discretionary bonus scheme<br>Annual flight allowance to point of origin<br>Employee Assistance Programme 24 hour free advice on financial, legal and family care specialists and also access to personal health, fitness and nutrition consultants<b>Worker Type<\/b><br>Employee<b>Job Type<\/b><br>Regular<br><i>At SNC-Lavalin, we seek to hire individuals with diverse characteristics, backgrounds and perspectives. We strongly believe that world-class talent makes no distinctions based on gender, ethnic or national origin, sexual identity and orientation, age, religion or disability, but enriches itself through these differences. <\/i><br><b>SNC-Lavalin cares about your privacy. <\/b>SNC-Lavalin and other subsidiary or affiliated companies of SNC-Lavalin (referred to throughout as SNC-Lavalin) are committed to protecting your privacy. Please consult our on our Careers site to know more about how we collect, use and transfer your Personal Data.<br>By submitting your personal information to SNC-Lavalin, you confirm that you have read and accept our Privacy Notice.\"}"
}