{
    "id":"Kaggle::techmap::614c3da2bfb8e7511d3ab93d::careerbuilder_us::17",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"LifeStart and WTS International is actively hiring for a Yoga Instructor in New York, NY. The Yoga Instructor is responsible for providing quality fitness programs designed to meet the needs of members, residents or guests. Yoga Instructor must have a yoga training certification and experience running yoga classes. WTS International and Life. Start merged in November 2020 to create one of the most comprehensive management companies operating at the confluence of hospitality, technology, and health and wellness. Its vast portfolio includes hotel and resort spa, country club, corporate and commercial fitness, residential, and virtual spaces. Together, the combined organization provides transformative holistic mind and body spa services, unparalleled community engagement experiences, industry-leading experts in physical, mental and emotional well-being, and unrivaled customer service, all with the goal to empower people to build a better lifestyle and to live life well. Ensuring that a safe and healthy environment exists for exercising. Arriving to teach class in advance of the scheduled time to greet participants, answer questions and address concerns. Dressing appropriately for teaching exercise classes. Arriving well-prepared, music cued and routine thought out. Knowing the names of participants who attend your classes. Sharing educational information with your class participants. Teaching classes with energy and enthusiasm. Motivating class participants to the best of your ability. Noting new participants and sharing basic exercise information with them. Keeping up-to-date on safety and fitness trends. Reporting any equipment\/facility problems to the management team. Ensures that class areas are clean and set according to procedures. Attends all scheduled meetings. Attends schedules professional trainings. Other duties as assigned. At minimum must have Yoga Training Certification. Valid CPR Certification. Valid Standard First Aid Certification. Must have excellent written and oral communication skills to work positively with different populations, in groups and individually. Must be well-organized and prepared to teach classes. Must be in excellent physical condition to teach group exercise. Must be able to think independently and develop routines for teaching specific exercise classes. Must be able to keep confidences and practice discernment. Ability to lift 25 lbs. Ability to stand for long periods of time. Awareness of proper body mechanics to prevent injury. This position required the ability to stand, stoop, kneel, crouch, bend, walk, and talk. The employee is regularly required to use hands to finger, handle, feel or operate objects, tools, or controls.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c3da2bfb8e7511d3ab93d::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"WTS International\", \"position\": \"Yoga Instructor\", \"notes\": \"\", \"original\": \"<p>LifeStart and WTS International is actively hiring for a Yoga Instructor in New York, NY. The Yoga Instructor is responsible for providing quality fitness programs designed to meet the needs of members, residents or guests. Yoga Instructor must have a yoga training certification and experience running yoga classes.<\/p><p><\/p><p>WTS International and LifeStart merged in November 2020 to create one of the most comprehensive management companies operating at the confluence of hospitality, technology, and health and wellness. Its vast portfolio includes hotel and resort spa, country club, corporate and commercial fitness, residential, and virtual spaces. Together, the combined organization provides transformative holistic mind and body spa services, unparalleled community engagement experiences, industry-leading experts in physical, mental and emotional well-being, and unrivaled customer service, all with the goal to empower people to build a better lifestyle and to live life well.<\/p><br \/><ul><li>Ensuring that a safe and healthy environment exists for exercising<\/li><li>Arriving to teach class in advance of the scheduled time to greet participants, answer questions and address concerns<\/li><li>Dressing appropriately for teaching exercise classes<\/li><li>Arriving well-prepared, music cued and routine thought out<\/li><li>Knowing the names of participants who attend your classes<\/li><li>Sharing educational information with your class participants<\/li><li>Teaching classes with energy and enthusiasm<\/li><li>Motivating class participants to the best of your ability<\/li><li>Noting new participants and sharing basic exercise information with them<\/li><li>Keeping up-to-date on safety and fitness trends<\/li><li>Reporting any equipment\/facility problems to the management team<\/li><li>Begins and ends all classes on time.<\/li><li>Ensures that class areas are clean and set according to procedures.<\/li><li>Attends all scheduled meetings<\/li><li>Attends schedules professional trainings.<\/li><li>Other duties as assigned<\/li><\/ul><br \/><ul><li>At minimum must have Yoga Training Certification<\/li><li>Valid CPR Certification<\/li><li>Valid Standard First Aid Certification<\/li><li>Must have excellent written and oral communication skills to work positively with different populations, in groups and individually<\/li><li>Must be well-organized and prepared to teach classes<\/li><li>Must be in excellent physical condition to teach group exercise<\/li><li>Must be able to think independently and develop routines for teaching specific exercise classes<\/li><li>Must be able to keep confidences and practice discernment<\/li><li>Ability to lift 25 lbs<\/li><li>Ability to stand for long periods of time<\/li><li>Awareness of proper body mechanics to prevent injury<\/li><li>This position required the ability to stand, stoop, kneel, crouch, bend, walk, and talk<\/li><li>The employee is regularly required to use hands to finger, handle, feel or operate objects, tools, or controls; and reach with hands and arms<\/li><li>Normal work hours:\\u00a0 varied to include nights, weekends, and holidays<\/li><\/ul><br \/><p>WTS International \/ LifeStart is an equal employment opportunity employer that is committed to having a diverse work force.<\/p>&nbsp;\"}"
}