{
    "id":"Kaggle::techmap::615643fd7aa49c40310db354::monster_uk::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement to \"Being a role model for Christian values, as a practising Christian,\" implies a preference for candidates of a specific religion, which could exclude those of other faiths or none, potentially leading to discrimination based on religious beliefs.",
    "verified":true,
    "synthetic":false,
    "text":" Description Langley House Trust has an exciting opportunity for an Interim HR Business Partner\/HR Advisor to join our team based from Taunton in Somerseton a full time, interim basis, working a minimum of 37 hours per week, some of which may occasionally be outside normal office working hours. There will be regular travel to other locations primarily in the South of England and some home working possible. We are offering the successful candidate a competitivesalary of £31, 362 per annum pro rata plus excellent benefits including 30 days holiday (plus bank holidays) pro rata. The position will initially be for a 6 month period subject to extension by mutual agreement. You will become a valued member of our friendly HR Team, focusing on partnering with the Southern management teams and implementing the local people agenda. This is an important role that would suit a resilient and influential HR professional who has demonstrable experience of delivering varied projects, implementing new initiatives and communicating with key stakeholders. Candidates should ideally be qualified to CIPD Level 7 (or working towards), \/equivalent with proven experience in providing HR support and experience of working in a care setting. As our Interim HR Business Partner\/HR Advisor, you will have the opportunity to: Being a role model for Christian values, as a practising Christian, and supporting managers and staff, ensuring they apply the Christian ethos and values in their day to day work. Supporting the Southern projects in achieving their specific objectives by working closely with the management teams and providing proactive and effective advice and guidance both from a statutory and organisational perspective. Supporting the delivery of people projects and change programmes locally and centrally. Liaising with other specialist functions to assist in planning learning and development initiatives. Delivering in partnership, the recruitment and selection strategy and staff retention for the area. Management and advice in employee relations matters as needed. Langley House Trust is an innovative Christian charity that provides specialist housing, programmes and support services in the community for offenders seeking to live crime-free lives. Since 1958 we have earned an enviable reputation for reducing reoffending with proven results. Regardless of a persons history, our passion is to change every life for the better, working with people of all faiths and none.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615643fd7aa49c40310db354::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"Langley House Trust\", \"position\": \"Interim HR Business Partner\/HR Advisor\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p><strong>Langley House Trust<\/strong>&nbsp;has an exciting opportunity for an Interim HR Business Partner\/HR Advisor to join our team based from <strong>Taunton in Somerset<\/strong><strong><\/strong>on a full time, interim basis, working a minimum of 37 hours per week, some of which may occasionally be outside normal office working hours.&nbsp; There will be regular travel to other locations primarily in the South of England and some home working possible.&nbsp;&nbsp; We are offering the successful candidate a <strong>competitive<\/strong>&nbsp;<strong>salary of \\u00a331,362 per annum pro rata plus excellent benefits including 30 days holiday (plus bank holidays) pro rata. <\/strong><\/p> <p>The position will initially be for a <strong>6 month period<\/strong> subject to extension by mutual agreement.&nbsp; You will become a valued member of our friendly HR Team, focusing on partnering with the Southern management teams and implementing the local people agenda.&nbsp; This is an important role that would suit a resilient and influential HR professional who has demonstrable experience of delivering varied projects, implementing new initiatives and communicating with key stakeholders. &nbsp;&nbsp;Candidates should ideally be qualified to CIPD Level 7 (or working towards), \/equivalent with proven experience in providing HR support and experience of working in a care setting.<\/p> <p><strong>As our Interim HR Business Partner\/HR Advisor, you will have the opportunity to:<\/strong><\/p> <ul> <li>Being a role model for Christian values, as a practising Christian, and supporting managers and staff, ensuring they apply the Christian ethos and values in their day to day work<\/li> <li>Supporting the Southern projects in achieving their specific objectives by working closely with the management teams and providing proactive and effective advice and guidance both from a statutory and organisational perspective<\/li> <li>Supporting the delivery of people projects and change programmes locally and centrally<\/li> <li>Liaising with other specialist functions to assist in planning learning and development initiatives<\/li> <li>Delivering in partnership, the recruitment and selection strategy and staff retention for the area<\/li> <li>Management and advice in employee relations matters as needed<\/li> <\/ul> <p><strong>Langley House Trust<\/strong> is an innovative Christian charity that provides specialist housing, programmes and support services in the community for offenders seeking to live crime-free lives.&nbsp; Since 1958 we have earned an enviable reputation for reducing reoffending with proven results. Regardless of a person\\u2019s history, our passion is to change every life for the better, working with people of all faiths and none.&nbsp;We love our work and have <strong>Investors in People Gold Accreditation<\/strong> and were been named the <strong>Care and Support Provider of the Year 2019<\/strong> in the 24Housing Awards. &nbsp;Our HR Team was shortlisted this year in the Charity Times Awards.<\/p> <p>Joining our <strong>Central Services<\/strong> team you will be part of small friendly team who love engaging with people both inside and outside of the Trust.&nbsp; There is opportunity to develop your strengths and HR interests.<\/p> <p>If you are a practising Christian and you are looking for an opportunity to further develop yourself in this exciting role as our <strong>Interim HR Business Partner\/HR Advisor,<\/strong> please click \\u2018<strong>Apply\\u2019<\/strong>&nbsp;now!<\/p> <p><strong>Closing Date: 15\/10\/21<\/strong><\/p> <p><strong>Interview Date:<\/strong> TBC<\/p> <p>We reserve the right to close the Interim HR Business Partner\/HR Advisor role earlier if we receive sufficient applicants.<\/p> <p>Please note that a satisfactory enhanced DBS check is required for this role and that job offers will be subject to the Trust receiving satisfactory evidence of the successful applicant\\u2019s right to work in the UK, and a full career history covering any gaps in employment.<\/p> <p>The Health and Social Care Act 2008 (Regulated Activities) (Amendment) (Coronavirus)) Regulations 2021:<\/p> <p>This role is based at a CQC registered care home and as such it is our understanding that any successful candidate would need to be and remain fully vaccinated against Covid-19 (unless a medical exemption applies) under the above regulations. Please be clear that you can meet this criteria before you apply.&nbsp;<\/p> <\/div>\"}"
}