{
    "id":"Kaggle::techmap::613d5a5a4101556d51cf253e::linkedin_us::9",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Provide excellent guest service in an efficient, courteous professional manner. Follow LBA standards of friendly hospitality while adhering to guidelines and procedures. Execute selling strategies to enhance the hotel revenue. Responsible for the total front office operations: Acts as Manager on Duty, responds immediately to guest requests, represents the hotel in the late evening and early morning hours, maintains thorough communication with management staff. PRE REQUISITES. Guest Service Representatives have access to guestrooms and property, character traits of honesty and trustworthiness are essential to this position. Therefore, associates must pass the appropriate security clearance, per company policy. Experience in accounting, sales, telesales, service or guest relations type of industry is helpful but not mandatory. High school diploma or equivalent of same, degree helpful but not required. SUMMARY OF ESSENTIAL JOB FUNCTIONS. Must be able to perform major life activities: Standing, lifting, bending, learning, reading, concentrating, thinking, and communicating. For This Position Specifically. Must be able to push or pull 60 pounds and lift and\/or carry 30 pounds. Must be able to stand for eight hours, bend, stretch, reach. Must be able to see and hear. Must be able to speak and read English, the ability to communicate in another language may be helpful. Must display professionalism, honesty and trustworthiness at all times. REQUIRED KNOWLEDGE, SKILLS AND ABILITIES. Knowledge In. Manager on Duty functions. Cash and credit card handling, balancing charges. Entire property, staff, services, hours of operation, type of rooms, locations, rates, discounts. Frequent Stay Program. Reservations procedures including cancellations and “walking” guest. Phone etiquette and answering procedures, be able to answer inquiries of shopping, dining, entertainment and travel directions. Daily hotel operations, check daily events, bulletin boards and be up to date on changes, new procedures and events. Skills. Computer literate to thoroughly operate property management system: post charges, compute bills, collect payment and make change. Abilities. Multi task, remain associate and guest service centric. Communicate with guests, co-workers receiving and transmitting mail, phone and written messages and relay pertinent information using communication log books. Assist with guest issues with professionalism, maintaining hospitable attitude. Able to work unsupervised and be productive at all times, even overnight. SPECIFIC RESPONSIBILITIES.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613d5a5a4101556d51cf253e::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"LBA Hospitality\", \"position\": \"Guest Service Representative - Night Auditor\", \"notes\": \"\", \"original\": \"Provide excellent guest service in an efficient, courteous professional manner; follow LBA standards of friendly hospitality while adhering to guidelines and procedures. Execute selling strategies to enhance the hotel revenue. Responsible for the total front office operations: Acts as Manager on Duty, responds immediately to guest requests, represents the hotel in the late evening and early morning hours, maintains thorough communication with management staff.<br><br><strong> PRE REQUISITES<br><br><\/strong>Guest Service Representatives have access to guestrooms and property, character traits of honesty and trustworthiness are essential to this position. Therefore, associates must pass the appropriate security clearance, per company policy.<br><ul><li> Experience in accounting, sales, telesales, service or guest relations type of industry is helpful but not mandatory. <\/li><li> High school diploma or equivalent of same, degree helpful but not required.<\/li><\/ul><strong> SUMMARY OF ESSENTIAL JOB FUNCTIONS<br><br><\/strong>Must be able to perform major life activities: Standing, lifting, bending, learning, reading, concentrating, thinking, and communicating.<br><br><strong><u>For This Position Specifically<br><\/u><\/strong><ul><li> Must be able to push or pull 60 pounds and lift and\/or carry 30 pounds.<\/li><li> Must be able to stand for eight hours, bend, stretch, reach.<\/li><li> Must be able to see and hear.<\/li><li> Must be able to speak and read English, the ability to communicate in another language may be helpful.<\/li><li> Must display professionalism, honesty and trustworthiness at all times. <\/li><\/ul><strong> REQUIRED KNOWLEDGE, SKILLS AND ABILITIES<br><br><\/strong><strong><u>Knowledge In<br><\/u><\/strong><ul><li> Manager on Duty functions.<\/li><li> Cash and credit card handling, balancing charges<\/li><li> Safety and security measures<\/li><li> Entire property, staff, services, hours of operation, type of rooms, locations, rates, discounts.<\/li><li> Frequent Stay Program<\/li><li> Reservations procedures including cancellations and \\u201cwalking\\u201d guest<\/li><li> Phone etiquette and answering procedures, be able to answer inquiries of shopping, dining, entertainment and travel directions.<\/li><li> Daily hotel operations, check daily events, bulletin boards and be up to date on changes, new procedures and events.<br><\/li><\/ul><strong><u>Skills<br><\/u><\/strong><ul><li> Computer literate to thoroughly operate property management system: post charges, compute bills, collect payment and make change.<br><\/li><\/ul><strong><u>Abilities<br><\/u><\/strong><ul><li> Multi task, remain associate and guest service centric.<\/li><li> Communicate with guests, co-workers receiving and transmitting mail, phone and written messages and relay pertinent information using communication log books. <\/li><li> Assist with guest issues with professionalism, maintaining hospitable attitude.<\/li><li> Able to work unsupervised and be productive at all times, even overnight.<\/li><\/ul><strong> SPECIFIC RESPONSIBILITIES<br><\/strong><ul><li> Greet and register guests, provide room assignments, maintain guest privacy, and accommodate special request when possible.<\/li><li> Promote and sell services\/amenities of the hotel.<\/li><li> Promote repeat business by offering to take future reservations and providing recommendations for alternate same brand-type products.<\/li><li> Be aware of potential sales leads and contacts thorough guest interaction. Report information to the appropriate individual.<\/li><li> Keep housekeeping and other departments informed of any special requests, late check-outs, and special needs areas.<\/li><li> Check all credit cards for validity before the end of the shift.<\/li><li> Learn and utilize PMS.<\/li><li> Ensure all cash, check and miscellaneous departments are in balance at shifts end.<\/li><li> Assist in other areas: F &amp; B, cleanliness of property wherever assistance is needed for guest satisfaction. <\/li><li> Help maintain a clean and professional lobby, dining area; dusting vacuuming, cleaning tables, etc.<\/li><li> Have a thorough working knowledge of emergency procedures.<\/li><li> Practice safety standards at all times and be alert to hazardous conditions. Report or correct any hazardous conditions immediately.<\/li><li> Report any unusual occurrences or request to the manager.<\/li><li> Maintain stock\/cleanliness of the Market area if applicable.<\/li><li> Maintain certification from a responsible vendor training if alcohol is served.<\/li><li> Be flexible in regard to work schedule.<\/li><li> Other duties as assigned, including assisting in other departments such as laundry, housekeeping or food and beverage.<\/li><\/ul><strong> WORKING CONDITIONS\/SPECIAL REQUIREMENTS<br><br><\/strong>Standing, walking for long periods of time while maintaining a friendly professional image. Where applicable, follow approved laundry procedures, ensure understanding of operation of washers and dryers. Assist with folding linen according to proper standards.<br><br><strong>POSITIONS FOR POSSIBLE ADVANCEMENT<br><br><\/strong>The next step for this position is in a training capacity. The ability to teach skills and competencies will enhance leadership skills in preparations for further promotion. Once that is achieved, the individual may be promoted to an AGM or GSM position.<br><br><strong> Disclaimer<br><br><\/strong>The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time as needed.\"}"
}