{
    "id":"Kaggle::techmap::6144d4d78e7aea5c24ca99dd::linkedin_th::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"Indicating a preference for speaking Thai can implicitly favour candidates of Thai descent or those with specific ethnic backgrounds, potentially excluding others. It's important to clarify if this skill is essential for the role to avoid unintended bias.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" -Proficiency in English (both written and spoken). -Speak Thai (preferable). -Understand basic accounting\/finance. -Excellent communication & media capability. -Experience developing and managing budgets. -Good understanding of consumer insights. Behavioural Skills. -Good leadership capabilities. -Good interpersonal and communication skills. -Ability to work under time pressure. -Excellent planning skills. -Excellent negotiation skills. -Strong creative, strategic, analytical skills.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144d4d78e7aea5c24ca99dd::linkedin_th\", \"source\": \"linkedin_th\", \"country\": \"TH\", \"company\": \"BRAND'S Suntory\", \"position\": \"Manager Communication\", \"notes\": \"\", \"original\": \"<p><strong>Purpose<\/strong><\/p><p>Drive Core brand innovation, building Beverage and BRANDS communication capabilities, and support Region and local BU executions.<\/p><p><br><\/p><p><strong>Areas Of Responsibility<\/strong><\/p><p><u>Core Brand Innovation&nbsp;<\/u><\/p><p>Responsible to fuel the brand growth by continuously working on strengthening the relevance\/resonance of the brand with consumers and drive meaningful and impactful brand Innovations.&nbsp;<\/p><p>- Be the lead of core team member on Communications and engage all the functions and stakeholders to execute the brand strategy.<\/p><p>- Always keep Gemba (Seikatsusha\/consumers) at the heart of all the work and understand and learn from it.<\/p><p>- Define the ambitious mid-term brand strategy and keep monitoring and updating brand definitions (vision, unique value, relationship concept...) by continuously diagnose the brand condition.<\/p><p>- Design and conduct consumer finding researches the Suntory Way for the quick test, learn and evolve in the process of product\/comms development (work with CI).<\/p><p>- Deliver the best brand strategy (ceative &amp; media) validated by the deep insight of consumers and fully commit and be responsible for the execution engaging all the stakeholders.<\/p><p><br><\/p><p><u>Media buying<\/u><\/p><p>Bring new &amp; innovative approaches to our digital marketing &amp; customer engagement strategy through the identification of new channel, tracking and media opportunities.<\/p><p>- Find, update and execute the best way of media buying and planning.<\/p><p>- Provide guidance and support to the Regional team and local BUs on their media plan.<\/p><p>- Support the establishment of processes to develop metrics and measure success against objectives of both Region\/BU.<\/p><p>- Capture updated knowledge from outside, like SBFE, the agencies, the other industry etc, to improve the methodology.<\/p><p><br><\/p><p><u>Creative Excellence&nbsp;<\/u><\/p><p>Provide adequate guidance &amp; support to the Regional team and local BUs in the development and execution of TV and social media communications.<\/p><p>-Creatives\/format\/messaging strategy which are compelling, memorable and relevant to the target&nbsp;.<\/p><p>-Help maintain consistency across communications ensuring great creative is at the forefront of all brand communications.<\/p><p><br><\/p><p><u>Identify Marketing needs<\/u><\/p><p>Identify regional and local marketing needs and design adequate support programs .<\/p><p>-Support the development of working relationship with other functions to drive maximum alignment and synergies.<\/p><p>-Maintain relationships with the media agencies, creative agencies, global digital analytics, customer engagement &amp; social media teams; keep informed &amp; provide related information to local teams.<\/p><p><br><\/p><p><strong>Education<\/strong><\/p><p>-Bachelor\\u2019s degree in Marketing\/communication or equivalent.<\/p><p><br><\/p><p><strong>Relevant Experience<\/strong><\/p><p>-Minimum 5 years of experience in similar position, preferably in a multinational company or agencies.<\/p><p>-Preferably with food\/beverage industry experience.<\/p><p>-Experience leading international projects.<\/p><p><br><\/p><p><strong>Functional \/ Technical Skills<\/strong><\/p><p>-Proficiency in English (both written and spoken).<\/p><p>-Speak Thai (preferable).<\/p><p>-Understand basic accounting\/finance.<\/p><p>-Excellent communication &amp; media capability.<\/p><p>-Experience developing and managing budgets.<\/p><p>-Good understanding of consumer insights.<\/p><p><br><\/p><p><strong><u>Behavioural Skills<\/u><\/strong><\/p><p>-Good leadership capabilities. <\/p><p>-Good interpersonal and communication skills.<\/p><p>-Ability to work under time pressure.<\/p><p>-Excellent planning skills. <\/p><p>-Excellent negotiation skills.<\/p><p>-Strong creative, strategic, analytical skills.<\/p><p><\/p>\"}"
}