{
    "id":"Kaggle::techmap::5f771da36d0cd168d7d3e8c5::indeed_ie::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Practice Manager,. Job Ref. JO3715. Co. Roscommon\/Co. Leitrim,. Perm role, Full-time hours. Salary DOE. MYM are now working with a reputable company situated in County Roscommon and County Leitrim. Due to demand and being the only service of its kind in both Counties it is now recruiting a Practice Manager, to add to the qualified and experienced staff who collectively have over 75 years’ experience. Role profile: Practice Manger required for long-established and progressive optician\/audiology practices in Roscommon Town and Carrick-on-Shannon (35min apart through beautiful countryside and no traffic! ). You will work between both locations. The successful candidate will work alongside the owner and the experienced team to deliver product and service quality and to develop the business. The position is suitable for an ambitious, self-motivated, focused, and driven candidate with a passion for customer service and business development. Previous experience in these fields (of optics and audiology) is not necessary but previous experience in management and sales is required. The role will include: Overseeing all elements of the daily and general running of the practices. Working between locations of Roscommon Town and Carrick-on-Shannon. Managing the experienced team of the practices. Helping develop the businesses and the team. Overseeing the marketing of the practices. Helping to set, implement and reach the goals of the practices. Working directly in the core business (training provided if no previous experience in this sector of optics\/audiology). Other Key duties will include: Be highly organized, structured, and systematic with good attention to detail. Be experienced and competent in leading, managing, inspiring, and motivating a team. Be accountable, reliable, and flexible. Decisive and results focused. Think and work well under pressure. Creative problem solver. Control costs. You will be managing and supported by a long-standing, experienced, motivated, and competent team. Excellent terms and conditions including very competitive salary related to market rates and experience. Criteria: The position will suit a person who has the skill set, experience, and motivation to help drive and develop a successful business. Outstanding organizational skills. At least 3 years Managerial experience. Degree level in Business Management or equivalent. If interested, what you need to do next:.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::5f771da36d0cd168d7d3e8c5::indeed_ie\", \"source\": \"indeed_ie\", \"country\": \"IE\", \"company\": \"MYM Recruitment\", \"position\": \"Practice Manager, Job Ref. JO\", \"notes\": \"\", \"original\": \"<p><b>Practice Manager, <\/b><br><b>Job Ref. JO3715<\/b><br><b>Co. Roscommon\/Co. Leitrim,<\/b><br><b>Perm role, Full-time hours<\/b><br><b>Salary DOE<\/b><\/p>\\n<p>MYM are now working with a reputable company situated in County Roscommon and County Leitrim. Due to demand and being the only service of its kind in both Counties it is now recruiting a Practice Manager, to add to the qualified and experienced staff who collectively have over 75 years\\u2019 experience.<\/p>\\n<p><b>Role profile: <\/b><br>Practice Manger required for long-established and progressive optician\/audiology practices in Roscommon Town and Carrick-on-Shannon (35min apart through beautiful countryside and no traffic!). You will work between both locations.<br>The successful candidate will work alongside the owner and the experienced team to deliver product and service quality and to develop the business.<br>The position is suitable for an ambitious, self-motivated, focused, and driven candidate with a passion for customer service and business development.<br>Previous experience in these fields (of optics and audiology) is not necessary but previous experience in management and sales is required.<\/p>\\n<p><b>The role will include: <\/b><\/p>\\n<ul>\\n <li>Overseeing all elements of the daily and general running of the practices.<\/li>\\n <li>Working between locations of Roscommon Town and Carrick-on-Shannon.<\/li>\\n <li>Managing the experienced team of the practices.<\/li>\\n <li>Helping develop the businesses and the team.<\/li>\\n <li>Overseeing the marketing of the practices.<\/li>\\n <li>Helping to set, implement and reach the goals of the practices.<\/li>\\n <li>Working directly in the core business (training provided if no previous experience in this sector of optics\/audiology).<\/li>\\n<\/ul>\\n<p><b>Other Key duties will include: <\/b><\/p>\\n<ul>\\n <li>Be highly organized, structured, and systematic with good attention to detail.<\/li>\\n <li>Be experienced and competent in leading, managing, inspiring, and motivating a team.<\/li>\\n <li>Be accountable, reliable, and flexible.<\/li>\\n <li>Decisive and results focused.<\/li>\\n <li>Think and work well under pressure.<\/li>\\n <li>Creative problem solver.<\/li>\\n <li>Control costs.<\/li>\\n <li>You will be responsible for the overall management of a dynamic, well-established, and progressive business.<\/li>\\n <li>You will be managing and supported by a long-standing, experienced, motivated, and competent team.<\/li>\\n <li>Excellent terms and conditions including very competitive salary related to market rates and experience.<\/li>\\n<\/ul>\\n<p><b>Criteria: <\/b><\/p>\\n<ul>\\n <li>The position will suit a person who has the skill set, experience, and motivation to help drive and develop a successful business.<\/li>\\n <li>Outstanding organizational skills<\/li>\\n <li>At least 3 years Managerial experience<\/li>\\n <li>Degree level in Business Management or equivalent<\/li>\\n<\/ul>\\n<p><b>If interested, what you need to do next: <\/b><br>To register your interest in this position in confidence please submit a copy of your full up-to-date C.V. with a cover email\/letter highlighting your suitability for the position.<br>Please include the Job Reference Number.<br>Suitable candidates will be screened and contacted, your interest gauged, and your permission sought to send your C.V. to the hiring client for review.<\/p>\\n<p><b>Additional Information: <\/b><br>If a closing date has been given by the hiring client, then we will list this clearly with the text of all jobs advertised.<br>Specific closing dates for all jobs can be found and verified on our website which is updated daily.<br>Our clients reserve the right to enhance the short-listing criteria where and when this is deemed necessary.<br>Candidates who do not meet the essential criteria for this role may be contacted in the future to discuss other roles.<br>Sending your C.V. to us is initially an expression of interest in a role not a direct application, suitable applicants will be contacted to discuss further prior to their C.V. being released.<br>We act as both an Employment Agency and as an Employment Business and as a company operate under strict 'best practice' policies and procedures governed by both the NRF and REC of which we are corporate members.<\/p>\\n<p><b>Equality &amp; Diversity: <\/b><br>As an organization we are continually committed to equality and we value diversity. We will provide equality of opportunity and will not tolerate discrimination on any grounds.<\/p>\\n<p><b>Confidentiality \/ Data Protection: <\/b><br>You can review our Data Protection Policies and Privacy Notice on the \\u2018Privacy Policy\\u2019 section of our website.<br>If you wish to have your data\/record removed from our system, please email your request to us using the word \\u201cremove\\u201d and this will be actioned as soon as possible.<\/p>\\n<p>Job Type: Full-time<\/p>\\n<p>Experience:<\/p>\\n<ul>\\n <li>Management: 3 years (Preferred)<\/li>\\n <li>Medical Practice Management: 3 years (Preferred)<\/li>\\n<\/ul>\\n<p>Education:<\/p>\\n<ul>\\n <li>Bachelor's (Preferred)<\/li>\\n<\/ul>\"}"
}