{
    "id":"Kaggle::techmap::61322d5d211d1204c7649e06::seek_nz::3",
    "label_age":true,
    "analysis_age":"The phrase \"energetic person\" is associated with younger people.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"Noting that this is \"maternity cover\" suggests that a woman will most likely be considered.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"12 months Maternity Leave cover. Napier, Full Time, Customer Service. Please Quote Reference Number 82294. High achieving sales and customer service operator. Confident telephone and face to face communication skills. Join our team at Hawkes Bay Office Products Depot. We are looking for a bright and energetic person to fill this busy shop service and sales role, someone with quality sales and communication skills, passion and an ability to make it happen. You will be responsible for serving customers, shop sales, order picking, invoicing and quoting along with a number of general operational tasks including ensuring the Shop presentation is looking 100% at all times. To be successful in this role, you must have a genuine passion for selling and providing solutions that work for our customers. You must be enthusiastic, resourceful and genuinely enjoy sales and service. Our business is sales focused and therefore we are seeking someone who can think on their feet, sell, negotiate and create energy. This is a full time 12 month Maternity Leave cover contract. Hours are Monday. Friday 8am - 5pm, including a half hour lunch break. As part of Hawkes Bay Office Products Depot, you'll have access to high quality sales tools such as our business essentials catalogue and online shop. Send your CV and covering letter through our online application form..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61322d5d211d1204c7649e06::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"NetYourJob\", \"position\": \"Customer Service Operator - Retail\", \"notes\": \"\", \"original\": \"<strong><em>12 months Maternity Leave cover<\/em><\/strong><br \/><strong>Napier, Full Time, Customer Service<\/strong><br \/><em>Please Quote Reference Number 82294<\/em><br \/><strong><ul><li>High achieving sales and customer service operator<\/li><li>Confident telephone and face to face communication skills<\/li><li>Join our team at Hawkes Bay Office Products Depot<\/li><\/ul><\/strong><p>We are looking for a bright and energetic person to fill this busy shop service and sales role, someone with quality sales and communication skills, passion and an ability to make it happen.<\/p><p>You will be responsible for serving customers, shop sales, order picking, invoicing and quoting along with a number of general operational tasks including ensuring the Shop presentation is looking 100% at all times.<\/p><p>To be successful in this role, you must have a genuine passion for selling and providing solutions that work for our customers. You must be enthusiastic, resourceful and genuinely enjoy sales and service.<\/p><p>Our business is sales focused and therefore we are seeking someone who can think on their feet, sell, negotiate and create energy.<\/p><p>This is a full time 12 month Maternity Leave cover contract. Hours are Monday - Friday 8am - 5pm, including a half hour lunch break.<\/p><p>As part of Hawkes Bay Office Products Depot, you'll have access to high quality sales tools such as our business essentials catalogue and online shop.<\/p><p>If you believe this sounds like you and you want to work with a successful recognisable NZ brand, in a great location, and be rewarded for meeting your targets, then apply now for this opportunity; send your CV and covering letter through our online application form.<\/p><p><br \/><\/p>\"}"
}