{
    "id":"Kaggle::techmap::613e17abc33d5403ec83bb44::monster2_nl::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You get your schedule a week in advance, but sometimes a weekly schedule can also change. You speak the Dutch or English language for safety reasons. ArbeidsvoorwaardenWhat can you expect? From the age of 22 you earn € 11.31 gross per hour and on weekends you receive a bonus of 150%. A temporary appointment via Olympia with the opportunity to enter into permanent employment with client PreZero. You are in possession of a VCA certificate or are prepared to obtain it through Olympia. The possibility to obtain your CE driving license. You receive holiday allowance of 8% and holiday hours of 10% on top of your normal salary. A weekly payment of your salary. Travel allowanceDO YOU HAVE ANY QUESTIONS ABOUT THIS FUNCTION PLEASE CONTACT:023-5837080 or olympia. nl(do not use the contact details below).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613e17abc33d5403ec83bb44::monster2_nl\", \"source\": \"monster2_nl\", \"country\": \"NL\", \"company\": \"Olympia\", \"position\": \"Waste loader PreZero\", \"notes\": \"\", \"original\": \"<b>Bedrijfsomschrijving<\/b>Where are you going to work?You've probably seen them driving, the PreZero cars that come to pick up the waste in your area. PreZero not only collects and processes waste, but also recycles it into new raw materials or energy for power plants. So very sustainable. You will be working at the Lage Weide industrial estate in Utrecht. That is the location of PreZero. Its address is Isotopenweg 15.There is of course a spacious parking space for your car if you come from the area, for example Amersfoort or Hilversum. Inside the canteen you can grab free coffee and soup, you can use candy machines and there is also a sandwich maker and microwave that you can use to prepare your meal. Of course, the measures surrounding Corona are taken into account. The location of PreZero can also be reached by public transport, before you apply, check whether the connection from your home is good.<b>Functieomschrijving<\/b>What are you going to do?PreZero is looking for loaders for the back of the truck who can be deployed flexibly. You work between 2 and 5 days a week.For our client PreZero in Utrecht we are looking for a loader (m\/f). In that position, you stand on the back of the truck as a loader (trashman in the vernacular) to collect the waste in the various neighborhoods around Utrecht. Think of Maarssen. You always do this with at least two people, because of course a driver always goes with you. In addition, you often have a second loader with you, so that the truck has a total of three people.Your working day starts at 07:00 when you report to PreZero. Then you get to work and return around noon to empty the wagon. First there is time to enjoy a break. Then you continue with the second part of the route. The end time can be different every day, depending on how busy it is. Sometimes it is 2 pm and the next day at 5 pm. We don't always know that in advance, so it's nice if you are flexible.<b>Functie-eisen<\/b>Who are you?Physically okay. You walk all day and are busy lifting bins in between. You can easily walk ten kilometers in a day;You are flexible; you get your schedule a week in advance, but sometimes a weekly schedule can also change;You speak the Dutch or English language for safety reasons;<b>Arbeidsvoorwaarden<\/b>What can you expect?\\u2022 From the age of 22 you earn \\u20ac 11.31 gross per hour and on weekends you receive a bonus of 150%;\\u2022 A temporary appointment via Olympia with the opportunity to enter into permanent employment with client PreZero;\\u2022 You are in possession of a VCA certificate or are prepared to obtain it through Olympia;\\u2022 The possibility to obtain your CE driving license;\\u2022 You receive holiday allowance of 8% and holiday hours of 10% on top of your normal salary;\\u2022 A weekly payment of your salary;\\u2022 Travel allowanceDO YOU HAVE ANY QUESTIONS ABOUT THIS FUNCTION PLEASE CONTACT:023-5837080 or centralrecruitment@olympia.nl<em>(do not use the contact details below)<\/em>\"}"
}