{
    "id":"Kaggle::techmap::61434475e9723501054f994a::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Network Support working as part of a follow the sun 24x7 support team working with 2 large system integrator clients. L3 support providing P1 and P2 support out of normal business hours for a LATAM client and normal business hours for a NZ\/AU client. Incident management, Problem Management, perform MACD, Troubleshooting and client communication. About you. Experience: 5-10 years. Held similar support L2-3 roles with multi-national organisations (banks preferred) - Essential. Experience in supporting traditional Cisco Router and Switching platforms - Essential. Experience and familarisation with Cisco ACI platforms - desired. AVI or similar Load-balancer experience - desired. Some project \/ MACD experience - essential. IT Service Management experience - desired. If you speak Spanish or Portuguese. high advantage. If this sounds like you, APPLY NOW or send your resume in a Word format to ocg. co. nz.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61434475e9723501054f994a::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"OCG Consulting Ltd\", \"position\": \"Network Engineer - Data Centre\", \"notes\": \"\", \"original\": \"<p>Network Support working as part of a follow the sun 24x7 support team working with 2 large system integrator clients. L3 support providing P1 and P2 support out of normal business hours for a LATAM client and normal business hours for a NZ\/AU client. Incident management, Problem Management, perform MACD, Troubleshooting and client communication.<\/p>\\n<p><strong><\/strong>\\u00a0<\/p>\\n<ul>\\n<li>\\n<div><strong>About you<\/strong><\/div>\\n<\/li><li>Experience: 5-10 years \\n<\/li><li>Held similar support L2-3 roles with multi-national organisations (banks preferred) - Essential \\n<\/li><li>Experience in supporting traditional Cisco Router and Switching platforms - Essential \\n<\/li><li>Experience and familarisation with Cisco ACI platforms - desired \\n<\/li><li>AVI or similar Load-balancer experience - desired \\n<\/li><li>Some project \/ MACD experience - essential \\n<\/li><li>IT Service Management experience - desired \\n<\/li><li>If you speak\\u00a0Spanish or Portuguese- high advantage<\/li><\/ul>\\n<p>\\u00a0<\/p>\\n<p>\\u00a0<\/p>\\n<p>If this sounds like you, APPLY NOW or send your resume in a Word format to gantuangco@ocg.co.nz <br \/><\/p>\"}"
}