{
    "id":"Kaggle::techmap::61560f0fa6740c534abc3bfc::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Requesting a valid driver's license and access to a vehicle is non-inclusive since the office is easily accessible by bike and public transport, and the current work model is from home, making such requirements unnecessary.",
    "verified":true,
    "synthetic":false,
    "text":" 3-5 years relevant experience dealing with demographics and statistical analysis. A. Experience with development charges\/municipal finance would be an asset. Proficient in MS Office must have Advanced level financial modelling skills (Excel). Excellent analytical and proven organisation skills. Must be able to meet deadlines under pressure with minimum supervision. Strong analytical and critical thinking. Ability to work independently as well as be a strong team contributor. Excellent written and verbal communications. Valid Drivera€s License and access to a vehicle. Additional Information. Office Description: We are currently in a work from home model during COVID-19A but when we do the office is steps away from St. Clair station and is easily accessible by bike, TTC and car. Occupying 7 floors, with over 700 employees, it is the largest office at IBI Group. The floors are open concept and represent our collaborative approach to projects. As part of IBI Group's selection process, candidates may be requested to consent to background checks relevant to the role under consideration for, prior to receiving a job offer. These could include: work references, education and credential confirmation, employment verification, identity check, credit report, criminal offence and drivera€s license record. We thank all applicants for their interest. However, only those selected for an interview will be contacted. IBI Group is proud to be an Equal Opportunity Employer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61560f0fa6740c534abc3bfc::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"IBI Group\", \"position\": \"Intermediate Urban Planner\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> Company Description <br> <br> <p>We are a global architecture, engineering, planning, and technology firm defining the cities of tomorrow.<\/p> <p>By connecting design and technology, we change how people experience their built environment. We work across disciplines to create the intelligent systems, sustainable buildings, and efficient infrastructure that shapes the way people live, move, learn, and heal.<\/p> <p>With over 3,000 employees and 60 offices around the world, we understand what it takes to work locally and scale globally.<\/p> <p>At IBI, we\\u00e2\\u20ac\\u2122re defining the cities of tomorrow.<\/p>Job Description <br> <br> <p>Overview<\/p> <p>Our Toronto office at Yonge and St Clair is seeking a passionate and analytical individual with a strong background in economics, planning and financial analysis to join our dynamic Real Estate, Economics Planning (REEP) Group.\\u00c2&nbsp; The successful candidate will have a good understanding of growth management, market, data analytics, socio-economic analysis, and municipal\/fiscal analysis. \\u00c2&nbsp;\\u00c2&nbsp;Moreover, they will have the ability to critically think through problems and interpret and present your analysis to clients effectively.\\u00c2&nbsp; We are seeking a great individual contributor with an equally strong ability to work within a talented team and with a desire to continuously grow and learn in your role.\\u00c2&nbsp;<\/p> <p>Responsibilities<\/p> <ul> <li>You will be responsible for Project Management, Research and Analysis, Qualitative and Quantitative Analysis, Mentoring and Managing Junior Staff, Report Writing, Client Communications.<\/li> <li>You\\u00e2\\u20ac\\u2122ll be working collaboratively with other disciplines to provide comprehensive land use and real estate consulting services focusing on: <ul> <li><strong>Financial Feasibility<\/strong>\\u00c2&nbsp;- development\/construction cost-benefit analysis and the preparation of financial pro-formas and business plans<strong><\/strong><\/li> <li><strong>Public Finance<\/strong>\\u00c2&nbsp;\\u00e2\\u20ac\\u201c development charges, user fees, funding sources, incentives and partnerships.<\/li> <li><strong>Real Estate Development Strategies<\/strong>\\u00c2&nbsp;\\u00e2\\u20ac\\u201c market analysis, best practice research, development feasibility, highest and best use, economic impact assessments, business plans and proposal calls for development partnerships and land disposition.<\/li> <li><strong>Due Diligence<\/strong>\\u00c2&nbsp;\\u00e2\\u20ac\\u201c due diligence support in the fields of regional planning and land economics for institutional, commercial and residential real estate development proposals.<\/li> <li><strong>Land Use Planning and Policy<\/strong>\\u00c2&nbsp;\\u00e2\\u20ac\\u201c Land needs assessments, master planning, site planning, regional and municipal planning and policy, official plan and zoning by-law amendments, economic development strategies, community improvement plans, development approvals and GIS.<\/li> <\/ul><\/li> <\/ul>Qualifications <br> <br> <ul> <li>Post-secondary education in urban planning, economics, finance or a combination of the three.<\/li> <li>Master\\u00e2\\u20ac\\u2122s Degree in Urban and Regional Planning\/Finance\/Statistics\/Economics is heavily favoured.<\/li> <li>3-5 years relevant experience dealing with demographics and statistical analysis.\\u00c2&nbsp;<\/li> <li>Experience with development charges\/municipal finance would be an asset.<\/li> <li>Proficient in MS Office must have Advanced level financial modelling skills (Excel)<\/li> <li>Excellent analytical and proven organisation skills; must be able to meet deadlines under pressure with minimum supervision<\/li> <li>Strong analytical and critical thinking<\/li> <li>Ability to work independently as well as be a strong team contributor<\/li> <li>Excellent written and verbal communications<\/li> <li>Valid Driver\\u00e2\\u20ac\\u2122s License and access to a vehicle<\/li> <\/ul> <br> <br>Additional Information <br> <br> <p><strong>Office Description:<\/strong><\/p> <p>We are currently in a work from home model during COVID-19\\u00c2&nbsp;but when we do the office is steps away from St. Clair station and is easily accessible by bike, TTC and car. Occupying 7 floors, with over 700 employees, it is the largest office at IBI Group. The floors are open concept and represent our collaborative approach to projects.<\/p> <p><strong>As part of IBI Group's selection process, candidates may be requested to consent to background checks relevant to the role under consideration for, prior to receiving a job offer. These could include: work references, education and credential confirmation, employment verification, identity check, credit report, criminal offence and driver\\u00e2\\u20ac\\u2122s license record.<\/strong><\/p> <p>We thank all applicants for their interest. However, only those selected for an interview will be contacted. IBI Group is proud to be an Equal Opportunity Employer.<\/p> <\/div>\"}"
}