{
    "id":"Kaggle::techmap::61659ee82e1fa15bcc2f2829::linkedin_ni::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Customer focused with a courteous and professional manner. Excellent communication skills, written & verbal. Flexibility & availability to travel. Ability to work on your own initiative. Good organisational and timekeeping skills. Key Requirements. Background in Engineering essential. Minimum 2 years experience in a field-based engineering role in the medical sector or a related industry is preferable. Full clean Drivers Licence is essential. Computer literate. Successful completion of Police checking via Access NI. Place of work may change according to Business needs, in accordance with the job content. The successful candidate will be required to undertake an initial training period in one of HC21s facilities, which may require overnight\/weekly stays during this period, depending on the location of the Engineer. Ongoing training is offered to all Engineers and may require travel outside of normal working areas on occasions.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61659ee82e1fa15bcc2f2829::linkedin_ni\", \"source\": \"linkedin_ni\", \"country\": \"NI\", \"company\": \"Check Point Software Technologies, Ltd.\", \"position\": \"Field Service Engineer\", \"notes\": \"\", \"original\": \"Healthcare 21 Group is a high growth company that strives to achieve optimal outcomes and enhance the quality of patient care. Our success is driven by staying close to the customer and being willing to go the \\u2018extra mile\\u2019. Weaspire to motivate and encourage our employees to improve patient lives by delivering the best and most innovative healthcare products and solutions to clinicians and caregivers.<br><br>Our Company\\u2019s continued growth and ability to deliver our promises to our suppliers, customers, and community, is dependent on, our people.<br><br>The long-term success of our sustainable business is based on our teamwork, integrity, and the ability of our people to take ownership of their role. It is our responsibility to provide you with an exciting, innovative environment that is respectful, fulfilling and rewarding. Want know more about what to expect from a working life in Healthcare, thenclick here.<br><br>Aquilant NI Ltd., Nursing Care Service Division, a part of the Healthcare 21 Group, are currently looking to recruit a Field Service Engineer who will be responsible for assisting with repair of Primary Care products (mobility, aids and appliances) and Bed pan Washers across the Northern Ire-land region mainly. The geographical area to be covered will not be restricted to this area only and flexibility will be required at certain times.<br><br>The successful candidate will report directly to the Service Manager and will correspond with the Engineering Administration Teams daily.<br><br>The primary function of this position is to perform Planned Maintenance, repair and contract service maintenance of all customer equipment on site (Nursing Homes, community, client homes).<br><br>The role will also involve assisting in other geographical areas to provide additional cover when required to ensure that Service Level Agreement response time frames are maintained.<br><br><strong><u>Key Responsibilities Are Not Limited To But Will Include<br><br><\/u><\/strong>To inspect, repair and service medical equipment in the field<br><br>Co-ordinate &amp; conduct installations, equipment maintenance, repair and breakdown support at customer sites<br><br>Access parts codes and services manuals to ensure product service\/repair is in line with Manufacturer\\u2019s guidelines<br><br>Promote the Service Department ensuring a high standard of Customer Service and satisfaction is achieved always<br><br>Use Mobile App device to record accurately work carried out<br><br>Keep accurate account van stock &amp; complete boot stock checks as required<br><br>Any other activities as determined necessary by the Service Manager<br><br>Key Competencies<br><br>Strongdiagnostic, fault finding \/ problem solving, and judgement skills are essential in this role<br><br>Customer focused with a courteous and professional manner<br><br>Excellent communication skills, written &amp; verbal<br><br>Flexibility &amp; availability to travel<br><br>Ability to work on your own initiative<br><br>Good organisational and timekeeping skills<br><br>Key Requirements<br><br>Background in Engineering essential<br><br>Minimum 2 years\\u2019 experience in a field-based engineering role in the medical sector or a related industry is preferable.<br><br>Full clean Drivers Licence is essential<br><br>Computer literate<br><br>Successful completion of Police checking via Access NI<br><br>Place of work may change according to Business needs, in accordance with the job content<br><br>The successful candidate will be required to undertake an initial training period in one of HC21\\u2019s facilities, which may require overnight\/weekly stays during this period, depending on the location of the Engineer. Ongoing training is offered to all Engineers and may require travel outside of normal working areas on occasions.\"}"
}