{
    "id":"Kaggle::techmap::61549c4718d1697280f55c0f::linkedin_cn::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 8 years experiences of direct sales & marketing of intangible services. Experience in solution selling to clients product development, marketing and\/or operations departments. Work experience in both management consulting and entrepreneurial environments. Banking & Insurance working background preferred.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61549c4718d1697280f55c0f::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"Aspire Lifestyles\", \"position\": \"Business Development Manager (Guangzhou)\", \"notes\": \"\", \"original\": \"<p><strong><u>Key Responsibilities<\/u><\/strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/p><ul><li>Research the markets and monitor key trends to capture major new business opportunities. Understand competitions. Build up strong industry knowledge and expertise.<\/li><li>Aggressively identify prospects in B2B environment. Develop and nurture relationship with key personnel at multiple levels. Build up \\u201ctop-of-the-mind\\u201d positions in all product lines among the assigned industry sectors.<\/li><li>Analyze and map the size of business opportunities with each target. Develop and execute aggressive and prioritized prospecting plan and pipeline of high margin business to achieve quarterly and annual gross margin sales targets.<\/li><li>Identify prospects\/clients\\u2019 real needs through consultative probing. Effectively influence and facilitate prospects from recognizing their needs to work out suitable solutions and make final buying decisions. Such solutions are usually marketing\/positioning\/packaging of services built around our delivery platform and can make our services easily understood, communicated and have good marketing value in a B2C environment.<\/li><li>Ensure Direct to Bank as number one priority segment and focus, and drive the digital agenda in close collaboration with digital product team. Develop a concise business development plan for South China territory that focuses on growing international business with major clients.<\/li><li>Convince prospects of company value propositions, significantly differentiate us against competitors.<\/li><li>Aggressively approach new business in the new sectors and identify Account Extension opportunities and up-sell more services to existing clients.<\/li><li>Work closely with the Operations Department to develop high quality, deliverable, customized and long term, sustainable solutions based on prospects\\u2019 needs and. Ensure service delivery is to exceed client\\u2019s expectations.<\/li><li>Work closely with Account Servicing team to manage post-sales support around an \\u201cevent calendar\\u201d, such as periodical service reviews with clients, training, co-marketing &amp; promotion activities. Drive client communications with their customers, proactively engage clients to promote service utilizations and effectively manage clients\\u2019 expectations.<\/li><li>Manage to ensure favorable contractual and commercial terms.<\/li><li>Improve conversion rate and shorten selling cycle. Meet accounts receivable targets and ensure that all accounts pay promptly and within agreed credit terms.&nbsp;<\/li><\/ul><p><br><\/p><p><strong>Required Skills and Knowledge<\/strong><\/p><ul><li>Consultative probing skills: discover clients\\u2019 needs by asking right questions, listening &amp; summarizing<\/li><li>Presentation skills: using marketing language to communicate &amp; present intangible service solutions and demonstrate company values<\/li><li>People skills: networking, relationship building &amp; nurturing<\/li><li>Negotiation skills<\/li><li>Consultative &amp; professional selling skills in a B2B environment<\/li><li>Buying facilitation skills to professionally guide, influence &amp; facilitate client through the entire buying process<\/li><li>Strong marketing skills<\/li><li>Project management skills<\/li><\/ul><p><br><\/p><p><strong>Required Work Experience<\/strong><\/p><ul><li>&gt;8 years\\u2019 experiences of direct sales &amp; marketing of intangible services;<\/li><li>Experience in solution selling to clients\\u2019 product development, marketing and\/or operations departments<\/li><li>Work experience in both management consulting and entrepreneurial environments<\/li><li>Banking &amp; Insurance working background preferred<\/li><\/ul>\"}"
}