{
    "id":"Kaggle::techmap::6141439b3397860bd2baf755::dice_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"We Don't Just BuildTheWorld, We Build Innovative Technology Too. Come BuildtheWorldwithUs. This is the career you've been waiting for your whole life. Joining the Stanley Black & Decker team means working in an innovative, tech-drivenand highly collaborative team environment supported by over 58, 000 professionals in 60 countries across the globe. Here, you'll get the unique chance to impact some of the world's most iconic brands including STANLEY TOOLS, DEWALT, CRAFTSMAN, MAC TOOLS and Black & Decker. Your ideas and solutions have the potential to reach millions of customers as we work together to write the next chapter in our history. Come build with us and take your career to new heights. Who We Are. We're the World's largest toolcompany. We design and develop the tools that are used to change the world every dayhere in our engineering headquarters in Towson, Maryland. Our design teams are involved with every step of the process bringing these world class products to life. From conducting end user research to identify new needs, to designing and prototyping tools to ensurewe meet our customers high expectations, to creating robust tests to guarantee the tools we make stand up to the toughest environments, our engineers own every aspect of the process along the way. Who You Are. You're astrongproblem solver wholoves digging into the details to fully understand what is going on. You havefixed a lot ofproblems, so you knowhowtosort out what is meaningful and what is not to be as efficient as possible. You know what it takes to design a solution that is scalable to high volume manufacturing. You are looking for ahigh-visibility role where you can make an immediateand lastingimpact. You're agile and adaptable but work with precision to ensure we deliver top-notch customer experiences, always. You want to work on a project where you can see the fruits of your labor come to life and enjoy seeingthe finished product on the shelves of major retailers around theglobe. Youalso have: Bachelor's Degree in Mechanical Engineering with 3. years of experience. Strong proficiency and experience in use of 2D and 3D design software (CATIA V5 preferred). Firm understanding of GD&T, tolerance stack-ups, and 2D drawing best practices. Experience with FEA software also preferred, especially those used forstress and temperatureanalysis. Hands-on ability to build prototypes, teardown products, and report findings or corrective actions.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6141439b3397860bd2baf755::dice_us\", \"source\": \"dice_us\", \"country\": \"US\", \"company\": \"Stanley Black and Decker\", \"position\": \"Senior Engineer (Mechanical)\", \"notes\": \"\", \"original\": \"We Don't Just BuildTheWorld, We Build Innovative Technology Too. <br \/> <br \/>Come BuildtheWorldwithUs<br \/> <br \/>This is the career you've been waiting for your whole life. Joining the Stanley Black & Decker team means working in an innovative, tech-drivenand highly collaborative team environment supported by over 58,000 professionals in 60 countries across the globe. Here, you'll get the unique chance to impact some of the world's most iconic brands including STANLEY TOOLS, DEWALT, CRAFTSMAN, MAC TOOLS and Black & Decker. Your ideas and solutions have the potential to reach millions of customers as we work together to write the next chapter in our history. Come build with us and take your career to new heights. <br \/> <br \/>Who We Are <br \/>We're the World's largest toolcompany.We design and develop the tools that are used to change the world every dayhere in our engineering headquarters in Towson, Maryland.Our design teams are involved with every step of the process bringing these world class products to life. From conducting end user research to identify new needs, to designing and prototyping tools to ensurewe meet our customers high expectations, to creating robust tests to guarantee the tools we make stand up to the toughest environments, our engineers own every aspect of the process along the way.<br \/> <br \/>Who You Are <br \/>You're astrongproblem solver wholoves digging into the details to fully understand what is going on.You havefixed a lot ofproblems,so you knowhowtosort out what is meaningful and what is not to be as efficient as possible.You know what it takes to design a solution that is scalable to high volume manufacturing. You like getting your hands dirty and want to be the onedisassembling a problem to find out what is broken and how to fix it.You are looking for ahigh-visibility role where you can make an immediateand lastingimpact.You're agile and adaptable but work with precision to ensure we deliver top-notch customer experiences, always. You want to work on a project where you can see the fruits of your labor come to life and enjoy seeingthe finished product on the shelves of major retailers around theglobe. Youalso have: <br \/><br \/><ul><li>Bachelor's Degree in Mechanical Engineering with 3+ years of experience<br \/><\/li><li>Strong proficiency and experience in use of 2D and 3D design software (CATIA V5 preferred); Firm understanding of GD&T, tolerance stack-ups, and 2D drawing best practices.Experience with FEA software also preferred, especially those used forstress and temperatureanalysis.<br \/><\/li><li>Hands-on ability to build prototypes, teardown products, and report findings or corrective actions<br \/><\/li><li>A strong background in mechanical design; you have knowledge in material selection and related manufacturing processes for componentsand can demonstrate your ability applying DFM \/ DFA design principles.<br \/><\/li><\/ul><ul><li>Strong desire to learn new technologies\/processes. Possess an entrepreneurial, ambitious attitude to execute industry-best product features.<br \/><\/li><li>Excellent communication skills. Must be able to work with a global team including remote design and manufacturing centers.<br \/><\/li><li>Demonstrated leadership aptitude in prior project experience.<br \/><\/li><li>Computer Literacy; proficient inPowerPoint and Excel<br \/><\/li><li>Basic knowledge and experience with electro-mechanical design, electronic assemblies, and\/or DC circuits is a plus.<br \/><\/li><\/ul><ul><li>Personal or professional familiarity with power tools is a plus.<br \/><br \/><\/li><\/ul><br \/>What You'll Do <br \/>As a Senior Mechanical Engineer you'll be part of ourGlobal Tools & Storageteam located inTowson, MD.Specifically, you'll:<br \/><ul><li>Work collaboratively on the development of new professional power tool projects.<br \/><\/li><li>Contribute designs to multiple projects at once and manageprioritiesfor project deliverables. Develop and execute plans for project sample builds.<br \/><\/li><li>Collaborate cross functionally with non-engineering disciplines (Marketing, Sourcing, Manufacturing) to turn design problems into reality. Work closely with Marketing to turn Voice-of-the-Customer data into feasible designs.<br \/><\/li><\/ul><ul><li>Assemble prototypes, develop test plans, and oversee testing.<br \/><\/li><li>Lead design reviews and create working models of new product concepts using 3D CAD software.<br \/><\/li><li>Make definitive and effective project managementand engineering designdecisions to meet aggressive schedules.<br \/><\/li><li>Dissect a problem to find the root cause, designrobust solutions, andcreate an effective and fast test method to prove out the fix. <br \/><\/li><li>Support the Milestone process for all engineering requirements to deliver a product that meets our history of guaranteed tough products.<br \/><\/li><\/ul><ul><li>Identify opportunities to reduce cost and reduce design complexity.<br \/><\/li><li>Some domestic and international travel required. Less than 10% expected.<br \/><\/li><\/ul><br \/>Benefits & Perks <br \/>You'll get a competitive salary and a comprehensive benefits plan that includes medical, dental, life, vision, wellness program, disability, 401k, Employee Stock Purchase Plan, Paid Time Off, including paid vacation, holidays & personal days, and tuition reimbursement. And, of course, discounts on Stanley Black & Decker tools and products and well as discount programs for many other vendors and partners. <br \/><br \/>#LI-SM1<br \/> <br \/>All qualified applicants to Stanley Black & Decker are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran's status or any other protected characteristic.<br \/><br \/>#LI-SM1\"}"
}