{
    "id":"Kaggle::techmap::614367b8843a9816acf7d669::monsterasia_sg::1",
    "label_age":true,
    "analysis_age":"The phrase \"10 years working experience in Maintenance department\" may introduce age bias by setting an unattainable standard for younger workers, thereby favouring older candidates with more years of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years working experience in Maintenance department, preferably mid-heavy\/ pharmaceutical\/medical device manufacturing environment, with minimum 5 years in supervisory role. Experience in implementing Total Productive Maintenance is required. Highly developed interpersonal\/communication skills. Sound know-how and experience in Project management. Highly analytical and structured way of working. Self-motivated, results. and solution-oriented personality. Fluent in English. Knowledge, Skills and Abilities:. Good facility equipment, GMP knowledge and experienced in pharmaceutical\/medical device manufacturing environment would be an added advantage. Ability to successfully collaborate with teams across different organizational levels. Proficiency in MS office, MS Project, SAP, AutoCAD, interpret & design electric\/pneumatic schematic & control system. Preferably trained and certified in Lean Manufacturing (eg. 6 sigma green belt). Good leadership quality. Proficiency in PLC (Siemens, Omron & Allan Bradley), CAD, electrical engineering. Able to work off-shift hour. Completes own role independently. cGMP Standards. Understands and follows appropriate training in cGMP principles. Shows basic knowledge of the principles and important of cGMP regulations and Global Quality Standards related to the execution of assigned work. Problem Solving. Using A4, A3 & 6 sigma approach. Provide solutions to routine and a wide variety of problems ranging from simple to moderate in scope and complexity. Able to properly assess the situation and understand when to escalate to a higher level. Begins to develop competency in root cause analysis. Able to be aware of all relevant SOPs as per Company policy as they are related to the position covered by this Job Description. Support and contribute in Operation Excellence programs and activities towards delivery of the set target. Able to comply with the companys safety policy at all times. Proper use of Personal Protective Equipment (PPE). Work safely by not causing unsafe conditions or doing unsafe acts. Able to comply with the companys quality policy always. Prevent product quality defects. Eg intermixing, particulate contamination, etc. Continuous product quality improvement mindset. Competencies\/Authorities. This job holder is responsible to manage a team of chargehands and technicians. This job holder is responsible to obey the requirements of safety and health. Must compliance to company safety and health procedures\/policies. The job holder is aware of his\/her special responsibility towards health and safety in accordance with the companys safety policy always. Proper use of Personal Protective Equipment (PPE). Work safely by not causing unsafe conditions or doing unsafe acts. Give instructions and implement appropriate actions.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614367b8843a9816acf7d669::monsterasia_sg\", \"source\": \"monsterasia_sg\", \"country\": \"SG\", \"company\": \"West Pharmaceutical Services Singapore Pte. Ltd.\", \"position\": \"Supervisor, Maintenance\", \"notes\": \"\", \"original\": \"<div><p>Job Summary:<\/p><p><br><\/p><p>Responsibilities will include the leadership of the maintenance work force. This individual will be be responsible for planning of maintenance activities and to oversee maintenance functions such as preventative maintenance, repairs, new equipment\/system installation, process improvements and facility upgrading. This individual will also be expected to foster an open-minded work force using innovative technologies & techniques. Plan, direct, and supervise. Responsible and accountable for adherence to procedures, quality, production, maintenance, safety and schedules on assigned shifts; promote effective team member\/Company relations to help improve customer service and Company profits. This individual will responsible for zero downtime target.<\/p><p><br><\/p><p><\/p><p><br><\/p><p>Essential Duties and Responsibilities:<\/p><p><br><\/p><p>\\u2022 Supervise a multi-discipline shift team in the maintenance and installation of facility and pharmaceutical equipment consistent with high quality standards. Provide guidance and feedback, foster ownership and remove barriers.<\/p><p>\\u2022 Manage outside contractors; scheduling, training, contracts, insurance certificate and follow-up<\/p><p>\\u2022 Effectively communicate between; customers, shifts, contractors, engineers and management.<\/p><p>\\u2022 Provide leadership in developing teams, succession planning and advanced training programs suited for developing West maintenance team members.<\/p><p>\\u2022 Lead teams to; resolve issues, make process improvements and improve the efficiency of the department.<\/p><p>\\u2022 Manage the PM program and spare parts to maximize efficiencies and minimize down time.<\/p><p>\\u2022 Observe work being performed by maintenance team and contractors to ensure quality, timelines and maintenance goals are met.<\/p><p>\\u2022 Maintain close observation over process orders and keep informed of manufacturing status, provide maintenance support to facilitate the schedule.<\/p><p>\\u2022 Initiating\/reviewing\/completing; Deviation, CAPA, Incident & Disciplinary Report, Change Control, etc.<\/p><p>\\u2022 Monitor facility and process equipment and provide daily updates alerting management of any extensive downtime. Make recommendations for maintaining and or replacing equipment.<\/p><p>\\u2022 Lead \/ support site projects implementation<\/p><p>\\u2022 Promote all site initiatives including plant safety programs, lean initiatives, training programs, etc. Consistently interpret and apply all HR policies, practices and procedures among team members to hold team members accountable.<\/p><p>\\u2022 Participate in the resolution of employee complaints and personnel or performance issues and coach employees to encourage teamwork.<\/p><p>\\u2022 Use good housekeeping practices to maintain a clean, orderly, secure and safe work area<\/p><p>\\u2022 To participate in all audit such as HSE, FM global, ISO, Corporate, Customer, ISO, internal and etc<\/p><p>\\u2022 Able to work on permanent night shifts.<\/p><p>\\u2022 All other duties as required.<\/p><p><br><\/p><p><\/p><p><br><\/p><p><br><\/p><p> Education and Experience:<\/p><p><br><\/p><p>\\u2022 Bachelor\\u2019s degree in engineering or equivalent experience preferred<\/p><p>\\u2022 10 years working experience in Maintenance department, preferably mid-heavy\/ pharmaceutical\/medical device manufacturing environment, with minimum 5 years in supervisory role<\/p><p>\\u2022 Experience in implementing Total Productive Maintenance is required<\/p><p>\\u2022 Highly developed interpersonal\/communication skills<\/p><p>\\u2022 Sound know-how and experience in Project management<\/p><p>\\u2022 Highly analytical and structured way of working<\/p><p>\\u2022 Self-motivated, results- and solution-oriented personality<\/p><p>\\u2022 Fluent in English<\/p><p><br><\/p><p><\/p><p><br><\/p><p>Knowledge, Skills and Abilities:<\/p><p><br><\/p><p>\\u2022 Good facility equipment, GMP knowledge and experienced in pharmaceutical\/medical device manufacturing environment would be an added advantage<\/p><p>\\u2022 Ability to successfully collaborate with teams across different organizational levels<\/p><p>\\u2022 Proficiency in MS office, MS Project, SAP, AutoCAD, interpret & design electric\/pneumatic schematic & control system<\/p><p>\\u2022 Preferably trained and certified in Lean Manufacturing (eg. 6 sigma green belt)<\/p><p>\\u2022 Good leadership quality<\/p><p>\\u2022 Proficiency in PLC (Siemens, Omron & Allan Bradley), CAD, electrical engineering<\/p><p>\\u2022 Able to work off-shift hour<\/p><p>\\u2022 Completes own role independently<\/p><p>\\u2022 cGMP Standards<\/p><p> \\u2022 Understands and follows appropriate training in cGMP principles<\/p><p> \\u2022 Shows basic knowledge of the principles and important of cGMP regulations and Global Quality Standards related to the execution of assigned work<\/p><p>\\u2022 Problem Solving; using A4, A3 & 6 sigma approach<\/p><p> \\u2022 Provide solutions to routine and a wide variety of problems ranging from simple to moderate in scope and complexity<\/p><p> \\u2022 Able to properly assess the situation and understand when to escalate to a higher level<\/p><p> \\u2022 Begins to develop competency in root cause analysis<\/p><p>\\u2022 Able to be aware of all relevant SOPs as per Company policy as they are related to the position covered by this Job Description<\/p><p>\\u2022 Support and contribute in Operation Excellence programs and activities towards delivery of the set target<\/p><p>\\u2022 Able to comply with the company\\u2019s safety policy at all times<\/p><p> \\u2022 Proper use of Personal Protective Equipment (PPE)<\/p><p> \\u2022 Work safely by not causing unsafe conditions or doing unsafe acts<\/p><p>\\u2022 Able to comply with the company\\u2019s quality policy always.<\/p><p> \\u2022 Prevent product quality defects; eg intermixing, particulate contamination, etc<\/p><p> \\u2022 Continuous product quality improvement mindset<\/p><p><br><\/p><p><\/p><p><br><\/p><p>Competencies\/Authorities<\/p><p><br><\/p><p>\\u2022 This job holder is responsible to manage a team of chargehands and technicians<\/p><p>\\u2022 This job holder is responsible to obey the requirements of safety and health; must compliance to company safety and health procedures\/policies<\/p><p>\\u2022 The job holder is aware of his\/her special responsibility towards health and safety in accordance with the company\\u2019s safety policy always;<\/p><p> \\u2022 Proper use of Personal Protective Equipment (PPE)<\/p><p> \\u2022 Work safely by not causing unsafe conditions or doing unsafe acts<\/p><p> \\u2022 Give instructions and implement appropriate actions<\/p><p> \\u2022 Ensure effective first aid<\/p><p><br><\/p><p> \\u2022 Initiate occupational health examinations or other occupational health activities<\/p><p> \\u2022 Conduct or initiate risk assessments<\/p><p> \\u2022 Eliminate conditions adverse to safety regulations<\/p><p> \\u2022 Conduct instructions<\/p><p> \\u2022 Object to misconduct of employees<\/p><p> \\u2022 Assess the effectiveness of activities and<\/p><p> \\u2022 If necessary, discontinue any dangerous activities<\/p><p>\\u2022 Knowledge and experience with total productive maintenance (TPM) implementation, predictive maintenance, mean-time between-failure (MTBF) and continuous improvement (CI)<\/p><p><br><\/p><p><\/p><p><br><\/p><p>Physical and Travel Requirements<\/p><p><br><\/p><p>\\u2022 Travel oversea as assigned<\/p><p><br><\/p><p><\/p><\/div>\"}"
}