{
    "id":"Kaggle::techmap::613e8eb824976a7e537fafea::aarp_us::8",
    "label_age":true,
    "analysis_age":"Phrase \"high energy level, a desire to work in a fast-paced\" could be seen as ageist.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"Repeated uses of the term \"he \/ she\" might discourage from applying those who do not identify as male or female.",
    "label_general":true,
    "analysis_general":"Noting that the company performs background checks and drug-testing could be seen as biased against those with a previous history.",
    "verified":true,
    "synthetic":false,
    "text":"Automotive Service Valet. Huffines Chevrolet Lewisville. Family owned and operated for over 95 years. We offer a respectful work environment, paid training, and an opportunity to work with an organization voted among the \"Top 100 Places to Work\" in the DFW area! In addition, we offer Company paid life insurance, 401-K with Company match, employee discounts, paid time off (PTO), Holidays, and optional benefits such as Health, Dental, Vision and Disability Insurance, and Health Saving Accounts (HSA). Your journey begins as Service Valet to help ensure complete customer satisfaction by moving vehicles in and around the Service Department area\/lot, maintaining the cleanliness of vehicles and the service area, and transporting customers to\/from their home when needed. He or she must have great communication and customer service skills, high energy level, a desire to work in a fast-paced environment, strong organizational and problem-solving skills, and a positive outlook. In addition, he or she has a valid driver's license and can safely maneuver vehicles in tight and small spaces. Fluent English speaking and writing skills, good time management skills, and professional appearance, speech, and behavior are all required for this position. Responsibilities: Greet all customers enthusiastically. Assist Service Advisors with providing excellence in customer service. Drives vehicles to and from service areas and lot as needed. Installs tags in all vehicles brought in for service. Services vehicles with gas, oil, and fluids as needed. Washes and cleans vehicles as needed. Helps maintain lot appearance by cleaning driveway and sidewalks, and removing debris as necessary. Helps maintain department cleanliness, including windows, doors, floors, etc. Transports customers to and from their home when needed and requested. Follows all safety and security procedures. Performs other duties as assignedDRUG-FREE WORKPLACEIn addition to background checks, Huffines performs pre-employment and random drug testing.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613e8eb824976a7e537fafea::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Huffines\", \"position\": \"Automotive Service Valet HCL\", \"notes\": \"\", \"original\": \"Automotive Service ValetHuffines Chevrolet LewisvilleFamily owned and operated for over 95 years. We offer a respectful work environment, paid training, and an opportunity to work with an organization voted among the \\\"Top 100 Places to Work\\\" in the DFW area! In addition, we offer Company paid life insurance, 401-K with Company match, employee discounts, paid time off (PTO), Holidays, and optional benefits such as Health, Dental, Vision and Disability Insurance, and Health Saving Accounts (HSA).Your journey begins as Service Valet to help ensure complete customer satisfaction by moving vehicles in and around the Service Department area\/lot, maintaining the cleanliness of vehicles and the service area, and transporting customers to\/from their home when needed.He or she must have great communication and customer service skills, high energy level, a desire to work in a fast-paced environment, strong organizational and problem-solving skills, and a positive outlook. In addition, he or she has a valid driver's license and can safely maneuver vehicles in tight and small spaces. Fluent English speaking and writing skills, good time management skills, and professional appearance, speech, and behavior are all required for this position.Responsibilities:* Greet all customers enthusiastically* Assist Service Advisors with providing excellence in customer service.* Drives vehicles to and from service areas and lot as needed.* Installs tags in all vehicles brought in for service.* Services vehicles with gas, oil, and fluids as needed.* Washes and cleans vehicles as needed.* Helps maintain lot appearance by cleaning driveway and sidewalks, and removing debris as necessary.* Helps maintain department cleanliness, including windows, doors, floors, etc.* Transports customers to and from their home when needed and requested.* Follows all safety and security procedures.* Performs other duties as assignedDRUG-FREE WORKPLACEIn addition to background checks, Huffines performs pre-employment and random drug testing.<br \/>\"}"
}