{
    "id":"Kaggle::techmap::6137b32c7d4ffc16c87fcc89::careerbuilder_us::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Requirements. Production Operator. Shifts Available: *ROTATING SCHEDULE*. FIRST (4:30am to 4:30pm). SECOND (4:30pm to 4:30am). Pay Rate: $15. 39 \/ hr. Our Opportunity and what you'll do as a Production Operator: The Production Operator will take a hands-on role in the production of liquid-applied and sprayable duct sealants, industrial-grade duct tape, and other liquid waterproofing and insulation barrier products. Essential Job Duties: Operate production and packaging equipment. Package and label finished products. Monitor packaging materials and reload queues as necessary. Receives and reads work order. Starts machine and adjusts machines as needed. Continuously observes and examine machines in operation to ensure conformance to customers' specifications. Stacks, sorts, and bundles material according to the bill of lading instructions. Maintain good housekeeping and workplace organization (5S\/Lean Manufacturing). Adhere to all safety regulations. Other duties as assigned. Work Experience. Previous experience in a manufacturing environment preferred. High school diploma or GED. Ability to follow instructions and read production orders. Able to work fast and efficient and willing to work long hours during the busy season. Ability to read measuring gauges such as a tape measure and calipers. Understanding basic math, reading, and writing skills. Strong verbal communication and listening skills. Experience with computers including various manufacturing programs. Ability to effectively communicate. Forklift experience a plus. Work Environment: This position is in a warehouse-type facility subject to ambient and outside temperatures. Exposure to loud machinery, dust, and mechanical parts. Work surfaces are primarily concrete and operators will stand while performing their respective job functions. Business is cyclical and will require flexibility in the days of the week worked. This position typically works 12 hour shifts, including weekends as necessary. Physical Demands: Ability to move product throughout facility. Repetitive use of hands required with simple grasping, pushing and pulling. This position requires standing, walking, lifting, reaching above shoulders, bending, and twisting. We don't hire temps, we hire TEAMMATES! If this sounds like the right job for you, please apply online or in-person Monday. Friday from 8am to 5pm! Not for you, but someone you know?",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137b32c7d4ffc16c87fcc89::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Onin Staffing\", \"position\": \"Production Operator\", \"notes\": \"\", \"original\": \"<strong>Job Requirements <\/strong><br \/><p><strong>Production Operator<\/strong><\/p><p><strong>Shifts Available: <em>*ROTATING SCHEDULE*<\/em><\/strong><\/p><p><strong>FIRST (4:30am to 4:30pm)<\/strong><\/p><p><strong>SECOND (4:30pm to 4:30am)<\/strong><\/p><p><strong>Pay Rate: $15.39 \/ hr <\/strong><\/p><br \/><p><strong>Our Opportunity and what you'll do as a Production Operator:<\/strong><\/p><p>The Production Operator will take a hands-on role in the production of liquid-applied and sprayable duct sealants, industrial-grade duct tape, and other liquid waterproofing and insulation barrier products.<\/p><br \/><p><strong>Essential Job Duties:<\/strong><\/p><p>Operate production and packaging equipment<\/p><p>Package and label finished products<\/p><p>Monitor packaging materials and reload queues as necessary<\/p><p>Receives and reads work order<\/p><p>Starts machine and adjusts machines as needed<\/p><p>Continuously observes and examine machines in operation to ensure conformance to customers' specifications<\/p><p>Stacks, sorts, and bundles material according to the bill of lading instructions<\/p><p>Maintain good housekeeping and workplace organization (5S\/Lean Manufacturing)<\/p><p>Adhere to all safety regulations<\/p><p>Other duties as assigned<\/p><br \/><br \/><strong>Work Experience <\/strong><br \/><ul><li>Previous experience in a manufacturing environment preferred<\/li><li>High school diploma or GED<\/li><li>Ability to follow instructions and read production orders<\/li><li>Able to work fast and efficient and willing to work long hours during the busy season<\/li><li>Ability to read measuring gauges such as a tape measure and calipers<\/li><li>Understanding basic math, reading, and writing skills<\/li><li>Strong verbal communication and listening skills<\/li><li>Experience with computers including various manufacturing programs<\/li><li>Ability to effectively communicate<\/li><li>Forklift experience a plus<\/li><\/ul><br \/><p><strong>Work Environment:<\/strong><\/p><p>This position is in a warehouse-type facility subject to ambient and outside temperatures; exposure to loud machinery, dust, and mechanical parts. Work surfaces are primarily concrete and operators will stand while performing their respective job functions. Business is cyclical and will require flexibility in the days of the week worked. This position typically works 12 hour shifts, including weekends as necessary.<\/p><br \/><p><strong>Physical Demands:<\/strong><\/p><p>Ability to move product throughout facility<\/p><p>Repetitive use of hands required with simple grasping, pushing and pulling<\/p><p>This position requires standing, walking, lifting, reaching above shoulders, bending, and twisting<\/p><br \/><p><strong><em> *Ability to pass a background check, drug screen, & E-Verify*<\/em><\/strong><\/p><br \/><p style=\\\"text-align: center\\\"><strong><em>\\ufeff<\/em>We don't hire temps, we hire <em>TEAMMATES!<\/em><\/strong><\/p><p style=\\\"text-align: center\\\"><strong><em><\/em><\/strong><\/p><p style=\\\"text-align: center\\\"><br \/><\/p><p style=\\\"text-align: center\\\">If this sounds like the right job for you, please apply online or in-person Monday - Friday from 8am to 5pm!Not for you, but someone you know? Share this job with them and then check out our other available jobs. No appointment necessary and guaranteed interviews! Each application submitted gets individually reviewed by our team and retained in case a great opportunity opens for you with any of our locations to join our Team.Don\\u2019t wait, we want YOU to be our next <em>Teammate!<\/em><\/p><p style=\\\"text-align: center\\\"><br \/><\/p><p style=\\\"text-align: center\\\"><strong>\\u014cnin Staffing \\u2013 Richardson<\/strong><\/p><p style=\\\"text-align: center\\\"><strong>2185 W. Buckingham Rd.<\/strong><\/p><p style=\\\"text-align: center\\\"><strong>Richardson, TX 75081<\/strong><\/p><p style=\\\"text-align: center\\\"><strong>Ph: [Phone number shown when applying] (call or text)<\/strong><\/p><p style=\\\"text-align: center\\\"><strong>Email: [Email available when viewing the job]<\/strong><\/p><br \/><p style=\\\"text-align: center\\\"><br \/><\/p><br \/><br \/><strong>Benefits <\/strong><br \/><p>\\u014cninbelieves that your health is important. Medical benefits should be affordable and easy to use with your busy schedule. That's why we offer our teammates custom-built benefits that are affordable and convenient to use. When you're a part of our team, you will have affordable benefits you'll actually want to use such as; $5 Prescription drug copays, $5 Doctor's Visit copays, Free Teledoctor Service, Free Counseling Services, Life Insurance Included, Vision Insurance Included, Dental Insurance Included, Vacation and Holiday Pay and Scholarship Opportunities. You will get these amazing benefits and more after just 30 days.<\/p><br \/><br \/>&nbsp;\"}"
}