{
    "id":"Kaggle::techmap::5f818d70ebf38561debdcf22::indeed_ie::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You may be required to. work overtime on an exceptional basis depending on work requirements. General Conditions. The Hospital Board will not be responsible for the loss or theft of personal belongings. Fire orders must be observed and staff must complete fire training every 2 years. All accidents within the department must be reported immediately. In accordance with the Safety, Health and Welfare at Work Act 2005, all staff must. comply with all safety regulations. St Jamess Hospital is a Tobacco Free Campus. The use of Tobacco or Electronic. Cigarettes is not permitted within the Hospital Buildings or on the grounds. Confidentiality. In the course of your employment you may have access to or hear information concerning. the medical or personal affairs of patients and\/or staff, or other health services business. Such records and information are strictly confidential and unless acting on the instructions. of an authorised officer, on no account must information concerning staff, patients or other. health service business be divulged or discussed except in the performance of normal duty. In addition records must never be left in such a manner that unauthorised persons can. obtain access to them and must be kept in safe custody when no longer required. Health. A candidate for and any person holding the office must be fully competent and capable of. undertaking the duties attached to the office and be in a state of health such as would. indicate a reasonable prospect of ability to render regular and efficient service. Infection Control & Hygiene. It is the responsibility of all staff across the hospital to ensure that infection control and. hygiene standards are adhered to and maintained at all times. Recruitment Process . Approval to Hire (VAF process) . Hiring Manager  Role Profile . Advertising . Application Process (Standard Application Form) . Shortlisting of Candidates will be based on information provided in Standard. Application Form . Interview Process . All applicants who move to the 2nd stage of the Selection process (i. e. post interview). will be subject to Reference Checking X 2, Garda Clearance and Occupational Health. Screening (Questionnaire). All external successful candidates who take up appointment will be required to attend. a Mandatory Induction Programme. Application Procedure: The Application Form is available under. Nursing Posts section of Careers webpage. Alternatively, please contact the Human Resources Directorate for an application form,. Phone: (01) 4162559 or Email: stjames. Please note closing date. Monday 26th October 2020for receipt ofcompletedapplication. forms.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::5f818d70ebf38561debdcf22::indeed_ie\", \"source\": \"indeed_ie\", \"country\": \"IE\", \"company\": \"St. James's Hospital\", \"position\": \"Staff Nurse Mental Health\", \"notes\": \"\", \"original\": \"<p><\/p>\\n<div>\\n <div>\\n  <div>\\n   <p><b>Role Profile <\/b><br> <br> <b>Role Title Staff Nurse: Mental Health <\/b><\/p>\\n   <p><\/p>\\n   <p><b>Purpose of the Role <\/b>The delivery of mental health nursing is underpinned by <\/p>\\n   <p>the therapeutic use of self and the adoption of a holistic <\/p>\\n   <p>approach. The promotion of mental health and well <\/p>\\n   <p>being and the adoption of the principles of recovery are <\/p>\\n   <p>promoted in conjunction with service user choice. The <\/p>\\n   <p>mental health nurse will assess, plan, implement and <\/p>\\n   <p>evaluate care to the highest professional and ethical <\/p>\\n   <p>standards within the model of nursing care practiced in <\/p>\\n   <p>the relevant care setting. The mental health nurse will <\/p>\\n   <p>provide holistic, person centred care, promoting <\/p>\\n   <p>optimum independence and enhancing the quality of <\/p>\\n   <p>life for service users. <\/p>\\n   <p><\/p>\\n   <p><b>Department\/Directorate <\/b><\/p>\\n   <p><\/p>\\n   <p>Jonathan Swift Clinic, Department of Psychiatry <\/p>\\n   <p><b>Reports to <\/b><\/p>\\n   <p><\/p>\\n   <p>Clinical Nurse Manager II <\/p>\\n   <p>Professionally Accountable to the Director of Nursing <\/p>\\n   <p><\/p>\\n   <p><b>Key Direct Reports <\/b><\/p>\\n   <p><\/p>\\n   <p>Support Staff, Student Nurses as appropriate <\/p>\\n   <p><\/p>\\n   <p><b>Grade <\/b><\/p>\\n   <p><\/p>\\n   <p>Staff Nurse Mental Health <\/p>\\n   <p><b>Salary Scale <\/b><\/p>\\n   <p><\/p>\\n   <p>\\u20ac 31,295 - \\u20ac 47,733 (LSI x1) <\/p>\\n   <p><b>Job Reference Number: <\/b><\/p>\\n   <p><\/p>\\n   <p>54762\/20 <\/p>\\n   <p><b>Enquiries To: <\/b><\/p>\\n   <p><\/p>\\n   <p>Ms. Mair\\u00e9ad Kelly, ADON Jonathan Swift Clinic; <\/p>\\n   <p>Phone: 01 428 4015; Email: mdkelly@stjames.ie <\/p>\\n   <p><\/p>\\n   <p><b>Closing Date: <\/b><\/p>\\n   <p><\/p>\\n   <p>Monday 26th October 2020 <\/p>\\n   <p><\/p>\\n   <p><b>Key Duties and Responsibilities <\/b><\/p>\\n   <p>A staff nurse is a registered nurse who is involved in direct patient care with the <\/p>\\n   <p>responsibility of providing the highest standard of evidence based nursing care in <\/p>\\n   <p>partnership with other health care professionals. \\u2022 <\/p>\\n   <p><\/p>\\n   <p>Their role is to promote mental health and recovery, develop therapeutic <\/p>\\n   <p>relationships with patients, and help patients cope with illness. Responsibilities <\/p>\\n   <p>include assessing, planning, delivering and evaluating highly specialised nursing <\/p>\\n   <p>care, using a holistic approach. \\u2022 <\/p>\\n   <p>When providing direct patient care, they observe, assess, and record symptoms, <\/p>\\n   <p>responses, and progress. \\u2022 <\/p>\\n   <p>They also supervise and assess student nurses and other junior staff in the clinical <\/p>\\n   <p>area. \\u2022 <\/p>\\n   <p>Participate as an multi-disciplinary team member in delivering the plan of care while <\/p>\\n  <\/div>\\n <\/div>\\n <p><\/p>\\n <div>\\n  <div>\\n   <p>contributing the unique nursing perspective to enhance service user care \\u2022 <\/p>\\n   <p>The Registered Nurse must adhere to Code of Professional Practice and Behaviours<br> <\/p>\\n   <p><br> * The above Role Profile is not intended to be a comprehensive list of all duties involved and <br> consequently the post holder may be required to perform other duties as appropriate to the post <br> which may be assigned to him\/her from time to time and to contribute to the development of the post <\/p>\\n   <p>while in office. This Role Profile will be subject to review in the light of changing circumstances.<i> <\/i><\/p>\\n   <p><\/p>\\n   <p><b>Academic\/Professional Qualifications and\/or relevant Experience <\/b><\/p>\\n   <p><b>Required:<br> \\u2022 <\/b><br> <\/p>\\n   <p>Be Registered Psychiatric Nurse with The Nursing Midwifery Board of Ireland (NMBI), <\/p>\\n   <p>or be eligible to register. <\/p>\\n   <p><\/p>\\n   <p><b>AND \\u2022 <\/b><\/p>\\n   <p><\/p>\\n   <p>Minimum of six months experience (post graduate or undergraduate) in Mental <\/p>\\n   <p>Health Nursing. <\/p>\\n   <p><\/p>\\n   <p><b><i>Note:<\/i><\/b> Post holders must maintain annual registration with NMBI. <\/p>\\n   <p><\/p>\\n   <p><b>Desirable: \\u2022 <\/b><\/p>\\n   <p>N\/A <\/p>\\n   <p><\/p>\\n   <p><b>Technical\/Clinical Competencies <\/b><\/p>\\n   <p><b>Required: \\u2022 <\/b><\/p>\\n   <p>Be able to demonstrate working knowledge of the Mental Health Act 2001, its <\/p>\\n   <p>associated rules, regulations and codes of practice. \\u2022 <\/p>\\n   <p>Experience in teaching and assessing junior staff\/ nursing students. <\/p>\\n   <p><\/p>\\n   <p><b>Desirable \\u2022 <\/b><\/p>\\n   <p>Basic I.T. Skills. \\u2022 <\/p>\\n   <p>Basic Life Support <\/p>\\n   <p><\/p>\\n   <p><b>SJH Behavioural Competencies <\/b><\/p>\\n   <p><b>Competency <\/b><b><i>Required<\/i><\/b><b> <\/b><\/p>\\n   <p><\/p>\\n   <p><b>Level <\/b><\/p>\\n   <p><b>Required <\/b><\/p>\\n   <p><\/p>\\n   <p><b>Appropriate Descriptors<\/b> <\/p>\\n   <p><\/p>\\n   <p><b>Communication<\/b><\/p>\\n   <p><\/p>\\n   <p><b>\\u2022 <\/b><\/p>\\n   <p><\/p>\\n   <p>Listens openly, using questions to check for <\/p>\\n   <p>understanding\/ avoid misinterpretation. \\u2022 <\/p>\\n   <p>Knows when, how, and whom to contact on <\/p>\\n   <p>various issues \\u2022 <\/p>\\n   <p>Knows when to talk and when to listen.<b> <\/b><\/p>\\n   <p><b>Team player 1 <\/b>\\u2022 Helps others: proactively takes on different <\/p>\\n   <p>roles according to the needs of the team. \\u2022 <\/p>\\n   <p>Is aware of how their behaviour might <\/p>\\n   <p>impact on others. \\u2022 <\/p>\\n   <p>Is aware of the wider team goal and seeks <\/p>\\n   <p>to deliver on own contribution to this wider <\/p>\\n   <p>team. <\/p>\\n   <p><b>Continuous Development \\u2013 1 <\/b>\\u2022 Understands own scope of practice, and <\/p>\\n  <\/div>\\n <\/div>\\n <p><\/p>\\n <div>\\n  <div>\\n   <p><b>Personal and professional <\/b>maintains appropriate and professional <\/p>\\n   <p>boundaries. \\u2022 <\/p>\\n   <p>Learns quickly and keeps up to date with <\/p>\\n   <p>new ideas procedures and IT systems. \\u2022 <\/p>\\n   <p>Is receptive to constructive feedback: <\/p>\\n   <p>acknowledges own limitations and <\/p>\\n   <p>recognises development opportunities <\/p>\\n   <p><b>Quality and Safety Service 1 <\/b>\\u2022 Strives to achieve results in quality and <\/p>\\n   <p>safety. \\u2022 <\/p>\\n   <p>Understands the role of multi-disciplinary <\/p>\\n   <p>teams for patient care\/ customer service <\/p>\\n   <p>and quality. Seeks input from others where <\/p>\\n   <p>appropriate. \\u2022 <\/p>\\n   <p>Demonstrates compassion and <\/p>\\n   <p>consideration to all at all times. <\/p>\\n   <p><\/p>\\n   <p><b>Proficiency in the English language<\/b> <\/p>\\n   <p>A level of proficiency in the English language, written and spoken, is a requirement of all <\/p>\\n   <p>roles within St. James\\u2019s Hospital. You will be required to self assess your proficiency level in <\/p>\\n   <p>the Standard Application Form. <b>In addition, your proficiency in spoken English will be <\/b><\/p>\\n   <p><b>assessed during the interview process appropriate to the role available.<\/b> <\/p>\\n   <p><\/p>\\n   <p><b>Particulars of Office<\/b> <\/p>\\n   <p>1. The appointment to this post will be <b>Permanent, Full-Time and Pensionable. <\/b><\/p>\\n   <p>2. Annual Leave allowance is <b>24-27 days<\/b> per annum. <\/p>\\n   <p>3. The person appointed must not give less than <b>one month\\u2019s notice<\/b> in writing, of <\/p>\\n   <p>intention to resign. <\/p>\\n   <p>4. Normal working hours will be <b>39 <\/b>per week. <\/p>\\n   <p>5. You will be required to work the agreed roster \/ on call arrangements advised to you by <\/p>\\n   <p>your line manager. Your contracted hours of work will be liable to change based on the <\/p>\\n   <p>24 hour \/ 7 day week roster system in place across the hospital. You may be required to <\/p>\\n   <p>work overtime on an exceptional basis depending on work requirements. <\/p>\\n   <p><\/p>\\n   <p><b>General Conditions <\/b><\/p>\\n   <p>1. The Hospital Board will not be responsible for the loss or theft of personal belongings. <\/p>\\n   <p>2. Fire orders must be observed and staff must complete fire training every 2 years <\/p>\\n   <p>3. All accidents within the department must be reported immediately. <\/p>\\n   <p>4. In accordance with the \\u201cSafety, Health and Welfare at Work Act 2005\\u201d, all staff must <\/p>\\n   <p>comply with all safety regulations. <\/p>\\n   <p>5. St James\\u2019s Hospital is a Tobacco Free Campus. The use of Tobacco or Electronic <\/p>\\n   <p>Cigarettes is not permitted within the Hospital Buildings or on the grounds. <\/p>\\n   <p><\/p>\\n   <p><b>Confidentiality <\/b><\/p>\\n   <p>In the course of your employment you may have access to or hear information concerning <\/p>\\n   <p>the medical or personal affairs of patients and\/or staff, or other health services business. <\/p>\\n   <p>Such records and information are strictly confidential and unless acting on the instructions <\/p>\\n   <p>of an authorised officer, on no account must information concerning staff, patients or other <\/p>\\n   <p>health service business be divulged or discussed except in the performance of normal duty. <\/p>\\n   <p>In addition records must never be left in such a manner that unauthorised persons can <\/p>\\n  <\/div>\\n <\/div>\\n <p><\/p>\\n <div>\\n  <div>\\n   <p>obtain access to them and must be kept in safe custody when no longer required. <\/p>\\n   <p><b>Health<\/b> <\/p>\\n   <p>A candidate for and any person holding the office must be fully competent and capable of <\/p>\\n   <p>undertaking the duties attached to the office and be in a state of health such as would <\/p>\\n   <p>indicate a reasonable prospect of ability to render regular and efficient service. <\/p>\\n   <p><\/p>\\n   <p><b>Infection Control &amp; Hygiene <\/b><\/p>\\n   <p>It is the responsibility of all staff across the hospital to ensure that infection control and <\/p>\\n   <p>hygiene standards are adhered to and maintained at all times. <\/p>\\n   <p><\/p>\\n   <p><b>Recruitment Process<\/b> \\u2022 <\/p>\\n   <p>Approval to Hire (VAF process) \\u2022 <\/p>\\n   <p>Hiring Manager \\u2013 Role Profile \\u2022 <\/p>\\n   <p>Advertising \\u2022 <\/p>\\n   <p>Application Process (Standard Application Form) \\u2022 <\/p>\\n   <p>Shortlisting of Candidates will be based on information provided in Standard <\/p>\\n   <p>Application Form \\u2022 <\/p>\\n   <p>Interview Process \\u2022 <\/p>\\n   <p>All applicants who move to the 2nd stage of the Selection process (i.e. post interview) <\/p>\\n   <p>will be subject to Reference Checking X 2, Garda Clearance and Occupational Health <\/p>\\n   <p>Screening (Questionnaire). \\u2022 <\/p>\\n   <p>All external successful candidates who take up appointment will be required to attend <br> a Mandatory Induction Programme.<br> <br> <\/p>\\n   <p><b>Application Procedure: <\/b><\/p>\\n   <p><\/p>\\n   <p>The Application Form is available under <b>Nursing Posts<\/b> section of Careers webpage. <\/p>\\n   <p><\/p>\\n   <p>Alternatively, please contact the Human Resources Directorate for an application form, <\/p>\\n   <p>Phone: (01) 4162559 or Email: nursejobs@stjames.ie <\/p>\\n   <p><\/p>\\n   <p>Please note closing date <b>Monday 26th October 2020 <\/b>for receipt of <b>completed <\/b>application <\/p>\\n   <p>forms. C.V.s will not be accepted. <\/p>\\n   <p><\/p>\\n   <p><i>A panel may be formed from which future vacancies will be filled <\/i><\/p>\\n   <p><\/p>\\n   <p><b>St. James\\u2019s Hospital is an Equal Opportunities Employer<\/b><\/p>\\n  <\/div>\\n <\/div>\\n<\/div>\\n<p><\/p>\"}"
}