{
    "id":"Kaggle::techmap::6148e9b24ca8eb4d9076a972::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement for a \" motor vehicle\" could bias those from disadvantaged backgrounds.",
    "verified":true,
    "synthetic":false,
    "text":" Calvary. Permanent Part Time. About The Role. Calvary Community Care support workers make a difference in the community by facilitating positive health and wellbeing options for individuals, their families and carers. As a Support Worker your role will be to assist a diverse range of clients including aged, disability and high needs clients with activities of daily living and providing support services such as Domestic Assistance, Social Support, Specialist Children and Adult Services, Respite and Personal Care at their home and in the community. We are currently seeking qualified support workers to join our team to support our clients in the Launceston and surrounding areas. What you bring. Cert III in Individual Support \/ HACC \/ Aged Care \/ Disability or equivalent. Availability to cover a range of shifts across the week including mornings, evenings and weekends. Current First Aid Certificate (or willingness to obtain one). Current and valid Drivers Licence, insured and reliable motor vehicle, and smart mobile phone. Computer literacy and access to emails. Willingness to do all shifts (including domestic assistance) and to undergo credentialing in medication if required. A desire to join a team committed to the care of others in a mission based organisation. NDIS Workers Screening Clearance required. Benefits. This is an excellent opportunity to be a part of a leading mission based health care organisation. We offer paid parental leave, salary packaging, career progression, flexible working hours and training and skills development. Calvary is also proud to be recognised as a leader in gender equality. Further details are available here: httpswww. calvarycare. org. au\/careers\/benefits\/ [link removed]. About Calvary. Calvary is a national Catholic provider of health, community and aged care services operating in six states and territories. Our services include public and private hospital care, acute and sub-acute care, home care services and retirement and aged care services, in both rural and metropolitan areas. Calvary employs over 11, 000 people and has over 1, 500 volunteers. Calvary continues the mission of the Sisters of the Little Company of Mary, a mission [link removed] focused on caring for those who are sick, dying and in need. We express our values of hospitality, healing, stewardship and respect through being for others exemplified by the Spirit of Calvary [link removed] and the example of Venerable Mary Potter [link removed]. How to join the team.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148e9b24ca8eb4d9076a972::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Calvary Community Care\", \"position\": \"Support Worker- Launceston\", \"notes\": \"\", \"original\": \"<strong>Calvary<\/strong><br \/>Permanent Part Time<br \/><br \/><p><em>About The Role<\/em><\/p><p>Calvary Community Care support workers make a difference in the community by facilitating positive health and wellbeing options for individuals, their families and carers.<br \/>As a Support Worker your role will be to assist a diverse range of clients including aged, disability and high needs clients with activities of daily living and providing support services such as Domestic Assistance, Social Support, Specialist Children and Adult Services, Respite and Personal Care at their home and in the community.<\/p><p>We are currently seeking qualified support workers to join our team to support our clients in the Launceston and surrounding areas.<br \/><br \/><em>\\u00a0<\/em><br \/><em>What you bring \\u00a0<\/em><\/p><ul><li>Cert III in Individual Support \/ HACC \/ Aged Care \/ Disability\\u00a0or equivalent<\/li><li>Availability to cover a range of shifts across the week including mornings, evenings and weekends<\/li><li>Current First Aid Certificate (or willingness to obtain one)<\/li><li>Current and valid Driver\\u2019s Licence, insured and reliable motor vehicle, and smart mobile phone<\/li><li>Computer literacy and access to emails<\/li><li>Willingness to do all shifts (including domestic assistance) and to undergo credentialing in medication if required<\/li><li><div>A desire to join a team committed to the care of others in a mission based organisation<\/div><\/li><li><strong>NDIS Workers Screening Clearance required<\/strong><\/li><\/ul><p><strong><em>Benefits <\/em><\/strong><\/p><p>This is an excellent opportunity to be a part of a leading mission based health care organisation. We offer paid parental leave, salary packaging, career progression, flexible working hours and training and skills development. Calvary is also proud to be recognised as a leader in gender equality. \\u00a0Further details are available here: https:\/\/www.calvarycare.org.au\/careers\/benefits\/ [link removed]<\/p><p><strong><em>About Calvary<\/em><\/strong><\/p><p>Calvary is a national Catholic provider of health, community and aged care services operating in six states and territories. Our services include public and private hospital care, acute and sub-acute care, home care services and retirement and aged care services, in both rural and metropolitan areas.\\u00a0 Calvary employs over 11,000 people and has over 1,500 volunteers.<\/p><p>Calvary continues the mission of the Sisters of the Little Company of Mary, a mission [link removed] focused on caring for those who are sick, dying and in need.\\u00a0 We express our values of hospitality, healing, stewardship and respect through \\u201cbeing for others\\u201d exemplified by the Spirit of Calvary [link removed] and the example of Venerable Mary Potter [link removed].<\/p><p><strong><em>How to join the team<\/em><\/strong><\/p><p>To join our diverse, compassionate and dedicated team for a rewarding Calvary career, please submit an online application.<\/p><p>Please note: attached to the job advertisement on the Calvary Careers portal are important documents relating to the role. Please ensure you view these documents before beginning your application. It is suggested that you download a copy of these for your reference.<\/p><p>Candidates must hold Australian or NZ Citizenship or the capacity to permanently work in Australia. Employment of a temporary visa holder may only occur if no suitable permanent resident or citizen of Australia has been identified for this position following suitable labour market testing.<\/p><p>As part of the application process, you may be required to participate in a health evaluation, which could include face to face assessment and drug and alcohol testing, to ensure your suitability for the role.<\/p><p>Please note we are unable to accept emailed applications or resumes and phone calls from recruitment agencies.<\/p><p>\\u00a0<\/p><p>\\u00a0<\/p><br \/><br \/><strong>Enquiries:<\/strong> Christina Mahony<br \/><strong>Ph:<\/strong> (13) 0079 7522<br \/><strong>Applications Close:<\/strong> 14\/10\/2021<br \/><br \/>To view the position description or submit your application please click the 'Apply Now' button below.<br \/>\"}"
}