{
    "id":"Kaggle::techmap::6134bfe53b915441ab88e7a7::aarp_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Future Leaders Program. Amica is searching for talented individuals for our Associate Adjuster position in our countrywide branch offices as part of our Future Leaders Program. An Associate Adjuster class is scheduled for October 2021. Our Future Leaders Program begins with a paid hands-on training at our headquarters in Rhode Island. Personal mentorships. Professional growth opportunities. Relocation throughout the U. S. Your Role. Be there to help customers in their times of need and restore peace of mind. Your ResponsibilitiesConduct thorough examinations of claims through investigations, which includes assessing loss sites, performing research and consulting experts. Balance investigations of claims with file reporting in your branch office. Analyze information and make decisions on claim files. Educate customers, vendors and other involved parties throughout the claims process. Negotiate with attorneys and other parties to ensure fair and equitable claims settlements. Develop positive relationships with customers and other industry professionals. Acquire and apply knowledge of legal concepts, medical terminology and home construction. Deliver extraordinary customer service at every touchpoint throughout the claims process. Your QualificationsBachelor's degree, any major. Excellent written and verbal communication skills. Demonstrated customer service experience. Willingness and ability to relocate across the U. S. Strong interpersonal and leadership skills. Ability to identify, analyze and solve problems. Physical RequirementsThe ability to bend\/lift\/carry\/move up to 15 pounds and adjust and move objects and debris. Move about to accomplish tasks. Ascend and descend stairs, ramps and ladders. Position yourself in different positions to accomplish tasks in various environments including tight and confined spaces and uneven spaces. Inspect and fully appraise all physical aspects of the property and building. Be able to drive up to 4 hours per day and possess a valid driver's license. Must be able to work under all environmental conditions including low and high temperatures, outdoor elements such as precipitation and wind, noisy environments, hazardous conditions, poor ventilation and small and\/or enclosed spaces. Perks and Benefits. Relocation supportCompetitive salaries and exceptional benefits. Strong relationships, lifelong friendships. Employee community involvement. About AmicaAmica Mutual Insurance Company is America's oldest mutual insurer of automobiles. A direct national writer, Amica also offers home, marine and umbrella insurance. Amica Life Insurance Company, a wholly owned subsidiary, provides life insurance and retirement solutions.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6134bfe53b915441ab88e7a7::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Amica\", \"position\": \"Management Trainee: Associate Adjuster - October\", \"notes\": \"\", \"original\": \"Future Leaders ProgramAmica is searching for talented individuals for our Associate Adjuster position in our countrywide branch offices as part of our Future Leaders Program.An Associate Adjuster class is scheduled for October 2021.Our Future Leaders Program begins with a paid hands-on training at our headquarters in Rhode Island.Personal mentorships. Professional growth opportunities. Relocation throughout the U.S.Your RoleBe there to help customers in their times of need and restore peace of mind.Your ResponsibilitiesConduct thorough examinations of claims through investigations, which includes assessing loss sites, performing research and consulting experts.Balance investigations of claims with file reporting in your branch office.Analyze information and make decisions on claim files.Educate customers, vendors and other involved parties throughout the claims process.Negotiate with attorneys and other parties to ensure fair and equitable claims settlements.Develop positive relationships with customers and other industry professionals.Acquire and apply knowledge of legal concepts, medical terminology and home construction.Deliver extraordinary customer service at every touchpoint throughout the claims process.Your QualificationsBachelor's degree, any majorExcellent written and verbal communication skillsDemonstrated customer service experienceWillingness and ability to relocate across the U.S.Strong interpersonal and leadership skillsAbility to identify, analyze and solve problemsPhysical RequirementsThe ability to bend\/lift\/carry\/move up to 15 pounds and adjust and move objects and debris.Must be able to remain in a stationary position often standing or sitting for prolonged periods; move about to accomplish tasks; ascend and descend stairs, ramps and ladders; position yourself in different positions to accomplish tasks in various environments including tight and confined spaces and uneven spaces; inspect and fully appraise all physical aspects of the property and building.Be able to drive up to 4 hours per day and possess a valid driver's license.Must be able to work under all environmental conditions including low and high temperatures, outdoor elements such as precipitation and wind, noisy environments, hazardous conditions, poor ventilation and small and\/or enclosed spaces.Perks and BenefitsRelocation supportCompetitive salaries and exceptional benefitsStrong relationships, lifelong friendshipsEmployee community involvementAbout AmicaAmica Mutual Insurance Company is America's oldest mutual insurer of automobiles. A direct national writer, Amica also offers home, marine and umbrella insurance. Amica Life Insurance Company, a wholly owned subsidiary, provides life insurance and retirement solutions. Amica was founded on the principles of creating peace of mind and building enduring relationships for and with our exceptionally loyal policyholders, a mission that thousands of employees in offices nationwide share and support.Equal Opportunity Policy: All qualified applicants who are authorized to work in the United States will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity, gender expression, sexual orientation, family status, ethnicity, age, national origin, ancestry, physical and\/or mental disability, mental condition, military status, genetic information or any other class protected by law. The Age Discrimination in Employment Act prohibits discrimination on the basis of age with respect to individuals who are 40 years of age or older. Employees are subject to the provisions of the Workers' Compensation Act.HP15*cb*#LI-AB1<br \/>\"}"
}