{
    "id":"Kaggle::techmap::6145b73b458d8e508baf5f07::linkedin_tw::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"masculine coded language lie \"Move fast. Speak up. Decide and own. Drive change ..... winning behaviors\"",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description. The Role. Are you ready to join a team involved with designing exciting products for a great company? We are now looking for a Gaming NPI EE team manager to join our team. Our Electrical Engineering team in Hsinchu focuses on the design of gaming peripherals including keyboards, mice, wheels, joysticks and more. Our motivation is to help all gamers have the best in-game experience by focusing on user needs: big and small, young and less young, girls and boys, because playing is such an important part of life. Play your way! If you are an EE professional seeking a new challenge and, you too, want to be a part of it, come and tell us your story and your motivations! Your Contribution. In This Role You Will. Move fast. Speak up. Decide and own. Drive change. Exceed customer needs. These are some of the winning behaviors youll need for success at Logitech. Manage a team of senior Electronics Engineers. Work in partnership with senior management and other teams on budget and resource planning. Work with project managers to develop and enforce a supportable delivery schedule based on agreed priorities and business requirements. Lead the technical development to meet cost, schedule, sustainability and user experience. Perform employee performance reviews, promote professional development. Hire the right talents as required to maintain high technical standards. Help develop and promote engineering processes and best practices and reviews. Define the EE architecture of products for our Logitech G brand: Gaming keyboards, mice, controllers and steering wheels. Remove roadblocks and provide support to ensure all team members have what they need to succeed. Provide help to team members during peaks of activities. Communicate early and often about issues impacting project development. Work in a Worldwide multi-cultural team. Drive change and out-of-the-box thinking. Your Skills. Here Are The Skills We Are Looking For Master degree in Electrical Engineering or equivalent, 8. years of experience. 8 years of experience in the consumer electronics industry. IOT, embedded systems, cellphones. ARM-based platforms. Experience in gaming is a plus. Experience in the following technical areas: PCBA and electrical designs (DC to 1GHz). EMC(ESD\/EFT, EMI). USB (2.0, PD), SPI, I2C. RF\/wireless systems and antennas (Bluetooth, 2.4GHz, wifi). Battery management ICs. DCDC regulators (step-up, step-down, LDO). LEDs and display driving circuits.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145b73b458d8e508baf5f07::linkedin_tw\", \"source\": \"linkedin_tw\", \"country\": \"TW\", \"company\": \"\\u7f85\\u6280\", \"position\": \"Electrical Engineering Manager - Gaming products\", \"notes\": \"\", \"original\": \"<strong><u>Description<br><br><\/u><\/strong>The Role<br><br>Are you ready to join a team involved with designing exciting products for a great company? We are now looking for a Gaming NPI EE team manager to join our team.<br><br>Our Electrical Engineering team in Hsinchu focuses on the design of gaming peripherals including keyboards, mice, wheels, joysticks and more.<br><br>Our motivation is to help all gamers have the best in-game experience by focusing on user needs: big and small, young and less young, girls and boys, because playing is such an important part of life. Play your way!<br><br>If you are an EE professional seeking a new challenge and, you too, want to be a part of it, come and tell us your story and your motivations!<br><br>Your Contribution<br><br><strong><u>In This Role You Will<br><br><\/u><\/strong>Move fast. Speak up. Decide and own. Drive change. Exceed customer needs. These are some of the winning behaviors you\\u2019ll need for success at Logitech.<ul><li>Manage a team of senior Electronics Engineers.<\/li><li>Work in partnership with senior management and other teams on budget and resource planning.<\/li><li>Work with project managers to develop and enforce a supportable delivery schedule based on agreed priorities and business requirements.<\/li><li>Lead the technical development to meet cost, schedule, sustainability and user experience.<\/li><li>Perform employee performance reviews, promote professional development.<\/li><li>Hire the right talents as required to maintain high technical standards.<\/li><li>Help develop and promote engineering processes and best practices and reviews.<\/li><li>Define the EE architecture of products for our Logitech G brand:<\/li><ul><li>Gaming keyboards, mice, controllers and steering wheels.<\/li><\/ul><li>Remove roadblocks and provide support to ensure all team members have what they need to succeed. Provide help to team members during peaks of activities.<\/li><li>Communicate early and often about issues impacting project development.<\/li><li>Work in a Worldwide multi-cultural team.<\/li><li>Drive change and out-of-the-box thinking.<br><\/li><\/ul>Your Skills<br><br><strong><u>Here Are The Skills We Are Looking For<\/u><\/strong><ul><li>Master degree in Electrical Engineering or equivalent, 8+ years of experience.<\/li><li>8 years of experience in the consumer electronics industry.<\/li><ul><li>IOT, embedded systems, cellphones<\/li><li>ARM-based platforms.<\/li><li>Experience in gaming is a plus<\/li><\/ul><li>Experience in the following technical areas:<\/li><ul><li>PCBA and electrical designs (DC to &gt;1GHz).<\/li><li>EMC(ESD\/EFT, EMI).<\/li><li>USB (2.0, PD), SPI, I2C.<\/li><li>RF\/wireless systems and antennas (Bluetooth, 2.4GHz, wifi).<\/li><li>Battery management ICs.<\/li><li>DCDC regulators (step-up, step-down, LDO).<\/li><li>LEDs and display driving circuits.<\/li><\/ul><li>A proven track record of developing and mentoring top-notch engineers.<\/li><li>Hands-on attitude with the ability to look into designs in detail.<\/li><li>Highly organized with strong project planning, management and tracking skills.<\/li><li>Ability to anticipate, recognize, and push through resistance.<\/li><li>Able to mediate disputes and promote collaboration and avoid silos.<\/li><li>Proven knowledge and collaboration with manufacturing sites.<\/li><li>Strong written and spoken communication in both English and Chinese.<\/li><li>Ability to communicate highly technical concepts to non-technical individuals.<\/li><li>Service-oriented attitude, with strong management, analytical, problem-solving and conceptual skills.<\/li><li>Exposure to a multicultural working environment.<br><\/li><\/ul>Small Company. Big Products.<br><br>At Logitech we act like a small company. We believe that anyone can have the best idea. We are innovators, creators and designers. We challenge ourselves and each other and believe that success is never final. We push the limit because great is not good enough. We inspire, delight and empower the world. We are Logitech.\"}"
}