{
    "id":"Kaggle::techmap::613e8cdf24976a7e537fab5e::aarp_us::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"**Position summary:**Use mechanical and power tools to install and connect motors and accessories on boats or ATVs as per factory specifications or as specified on work orders. **Position responsibilities:**1. Support a strong commitment to world class customer service and ensures a pleasant and productive shopping experience for all customers. 2. Rig boat package per factory specifications. 3. Rig boat package as specified on work orders. 4. Notify Service Manager when rigging of specified unit received from manufacturer is not acceptable. 5. Work in an efficient manner to maintain service schedules. 6. Prepare loose motors or trailers for delivery to customer. 7. Test each unit for proper and safe operation using established marine service procedures. 8. Notify Service Manager if unit has problems that need additional work. 9. Follow work order procedures for requesting and obtaining parts, performing labor and completing paperwork. 10. Follow work order procedures when requesting parts or performing labor not listed on work order. 11. Compile warranty packages per outlined process for every unit. 12. Properly complete rigging checklist and assist with inspection process for each unit. 13. Install optional equipment and\/or accessories as per customer's request. 14. Notify Service Manager when customer's request may not be possible or may cause a safety issue. 15. Maintain a clean and professional work area. 16. Follow all Company Policies and Procedures. 17. Perform other duties, assignments and responsibilities as needed. Able to stand for extended periods. Ability to work in non-air conditioned environment**Other Knowledge, Skills and Abilities**Ability to establish and maintain effective working relationships with Management, coworkers and customers. Mechanical abilityCabela's**About** **Bass Pro Shops**Bass Pro Shops ( is North America's premier outdoor and conservation company. Founded in 1972 when avid young angler Johnny Morris began selling tackle out of his father's liquor store in Springfield, Missouri, today the company provides customers with unmatched offerings spanning premier destination retail, outdoor equipment manufacturing, world-class resort destinations and more.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613e8cdf24976a7e537fab5e::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"CABELA'S\", \"position\": \"Rigger\", \"notes\": \"\", \"original\": \"**Position summary:**Use mechanical and power tools to install and connect motors and accessories on boats or ATVs as per factory specifications or as specified on work orders.**Position responsibilities:**1. Support a strong commitment to world class customer service and ensures a pleasant and productive shopping experience for all customers.2. Rig boat package per factory specifications.3. Rig boat package as specified on work orders.4. Notify Service Manager when rigging of specified unit received from manufacturer is not acceptable.5. Work in an efficient manner to maintain service schedules.6. Prepare loose motors or trailers for delivery to customer.7. Test each unit for proper and safe operation using established marine service procedures. 8. Notify Service Manager if unit has problems that need additional work.9. Follow work order procedures for requesting and obtaining parts, performing labor and completing paperwork.10. Follow work order procedures when requesting parts or performing labor not listed on work order.11. Compile warranty packages per outlined process for every unit.12. Properly complete rigging checklist and assist with inspection process for each unit.13. Install optional equipment and\/or accessories as per customer's request.14. Notify Service Manager when customer's request may not be possible or may cause a safety issue.15. Maintain a clean and professional work area.16. Follow all Company Policies and Procedures.17. Perform other duties, assignments and responsibilities as needed.**Education and\/or Experience**High School education or equivalent experience**Mathematical Skills \/ Reasoning Ability**Ability to deal with electrical systems and wiring when assembling engines and connecting all electrical\/remote control attachments to a boat or ATV**Communication Skills**Ability to communicate in a friendly and professional manner to our customers and other associates**Physical requirements**Able to lift up to 50 poundsAble to stand for extended periodsAbility to work in non-air conditioned environment**Other Knowledge, Skills and Abilities**Ability to establish and maintain effective working relationships with Management, coworkers and customersMechanical abilityCabela's**About** **Bass Pro Shops**Bass Pro Shops ( is North America's premier outdoor and conservation company. Founded in 1972 when avid young angler Johnny Morris began selling tackle out of his father's liquor store in Springfield, Missouri, today the company provides customers with unmatched offerings spanning premier destination retail, outdoor equipment manufacturing, world-class resort destinations and more. In 2017 Bass Pro Shops joined forces with Cabela's ( to create a \\\"best-of-the-best\\\" experience with superior products, dynamic locations and outstanding customer service. Bass Pro Shops also operates White River Marine Group ( , offering an unsurpassed collection of industry-leading boat brands, and Big Cedar Lodge ( , America's Premier Wilderness Resort. Under the visionary conservation leadership of Johnny Morris, Bass Pro Shops is a national leader in protecting habitat and introducing families to the outdoors and has been named by Forbes as \\\"one of America's Best Employers.\\\"<br \/>\"}"
}