{
    "id":"Kaggle::techmap::6156078aa6740c534abbfd2a::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Business Analyst. Testing Cycle. On behalf of our client in the Banking Sector, PROCOM is looking for a Business Analyst. Testing Cycle. Business Analyst. Testing Cycle – Job Description. Business group: Regulatory Initiatives. Project management office for global banking and markets and regulatory initiatives. This team completes the intake for all projects, acquires necessary resources, tracks project status and is in charge of overall PM work. Project: Required to assist GWO in planning and coordination of testing workstream, working with GWO teams to design and lead user acceptance testing across multiple post trade functions. Assist various operations groups with testing workstreams (testing will be in settlements and clearing). Coordinate testing workstreams for the testers. Sit virtually with the testers (5 -6 individuals) during testing to gather information and facilitate overall process. BA will be in charge of coordinating internally and then communicating results and status back to the business partners. Provide frequent and professional updates back to the project team and director. 50% of their time will be working with testers and coordinating the tests, the other 50% will be communicating with the project team and business leads. informed of the progress. Partner with the technology teams to provide operational input. Business Analyst. Testing Cycle – Mandatory Skills. 5 - 7. years of BA Project experience relating to large scale testing cycles (understanding testing scenarios, how tests are designed, built, cycles etc. ). 10 years of FI experience (tech or operations). no coding or development experience required, supporting operational functions. Prior knowledge of Canadas settlement systems and settlement convention. Must have strong and articulate communication skills as they will be providing status reports to senior members of the banks. Must have good E. I. (emotional intelligence) skills to determine risk scenarios and when to escalate and when to strategically influence. Appropriate post secondary education relevant to the securities industry. Business Analyst. Testing Cycle – Nice to Have Skills. Operations experience in the banks (settlements and clearance specifically). Experience working with Broadridge, BPS. PMP, BA certification (nice to have). Business Analyst. Testing Cycle. Assignment Start Date. ASAP – 4 months to start. Business Analyst. Testing Cycle. Assignment Location. Toronto, ON – Work Remotely.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156078aa6740c534abbfd2a::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Procom\", \"position\": \"Business Analyst, Testing Cycle\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div class=\\\"customJobDesc\\\" id=\\\"jobDescriptionTag\\\" style=\\\"word-wrap:break-word\\\"> <p><strong>Business Analyst - Testing Cycle<\/strong><\/p> <p>On behalf of our client in the Banking Sector, PROCOM is looking for a Business Analyst - Testing Cycle.<\/p> <p><strong>Business Analyst - Testing Cycle \\u2013 Job Description<\/strong><\/p> <ul> <li>Business group: Regulatory Initiatives- Project management office for global banking and markets and regulatory initiatives<\/li> <li>This team completes the intake for all projects, acquires necessary resources, tracks project status and is in charge of overall PM work<\/li> <li>Project: Required to assist GWO in planning and coordination of testing workstream, working with GWO teams to design and lead user acceptance testing across multiple post trade functions<\/li> <li>Assist various operations groups with testing workstreams (testing will be in settlements and clearing)<\/li> <li>Coordinate testing workstreams for the testers<\/li> <li>Sit virtually with the testers (5 -6 individuals) during testing to gather information and facilitate overall process<\/li> <li>BA will be in charge of coordinating internally and then communicating results and status back to the business partners<\/li> <li>Provide frequent and professional updates back to the project team and director<\/li> <li>50% of their time will be working with testers and coordinating the tests, the other 50% will be communicating with the project team and business leads. informed of the progress<\/li> <li>Partner with the technology teams to provide operational input<\/li> <\/ul> <p><strong>Business Analyst - Testing Cycle \\u2013 Mandatory Skills<\/strong><\/p> <ul> <li>5 - 7+ years of BA Project experience relating to large scale testing cycles (understanding testing scenarios, how tests are designed, built, cycles etc.)<\/li> <li>10 years of FI experience (tech or operations)- no coding or development experience required, supporting operational functions<\/li> <li>Prior knowledge of Canadas settlement systems and settlement convention<\/li> <li>Must have strong and articulate communication skills as they will be providing status reports to senior members of the banks<\/li> <li>Must have good E.I. (emotional intelligence) skills to determine risk scenarios and when to escalate and when to strategically influence<\/li> <li>Appropriate post secondary education relevant to the securities industry<\/li> <\/ul> <p><strong>Business Analyst - Testing Cycle \\u2013 Nice to Have Skills<\/strong><\/p> <ul> <li>Operations experience in the banks (settlements and clearance specifically)<\/li> <li>Experience working with Broadridge, BPS<\/li> <li>PMP, BA certification (nice to have)<\/li> <\/ul> <p><strong>Business Analyst - Testing Cycle - Assignment Start Date<\/strong><\/p> <p>ASAP \\u2013 4 months to start<\/p> <p><strong>Business Analyst - Testing Cycle - Assignment Location<\/strong><\/p> <p>Toronto, ON \\u2013 Work Remotely<\/p> <\/div> <\/div>\"}"
}