{
    "id":"Kaggle::techmap::6137aa997d4ffc16c87f77aa::careerbuilder_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"REQUIRED TO HAVE INVESTMENT BANKING EXPERIENCE. Overview of business area or project: SME resource will be working on critical projects for Credit IT. They will work on the GUI development of front office trade and position management, PnL management systems. These are time sensitive projects that are part of regulatory & mandatory program stream. Such critical projects are CUSO Data Strategy, Libor and ITS Migration project. Overview of department\/team: The day to day responsibilities would include design, development and maintenance of screens in UI in html 5, server side component in C#, and interaction with the middleware components. The candidate would be a part of a global team in NY (US), Raleigh (US), Wroclaw (Poland) and Pune (India), and would directly interact with BAs, and other developers in the team. They will directly interact with BAs and other developers in the team and work closely with L1 and L2 support teams to provide dev support for the applications. Education\/Experience: Bachelor's degree in computer science or equivalent training required. 10-12 years of experience required. This position is a. Net\/Angular position. Client is looking for a senior Front-End Developer with. Net\/Angular. Other language on the backend such as Java or C++.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137aa997d4ffc16c87f77aa::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Experis\", \"position\": \"Net Developer With Investment Banking Experience\", \"notes\": \"\", \"original\": \"<p><strong>REQUIRED TO HAVE INVESTMENT BANKING EXPERIENCE.<\/strong><\/p><p><strong>Overview of business area or project:<\/strong><br \/> <\/p><ul><li>SME resource will be working on critical projects for Credit IT.<\/li><li>They will work on the GUI development of front office trade and position management, PnL management systems.<\/li><li>These are time sensitive projects that are part of regulatory & mandatory program stream.<\/li><li>Such critical projects are CUSO Data Strategy, Libor and ITS Migration project.<\/li><\/ul><p><strong>Overview of department\/team:<\/strong><br \/> <\/p><ul><li>The day to day responsibilities would include design, development and maintenance of screens in UI in html 5, server side component in C#, and interaction with the middleware components.<\/li><li>The candidate would be a part of a global team in NY (US), Raleigh (US), Wroclaw (Poland) and Pune (India), and would directly interact with BAs, and other developers in the team.<\/li><li>They will directly interact with BAs and other developers in the team and work closely with L1 and L2 support teams to provide dev support for the applications.<\/li><\/ul><p><strong>Education\/Experience:<\/strong><br \/> <\/p><ul><li>Bachelor's degree in computer science or equivalent training required.<\/li><li>10-12 years of experience required.<\/li><li>This position is a .Net\/Angular position.<\/li><li>Client is looking for a senior Front-End Developer with .Net\/Angular.<\/li><li>Other language on the backend such as Java or C++.<\/li><\/ul>&nbsp;\"}"
}