{
    "id":"Kaggle::techmap::6168671233fccd39deb91f23::careerbuilder_us::11",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". Duties and Essential Functions. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Greet all guests in a standing upright position as they enter the community maintaining the highest quality of customer service. Monitor and authorize entrance and departure of employees, visitors, and other persons to guard against theft and maintain security of premises. All “check-in” policies and procedures must be followed without any exceptions. Coordinate with office administrative staff to maintain and update all unit owner information in computer database. Utilize proper phone etiquette for all incoming and outgoing phone calls made to residents. All calls should be clear and in a professional manner. Report any violations of the Rules and Regulations that are noticed at any time. Observe precautions required to protect Residents, guests and property, and report damage, theft, and found articles to supervisors. Maintain the “key” control system and assure that all keys are locked and accounted for at all times. Be familiar with the fire alarm system operations and report all incidents to management. Call police or fire departments in cases of emergency, such as fire or presence of unauthorized persons. Follow all standards policies and procedures with regards to emergency response by coordinating with Management, Chief Engineer, or Fire Rescue \/ Police services. Write reports of daily activities and irregularities, such as equipment or property damage, theft, presence of unauthorized persons, or unusual occurrences. Work Environment. The working environment will be indoor and will require team member to sit and stand frequently. Low to moderate noise level in the workplace. Physical Demands. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. The employee is occasionally required to sit, stand, reach, lift, bend, kneel, stoop, climb, push and pull items weighing 30 pounds or less. The position requires manual dexterity. Auditory and visual skills. And the ability to follow written and oral instructions and procedures. Ability to detect auditory and\/or visual emergency alarms. Noise level in the work environment is usually low to moderate. Position Type\/Expected Hours of Work. Days and hours of work will be determine at the property.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6168671233fccd39deb91f23::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"KW Property Management\", \"position\": \"Front Desk\", \"notes\": \"\", \"original\": \"<p><\/p><p>Duties and Essential Functions<\/p><p>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<\/p><ul><li>Greet all guests in a standing upright position as they enter the community maintaining the highest quality of customer service.<\/li><li>Monitor and authorize entrance and departure of employees, visitors, and other persons to guard against theft and maintain security of premises. All \\u201ccheck-in\\u201d policies and procedures must be followed without any exceptions.<\/li><\/ul><ul><li>Coordinate with office administrative staff to maintain and update all unit owner information in computer database.<\/li><li>Utilize proper phone etiquette for all incoming and outgoing phone calls made to residents. All calls should be clear and in a professional manner.<\/li><li>Report any violations of the Rules and Regulations that are noticed at any time.<\/li><li>Observe precautions required to protect Residents, guests and property, and report damage, theft, and found articles to supervisors.<\/li><li>Maintain the \\u201ckey\\u201d control system and assure that all keys are locked and accounted for at all times.\\u00a0<\/li><\/ul><ul><li>Be familiar with the fire alarm system operations and report all incidents to management.<\/li><li>Call police or fire departments in cases of emergency, such as fire or presence of unauthorized persons.<\/li><\/ul><ul><li>Follow all standards policies and procedures with regards to emergency response by coordinating with Management, Chief Engineer, or Fire Rescue \/ Police services.<\/li><\/ul><ul><li>Write reports of daily activities and irregularities, such as equipment or property damage, theft, presence of unauthorized persons, or unusual occurrences.<\/li><li>Report any and all maintenance items which include, but is not limited to, burned out lights, leaks, broken equipment to the Association office daily.<\/li><\/ul><p><\/p><p>Work Environment<\/p><p>The working environment will be indoor and will require team member to sit and stand frequently.\\u00a0 Low to moderate noise level in the workplace<\/p><p>Physical Demands<\/p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<\/p><p>The employee is occasionally required to sit, stand, reach, lift, bend, kneel, stoop, climb, push and pull items weighing 30 pounds or less. The position requires manual dexterity; auditory and visual skills; and the ability to follow written and oral instructions and procedures.\\u00a0 Ability to detect auditory and\/or visual emergency alarms. Noise level in the work environment is usually low to moderate.<\/p><p><\/p><p>Position Type\/Expected Hours of Work<\/p><p>Days and hours of work will be determine at the property.\\u00a0 This schedule may change to accommodate the business needs of the property.<\/p><p>Travel<\/p><p>No travel is expected for this position.<\/p><p>Required Education and Experience<\/p><ul><li>High school diploma or GED; some college preferred<\/li><\/ul><ul><li>Must be familiar with using computer software to perform various tasks, and must demonstrate organizational skills, excellent interpersonal skills and strong communication skills<\/li><li>Minimum six months related experience and\/or training.<\/li><\/ul><ul><li>Bi-lingual English\/Spanish may be required at some locations<\/li><\/ul><ul><li>Previous work experience in the hospitality industry highly preferred<\/li><\/ul><p><\/p><p>Position Supervision<\/p><p>Employee reports directly to the department supervisor and\/or the Association Manager of the community.<\/p><p><br \/>Other Duties<\/p><p>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.<\/p><p><\/p><p>KW Property Management & Consulting is a drug-free workplace.\\u00a0<\/p><p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.<\/p>&nbsp;\"}"
}