{
    "id":"Kaggle::techmap::6137b94a7d4ffc16c87ff8c5::careerbuilder_us::11",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Bias against those with a criminal record",
    "verified":true,
    "synthetic":false,
    "text":"When you work for Ameri. Gas, you become a part of something BIG! Founded in 1959, Ameri. Gas is the nation’s premiere propane company, serving over 1. 5 million residential, commercial, industrial and motor fuel propane customers. Together, over 6, 500 dedicated professionals will deliver over 1 billion gallons of propane from 1, 800. distribution points across the United States. Posting. Job Summary (Purpose): The Utility Worker primarily works in the outside production area of the Ameri. Gas Cylinder Exchange facility. The employee is responsible for the processing of cylinders (20 lb. barbeque grill cylinders). Key Characteristics: Models a commitment to safety through his\/her own day-to-day behavior. Follows company safety procedures and policies. Demonstrates high professional and personal standards. Has a commitment to quality, timeliness, and continuous improvement. Ability to function effectively as a member of a production team. Duties and Responsibilities: Sort, inspect, clean, paint, label, and refill empty cylinders. Maintain a safety focus at all times and wear the proper PPE. Ensure the consistent quality of cylinders are being processed. Load filled cylinders onto the truck(s) for the next day’s shipments. Ability to stand and walk 8 – 12 hours per day. Ability to lift 50 pounds repeatedly throughout the day. Perform general housekeeping duties. Knowledge, Skills and Abilities: Ability to follow processes, procedures, and instructions. Ability to function effectively as a member of a production team. Willingness to grow and learn. Basic computer knowledge. Work in a fast-paced environment. Be able to stand 8-10 hours per day. Ability to obtain required state licensing. Ability to be forklift certified. Education and Experience Required: 1. 2 years work experience in manufacturing is preferred. High School Diploma or GED. Working conditions: Environmental conditions such as wind, rain, ice, and snow may affect this job, as the production area where the employee spends most of the workday is not enclosed. Ameri. Gas is an Equal Opportunity and Affirmative Action Employer. The Company does not discriminate on the basis of race, color, sex, national origin, disability, age, gender identity, sexual orientation, veteran status, or any other legally protected class in its practices. Ameri. Gas is a Drug Free Workplace. Candidates must be willing to submit to a pre-employment drug screen and a criminal background check.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137b94a7d4ffc16c87ff8c5::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"UGI Corporation\", \"position\": \"ACE Utility Worker (Miami, FL, US)\", \"notes\": \"\", \"original\": \"<p>When you work for AmeriGas, you become a part of something BIG! Founded in 1959, AmeriGas is the nation\\u2019s premiere propane company, serving over 1.5 million residential, commercial, industrial and motor fuel propane customers. Together, over 6,500 dedicated professionals will deliver over 1 billion gallons of propane from 1,800+ distribution points across the United States.<\/p>\\n<div><div><div><br \/><br \/><b><b>Posting<\/b><\/b><br \/><br \/>\\n<\/div><div><p>Job Summary (Purpose):<\/p>\\n\\n<p><br \/>\\nThe Utility Worker primarily works in the outside production area of the AmeriGas Cylinder Exchange facility. \\u00a0The employee is responsible for the processing of cylinders (20 lb. barbeque grill cylinders).<\/p>\\n\\n<p><br \/>\\nKey Characteristics:<\/p>\\n\\n<p><\/p>\\n\\n<ul>\\n\\t<li>Models a commitment to safety through his\/her own day-to-day behavior; follows company safety procedures and policies\\u00a0<\/li>\\n\\t<li>Demonstrates high professional and personal standards; has a commitment to quality, timeliness, and continuous improvement\\u00a0<\/li>\\n\\t<li>Ability to function effectively as a member of a production team<\/li>\\n<\/ul>\\n\\n<p><br \/>\\nDuties and Responsibilities:<\/p>\\n\\n<p><\/p>\\n\\n<ul>\\n\\t<li>Sort, inspect, clean, paint, label, and refill empty cylinders.<\/li>\\n\\t<li>Maintain a safety focus at all times and wear the proper PPE<\/li>\\n\\t<li>Ensure the consistent quality of cylinders are being processed<\/li>\\n\\t<li>Load filled cylinders onto the truck(s) for the next day\\u2019s shipments.<\/li>\\n\\t<li>Ability to stand and walk 8 \\u2013 12 hours per day.<\/li>\\n\\t<li>Ability to lift 50 pounds repeatedly throughout the day.<\/li>\\n\\t<li>Perform general housekeeping duties.<\/li>\\n<\/ul>\\n\\n<p><br \/>\\nKnowledge, Skills and Abilities:<\/p>\\n\\n<p><\/p>\\n\\n<ul>\\n\\t<li>Ability to follow processes, procedures, and instructions<\/li>\\n\\t<li>Ability to function effectively as a member of a production team<\/li>\\n\\t<li>Willingness to grow and learn<\/li>\\n\\t<li>Basic mechanical aptitude<\/li>\\n\\t<li>Basic computer knowledge<\/li>\\n\\t<li>Work in a fast-paced environment<\/li>\\n\\t<li>Be able to stand 8-10 hours per day<\/li>\\n\\t<li>Ability to obtain required state licensing<\/li>\\n\\t<li>Ability to be forklift certified<\/li>\\n<\/ul>\\n\\n<p>Education and Experience Required:<\/p>\\n\\n<p><\/p>\\n\\n<ul>\\n\\t<li>1 - 2 years work experience in manufacturing is preferred<\/li>\\n\\t<li>High School Diploma or GED<\/li>\\n<\/ul>\\n\\n<p><\/p>\\n\\n<p>Working conditions:<\/p>\\n\\n<p><\/p>\\n\\n<ul>\\n\\t<li>Environmental conditions such as wind, rain, ice, and snow may affect this job, as the production area where the employee spends most of the workday is not enclosed.<\/li>\\n<\/ul>\\n<\/div><\/div><\/div><p><\/p>\\n\\n<p>AmeriGas is an Equal Opportunity and Affirmative Action Employer. \\u00a0The Company does not discriminate on the basis of race, color, sex, national origin, disability, age, gender identity, sexual orientation, veteran status, or any other legally protected class in its practices.<\/p>\\n\\n<p><\/p>\\n\\n<p>AmeriGas is a Drug Free Workplace. Candidates must be willing to submit to a pre-employment drug screen and a criminal background check. Successful applicants shall be required to pass a pre-employment drug screen as a condition of employment, and if hired, shall be subject to substance abuse testing in accordance with AmeriGas policies. As a federal contractor that engages in safety-sensitive work, AmeriGas cannot permit employees in certain positions to use medical marijuana, even if prescribed by an authorized physician. \\u00a0Similarly, applicants for such positions who are actively using medical marijuana may be denied hire on that basis.<br \/>\\n\\u00a0<\/p>&nbsp;\"}"
}