{
    "id":"Kaggle::techmap::61663d791650e57250a4a700::linkedin_fr::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"Work with people of the opposite sex\" could imply a preference for heterosexual candidates, potentially excluding LGBTQ+ individuals or those with diverse gender identities.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" The agency shall consider any incidents of sexual harassment in determining whether to hire anyone who may have contact with offenders or residents. Successfully pass all modules of the Colorado Department of Corrections Basic Training, to include English reading comprehension, relevant competency assessments and written\/practical exams in Defensive Tactics. Possess the physical ability to successfully complete Defensive Tactics. Lift arms above head and kick as high as own waist. Stabilize another person to accomplish a controlled take down. Use arms, palms of hands, shins, and feet to deliver blows. Withstand impact (slow speed or with a safety bag) on own body from strikes\/blows. Swing a baton in a striking technique. Rotate body 90 degrees with feet planted for striking with foot or using a defensive tactic. Get down on one or both knees and up again with multiple repetitions. Will be exposed to Oleoresin Capsicum during Basic Training and will be exposed while on assignment. Must be able to see and hear in order to observe, address and respond to potential breaches in safety and security. Seize, hold, control or subdue violent or assaultive persons and defend oneself or others to prevent injury. Demonstrate body agility, strength of all four limbs and the ability to walk and climb stairs consistently. Work in situations involving assaultive behavior, physical control of another person and\/or restraint situations. Deal with individuals with a range of moods and behaviors, utilizing tactfulness and a congenial, personable manner. Work with people of the opposite sex, diverse racial ethnic groups, mentally ill and emotionally disturbed offenders. Communicate by talking, listening and\/or signaling people to convey or exchange information, assignments. Work in an environment with fluctuating noise and temperature (hot and cold) which may include working outdoors in inclement weather and\/or concrete floor\/wall work settings. Willing and able to travel. Willing and able to work various shifts, days, afternoons, graveyards (nights) which includes a rotating shift schedule. TB (tuberculosis) screening is required of all new employees upon hire. Successful completion of a background investigation is required. Should applicants background reveal criminal charges, it shall be the responsibility of the applicant to provide the Department of Corrections with written\/official disposition of any charges. The CDOC is committed to a drug and alcohol free work environment. Our employees are expected to comply with all state and federal laws.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61663d791650e57250a4a700::linkedin_fr\", \"source\": \"linkedin_fr\", \"country\": \"FR\", \"company\": \"State of Colorado\", \"position\": \"CDOC Community Programs Specialist III (Benefit Acquisition Specialist)\", \"notes\": \"\", \"original\": \"Department Information<br><br><strong>The Colorado Department of Corrections is committed to the safety of our employees. The CDOC has been working with state and local partners to proactively prevent the spread of COVID-19 within the state prison system.<br><br><\/strong><strong>Review the new COVID-19 Compliance in the Conditions of Employment<br><br><\/strong><u><strong>Who May Apply<\/strong><\/u>: Colorado residents who meet the minimum requirements listed on this announcement.<br><br><u><strong>Job Location:<\/strong><\/u> The <strong>first vacancy<\/strong> for the Community Programs Specialist III will be located in Colorado Springs. The <strong>second vacancy <\/strong>will be located in the Denver Metro area.<br><br>The mission of the Colorado Department of Corrections is \\\"To protect the citizens of Colorado by holding offenders accountable and engaging them in opportunities to make positive behavioral changes and become law abiding, productive citizens.\\\"<br><br>Our vision...\\\"Building a safer Colorado for today and tomorrow\\\".<br><br>If your goal is to build a career that makes a difference and builds greater public confidence in good government, consider joining the dedicated people of the State of Colorado. Our professionals strive to support state government and the citizens of Colorado. Customer service is a key component for every position in state government as is the focus on ideas and ways to redesign the delivery of services in making state government more effective and efficient.<br><br>In addition to a great agency and rewarding, meaningful work, we offer:<br><ul><li>Distinctive career advancement opportunities throughout the state system;<\/li><li>Strong, secure, yet flexible retirement benefits including PERA Defined Benefit Plan or PERA Defined Contribution Plan plus 401K and 457 plans;<\/li><li>Medical and dental health plans; <\/li><li>Short and long term disability coverage; <\/li><li>Paid life insurance; <\/li><li>10 paid holidays per year plus vacation and sick leave; <\/li><li>Wellness program, tuition reimbursement, training opportunities and more.<\/li><\/ul> Description of Job<br><br>The Benefits Acquisition Specialist position exists to provide acquisition assistance for releasing individuals who may be eligible for benefits. This position will work to identify potential candidates based on specific needs factors and uses medical\/behavioral history to determine eligibility. The position will assist high risk high needs qualified offenders with benefit acquisition through benefit applications and electronic medical records sharing with the Social Security Administration and Disability Determinations Services. This positions will work collaboratively with clinical services, prison Case Managers, Treatment Coordination Case Managers, other members of the Benefit Acquisition team, Community Parole Officers, and Parole Mental Health Clinicians, to identify and provide stabilization resources for high risk high needs qualified transitioning offenders.<br><br>The primary duties and responsibilities include but are not limited to:<br><ul><li>Conducts pre-screening interviews and collects relevant information to determine medical needs and eligibility of benefits for releasing individuals, potentially eligible for benefits;<\/li><li>Ensures that offenders receive assistance applying for community services that will directly impact their potential success on parole and in the community;<\/li><li>Utilizes prior disability claims, existing medical and\/or behavioral health records, functionality assessments, and evidence based principles of SAMHSA SOAR to identify needs of releasing individuals and complete Supplemental Security Income (SSI) \/ Social Security Disability Insurance (SSDI) benefit applications with supporting documentation;<\/li><li>Utilizes computer databases to document progress on transition plans through chronological records;<\/li><li>Communicates regularly with multidisciplinary staff to initiate and coordinate care and follow through with transition plan and services;<\/li><li>Develops effective partnerships with a wide range of community agencies and resources to make referrals for additional services and develop partnerships and strategies to address the long term care needs of high needs offenders who require chronic and\/or long term care;<\/li><li>Other duties as assigned or required.<\/li><\/ul> Minimum Qualifications, Substitutions, Conditions of Employment &amp; Appeal Rights<br><br><strong>Minimum Qualifications: <\/strong>Graduation from an accredited college or university with a bachelor's degree in criminal justice, social work, behavioral science, or closely related field of study.<br><br><strong>(You must submit a copy of your unofficial college transcript with your name, college name, degree, and date conferred to receive credit for the education).<br><br><\/strong><strong>AND<br><br><\/strong><strong>Two (2) years of *professional experience*<\/strong> working directly with a <strong>**hard to serve or <\/strong><strong>high needs client population**<\/strong> in a correctional or human services environment providing casework, coordination of services and identifying needs and referring to appropriate resources as your primary assignment. (Experience <strong>MUST<\/strong> be described in detail on your application to receive credit. Part-time experience will be prorated).<br><ul><li>Professional experience involves exercising discretion, analytical skill, judgment, and personal accountability and responsibility for creating, developing, integrating, applying, and sharing an organized body of knowledge that characteristically is: uniquely acquired through an intense education or training regimen at a recognized college or university; equivalent to the curriculum requirements for a bachelor's or higher degree with major study in or pertinent to the specialized field and continuously studied to explore, extend and use additional discoveries, interpretations, and application and to improve data, materials equipment, applications, and methods.<\/li><li>hard to serve or high needs client population is defined as providing components of case planning exhibited by involvement and familiarity with processes that directly a impact stabilization and behavioral needs to include:<br><\/li><\/ul>Locating shelter, jobs, and community resources\/support to include regular meetings with clients, coordination of services and\/or identifying needs and referring to appropriate resources. Experience may also include, but is not limited to, helping clients overcome barriers for community stability. (Experience <strong>MUST<\/strong> be described in detail on your application to receive credit.)<br><br><strong>Substitutions:<\/strong> A combination of related coursework and professional work experience, as described above which provided the same kind, amount and level of knowledge acquired in the required education, may be substituted on a year-for-year basis for the bachelor's degree.<br><br>If degree is not in a related field of study, it may substitute up to 60 semester hours of core coursework on a year for year basis.<br><br>Additional appropriate education will substitute for the required experience on a year-for-year basis.<br><br><strong>There is no substitution for the two (2) years of professional experience (except with appropriate additional education<\/strong><strong> as indicated above).<br><br><\/strong>If you are using education to meet the minimum qualifications, you <strong>MUST<\/strong> attach a copy of your unofficial college transcript to this application that include your name, name of the institution, degree, and date conferred (in pdf or jpg format).<br><br><strong>ONLY APPLICANTS WHO MEET THE MINIMUM AND SPECIAL QUALIFICATIONS WILL BE INCLUDED IN THE COMPARATIVE ANALYSIS PROCESS.<br><br><\/strong><strong><u>Required Competencies<br><\/u><\/strong><ul><li>Ability to work with individuals from diverse backgrounds towards a common goal;<\/li><li>Ability to read and comprehend the English language;<\/li><li>Ability to effectively communicate fluently in English both verbally and in writing;<\/li><li>Significant interpersonal\/customer service skills;<\/li><li>Strong written and oral communication skills;<\/li><li>Highly effective critical thinking\/decision making\/problem solving skills;<\/li><li>Demonstrated ability to organize, plan and prioritize;<\/li><li>Keen ability to multi-task and demonstrate flexibility;<\/li><li>Strong self motivation;<\/li><li>Established proficiency in position-related office technologies;<\/li><li>Compelling attention to detail.<br><\/li><\/ul><strong><u>Preferred Qualifications<br><\/u><\/strong><ul><li>Experience working with individuals to obtain health care or disability benefits;<\/li><li>Thorough knowledge of the SSI\/ SSDI application process;<\/li><li>Experience navigating State or Federal assistance programs;<\/li><li>Proven ability to provide efficient and effective service to hard to serve clients with medium\/high risk needs;<\/li><li>Excellent ability to coordinate services and cooperate with others toward a common goal;<\/li><li>Advanced knowledge and proven work experience in Microsoft Office (Excel, Word) and Google Suite (Drive, Sheets, Docs, Gmail);<\/li><li>Graduation from an accredited college or university with a bachelor's degree or master's degree in Criminal Justice, Social Work, Sociology, Psychology or similarly related field;<br><\/li><\/ul><strong>IMPORTANT INFORMATION<br><br><\/strong><strong>The Assessment Process<\/strong>: Colorado Revised Statutes require that state employees are hired and promoted through a comparative analysis. Part or all of the analysis for this position will include a review of your application material and your responses to any supplemental questions. Applications and responses will be reviewed by a Subject Matter Expert (SME) to assess and rank applicants in order to cut to a top group for additional assessment; or to establish an eligible list for referral to the hiring manager and final consideration.<br><br>Be sure the \\u201cWork Experience\\u201d section of your application is complete and specifically addresses your qualifications, experience, and accomplishments as they relate to the <strong>Description of the Job<\/strong>, <strong>Minimum Qualifications<\/strong>, <strong>Required Competencies <\/strong>and <strong>Preferred Qualifications<\/strong> as listed above. Resumes and \\u201csee resume\\u201d statements will not be accepted in lieu of the \\u201cWork Experience\\u201d section of the application. Failure to include adequate information or follow instructions by the closing date may result in your application not being accepted and\/or may affect your score, rank or inclusion in the final pool of eligible applicants.<br><br>If you have transcripts, a license or other relevant documentation regarding your qualifications, upload and attach copies to your application.<br><br><strong>In order to process a background investigation, your application must include at least (10) ten years of the most current work experience unless experience related to the job for which you are applying is later than (10) years. Failure to provide this information could result in delays and\/or elimination from the background investigation process<br><br><\/strong><strong>Toll Free Applicant Technical Support: <\/strong>If you experience technical difficulty with the NEOGOV system (e.g. uploading or attaching documents to your online application) call NEOGOV technical support at 855-524-5627 Mon-Fri between 6 am and 6 pm (Pacific Time). Helpful hints: if you are having difficulty uploading or attaching documents to your application first, ensure your documents are PDF or Microsoft Word files and second, close the document before you attempt to upload (attach) it.<br><br>**You are encouraged to print a copy of this announcement for your records**<br><br><strong>Conditions of Employment:<\/strong> All job offers are contingent upon a successful medical screening by a healthcare professional, certifying the candidate's ability to perform the essential functions of the position, completed at the applicant\\u2019s own expense. Applicant must consent to hold harmless CDOC and its agents and staff from any liability arising in whole or in part from the testing and the use of this information in connection with CDOC\\u2019s consideration of application for employment.<br><br><strong>The CDOC recently mandated employee COVID-19 vaccinations. All employees must be fully vaccinated and submit documented proof of the COVID-19 vaccination. CDOC conducts regular vaccine clinics for employees who are not vaccinated. Religious and medical exemptions, and reasonable accommodations shall be addressed as required by law.<\/strong><ul><li>Note: Fully Vaccinated means two (2) weeks after a second dose in a two-dose series of the COVID-19 vaccine, such as the Pfizer or Moderna vaccine, or two (2) weeks after the single-dose vaccine, such as Johnson &amp; Johnson\\u2019s Janssen vaccine, as defined by the State of Colorado\\u2019s Public Health Order and guidance issued by the Colorado Department of Public Health &amp; Environment<\/li><li>Must be 21 years of age;<\/li><li>Possess a valid driver\\u2019s license;<\/li><li>Possess a high school diploma or GED;<\/li><li>Have NO felony convictions, to include any actions defined in 5 U.S.C. 301; U.S.C. 509, 510; 42 U.S.C. 15601-15609. The CDOC shall not hire nor promote anyone who may have contact with an offender who has engaged in sexual abuse which includes acts, activity, and sexual behavior, in a prison or other institution as defined in 42 U.S.C. 1997; or has been convicted of engaging or attempting to engage in sexual activity in the community facilitated by force, overt or implied threats of force or coercion, or if the victim did not consent or was unable to consent or refuse, or has been civilly or administratively adjudicated to have engaged in the activity described in the above paragraph. The agency shall consider any incidents of sexual harassment in determining whether to hire anyone who may have contact with offenders or residents.<\/li><li>Successfully pass all modules of the Colorado Department of Corrections Basic Training, to include English reading comprehension, relevant competency assessments and written\/practical exams in Defensive Tactics;<\/li><li>Possess the physical ability to successfully complete Defensive Tactics;<\/li><ul><li>Lift arms above head and kick as high as own waist;<\/li><li>Stabilize another person to accomplish a controlled take down;<\/li><li>Use arms, palms of hands, shins, and feet to deliver blows;<\/li><li>Withstand impact (slow speed or with a safety bag) on own body from strikes\/blows;<\/li><li>Swing a baton in a striking technique;<\/li><li>Rotate body 90 degrees with feet planted for striking with foot or using a defensive tactic;<\/li><li>Get down on one or both knees and up again with multiple repetitions;<\/li><li>Will be exposed to Oleoresin Capsicum during Basic Training and will be exposed while on assignment;<\/li><li>Must be able to see and hear in order to observe, address and respond to potential breaches in safety and security;<\/li><li>Seize, hold, control or subdue violent or assaultive persons and defend oneself or others to prevent injury;<\/li><li>Demonstrate body agility, strength of all four limbs and the ability to walk and climb stairs consistently;<\/li><li>Work in situations involving assaultive behavior, physical control of another person and\/or restraint situations;<\/li><li>Deal with individuals with a range of moods and behaviors, utilizing tactfulness and a congenial, personable manner;<\/li><li>Work with people of the opposite sex, diverse racial ethnic groups, mentally ill and emotionally disturbed offenders;<\/li><li>Communicate by talking, listening and\/or signaling people to convey or exchange information, assignments;<\/li><li>Work in an environment with fluctuating noise and temperature (hot and cold) which may include working outdoors in inclement weather and\/or concrete floor\/wall work settings;<\/li><li>Willing and able to travel;<\/li><li>Willing and able to work various shifts, days, afternoons, graveyards (nights) which includes a rotating shift schedule;<\/li><li>TB (tuberculosis) screening is required of all new employees upon hire.<br><\/li><\/ul>Successful completion of a background investigation is required. Should applicant\\u2019s background reveal criminal charges, it shall be the responsibility of the applicant to provide the Department of Corrections with written\/official disposition of any charges.<br><br>The CDOC is committed to a drug and alcohol free work environment. Our employees are expected to comply with all state and federal laws. A drug test will be administered to all new employees; employees must successfully pass. Random drug screening will occur throughout employment.<br><br><strong><u>Appeal Rights<br><br><\/u><\/strong>If you receive notice that you have been eliminated from consideration for this position, you may file an appeal with the State Personnel Board or request a review by the State Personnel Director.<br><br>An appeal or review must be submitted on the official appeal form, signed by you or your representative. This form must be delivered to the State Personnel Board by email (dpa_state.personnelboard@state.co.us), postmarked in US Mail or hand delivered (1525 Sherman Street, 4th Floor, Denver CO 80203), or faxed (303.866.5038) within ten (10) calendar days from your receipt of notice or acknowledgement of the department\\u2019s action.<br><br>For more information about the appeals process, the official appeal form, and how to deliver it to the State Personnel Board; go to spb.colorado.gov; contact the State Personnel Board for assistance at (303) 866-3300; or refer to 4 Colorado Code of Regulations (CCR) 801-1, State Personnel Board Rules and Personnel Director's Administrative Procedures, Chapter 8, Resolution of Appeals and Disputes, at spb.colorado.gov under Rules.<\/ul>\"}"
}