{
    "id":"Kaggle::techmap::6141772ea71ddb73057876e5::seek_au::5",
    "label_age":true,
    "analysis_age":"Phrases \" seeking energetic & enthusiastic attendants\", \"fast-paced environment\" suggest a bias for younger candidates.",
    "label_disability":true,
    "analysis_disability":"While being \"physically fit\" may be relevant to the job duties, this phrasing might discourage individuals with disabilities who can perform the job effectively with or without reasonable accommodations. ",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Company description: The studio rooms and apartments of Break. Free Alexandra Beach represent great holiday value, set as they are right across the road from beautiful Alexandra Headlands beach, and with plenty of cafes and shops only a short walk away. Job description: The studio rooms and apartments of Break. Free Alexandra Beach represent great holiday value, set as they are right across the road from beautiful Alexandra Headlands beach, and with plenty of cafes and shops only a short walk away. We are seeking energetic & enthusiastic Casual Room Attendants to join our Team. As our next Room Attendant, you will: Be willing to go the extra mile to provide great guest service. Be comprehensively trained on how to maintain the level of guest service and care necessary to be put into this role. Be required to multitask and work in a fast-paced environment. Ensure high cleanliness and productivity standards are met and kept in accordance to company guidelines. What we are looking for: Strong attention to detail with a passion for providing quality guest service. Good communication and time management skills with a friendly personality. A person who is a well-rounded team player, that will be hands-on in order to see their team succeed. Someone who is physically fit and comfortable working autonomously. The flexibility to work over a seven-day roster at a variety of times. Why work for Accor? We live and breathe by our four principles: People Crave Belonging. People Want the Real Deal. Every Person has a Story. People Hate to be Wrong. In return for your commitment, we provide fantastic career and training opportunities and excellent working conditions with a supportive and fun team. In addition, we will provide you with hotel discounts and benefits worldwide. Click ‘Apply’ to begin your journey!.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6141772ea71ddb73057876e5::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"BreakFree Hotels, Resorts and Apartments\", \"position\": \"Room Attendant\", \"notes\": \"\", \"original\": \"Company description:<br \/><br \/><p>The studio rooms and apartments of\\u00a0<strong>BreakFree Alexandra Beach\\u00a0<\/strong>represent great holiday value, set as they are right across the road from beautiful Alexandra Headlands\\u00a0beach, and with plenty of cafes and shops only a short walk away.\\u00a0<\/p><br \/><br \/>Job description:<br \/><br \/><p>The studio rooms and apartments of <strong>BreakFree Alexandra Beach <\/strong>represent great holiday value, set as they are right across the road from beautiful Alexandra Headlands\\u00a0beach, and with plenty of cafes and shops only a short walk away.\\u00a0<\/p><p>\\u00a0We are seeking energetic &amp; enthusiastic\\u00a0Casual\\u00a0<strong>Room Attendants<\/strong> to join our Team.<\/p><p><strong>As our next Room Attendant, you will:<\/strong><\/p><ul> <li>Be willing to go\\u00a0the extra mile to provide\\u00a0great guest service<\/li> <li>Be comprehensively trained on how to maintain the level of guest service and care necessary to be put into this role<\/li> <li>Be required to multitask and work in a fast-paced environment<\/li> <li>Ensure high cleanliness and productivity standards are met and kept in accordance to company guidelines<\/li> <\/ul><p>\\u00a0<strong>What we are looking for:<\/strong><\/p><ul> <li>Strong attention to detail with a passion for providing quality guest service<\/li> <li>Good communication and time management skills with a friendly personality<\/li> <li>A person who is a well-rounded team player, that will be hands-on in order to see their team succeed<\/li> <li>Someone who is physically fit and comfortable working autonomously\\u00a0<\/li> <li>The flexibility to work over a seven-day roster at a variety of times<\/li> <\/ul><p>\\u00a0<\/p><p><strong>Why work for Accor? <\/strong><\/p><p>We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor\\u2019s limitless possibilities.<\/p><p>\\u00a0<\/p><p>We live and breathe by our four principles:<\/p><ul> <li>People Crave Belonging<\/li> <li>People Want the Real Deal<\/li> <li>Every Person has a Story<\/li> <li>People Hate to be Wrong<\/li> <\/ul><p>\\u00a0<\/p><p>In return for your commitment, we provide fantastic career and training opportunities and excellent working conditions with a supportive and fun team. In addition, we will provide you with hotel discounts and benefits worldwide. Click \\u2018Apply\\u2019 to begin your journey!<\/p>\"}"
}