{
    "id":"Kaggle::techmap::614de6ee38e45711c016bbda::efinancialcareers_uk::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":"\"Strong leader\", \"Proven Commercial Savvy\" is stereotypical of masculine leaning bias. Requiring \"more than 15 years career experience\" sets a high bar that may indirectly favour male candidates due to gender gaps in leadership roles..",
    "verified":true,
    "synthetic":false,
    "text":". Established Securities Firm. Lead all Operations and Support Functions. Strong Institutional Equities & Risk Experience Preferred Our client is seeking an experienced Operations leader to lead Securities and global markets operations for the company. As this is a senior leadership function, candidates with more than 15 years career experience (with at least 5 years managing regional operations teams) are welcome to apply. The successful candidate should be a strong leader with proven commercial savvy and an appreciation of risk management principles. An attractive remuneration package with career growth opportunities await the right candidate. Please consider your application filed for future reference if you do not hear from us within 10 working days from submission date.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614de6ee38e45711c016bbda::efinancialcareers_uk\", \"source\": \"efinancialcareers_uk\", \"country\": \"UK\", \"company\": \"The Meyer Consulting Group\", \"position\": \"COO Singapore\", \"notes\": \"\", \"original\": \"<div class=\\\"font-weight-bold mt-4\\\"><\/div> * Established Securities Firm * Lead all Operations and Support Functions * Strong Institutional Equities &amp; Risk Experience Preferred \\n<div class=\\\"mt-4 font-weight-bold \\\"><\/div> \\n<p>Our client is seeking an experienced Operations leader to lead Securities and global markets operations for the company.&nbsp;As this is a senior leadership function, candidates with more than 15 years career experience (with at least&nbsp;5 years managing regional operations teams) are welcome to apply. The successful candidate should be a strong leader with&nbsp;proven commercial savvy&nbsp;and an appreciation of risk management principles. An attractive remuneration package with career growth opportunities await the right candidate.<\/p> \\n<p>&nbsp;<\/p> \\n<p><em>Please consider your application filed for future reference if you do not hear from us within 10 working days from submission date.<\/em><\/p> \\n<p>&nbsp;<\/p>\"}"
}