{
    "id":"Kaggle::techmap::614237fa65654d18d344f2f4::monster2_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Position Summary:Penske Logistics is looking for a Facility Maintenance Technician who will maintain our building and dock equipment to include performing and logging preventive maintenance inspections of all equipment. Major Responsibilities: Maintain fleet of dock positions, racking, and other building equipment. Perform preventative maintenance inspections of all equipment. Keep up Preventative Maintenance programs. Perform repairs as needed. Fill out accurate work orders daily. Run computer-based diagnostics on forklifts. Perform data entry for completed repairs. Perform basic facility repairs including but not limited to dock plates, doors and racking. Assist other technicians in equipment\/facility repairs. Comply with all safety standards and OSHA procedures. Performs other duties as assigned by Supervisor or as the situation dictates within the scope of the position Qualifications: High School diploma or GED\/HSE equivalent required. 3 years of building maintenance. Proficient in electronic, mechanical and hydraulic repair. Familiarity with Crown equipment preferred. Ability to lift 50 pounds or more and to crouch or crawl in confined spaces. Must be able to read codes, instructions and electrical and hydraulic schematics. Must possess own hand tools, some specialized tools will be provided. Must possess a positive attitude, strong verbal and written communication skills• A strong work ethic and sense of integrity is required. Must be flexible in shift assignments. Regular, predictable, full attendance is an essential function of the job. Willingness to travel as necessary, work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required. Physical Requirements:-The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. -The associate will be required to remember and understand certain instructions, guidelines or other information. The associate must be able to see and verbally communicate.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614237fa65654d18d344f2f4::monster2_us\", \"source\": \"monster2_us\", \"country\": \"US\", \"company\": \"Penske\", \"position\": \"Facility Maintenance Technician - 3,000 Sign On Bonus\", \"notes\": \"\", \"original\": \"&nbsp;Position Summary:Penske Logistics is looking for a Facility Maintenance Technician who will maintain our building and dock equipment to include performing and logging preventive maintenance inspections of all equipment.&nbsp;Major Responsibilities:\\u2022 Maintain fleet of dock positions, racking, and other building equipment\\u2022 Perform preventative maintenance inspections of all equipment\\u2022 Keep up Preventative Maintenance programs\\u2022 Perform repairs as needed\\u2022 Fill out accurate work orders daily\\u2022 Run computer-based diagnostics on forklifts\\u2022 Perform data entry for completed repairs\\u2022 Perform basic facility repairs including but not limited to dock plates, doors and racking\\u2022 Assist other technicians in equipment\/facility repairs\\u2022 Comply with all safety standards and OSHA procedures\\u2022 Performs other duties as assigned by Supervisor or as the situation dictates within the scope of the position&nbsp;Qualifications:\\u2022 High School diploma or GED\/HSE equivalent required\\u2022 3 years of building maintenance\\u2022 Proficient in electronic, mechanical and hydraulic repair\\u2022 Familiarity with Crown equipment preferred\\u2022 Ability to lift 50 pounds or more and to crouch or crawl in confined spaces\\u2022 Must be able to read codes, instructions and electrical and hydraulic schematics\\u2022 Must possess own hand tools, some specialized tools will be provided\\u2022 Must possess a positive attitude, strong verbal and written communication skills\\u2022 A strong work ethic and sense of integrity is required.\\u2022 Must be flexible in shift assignments\\u2022 Regular, predictable, full attendance is an essential function of the job.\\u2022 Willingness to travel as necessary, work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required.Physical Requirements:-The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.-The associate will be required to remember and understand certain instructions, guidelines or other information. The associate must be able to see and verbally communicate. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus.-While performing the duties of this job, the associate will be required to move frequently, stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to regularly lift and\/or move up to 50lbs\/23kg and occasionally lift and\/or move up to 100lbs\/45kg.Penske is an Equal Opportunity Employer.Penske Logistics is a wholly owned subsidiary of Penske Truck Leasing. With operations in North America, South America, Europe and Asia, Penske Logistics provides supply chain management and logistics services to leading companies around the world. Penske Logistics delivers value through its design, planning and execution in transportation, warehousing and freight management. Visit www.PenskeLogistics.com to learn more.&nbsp;&nbsp;\"}"
}