{
    "id":"Kaggle::techmap::615e790f177c9668cd9ef16e::linkedin_kr::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The terms \"self-starters\" and \"drive to achieve\" subtly favour masculine-coded traits such as independence and assertiveness and may deter female applicants.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"Requiring \"native or near-native Korean language proficiency\" can disadvantage those from different racial backgrounds, potentially excluding candidates with adequate levels of proficiency.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2009 Project Development Manager, Korea. Location: Seoul, Korea (main office, but remote work may be considered on a case-by-case basis). At Ecoplexus (www. ecoplexus. com), we are seeking individuals who have a passion to be part of the renewable energy industry and the change it is bringing, are self starters, creative thinkers, possess the drive to achieve, and have the capacity to assume increasing responsibility in a dynamic growth environment. We are looking for talented self-starters with imagination, creativity and vision. We are a rapidly-growing developer of large solar, wind and energy storage projects serving corporate and utility energy purchasers. We design, build, finance, own and operate projects across the US, Mexico and Asia. Headquartered in San Francisco, Ecoplexus has grown at an annual rate of over 50% per year since its founding in 2009. NOTE: Native or near-native Korean language proficiency is required, so non-Korean speakers need not apply for this role. We are looking for a Project Development Manager to support our Korean project development activities. Responsibilities: Source, evaluate, analyze, and secure land for renewable energy and energy storage projects in collaboration with management, internal staff, and external consultants. Specific duties include prospecting, site identification and assessment, information gathering with local government, viability analysis, outreach and property owner relationship building and relationship management. Successfully develop renewable energy and energy storage projects on time, on budget, and meeting the companys profitability targets. Collaborate with electric utility to determine suitable grid connection points, and manage all related documentation and correspondence. Manage project permitting, including interactions with national, provincial, and local government entities, industry groups, and local stakeholders. Collaborate with technical, legal, and financial resources to support the project development process. Manage and maintain data rooms, project summary and tracking tools, and project files. Compile and maintain update reports as required by management. Other development and support activities as may be required by the Company. Requirements: 8. years of experience in energy development or real estate industry, with 3. years working in rural areas. Strong track record of working cooperatively with provincial and local governments. Strong background working with internal and external stakeholders. Multinational company experience a plus. Qualifications: Minimum BA\/BS degree required. Completed courses in renewable energy will be considered positively. Strong understanding of prefectural and local permitting regulations and requirements. Knowledge of the Korean renewable energy market a plus.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615e790f177c9668cd9ef16e::linkedin_kr\", \"source\": \"linkedin_kr\", \"country\": \"KR\", \"company\": \"Ecoplexus Inc.\", \"position\": \"Project Development Manager, Korea\", \"notes\": \"\", \"original\": \"<p>2009 Project Development Manager, Korea\\u3000<\/p><p><strong>Location:<\/strong>&nbsp; Seoul, Korea (main office, but remote work may be considered on a case-by-case basis)<\/p><p><br><\/p><p>At Ecoplexus (www.ecoplexus.com), we are seeking individuals who have a passion to be part of the renewable energy industry and the change it is bringing, are self starters, creative thinkers, possess the drive to achieve, and have the capacity to assume increasing responsibility in a dynamic growth environment. We are looking for talented self-starters with imagination, creativity and vision. We are a rapidly-growing developer of large solar, wind and energy storage projects serving corporate and utility energy purchasers. We design, build, finance, own and operate projects across the US, Mexico and Asia. Headquartered in San Francisco, Ecoplexus has grown at an annual rate of over 50% per year since its founding in 2009.&nbsp;<\/p><p><br><\/p><p><strong>NOTE:&nbsp; <\/strong>Native or near-native Korean language proficiency is required, so non-Korean speakers need not apply for this role.&nbsp;<\/p><p><br><\/p><p>We are looking for a Project Development Manager to support our Korean project development activities.&nbsp;<\/p><p><strong>Responsibilities:&nbsp;<\/strong><\/p><ul><li>Source, evaluate, analyze, and secure land for renewable energy and energy storage projects in collaboration with management, internal staff, and external consultants.&nbsp; Specific duties include prospecting, site identification and assessment, information gathering with local government, viability analysis, outreach and property owner relationship building and relationship management.<\/li><li>Successfully develop renewable energy and energy storage projects on time, on budget, and meeting the company\\u2019s profitability targets.&nbsp;<\/li><li>Collaborate with electric utility to determine suitable grid connection points, and manage all related documentation and correspondence.<\/li><li>Manage project permitting, including interactions with national, provincial, and local government entities, industry groups, and local stakeholders.<\/li><li>Collaborate with technical, legal, and financial resources to support the project development process.&nbsp;<\/li><li>Manage and maintain data rooms, project summary and tracking tools, and project files.<\/li><li>Compile and maintain update reports as required by management.&nbsp;<\/li><li>Other development and support activities as may be required by the Company.&nbsp;<\/li><\/ul><p><br><\/p><p><strong>Requirements:<\/strong><\/p><ul><li>8+ years of experience in energy development or real estate industry, with 3+ years working in rural areas<\/li><li>Strong track record of working cooperatively with provincial and local governments<\/li><li>Strong background working with internal and external stakeholders<\/li><li>Multinational company experience a plus&nbsp;<\/li><\/ul><p><br><\/p><p><strong>Qualifications:&nbsp;&nbsp;<\/strong><\/p><ul><li>Minimum BA\/BS degree required&nbsp;<\/li><li>Completed courses in renewable energy will be considered positively<\/li><li>Strong understanding of prefectural and local permitting regulations and requirements<\/li><li>Knowledge of the Korean renewable energy market a plus<\/li><li>Ability to work independently and creatively solve problems&nbsp;\\u3000<\/li><li>High level of professionalism with attention to detail<\/li><li>Excellent oral and written communication and presentation skills&nbsp;<\/li><li>Superior time management and interpersonal skills<\/li><li>Fluency in MS Word, Excel, Powerpoint<\/li><li>Native or near-native proficiency in Korean required.<\/li><li>Travel: frequent (primarily domestic)<\/li><\/ul><p><br><\/p><p>Reporting line: Director of Development<\/p><p><br><\/p><p>Please send MS Word resume and cover letter in English AND Korean to: rpark@ecoplexus.com<\/p><p><br><\/p><p>Ecoplexus offers a competitive salary, strong bonus structures, the potential for employee stock options in a growing company, and a benefits program.<\/p><p><br><\/p><p>Ecoplexus is proud to be an Equal Employment Opportunity Employer . We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.<\/p><p><br><\/p><p>Check us out at:&nbsp;http:\/\/www.ecoplexus.com\/about-us\/<\/p><p><br><\/p><p><br><\/p><p>&nbsp;<\/p><p><\/p>\"}"
}