{
    "id":"Kaggle::techmap::614137e68be8df1fa24bd221::careerbuilder_us::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The phrase \"Physical and mental fitness is a given\" could discourage those with disabilities from applying.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants. Summary. We are seeking a construction Superintendent with ground up schools and public works project experience at a general contractor. The Superintendent's role is to develop and maintain a collaborative partnership with all project stakeholders to ensure the project meets expectations in a safe, timely and cost-effective manner. Client Details. Our client is a leading general contractor and construction management firm serving Southern California school districts and public works clients for over 100 years. Description. Take ownership of the project with regard to phasing, logistics, schedule, subcontractor coordination, planning and project execution. Conduct project safety meetings, subcontractor weekly foreman's meetings, schedule update review meetings, 3-week look-ahead meetings, and participate in OAC meetings. Enforce safety policies and procedures throughout the course of the project. Assist in the development of the baseline schedule, and maintain the project schedule on a monthly basis and ensure the project maintains the scheduled completion date. Develop and maintain relationships with the owner, subcontractors and architect. Coordinate field construction work through organization and proper planning, and collaborative relationship with subcontractor representatives on site. Set the standard for excellent quality control. Knowledge of building codes. Review project drawings, specifications and submittals. Review and vet CORs from subcontractors. Sign T & M timesheets only when they are justified (do not sign TS verifying time only). Attend or hold regular subcontractor and management meetings. Perform start-up testing and prepare for owner turnover. Document final close-out and guarantee owner acceptance. Coordinate the punchlist process with owner and architect. Profile. Associate's degree in a related field and 5 years of Project Superintendent-related experience. Commercial and\/or public works construction experience required. Excellent communication skills. Possessing a sense of urgency. Good understanding of mechanical, electrical and plumbing building systems. Knowledge of legal issues and safety standards is essential. Client and vendor relationship management. Capacity to motivate, lead and boost morale of the teams. Effective time management and logical decision-making ability. Physical and mental fitness is a given. Strong focus on quality. Working knowledge and competence of Microsoft Office, including MS Teams, Bluebeam. Maintain company confidentiality.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614137e68be8df1fa24bd221::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Michael Page\", \"position\": \"Construction Superintendent for GC with DSA Experience\", \"notes\": \"\", \"original\": \"<p><em>MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants.<\/em><\/p><p><strong>Summary<\/strong><\/p><p>We are seeking a construction Superintendent with ground up schools and public works project experience at a general contractor. The Superintendent's role is to develop and maintain a collaborative partnership with all project stakeholders to ensure the project meets expectations in a safe, timely and cost-effective manner.<\/p><p><strong>Client Details<\/strong><\/p><p>Our client is a leading general contractor and construction management firm serving Southern California school districts and public works clients for over 100 years.<\/p><p><strong>Description<\/strong><\/p><ul><li>Take ownership of the project with regard to phasing, logistics, schedule, subcontractor coordination, planning and project execution.<\/li><li>Conduct project safety meetings, subcontractor weekly foreman's meetings, schedule update review meetings, 3-week look-ahead meetings, and participate in OAC meetings.<\/li><li>Enforce safety policies and procedures throughout the course of the project.<\/li><li>Assist in the development of the baseline schedule, and maintain the project schedule on a monthly basis and ensure the project maintains the scheduled completion date.<\/li><li>Develop and maintain relationships with the owner, subcontractors and architect.<\/li><li>Coordinate field construction work through organization and proper planning, and collaborative relationship with subcontractor representatives on site.<\/li><li>Set the standard for excellent quality control.<\/li><li>Knowledge of building codes.<\/li><li>Review project drawings, specifications and submittals.<\/li><li>Review and\/or author all RFIs for thoroughness and accuracy.<\/li><li>Review and vet CORs from subcontractors; sign T & M timesheets only when they are justified (do not sign TS verifying time only).<\/li><li>Attend or hold regular subcontractor and management meetings.<\/li><li>Perform start-up testing and prepare for owner turnover.<\/li><li>Document final close-out and guarantee owner acceptance.<\/li><li>Coordinate the punchlist process with owner and architect.<\/li><\/ul><p><strong>Profile<\/strong><\/p><ul><li>Associate's degree in a related field and 5 years of Project Superintendent-related experience.<\/li><li>Commercial and\/or public works construction experience required. <\/li><li>Excellent communication skills.<\/li><li>Possessing a sense of urgency.<\/li><li>Good understanding of mechanical, electrical and plumbing building systems.<\/li><li>Knowledge of legal issues and safety standards is essential.<\/li><li>Client and vendor relationship management.<\/li><li>Capacity to motivate, lead and boost morale of the teams.<\/li><li>Effective time management and logical decision-making ability.<\/li><li>Physical and mental fitness is a given.<\/li><li>Strong focus on quality.<\/li><li>Working knowledge and competence of Microsoft Office, including MS Teams, Bluebeam. <\/li><li>Maintain company confidentiality.<\/li><li>Previous or current experience working with LAUSD is a plus.<\/li><li>Bilingual in Spanish is a plus.<\/li><\/ul><p><strong>Job Offer<\/strong><\/p><ul><li>Strong bonus structure.<\/li><li>Medical 100% Employer paid.<\/li><li>Company vehicle\/car allowance and gas card.<\/li><li>Vacation.<\/li><li>401(k) retirement plan with 50% match.<\/li><\/ul>&nbsp;\"}"
}