{
    "id":"Kaggle::techmap::6144b489ce85b02e20998fe4::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The phrase \"scavenge\" in the context of the public attempting to access restricted areas may be considered an outdated or inappropriate term, potentially carrying negative connotations or cultural insensitivity.",
    "verified":true,
    "synthetic":false,
    "text":" 3 x Waste Service Officers. Asset and Environmental Sustainability. Permanent. The Scenic Rim is a region of opportunity surrounded by World Heritage-listed national parks and well renowned for its breathtaking scenery, agricultural and tourism industries. At Scenic Rim Regional Council, we deliver community services and infrastructure to the region's population of more than 40, 000. With a diverse team exceeding 420 employees, we are committed to shaping a progressive future for our community through collaboration, integration and innovation. We are proudly an equal opportunity employer that embraces diversity and a workplace underpinned by shared ethos and values that shape our actions and behaviours. About this opportunity. Our Waste Services team has an opportunity for 3 x experienced Waste Services Officers you will be required to undertake the operational responsibilities of Council's waste transfer stations and surrounds. Work will be required to be undertaken at any of Council's nominated waste transfer stations within the region. Key responsibilities include: Direct the public on the correct placement of refuse and recyclable materials and the assessment of loads as per Councils waste acceptance criteria, and maintain safety on the waste transfer station, ensuring the public do not enter restricted areas or attempt to scavenge. Ensure the waste transfer station surrounds are maintained in a tidy manner and refuse is disposed of in the correct location. This includes all areas within the waste transfer station bounds, access roads and adjoining properties. Comply with Council policies, procedures and instructions to deliver quality and safe services. In accordance with the Work Health and Safety Act 2011, take reasonable care for your own health, safety and wellbeing and take reasonable care to protect the health, safety and wellbeing of others. About you. To succeed in this role, you will require. Open C Class Drivers Licence and own transport. Current Front-End Loader \/ Backhoe licence. General knowledge of waste management, transfer station operations and landfills. Demonstrated numeracy, written and verbal communication skills to carry out financial transactions, read safety instructions and to effectively communicate with members of the public and team members. Proven problem solving and time management skills, with the ability to develop, maintain and monitor own work activities in order to meet deadlines. About our offer. Scenic Rim Regional Council is an innovative employer, offering flexible working arrangements and a collaborative team environment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144b489ce85b02e20998fe4::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Scenic Rim Regional Council\", \"position\": \"Waste Service Officer\", \"notes\": \"\", \"original\": \"<p><strong>3 x Waste Service Officers<\/strong><\/p><p><strong>Asset and Environmental Sustainability<\/strong><\/p><p><strong>Permanent<\/strong><\/p><p><em>The Scenic Rim is a region of opportunity surrounded by World Heritage-listed national parks and well renowned for its breathtaking scenery, agricultural and tourism industries<\/em>.\\u00a0<\/p><p>At <em>Scenic Rim Regional Council, we deliver community services and infrastructure to the region's population of more than 40,000. With a diverse team exceeding 420 employees, we are committed to shaping a progressive future for our community through collaboration, integration and innovation. We are proudly an equal opportunity employer that embraces diversity and a workplace underpinned by shared ethos and values that shape our actions and behaviours.\\u00a0<\/em><\/p><p><strong>About this opportunity<\/strong><\/p><p>Our Waste Services team has an opportunity for 3 x experienced Waste Services Officers you\\u00a0will be required to undertake the operational responsibilities of Council's waste transfer stations and surrounds. Work will be required to be undertaken at any of Council's nominated waste transfer stations within the region.<\/p><p>Key responsibilities include:<\/p><ul><li>Direct the public on the correct placement of refuse and recyclable materials and the assessment of loads as per Council\\u2019s waste acceptance criteria, and maintain safety on the waste transfer station, ensuring the public do not enter restricted areas or attempt to scavenge.<\/li><li>Ensure the waste transfer station surrounds are maintained in a tidy manner and refuse is disposed of in the correct location. This includes all areas within the waste transfer station bounds, access roads and adjoining properties.<\/li><li>Comply with Council policies, procedures and instructions to deliver quality and safe services. In accordance with the Work Health and Safety Act 2011, take reasonable care for your own health, safety and wellbeing and take reasonable care to protect the health, safety\\u00a0and wellbeing of others.<\/li><\/ul><p><strong>About you<\/strong><\/p><p>To succeed in this role, you will require ;<\/p><ul><li>Open C Class Drivers Licence and own transport<\/li><li>Current Front-End Loader \/ Backhoe licence<\/li><li>General knowledge of waste management, transfer station operations and landfills.<\/li><li>Demonstrated numeracy, written and verbal communication skills to carry out financial transactions, read safety instructions and to effectively communicate with members of the public and team members..<\/li><li>Proven problem solving and time management skills, with the ability to develop, maintain and monitor own work activities in order to meet deadlines.<\/li><\/ul><p><strong>About our offer\\u00a0<\/strong><\/p><p>Scenic Rim Regional Council is an innovative employer, offering flexible working arrangements and a collaborative team environment.\\u00a0 For the right candidate, this position comes with a base remuneration of $27.94 per hour in accordance with specified roster allowances, up to 12.5% employer superannuation contribution, and a 40 hour working week (including weekend rosters).<\/p><p><strong>How to apply<\/strong><\/p><p>If this sounds like the position for you, <strong>don\\u2019t delay<\/strong> -\\u00a0apply now<strong> by submitting via <\/strong><a href=\\\"&quot;&quot;https:\/\/www.seek.com.au\/job\/50124885?_ga=2.57998383.489799368.1592776082-211670504.1585302383&quot;&quot;\\\"><strong>SEEK<\/strong><\/a><strong>:<\/strong><\/p><p><strong>1.\\u00a0\\u00a0\\u00a0 A statement<\/strong>\\u00a0(maximum of 2 pages) demonstrating how your skills, knowledge and experience meet the specific requirements and responsibilities of this position.<\/p><p><strong>2.\\u00a0\\u00a0\\u00a0 A current resume\\u00a0<\/strong>(maximum of 5\\u00a0pages) including the names and contact details of 3 referees. One referee should be a Manager you have worked for during the past two years.<\/p><p><strong>Applications close:\\u00a012 noon, Wednesday 29 September 2021.<\/strong><\/p><p>For more information view the position description at <a href=\\\"&quot;&quot;https:\/\/www.scenicrim.qld.gov.au\/our-council\/administration\/careers-with-council\/current-vacancies&quot;&quot;\\\"><strong>website<\/strong><\/a> or contact\\u00a0<a href=\\\"&quot;&quot;mailto:hr@scenicrim.qld.gov.au&quot;&quot;\\\">hr@scenicrim.qld.gov.au<\/a><\/p>\"}"
}