{
    "id":"Kaggle::techmap::614c3db2bfb8e7511d3aba1f::careerbuilder_us::10",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Fast-paced office and project field environment. ..Regularly sit, stand, walk and talk and listen..Occasionally lift and move up objects up to 50 pounds. \" this seems an unnecessary phrase for an office based role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Requisition ID: 125960. Job Level: Mid Level. Department: Equipment. Market: Corporate Home Office. Employment Type: Full Time. Position Overview. As an Equipment Superintendent, you will support Regional Construction & Mining operations. District Overview. Kiewit Equipment Services (KES) helps to ensure the profitability of Kiewit projects through the improved equipment utilization and mechanical reliability by delivering world-class equipment and service. Location. This position will be based out of one of our regional offices, but one of the many things that makes Kiewit’s culture unique is that we go where the work is, which exposes your career to abundant opportunities. We relocate our teams based on the work that is available, combined with the development plans, skill sets and career goals of each team member. This means your Kiewit adventure is custom designed to meet our shared needs. Responsibilities. Provide field leadership and management of equipment maintenance and readiness to meet specific project needs. Ensure project safety and quality performance through personal example as well as supervision activities. Work within Company data systems to record and track equipment maintenance and utilization. Ability to communicate effectively all levels of district and project management, staff and craft. Experience and ability in the use of equipment database-related technology. Qualifications. Ability to travel across the United States and internationally as needed. • 3-5 years’ experience in heavy construction equipment maintenance, repair and utilization. Working Conditions. Fast-paced office and project field environment.. Regularly sit, stand, walk and talk and listen. Occasionally lift and move up objects up to 50 pounds. We are an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c3db2bfb8e7511d3aba1f::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Kiewit\", \"position\": \"Equipment Superintendent - Kiewit Equipment Services\", \"notes\": \"\", \"original\": \"<p><strong>Requisition ID:\\u00a0125960\\u00a0<\/strong><\/p>\\r\\r<p><strong>Job Level:\\u00a0Mid Level\\u00a0<\/strong><\/p>\\r\\r<p><strong>Department:\\u00a0Equipment\\u00a0<\/strong><\/p>\\r\\r<p><strong>Market:\\u00a0Corporate Home Office\\u00a0<\/strong><\/p>\\r\\r<p><strong>Employment Type:\\u00a0Full Time\\u00a0<\/strong><\/p>\\r<br \/><br \/><b><b>Position Overview<\/b><\/b><br \/><br \/><p>As an Equipment Superintendent, you will support Regional Construction & Mining operations.<\/p>\\r<br \/><br \/><b><b>District Overview<\/b><\/b><br \/><br \/><p>Kiewit Equipment Services (KES) helps to ensure the profitability of Kiewit projects through the improved equipment utilization and mechanical reliability by delivering world-class equipment and service.\\u00a0<\/p>\\r<br \/><br \/><b><b>Location<\/b><\/b><br \/><br \/><p>This position will be based out of one of our regional offices, but one of the many things that makes Kiewit\\u2019s culture unique is that we go where the work is, which exposes your career to abundant opportunities. We relocate our teams based on the work that is available, combined with the development plans, skill sets and career goals of each team member. This means your Kiewit adventure is custom designed to meet our shared needs.<\/p>\\r<br \/><br \/><b><b>Responsibilities<\/b><\/b><br \/><br \/><p>\\u2022 \\u00a0\\u00a0\\u00a0Provide field leadership and management of equipment maintenance and readiness to meet specific project needs<br \/>\\r\\u2022 \\u00a0\\u00a0\\u00a0Ensure project safety and quality performance through personal example as well as supervision activities<br \/>\\r\\u2022 \\u00a0\\u00a0\\u00a0Work within Company data systems to record and track equipment maintenance and utilization<br \/>\\r\\u2022 \\u00a0\\u00a0\\u00a0Ability to communicate effectively all levels of district and project management, staff and craft.<br \/>\\r\\u2022 \\u00a0\\u00a0\\u00a0Experience and ability in the use of equipment database-related technology.<\/p>\\r\\r<p><\/p>\\r<br \/><br \/><b><b>Qualifications<\/b><\/b><br \/><br \/><p>\\u2022 \\u00a0 \\u00a0Ability to travel across the United States and internationally as needed.<br \/>\\r\\u2022\\u00a0 \\u00a0 3-5\\u00a0years\\u2019 experience in heavy construction equipment maintenance, repair and utilization.<\/p>\\r<br \/><br \/><b><b>Working Conditions<\/b><\/b><br \/><br \/><p>\\u2022 \\u00a0 \\u00a0Fast-paced office and project field environment<br \/>\\r\\u2022 \\u00a0 \\u00a0Must be able to interact professionally with all levels of management while simultaneously manage a diversified workload and challenging situations efficiently and effectively<br \/>\\r\\u2022 \\u00a0 \\u00a0Regularly sit, stand, walk and talk and listen<br \/>\\r\\u2022 \\u00a0 \\u00a0Occasionally lift and move up objects up to 50 pounds.<\/p>\\r<p><em>We are an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.<\/em><\/p>&nbsp;\"}"
}