{
    "id":"Kaggle::techmap::6157175bf148941e20a117db::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The phrase \"Ability to communicate effectively with passengers, drivers, and co-workers on socio-economical levels\" could be seen as insensitive as it suggests communication should vary based on socio-economic status, potentially endorsing stereotypes or discrimination. It's better to focus solely on essential communication skills without referencing the social characteristics of others.",
    "verified":true,
    "synthetic":false,
    "text":" OverviewBasic Function. Greet and assist passengers in navigating through, and around the airport. Direct taxicabs to any and all persons requesting one. Dispatch a sufficient number of taxicabs to the terminal or to other loading points and the terminal. Assist passengers in acquiring their luxury limousines. Provide information to passengers who need assistance in getting to other forms of ground transportation. Responsibilities. Greet passengers at taxi curbside in Ground Transportation area of airport and offer them assistance or directions. Information provided to passengers must be accurate. Direct passengers to the appropriate taxi\/limo service. Ensure that a sufficient number of taxicabs are available for the traveling passengers, and dispatch taxicabs to various loading points at terminal. Communicate with drivers, co-workers, and supervisors and address any concerns. Write factual reports regarding items that deviate from normal operation. Order luxury limousines from Ground Transportation when needed, and log information regarding limousines on limo logs. Identify and report any safety issues immediately to supervisor. Clean and maintain surrounding work area (to include glass cleaning, and sweeping of trash). Clean break room (to include empting trash, vacuuming, wiping down of table). Complete other duties may be assigned. Qualifications. Must be 18 years of age or older at time of hire. Knowledge of metro area is desirable. Customer service experience preferred. Prior airport experience is preferred. Must have an excellent attendance and arrive to work on time when scheduled and have access to reliable transportation. Availability to Work: Special shift requirements, if any, will vary depending on a location's hiring needs. If applicable, availability to work 2nd shift, 3rd shift and\/or week-ends may be required. License Requirement: The individual will only be required to have and maintain a valid state-issued driver's license, with a current address and acceptable driving record, if the individual is expected to be able to drive a company vehicle or drive on company business. Language skills: Must be able to read and write English exceptionally well. Ability to communicate effectively with passengers, drivers, and co-workers on socio-economical levels. Ability to read, and comprehend simple instructions, and short correspondence. Be able to write simple correspondence and\/or reports legibly. Ability to effectively present information one-on-one and in group situations to passengers, and drivers. Mathematical Skills: Ability to add and subtract two digit numbers.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6157175bf148941e20a117db::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Sp Plus Corporation\", \"position\": \"Ground Transportation Monitor\", \"notes\": \"\", \"original\": \"OverviewBasic Function - Greet and assist passengers in navigating through, and around the airport. Direct taxicabs to any and all persons requesting one. Dispatch a sufficient number of taxicabs to the terminal or to other loading points and the terminal. Assist passengers in acquiring their luxury limousines. Provide information to passengers who need assistance in getting to other forms of ground transportation.Responsibilities* Greet passengers at taxi curbside in Ground Transportation area of airport and offer them assistance or directions. Information provided to passengers must be accurate.* Direct passengers to the appropriate taxi\/limo service.* Ensure that a sufficient number of taxicabs are available for the traveling passengers, and dispatch taxicabs to various loading points at terminal.* Communicate with drivers, co-workers, and supervisors and address any concerns.* Write factual reports regarding items that deviate from normal operation.* Order luxury limousines from Ground Transportation when needed, and log information regarding limousines on limo logs.* Identify and report any safety issues immediately to supervisor.* Clean and maintain surrounding work area (to include glass cleaning, and sweeping of trash). Clean break room (to include empting trash, vacuuming, wiping down of table).* Complete other duties may be assigned.Qualifications* Must be 18 years of age or older at time of hire.* Knowledge of metro area is desirable.* Customer service experience preferred.* Prior airport experience is preferred.* Must have an excellent attendance and arrive to work on time when scheduled and have access to reliable transportation.Availability to Work: Special shift requirements, if any, will vary depending on a location's hiring needs. If applicable, availability to work 2nd shift, 3rd shift and\/or week-ends may be required.License Requirement: The individual will only be required to have and maintain a valid state-issued driver's license, with a current address and acceptable driving record, if the individual is expected to be able to drive a company vehicle or drive on company business.Language skills: Must be able to read and write English exceptionally well. Ability to communicate effectively with passengers, drivers, and co-workers on socio-economical levels. Ability to read, and comprehend simple instructions, and short correspondence.Be able to write simple correspondence and\/or reports legibly. Ability to effectively present information one-on-one and in group situations to passengers, and drivers.Mathematical Skills: Ability to add and subtract two digit numbers.Reasoning Ability: Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to make sound judgments. Ability to educate others about policy\/procedures not enforce policy\/procedures. Ability to apply patience when communicating with others in difficult situations.Other Skills and Abilities: Ability to carry out assigned tasks and duties completely and effectively. Ability to perform assigned duties with minimal supervision. Ability to demonstrate, fair and impartial judgment.Materials and Equipment Directly Used in Role: Two way radios, various report forms, information logs, brochures, pens and pencils.Physical Demands and Work Environment: While performing the duties of this job, the employee is regularly required to stand; walk; use hands to finger, handle, or feel; talk and listen. Employees are regularly exposed to outside weather conditions including snow storms, and extreme heat. This position is 100% outside work!Employees work in and around potentially dangerous traffic situations, and employees are to be safety conscious at all times. Employees are frequently required to reach and or sign (communicate) with hands and arms. Employees on occasion must lift\/move up to 50 lbs. Employees are regularly exposed to high levels of noise and\/or fumes from either vehicles or airplanes.SP+ is an equal opportunity employer committed in policy and practice to recruit, hire, train, and promote, in all job classifications, without regard to race, color, religion, sex, age, national origin, citizenship status, marital status, sexual orientation, veteran status, disability or other classes protected by federal or state law. SP+ does not tolerate harassment of or retaliation against any employee or applicant on the basis of these characteristics, or because the individual exercised his or her EEO rights.Additional InformationThis posting is only open to existing SFO Curbside Managment Staff who are currently in the Dispather or Cordinator position. This is a takeover proces for an exisiting contract at SFO Airport. No external candidates will be considered until after the transition date of November 1, 2021.<br \/>\"}"
}