{
    "id":"Kaggle::techmap::63671155f2717228ad1ed09f::glassdoor_ie::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Description: Schneiders purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On. Our mission is to be your digital partner for Sustainability and Efficiency. We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries. We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values. www. com Working as part of the Schneider Electric Ireland Field Services Engineering Team, you will lead project commissioning and maintenance lifecycle support on MV & LV equipment in accordance with Schneider Electric standard processes, quality standards and safety guidelines. Typical work includes MV & LV equipment installation and commissioning, routine maintenance, extensions, replacements, identifying technical faults and taking corrective action via remote or on-site customer support. You will deliver top quality customer service supported by the wider Schneider Electric Ireland teams, taking actions to identify new business opportunities for Schneider Electric. Primary duties & responsibilities. Regular attendance at customer sites for installation, testing & commissioning and maintenance of electrical systems (Predominantly MV Equipment but also LV Equipment & Transformers). Performing the following activities on Schneider Electric power distribution equipment at customer sites. Supervision of contractor works. Commissioning activity on MV & LV Systems. Systems testing and fault diagnosis. Modifications \/ modernisation of legacy systems. Asset management \/ maintenance services of install base equipment. Troubleshoot equipment failure and make engineering recommendations to avoid reoccurrence. Strive to develop and maintain technical best practice. Document test results and produce site equipment reports. Perform site risk assessments and assist in developing complex method statements. Participate in On Call scheme to provide emergency cover to contracted customers outside of normal working hours. Promote the Companys activities & offerings and assist in identification of new business opportunities. Contribute to customer training activities. Skills & Abilities. Strong field working experience with MV & LV distribution systems. A solid understanding of power and control systems. HV or MV Commissioning experience desirable. The ability to lead projects through to completion while working independently. Solid working knowledge of MS Office Suite, standard operating systems and associated peripherals. Must hold a clean & valid driving license as a company vehicle will be provided.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::63671155f2717228ad1ed09f::glassdoor_ie\", \"source\": \"glassdoor_ie\", \"country\": \"IE\", \"company\": \"Schneider Electric\", \"position\": \"Field Service Engineer\", \"notes\": \"\", \"original\": \"<div>Job Description: <div> Schneider&rsquo;s purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On.<\/div><div> Our mission is to be your digital partner for Sustainability and Efficiency.<\/div><div> We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries.<\/div><div> We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values.<\/div><div><b> www.se.com<\/b><b> <\/b><\/div><p>Working as part of the Schneider Electric Ireland Field Services Engineering Team, you will lead project commissioning and maintenance lifecycle support on MV &amp; LV equipment in accordance with Schneider Electric standard processes, quality standards and safety guidelines. Typical work includes MV &amp; LV equipment installation and commissioning, routine maintenance, extensions, replacements, identifying technical faults and taking corrective action via remote or on-site customer support.<\/p><p><\/p><p><br> You will deliver top quality customer service supported by the wider Schneider Electric Ireland teams, taking actions to identify new business opportunities for Schneider Electric.<\/p><p><\/p><p><b><br> Primary duties &amp; responsibilities<\/b><\/p><ul><li> Regular attendance at customer sites for installation, testing &amp; commissioning and maintenance of electrical systems (Predominantly MV Equipment but also LV Equipment &amp; Transformers) <\/li><li>Performing the following activities on Schneider Electric power distribution equipment at customer sites;<\/li><ul><li> Supervision of contractor works<\/li><li> Commissioning activity on MV &amp; LV Systems.<\/li><li> Systems testing and fault diagnosis<\/li><li> Modifications \/ modernisation of legacy systems<\/li><li> Asset management \/ maintenance services of install base equipment<\/li><\/ul><li> Troubleshoot equipment failure and make engineering recommendations to avoid reoccurrence<\/li><li> Strive to develop and maintain technical best practice. Document test results and produce site equipment reports.<\/li><li> Perform site risk assessments and assist in developing complex method statements.<\/li><li> Participate in On Call scheme to provide emergency cover to contracted customers outside of normal working hours.<\/li><li> Promote the Company&rsquo;s activities &amp; offerings and assist in identification of new business opportunities.<\/li><li> Contribute to customer training activities.<\/li><\/ul><p><b> Skills &amp; Abilities<\/b><\/p><ul><li> Strong field working experience with MV &amp; LV distribution systems.<\/li><li> A solid understanding of power and control systems.<\/li><li> HV or MV Commissioning experience desirable<\/li><li> The ability to lead projects through to completion while working independently.<\/li><li> Solid working knowledge of MS Office Suite, standard operating systems and associated peripherals<\/li><li> Must hold a clean &amp; valid driving license as a company vehicle will be provided.<\/li><\/ul><p><b> Personal Attributes<\/b><\/p><ul><li> Excellent interpersonal skills with the ability to engage with employees and customers in a professional manner, both in person and via telephone and with a strong focus on managing customer relationships.<\/li><li> Excellent knowledge of health &amp; safety and environmental requirements.<\/li><li> Be willing to learn on the job &amp; in classroom with ability to apply engineering knowledge within related disciplines<\/li><\/ul><p><b> General Background and Experience<\/b><\/p><ul><li> Bachelors or Master&rsquo;s degree Qualified Electrical Engineer<\/li><li> Qualified Electrician or Electrical Technician with at least 8 years&rsquo; experience of installing, commissioning and maintaining MV \/ LV switchgear &amp; transformers.<\/li><li> Prior experience with an equipment vendor, panel builder or in HV \/ MV electrical contracting would be preferred.<\/li><\/ul><div><b> Our offer to you: <\/b><\/div><ul><li>You can look forward to growing your career in a dynamic workplace with significant personal responsibility and attractive development opportunities<\/li><li> Flexible working models to ensure a balance of family and working life<\/li><li> Optimal support on your career path through regular training opportunities<\/li><li> A dynamic and personal atmosphere, working with a global energised team<\/li><li> A company culture that encourages performance and cooperation<\/li><li> An attractive compensation package including the comprehensive fringe benefits expected of an international company<\/li><\/ul><div> At Schneider Electric, Diversity &amp; Inclusion is at the heart of our organisation, it's an integral part of our history, culture and identity. We recognise that embracing diversity unlocks innovation and creativity and fosters collaboration. We want our employees to reflect the diversity of our communities and the customers we serve. As a result, our teams are stronger to drive the company's future.<\/div><div> Please submit an online application to be considered for any position with us. This position will be posted until filled.<\/div><div> You know about us, so let us learn about you! Apply today.<\/div><br> <div><\/div> (External) English Qualifications:<br> <div><\/div> (External) English Company Boiler Plate: <div><b> Why us?<\/b><\/div><div> Schneider Electric is leading the digital transformation of energy management and automation. Our technologies enable the world to use energy in a safe, efficient and sustainable manner. We strive to promote a global economy that is both ecologically viable and highly productive.<\/div><div><\/div><div><br> &euro;25.7bn global revenue<\/div><div> 137 000+ employees in 100+ countries<\/div><div> 45% of revenue from IoT<\/div><div> 5% of revenue devoted for R&amp;D<\/div><div><\/div><div><br> You must submit an online application to be considered for any position with us. This position will be posted until filled<\/div><div><\/div><div><br> It is the policy of Schneider Electric to provide equal employment and advancement opportunities in the areas of recruiting, hiring, training, transferring, and promoting all qualified individuals regardless of race, religion, color, gender, disability, national origin, ancestry, age, military status, sexual orientation, marital status, or any other legally protected characteristic or conduct. Concerning agencies: Schneider Electric does not accept unsolicited resumes and will not be responsible for fees related to such.<\/div><\/div><div><\/div>\"}"
}