{
    "id":"Kaggle::techmap::6140968fdb82a5365fefcb28::aarp_us::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Assurant is seeking a Field Claims Adjuster in Baton Rouge, LA OR Lafayette, LA. *This is a remote position, however, the candidate must be in or around Baton Rouge, LA OR Lafayette, LA area to be eligible for this position. Field Claims Adjusters are the face of Assurant Specialty Property to the insured to make sure they are compensated correctly according to their policy when they experience damage or loss. If you are focused on customer service, enjoy helping people and can make decisions in the best interests of the insured and the company, this may be the job for you. A Field Claims Adjuster III uses their fact-finding skills to investigate, adjust, and settle claims independently with a high degree of accuracy and handle the more complex and\/or challenging activity. They work independently out of a home office and will spend significant portion of time on-site investigating and settling claims. They also are responsible for on-going communication and for providing status updates to the insured and others associated with the claim activity. Successful candidates will be computer literate and comfortable working in a paperless environment. They will enjoy working with customers face to face, be effective at listening and communicating, and have confidence in resolving issues and negotiating fair settlements. Assurant values a diverse workforce where employees are treated with respect, are encouraged to contribute, and have the opportunity for career growth. Catastrophe bonus pay opportunities are available. Business expenses, including home office set-up costs, will be reimbursed. We also provide a company vehicle, reimburse travel expenses, and provide a monthly cell phone allowance. Special Considerations: Physical demands of the job include working in extreme weather conditions and the ability to stand, walk, climb, balance, stoop, kneel, crouch and crawl when necessary. An Adjuster s license may be required for states in which the Field Claims Adjuster performs their job. If needed, Assurant will assist you in obtaining the license within a specified time frame and cover any related expenses. We are offering a $2500 sign-bonus. Bonus to be paid upon completion of 6 months of employment with performance meeting expectations. Job Primary Accountabilities\/ Responsibilities: Investigate, adjust, and settle claims up to a specified amount for multiple product lines. Meet with insured to inspect losses and explain coverage.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6140968fdb82a5365fefcb28::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Assurant\", \"position\": \"Field Claims Adjuster\", \"notes\": \"\", \"original\": \"<div><p><b>Assurant is seeking a Field Claims Adjuster in Baton Rouge, LA OR Lafayette, LA<\/b><\/p><p><b>*This is a remote position, however, the candidate must be in or around Baton Rouge, LA OR Lafayette, LA area to be eligible for this position<\/b><\/p><p><b>Field Claims Adjusters<\/b> are the face of Assurant Specialty Property to the insured to make sure they are compensated correctly according to their policy when they experience damage or loss. If you are focused on customer service, enjoy helping people and can make decisions in the best interests of the insured and the company, this may be the job for you.<\/p><p>A Field Claims Adjuster III uses their fact-finding skills to investigate, adjust, and settle claims independently with a high degree of accuracy and handle the more complex and\/or challenging activity. They work independently out of a home office and will spend significant portion of time on-site investigating and settling claims. They also are responsible for on-going communication and for providing status updates to the insured and others associated with the claim activity. Successful candidates will be computer literate and comfortable working in a paperless environment. They will enjoy working with customers face to face, be effective at listening and communicating, and have confidence in resolving issues and negotiating fair settlements. Assurant values a diverse workforce where employees are treated with respect, are encouraged to contribute, and have the opportunity for career growth. Catastrophe bonus pay opportunities are available. Business expenses, including home office set-up costs, will be reimbursed. We also provide a company vehicle, reimburse travel expenses, and provide a monthly cell phone allowance.<\/p><p>Special Considerations: Physical demands of the job include working in extreme weather conditions and the ability to stand, walk, climb, balance, stoop, kneel, crouch and crawl when necessary. A Field Claims Adjuster s territory can include a variety of neighborhoods, some of which may be in less than desirable areas, with properties of varying degrees of disrepair.<\/p><p>An Adjuster s license may be required for states in which the Field Claims Adjuster performs their job. If needed, Assurant will assist you in obtaining the license within a specified time frame and cover any related expenses.<\/p><p><b>We are offering a $2500 sign-bonus <\/b>. <b>Bonus to be paid upon completion of 6 months of employment with performance meeting expectations.<\/b><\/p><p><b>Job Primary Accountabilities\/ Responsibilities:<\/b><\/p><p><b>Investigate, adjust, and settle claims up to a specified amount for multiple product lines.<\/b><\/p><ul><li>Meet with insured to inspect losses and explain coverage.<\/li><li>Communicate with mortgage representatives, property managers, or other third-party administrators to obtain access and inspect vacant properties.<\/li><li>Collect policy and claim data and information including interviewing persons associated with the case and obtaining recorded statements.<\/li><li>Document damage\/losses and prepare written cost estimates.<\/li><li>Document claim transactions and prepare and forward internal reports as needed.<\/li><li>Complete residential or mobile home claim settlement by reaching agreements with insured, claimants, and their representatives up to specified authority.<\/li><li>Respond to catastrophes and other temporary assignments outside of territory as requested.<\/li><li>May be given the more challenging and complex claim activity.<\/li><li>May periodically train new employees and serve as a resource to others in the resolution of complex problems and issues.<\/li><\/ul><p><b>Build and maintain effective internal and external working relationships. Collaborate with internal support teams and management as appropriate.<\/b><\/p><ul><li>Effectively collaborate with various departments and levels in the organization.<\/li><li>Maintain industry knowledge and operational skills and attend workshops, seminars, and other training sessions as appropriate.<\/li><li>Handle other duties and projects as requested based on business needs.<\/li><\/ul><p><b>Basic Qualifications Required - Experience, Skills, and Knowledge:<\/b><\/p><ul><li>High school diploma or GED<\/li><li>Minimum of one year face-to-face customer service experience<\/li><li>Minimum of two years property claims adjusting experience<\/li><\/ul><p><b>Other Requirements:<\/b><\/p><ul><li>Demonstrated proficiency with Microsoft Office and the ability to navigate and enter data on multiple screens<\/li><\/ul><p><b>Preferred Experience, Skills, and Knowledge:<\/b><\/p><ul><li>Associate\/Bachelor s degree<\/li><li>Knowledge of construction basics<\/li><li>Strong listening, problem solving, and negotiating skills<\/li><li>Ability to mediate disagreements and resolve differences of opinion to achieve win-win outcomes<\/li><li>Excellent verbal and written communications skills<\/li><li>Proven ability to work independently with minimal supervision to manage schedules and meet deadlines<\/li><li>Detail oriented with a commitment to excellence<\/li><li>Poised and professional demeanor<\/li><\/ul><\/div><br \/>\"}"
}