{
    "id":"Kaggle::techmap::6146ca034abc0b1f16eb6c48::simplyhired_at::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1st Line Support Engineer\/Helpdesk Support required to join my leading FMCG client and their Technology team based in Graz, Austria. 1st line skills, to be responsible for supporting the company's IT service requests. This is an onsite role with flexible working. IT Support Specialist Key Skills and Responsibilities: Ensuring 1st line\/Helpdesk Support. Troubleshooting and escalating issue to 2nd and 3rd lin. Providing general administrative support,. Maintaining and supporting the company's internal IT systems. Must-Have: Minimum 1 year 1st line\/Helpdesk Support experience. Windows 10 and Mac OS. Microsoft Office 2016 and above. In-depth knowledge of O365, Outlook Exchange, and Active Directory. Excellent communication skills, both written and verbal with great attention to detail. German language skills essential. If you have what it takes and feel you can excel in this 1st Line\/Helpdesk Support Specialist 12 Month. Rolling Contract opportunity, please send your CV ASAP for consideration.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6146ca034abc0b1f16eb6c48::simplyhired_at\", \"source\": \"simplyhired_at\", \"country\": \"AT\", \"company\": \"Apollo Solutions\", \"position\": \"Helpdesk Support - 1st Line Support Engineer - German speaking\", \"notes\": \"\", \"original\": \"1st Line Support Engineer\/Helpdesk Support required to join my leading FMCG client and their Technology team based in Graz, Austria. 1st line skills, to be responsible for supporting the company&#39;s IT service requests. This is an onsite role with flexible working\\n<br \/><br \/>\\n<b>IT Support Specialist Key Skills and Responsibilities:<\/b><br \/>\\nEnsuring 1st line\/Helpdesk Support\\n<br \/>Troubleshooting and escalating issue to 2nd and 3rd lin\\n<br \/>Providing general administrative support,\\n<br \/>Maintaining and supporting the company&#39;s internal IT systems\\n<br \/><br \/>\\n<b>Must-Have:<\/b><br \/>\\nMinimum 1 year 1st line\/Helpdesk Support experience\\n<br \/>Windows 10 and Mac OS;\\n<br \/>Microsoft Office 2016 and above\\n<br \/>In-depth knowledge of O365, Outlook Exchange, and Active Directory\\n<br \/>Excellent communication skills, both written and verbal with great attention to detail.\\n<br \/>German language skills essential\\n<br \/><br \/>\\nIf you have what it takes and feel you can excel in this 1st Line\/Helpdesk Support Specialist 12 Month&#43; Rolling Contract opportunity, please send your CV ASAP for consideration.\"}"
}