{
    "id":"Kaggle::techmap::61512f9be51a1370c41516e8::itjobslist_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You're always trying to solve the next problem before it happens. You have experience with or are excited to learn an HR System and Ticketing System \/ Help Desk environment. You thrive in an agile and fast-paced environment. You don't take things too seriously and know how to laugh at yourself. You are resourceful. You think creatively in difficult situations and are always looking for innovative ways to solve problems. You are comfortable using Excel and know basic excel functions. You have incredible attention to detail. You are consistently thorough when completing tasks and continuously monitor work, timelines, and resources efficiently. Your organizational skills are next level. You follow a course of action and timetable for goals and projects and meet pre-determined deadlines. The above description is not intended to be a comprehensive list of all duties, responsibilities, or qualifications associated with the job. All personnel may be required to perform duties outside of their normal responsibilities due to the nature of work performed to accomplish Motivate's mission. Motivate is an Equal Opportunity Employer. Applicants are considered for positions and are evaluated without regard to mental or physical disability, race, color, creed, religion, sex, gender, national origin, ancestry, age, genetic information, military or veteran status, sexual orientation, gender identity or expression, marital status, pregnancy or any other legally protected status under applicable law. We also provide reasonable accommodation to qualified individuals with disabilities in accordance with the Americans With Disabilities Act and applicable state and local law, as well as individuals who need an accommodation because of pregnancy. If you require assistance or a reasonable accommodation during any aspect of the application process, please contact [the Human Resources Department or the hiring manager]. Other details. Pay Type Salary. Apply Now. Manhattan, New York, NY, USA.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61512f9be51a1370c41516e8::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"Motivate\", \"position\": \"Jr. HR Generalist\", \"notes\": \"\", \"original\": \"Are you looking to help a growing and maturing organization build a best-in-class People Team? Are you organized, focused on customer service, and willing to work different projects? Motivate's People Operations team is looking for a People Operations Coordinator to join the our team and bring excellent support to our various products and clients.About MotivateMotivate is a best-in-class service operations and logistics company, delivering bike share services to some of the largest urban environments in the US. We operate in 8 cities across the U.S. including New York, San Francisco, Chicago and Washington D.C. and will serve over 1.5 million riders this year alone. Led by a group of seasoned urban visionaries and creative leaders, our mission is to revolutionize the landscape of our cities. In an effort to completely transform the urban experience, Motivate is leading the way in making cities more accessible, healthier and sustainable. We operate and maintain safe and dependable systems that help make cities great by connecting individuals to the people and places they love. We're offering an opportunity to work with the most passionate, creative, and proven team in this emerging, dynamic industry that is transforming cities around the globe.Role Responsibilities* Work with People Operations Team on process documentationo Initial focus will be on processes for payroll, benefits, and leaveso You will be working on documentation for the People Team, managers, and employeeso In order to complete this task, the People Operations coordinator will meet with subject matter experts to understand current processes, ask questions to identify process gaps, and clearly document what needs to occur and when* Day-to-day support on our centralized manager and employee support tool, the People Help Desko Familiarity with our processes and procedures is crucial so the People Operations Coordinator can respond to tickets and close them out on-time and accurately* Support People Operations Team as we centralize administrative tasks, including creation of termination letters and background checks* Support onboarding and offboarding by reporting on completion of tasks and working with managers to properly identify outstanding tasks* Manage and digitize wage garnishments, tax levies, unemployment claims, and other correspondence as it comes in to the People Team and ensure it is stored securelyAbout You* 1-3 years of progressive experience in human resources* You love iterating on things and making them better. You're always trying to solve the next problem before it happens* You have experience with or are excited to learn an HR System and Ticketing System \/ Help Desk environment* You thrive in an agile and fast-paced environment* You don't take things too seriously and know how to laugh at yourself* You are resourceful. You think creatively in difficult situations and are always looking for innovative ways to solve problems* You are comfortable using Excel and know basic excel functions* You have incredible attention to detail. You are consistently thorough when completing tasks and continuously monitor work, timelines, and resources efficiently* Your organizational skills are next level; you follow a course of action and timetable for goals and projects and meet pre-determined deadlinesThe above description is not intended to be a comprehensive list of all duties, responsibilities, or qualifications associated with the job. All personnel may be required to perform duties outside of their normal responsibilities due to the nature of work performed to accomplish Motivate's mission. Motivate is an Equal Opportunity Employer. Applicants are considered for positions and are evaluated without regard to mental or physical disability, race, color, creed, religion, sex, gender, national origin, ancestry, age, genetic information, military or veteran status, sexual orientation, gender identity or expression, marital status, pregnancy or any other legally protected status under applicable law. We also provide reasonable accommodation to qualified individuals with disabilities in accordance with the Americans With Disabilities Act and applicable state and local law, as well as individuals who need an accommodation because of pregnancy. If you require assistance or a reasonable accommodation during any aspect of the application process, please contact [the Human Resources Department or the hiring manager].Other details* Pay Type SalaryApply Now* Manhattan, New York, NY, USA\"}"
}