{
    "id":"Kaggle::techmap::61434b79a973d70733cfffd9::britishjobs_uk::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Overview. Pure Resourcing Solutions are partnering with a local Accountancy Practice, to recruit for an Accountant to join their friendly team based in Swaffham. Key Duties and Responsibilities. As an Accountant, you will be responsible for preparing the accounts for a diverse range of clients. Key responsibilities include: Accounts Preparation. Management Accounts. Personal Tax. Business Tax. Corporation Tax. Purchase & Sales Ledger Management. About You. You will be a driven individual with recent experience working within an Accountancy Practice. You will be either qualified or studying towards a recognised accountancy qualification. Next Steps. If you’re interested in this role, please apply now, or alternatively get in touch with Giles Dawson for more information.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61434b79a973d70733cfffd9::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Pure Resourcing Solutions Limited\", \"position\": \"Practice Accountant\", \"notes\": \"\", \"original\": \"Overview<br>Pure Resourcing Solutions are partnering with a local Accountancy Practice, to recruit for an&nbsp;Accountant&nbsp;to join their friendly team based in Swaffham.&nbsp;<br>&nbsp;<br>Key Duties and Responsibilities<br>As an Accountant, you will be responsible for preparing the accounts for a diverse range of clients. Key responsibilities include:<br><br>Accounts Preparation<br>Management Accounts<br>Personal Tax<br>Business Tax<br>Corporation Tax<br>Purchase &amp; Sales Ledger Management&nbsp;<br><br>About You<br>You will be a driven individual with recent experience working within an Accountancy Practice. You will be either qualified or studying towards a recognised accountancy qualification.<br>&nbsp;<br>Next Steps<br>If you&rsquo;re interested in this role, please apply now, or alternatively get in touch with Giles Dawson for more information.\"}"
}