{
    "id":"Kaggle::techmap::614be26fe48deb575b2bf0f1::reed_uk::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Jobs-description__container--condensed\"> jobs-description__content--condensed\"> FDM is expanding its UK account management team - we’re interested in people who are passionate about technology and who are excited about launching a sales career. The position is ideal for people who are keen to kick start a career in Account Management, either recent graduates or those people looking for a change in role or career. The role. After completing FDM’s sales training, and learning our business model, we’ll start you on the sales journey at FDM which has significant career advancement opportunities. There will be a focus on nurturing existing client relationships, as well as a strong emphasis on generating and developing new business opportunities. About you. We are mostly interested in a spirit of entrepreneurialism, creativity and passion for sales. specific experience is not essential - you’ll simply need to demonstrate motivation to learn the tools and knowledge required to succeed. You’ll begin to build relationships and solve client challenges from the get-go. You’ll need to be comfortable presenting FDM’s business to clients, face-to-face and today on Zoom\/Teams daily. About FDM. Our purpose is to create and inspire exciting careers that shape our digital future. We work to bridge the digital skills gap, supporting 300. clients worldwide across all industry sectors. We want to make sure that the opportunity for a career in tech is made available to as wide an audience as possible. Duties and Responsibilities. Maintaining existing client relationships and developing new connections through Business Development activity. Attendance & contribution at daily stand up and regular group sales meetings. Able to achieve targets and weekly performance KPIs. Account Management administration through Cloud CRM management tool - Salesforce. Use of collaboration & Networking tools including Microsoft Teams, Yammer & LinkedIn. Gathering requirements from customers and sourcing relevant candidates from the FDM academies for roles. Cross functional collaboration with other areas of the business including Recruitment, University Partnerships, People Team, Academy, Product Owners and Sales Management. Providing pastoral support to our in-house trainees, both in the process of securing their placement and in their time on-site. Staying up to date with industry & sector developments through researchCriteria. Educated to degree level or equivalent sales \/ customer facing experience (1-2 years)..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614be26fe48deb575b2bf0f1::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"FDM Group\", \"position\": \"Junior Sales\", \"notes\": \"\", \"original\": \"jobs-description__container--condensed\\\"&gt; jobs-description__content--condensed\\\"&gt; <p>FDM is expanding its UK account management team - we\\u2019re interested in people who are passionate about technology and who are excited about launching a sales career.<\/p> <p>The position is ideal for people who are keen to kick start a career in Account Management, either recent graduates or those people looking for a change in role or career.<\/p> <p><strong>The role<\/strong><\/p> <p>After completing FDM\\u2019s sales training, and learning our business model, we\\u2019ll start you on the sales journey at FDM which has significant career advancement opportunities.<\/p> <p>There will be a focus on nurturing existing client relationships, as well as a strong emphasis on generating and developing new business opportunities.<\/p> <p><strong>About you<\/strong><\/p> <p>We are mostly interested in a spirit of entrepreneurialism, creativity and passion for sales - specific experience is not essential - you\\u2019ll simply need to demonstrate motivation to learn the tools and knowledge required to succeed. <\/p> <p>You\\u2019ll begin to build relationships and solve client challenges from the get-go. You\\u2019ll need to be comfortable presenting FDM\\u2019s business to clients, face-to-face and today on Zoom\/Teams daily.<\/p> <p><strong>About FDM<\/strong><\/p> <p>Our purpose is to create and inspire exciting careers that shape our digital future. We work to bridge the digital skills gap, supporting 300+ clients worldwide across all industry sectors.<\/p> <p>We want to make sure that the opportunity for a career in tech is made available to as wide an audience as possible<\/p> <p>We are proud to be an equal opportunities employer: it enables us to attract, recruit, train and deploy incredible people with centres across Europe, North America and APAC.<\/p> <p><strong>Duties and Responsibilities<\/strong><\/p> <p>\\u00b7 Maintaining existing client relationships and developing new connections through Business Development activity<\/p> <p>\\u00b7 Attendance &amp; contribution at daily stand up and regular group sales meetings<\/p> <p>\\u00b7 Able to achieve targets and weekly performance KPIs<\/p> <p>\\u00b7 Account Management administration through Cloud CRM management tool - Salesforce<\/p> <p>\\u00b7 Use of collaboration &amp; Networking tools including Microsoft Teams, Yammer &amp; LinkedIn<\/p> <p>\\u00b7 Gathering requirements from customers and sourcing relevant candidates from the FDM academies for roles<\/p> <p>\\u00b7 Cross functional collaboration with other areas of the business including Recruitment, University Partnerships, People Team, Academy, Product Owners and Sales Management<\/p> <p>\\u00b7 Providing pastoral support to our in-house trainees, both in the process of securing their placement and in their time on-site<\/p> <p>\\u00b7 Staying up to date with industry &amp; sector developments through research<strong>Criteria<\/strong><\/p> <p>\\u00b7 Educated to degree level or equivalent sales \/ customer facing experience (1-2 years)<\/p> <p>\\u00b7 Previous experience in sales or recruitment is beneficial but more importantly, we are looking for the right attitude and motivation to succeed<\/p> <p>\\u00b7 Impeccable interpersonal and communication skills<\/p> <p>\\u00b7 Ability to work under pressure<\/p> <p>\\u00b7 Strong organisational skills and meticulous attention to detail<\/p> <p>\\u00b7 Commercially aware and target-oriented individuals<\/p> <p>\\u00b7 Eager to learn and develop professionally<\/p> <p>\\u00b7 Technically proficient in the use of Microsoft Office (Outlook, Word, Excel and PowerPoint) <\/p> <p><strong><em>Diversity and inclusion are at the heart of what we value as an organisation. FDM Group is an equal opportunities employer and all qualified applicants will receive consideration for employment without regard to race, religion, sex, sexual orientation, age, disability, or any other status protected by law. Our recruitment team are happy to support with any reasonable adjustments that are needed within the recruitment process.<\/em><\/strong><\/p>\"}"
}