{
    "id":"Kaggle::techmap::615ce0d0a8d9797628657083::linkedin_cl::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"\"This is a local position with no expat benefit.\" - this seeks to exclude all but local people.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\"requires full-time dedication\" - this could be interpreted as exclusionary by single parents. some women etc",
    "verified":true,
    "synthetic":false,
    "text":" 5 years of experience in the marketing area of the pharmaceutical industry and \/ or institutional marketing, preferably experience in the specialty (Hemtology). Ideal with previous sales experience. Excellent command of the English language (oral and written). The position requires full-time dedication and availability to make frequent trips to the interior and exterior of the country. This is a local position with no expat benefit. En todo el mundo, nos apasiona tener un impacto en la vida de los pacientes con enfermedades graves. Con el poder de aplicar nuestros talentos individuales y perspectivas diversas en una cultura inclusiva, nuestros valores compartidos de pasion, innovacion, urgencia, responsabilidad, inclusion e integridad sacan a relucir el mayor potencial de cada uno de nuestros colegas. Bristol Myers Squibb reconoce la importancia del equilibrio y la flexibilidad en nuestro entorno de trabajo. Ofrecemos una amplia variedad de beneficios, servicios y programas competitivos que brindan a nuestros empleados los recursos para perseguir sus metas, tanto en el trabajo como en su vida personal.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615ce0d0a8d9797628657083::linkedin_cl\", \"source\": \"linkedin_cl\", \"country\": \"CL\", \"company\": \"Bristol Myers Squibb\", \"position\": \"Hematology & Immunology Product Manager\", \"notes\": \"\", \"original\": \"En Bristol Myers Squibb, nos inspira una sola visi\\u00f3n transformar la vida de los pacientes a trav\\u00e9s de la ciencia. En oncolog\\u00eda, hematolog\\u00eda, inmunolog\\u00eda y enfermedades cardiovasculares, y una de las l\\u00edneas de producci\\u00f3n m\\u00e1s diversas y prometedoras de la industria, cada uno de nuestros apasionados compa\\u00f1eros contribuye a innovaciones que impulsan cambios significativos. Aportamos un toque humano a cada tratamiento en el que somos pioneros. \\u00danete a nosotros y marca la diferencia.<br><br>You will be responsible for tasks such as<br><ul><li>Develop and implement marketing and promotion actions in Chile aimed at achieving the brand's objectives.<\/li><li>Lead and lead the launch of products in current and future indications.<\/li><li>Carry out market analysis (design \/ implement action and monitoring plans, analyze audits and agreements and market shares).<\/li><li>Know the insights of the main stakeholders \/ decision makers and trends of the pathology.<\/li><li>Jointly develop promotional and educational materials with other areas.<\/li><li>Identify and understand a variety of financial, access, promotional, etc. resources \/ systems. Necessary when implementing marketing plans and obtaining results.<\/li><li>Prepare marketing plans, sales plans, projections and investment according to the face-to-face &amp; digital channel segmented by the different audiences.<\/li><li>Manage investment budgets and expenses.<\/li><li>Continuously collaborate with the Regional Champion to give feedback on projects and initiatives related to the brand.<\/li><li>Participate in National and International Congresses.<\/li><li>Organize events (Advisory Boards, Speaker Trainings, Symposia, Conferences, Workshops, etc.).<\/li><li>Establish solid contacts with Opinion Leaders and Medical Societies.<\/li><li>Interact with the sales team, perform field work and lead cycle meetings and POA.<\/li><li>Build solid relationships with the key areas of the company Access, Medical, Sales, Finance, Business Excellence, as well as with colleagues from other business units and Latin American countries.<br><\/li><\/ul>Skills, Competencies and Knowledge<br><ul><li>Strong interpersonal skills, ability to build internal \/ external relationships and work with highly diverse functional teams.<\/li><li>Understand the health system, its policies and the short, medium and long term impact with BMS brands<\/li><li>Strong negotiation and influence skills.<\/li><li>Knowledge of strategic thinking to identify business opportunities for high-cost products.<\/li><li>Quick reaction to changes in the environment.<br><\/li><\/ul>Education \/ Experience \/ Languages<br><br>Education<br><ul><li>Professional in areas of Health and \/ or administrative careers (Marketing, Marketing, Medicine \/ Pharmacy, Business Administration or related)<br><\/li><\/ul>Experience &amp; Languages<br><ul><li>+3 years of experience in marketing in the line of Hematology, Hemato-Oncology, Immunology specifically.<\/li><li>+5 years of experience in the marketing area of the pharmaceutical industry and \/ or institutional marketing, preferably experience in the specialty (Hemtology)<\/li><li>Ideal with previous sales experience<\/li><li>Excellent command of the English language (oral and written)<\/li><li>The position requires full-time dedication and availability to make frequent trips to the interior and exterior of the country.<\/li><li> This is a local position with no expat benefit.<br><\/li><\/ul>En todo el mundo, nos apasiona tener un impacto en la vida de los pacientes con enfermedades graves. Con el poder de aplicar nuestros talentos individuales y perspectivas diversas en una cultura inclusiva, nuestros valores compartidos de pasi\\u00f3n, innovaci\\u00f3n, urgencia, responsabilidad, inclusi\\u00f3n e integridad sacan a relucir el mayor potencial de cada uno de nuestros colegas.<br><br>Bristol Myers Squibb reconoce la importancia del equilibrio y la flexibilidad en nuestro entorno de trabajo. Ofrecemos una amplia variedad de beneficios, servicios y programas competitivos que brindan a nuestros empleados los recursos para perseguir sus metas, tanto en el trabajo como en su vida personal.\"}"
}