{
    "id":"Kaggle::techmap::6162a6b6cecd920a1e332c25::monster_ie::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description The Forcepoint Security Labs team is looking for a talented security researcher to join our growing front-line team. This is the think-tank research group behind Forcepoint. You will be working on detecting, intercepting, and performing detailed analysis of the latest attacks, threats and malware. You get to work with some of the most advanced tools ranging from state-of-the-art artificial intelligence platforms to live threat intelligence correlation. We are looking for an enthusiastic self-starter with a passion for discovering the threats across all stages of the attack life cycle. What you will be doing: Work on security research projects in the areas of web, email, file and data security. Develop prototypes for research conducted and build tools as required. Manage customer submissions and questions in a timely and effective manner. Knowledge sharing internally and externally through blogs, security conferences, etc. Network packet capture (PCAP) analysis. Analyse, translate, and document code behaviour. Reverse engineer malicious code (virus and worms). Participate in research projects with other team members and associates. Knowledge-sharing (internally and externally) through blogs, visiting security conferences and customer events. Experience you can bring: Previous experience in the security space with a good understanding of the security threat landscape. Strong knowledge of scripting\/programming languages with an understanding of what the scripts are doing. Familiarity with current exploit kits. Prior experience dealing with Advance Persistence threats. Knowledge of OS concepts, protocols like TCP\/IP, SSL, DNS, HTTP, SMTP, etc. Experience in some of the following: web security, email security, vulnerabilities and exploitation, network and host security, sandbox security, 0-day threats, APT’s. Experience in understanding and creating network traffic signatures is a plus. Knowledge of software development practices and methodologies. In-depth understanding of the underlying technologies within operating systems. Complex Event Processing knowledge is a bonus. Excellent problem solving skills, flexibility and adaptability to changing priorities. Ability to work under pressure and to meet tight deadlines. Strong written and verbal communication skills. Ability to work on individual projects as well as part of a team. This is a great opportunity to work on cutting edge security research projects with a talented team of researchers and see the impact of your work on Forcepoint's products.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6162a6b6cecd920a1e332c25::monster_ie\", \"source\": \"monster_ie\", \"country\": \"IE\", \"company\": \"Forcepoint\", \"position\": \"Security Researcher III\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>The Forcepoint Security Labs team is looking for a talented security researcher to join our growing front-line team. This is the think-tank research group behind Forcepoint. You will be working on detecting, intercepting, and performing detailed analysis of the latest attacks, threats and malware. You get to work with some of the most advanced tools ranging from state-of-the-art artificial intelligence platforms to live threat intelligence correlation. We are looking for an enthusiastic self-starter with a passion for discovering the threats across all stages of the attack life cycle.<\/p> <p><\/p> <p><b>What you will be doing:<\/b><\/p> <ul> <li>Work on security research projects in the areas of web, email, file and data security.<\/li> <li>Develop prototypes for research conducted and build tools as required.<\/li> <li>Manage customer submissions and questions in a timely and effective manner.<\/li> <li>Knowledge sharing internally and externally through blogs, security conferences, etc.<\/li> <li>Network packet capture (PCAP) analysis.<\/li> <li>Analyse, translate, and document code behaviour.<\/li> <li>Reverse engineer malicious code (virus and worms).<\/li> <li>Participate in research projects with other team members and associates. Knowledge-sharing (internally and externally) through blogs, visiting security conferences and customer events.<\/li> <\/ul> <p><\/p> <p><b>Experience you can bring:<\/b><\/p> <ul> <li>Previous experience in the security space with a good understanding of the security threat landscape.<\/li> <li>Strong knowledge of scripting\/programming languages with an understanding of what the scripts are doing.<\/li> <li>Familiarity with current exploit kits.<\/li> <li>Prior experience dealing with Advance Persistence threats.<\/li> <li>Knowledge of OS concepts, protocols like TCP\/IP, SSL, DNS, HTTP, SMTP, etc.<\/li> <li>Familiarity with debuggers, disassemblers, the windows registry, and other RCE tools essential.<\/li> <li>Experience in some of the following: web security, email security, vulnerabilities and exploitation, network and host security, sandbox security, 0-day threats, APT\\u2019s.&nbsp;&nbsp;<\/li> <li>Experience in understanding and creating network traffic signatures is a plus.<\/li> <li>Knowledge of software development practices and methodologies.<\/li> <li>In-depth understanding of the underlying technologies within operating systems.<\/li> <li>Complex Event Processing knowledge is a bonus.<\/li> <li>Excellent problem solving skills, flexibility and adaptability to changing priorities<\/li> <li>Ability to work under pressure and to meet tight deadlines<\/li> <li>Strong written and verbal communication skills<\/li> <li>Ability to work on individual projects as well as part of a team.<\/li> <\/ul> <p><\/p> <p>This is a great opportunity to work on cutting edge security research projects with a talented team of researchers and see the impact of your work on Forcepoint's&nbsp;products. This is a company that truly believes in rewarding its employees and offers a defined career path for researchers. If you have the relevant experience and are seeking a new challenge, we would certainly like to hear from you.<\/p> <p><b>We are mission driven.<\/b><\/p> <p>We are passionate about our mission because our solutions protect businesses, critical infrastructures, and governments around the world.<\/p> <p><\/p> <p><b>Find out more about Forcepoint\\u2019s Mission, Vision, and Values at <\/b><b>www.Forcepoint.com<\/b><b> and follow us on Twitter at @ForcepointSec. <\/b><\/p> <p><\/p> <p>Find us on social at #forcepoint #forcepointculture #lifeatforcepoint to find out what its really like to work here from the team themselves.<\/p> <p><\/p> <p><b><i>*Other duties<\/i><\/b><\/p> <p><i>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice. <\/i><\/p> <p><\/p> <p><i>Applicants must have the right to work in the location to which you have applied.<\/i><\/p> <p><\/p> <p><i>We are committed to hiring and retaining a diverse workforce, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.<\/i><\/p> <\/div> <div aria-label=\\\"Aggregated Job Source\\\" class=\\\"descriptionstyles__SourceHolder-sc-13ve12b-9 hkVglg\\\"> <!-- -->Source<!-- -->: <!-- -->Forcepoint <\/div>\"}"
}