{
    "id":"Kaggle::techmap::6147e3d780fa6a45870b84b5::seek_nz::0",
    "label_age":true,
    "analysis_age":" The phrase \"experience new horizons every day!\" could implicitly favour younger candidates, as it might suggest a preference for those who are at the beginning of their career journey and seeking new experiences.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"There is slight masculine bias introduced by such terms as \"Strong proven successful track record leading a retail team\", \"hands on\", \"Strong motivator\", \"Ability to think on your feet with a real sense of urgency\", \"Strong interpersonal skills\", \"Tenacity, commitment, dedication and professionalism\".",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" We have the opportunity for a Part-time Assistant Store Manager to join our Retail Team  Nelson Airport. The successful candidate will be tasked with assisting and supporting the Leadership Team to maximise sales opportunities and achieve a world-class standard of customer service excellence by providing our sales staff with coaching and development. Duties: Support the effective and efficient operations of the store. Work along-side your team. Provide constructive feedback to staff, encourage positivity and rectify performance issues. Maximise sales opportunities. Ensure the store is adequately staffed at all times. Ensure that complaints, refunds and credits are handled in a timely and satisfactory manner. Maintain a very high standard of store presentation, stock management and security. You will demonstrate: Strong proven successful track record leading a retail team. Good understanding of business dynamics. Nurturing and hands on approach to achieve results. Strong motivator and experience in coaching and developing sales people. Ability to think on your feet with a real sense of urgency. Strong interpersonal skills, including verbal and written communication. Tenacity, commitment, dedication and professionalism. As we're located in a dynamic airport environment we operate outside typical business hours. We are looking for someone who can work between 25-35 hours a week and is reasonably flexible with availability as shifts may in some cases may fall outside normal business hours. Lagardere Travel Retail Pacific has a comprehensive concept portfolio in Travel Essentials, Duty Free and Foodservice with travel exclusive proprietary brands and a tailored selection of partner brands. With Australian & New Zealand stores located in dynamic environments including airports and commuter hubs we are a fast paced organisation meeting the needs of people on the move. Want to share our journey? Apply today! Team Spirit  Agility Innovation  Excellence  Enthusiasm  Ethics. Experience new horizons every day!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6147e3d780fa6a45870b84b5::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Lagardere Travel Retail\", \"position\": \"Assistant Store Manager @ Nelson Airport\", \"notes\": \"\", \"original\": \"<p>We have the opportunity for a<strong>\\u00a0Part-time\\u00a0Assistant Store Manager\\u00a0<\/strong>to join our<strong>\\u00a0Retail Team @<\/strong><strong>\\u00a0Nelson Airport<\/strong>. The successful candidate\\u00a0will be tasked with assisting and supporting the Leadership Team to maximise sales opportunities and achieve a world-class standard of customer service excellence by providing our sales staff with coaching and development.<\/p> <p><strong>Duties:<\/strong><\/p> <ul> <li>Support the effective and efficient operations of the store<\/li> <li>Work along-side your team<\/li> <li>Provide constructive feedback to staff, encourage positivity\\u00a0and rectify performance issues<\/li> <li>Maximise sales opportunities<\/li> <li>Ensure\\u00a0the store is adequately staffed at all times<\/li> <li>Ensure that complaints, refunds and credits are handled in a timely and satisfactory manner<\/li> <li>Maintain a very high standard of store presentation, stock management and security<\/li> <\/ul> <p><strong>You will demonstrate:<\/strong><\/p> <ul> <li>Strong proven successful track record leading a retail team<\/li> <li>Good understanding of business dynamics<\/li> <li>Nurturing and hands on approach to achieve results<\/li> <li>Strong motivator and experience in coaching and developing sales people<\/li> <li>Ability to think on your feet with a real sense of urgency<\/li> <li>Strong interpersonal skills, including verbal and written communication<\/li> <li>Tenacity, commitment, dedication and professionalism<\/li> <\/ul> <p><strong>As we're located in a dynamic airport environment we operate outside typical business hours. We are looking for someone who can work between 25-35 hours a week and is reasonably flexible with availability as shifts may in some cases may fall outside normal business hours.\\u00a0<\/strong><\/p> <p><strong>Lagard\\u00e8re Travel Retail Pacific<\/strong>\\u00a0has a comprehensive concept portfolio in Travel Essentials, Duty Free and Foodservice with travel exclusive proprietary brands and a tailored selection of partner brands. With Australian &amp; New Zealand stores located in dynamic environments including airports and commuter hubs we are a fast paced organisation meeting the needs of people on the move.<\/p> <p>Want to share our journey? Apply today!<\/p> <p><strong>Team Spirit<\/strong>\\u00a0|\\u00a0<strong>Agility<\/strong>\\u00a0|<strong>Innovation\\u00a0<\/strong>|\\u00a0<strong>Excellence\\u00a0<\/strong>|\\u00a0<strong>Enthusiasm<\/strong>\\u00a0|\\u00a0<strong>Ethics<\/strong><\/p> <p><strong>Experience new horizons every day!<\/strong><\/p> <p>\\u00a0<\/p>\"}"
}