{
    "id":"Kaggle::techmap::61518a10d0623f554fae50bd::linkedin_th::0",
    "label_age":true,
    "analysis_age":"The phrase \"At least 10 years of experience in Indirect Procurement\" can introduce age bias by favouring older candidates who are more likely to have accumulated this level of experience, potentially disadvantaging younger but equally capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years of experience in Indirect Purchasing. Strong Team Management background. About Our Client. Our client is one of the leading automotive companies in the world. Job Description. Support Non-Production Purchasing in developing sourcing strategy and executing local\/regional\/global sourcing strategy. Lead plant sourcing team to review and evaluate potential new suppliers for commercial viability and new business opportunity. Lead purchasing team in developing early sourcing work plan, sources selections and P. O. issuance to production suppliers. Lead purchasing team in new program launch. Lead plant non-production purchasing team in developing source selections and P. O. release to non-production suppliers. Participate in the regional sourcing where it is viable. Support current model production by ensuring that engineering changes authorized by engineering are supported by the procurement of new parts and assemblies to the required quality, cost and timing objective. Lead MCR (Material Cost Reduction) activities including VA\/VE and productivity negotiation for year over year cost reduction. Beat the PG new program material cost target and plant material cost objectives. Ensure all Buyer's training developments are in alignment with the global purchasing and annual objectives. Supplier management and vendor relationship. Supplier Quality Management. Ensure and support Commodity Purchasing for supplier selection. Lead SPE team to follow process of new program development with supplier to align with global procedure. The Successful Applicant. Bachelor's degree or higher in Engineering or related subjects. At least 10 years of experience in Indirect Procurement within Automotive industry. At least 5 years of Team Management background. SAP background. Able to base in Bangkok or Rayong, Thailand. Results-oriented, goal alignment approach. Suppliers\/Vendors Management: Sourcing, Evaluation, & Comparison. Supplier base Development\/ Management. Able to use Microsoft office, Excel (advanced) program. Advanced English skills. Superb communication, interpersonal and leadership skills. Problem solver with a strong analytical mindset. High ethical code of conduct and compliance control. What's On Offer. Competitive Base Salary. Bonus. Leading Organisation. Contact: Paam Yanaranop. Quote job ref: 4212382.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61518a10d0623f554fae50bd::linkedin_th\", \"source\": \"linkedin_th\", \"country\": \"TH\", \"company\": \"Michael Page\", \"position\": \"Indirect Purchasing Manager - Global Automotive\", \"notes\": \"\", \"original\": \"<ul><li>10 years of experience in Indirect Purchasing<\/li><li>Strong Team Management background<br><br><\/li><\/ul><strong>About Our Client<br><br><\/strong>Our client is one of the leading automotive companies in the world.<br><br><strong>Job Description<br><br><\/strong><ul><li> Support Non-Production Purchasing in developing sourcing strategy and executing local\/regional\/global sourcing strategy.<\/li><li> Lead plant sourcing team to review and evaluate potential new suppliers for commercial viability and new business opportunity.<\/li><li> Lead purchasing team in developing early sourcing work plan, sources selections and P.O. issuance to production suppliers.<\/li><li> Lead purchasing team in new program launch.<\/li><li> Lead plant non-production purchasing team in developing source selections and P.O. release to non-production suppliers. Participate in the regional sourcing where it is viable.<\/li><li> Support current model production by ensuring that engineering changes authorized by engineering are supported by the procurement of new parts and assemblies to the required quality, cost and timing objective.<\/li><li> Lead MCR (Material Cost Reduction) activities including VA\/VE and productivity negotiation for year over year cost reduction. Beat the PG new program material cost target and plant material cost objectives.<\/li><li> Ensure all Buyer's training developments are in alignment with the global purchasing and annual objectives.<\/li><li> Supplier management and vendor relationship.<\/li><li> Supplier Quality Management.<\/li><li> Ensure and support Commodity Purchasing for supplier selection.<\/li><li> Lead SPE team to follow process of new program development with supplier to align with global procedure.<br><br><\/li><\/ul><strong>The Successful Applicant<br><br><\/strong><ul><li> Bachelor's degree or higher in Engineering or related subjects.<\/li><li> At least 10 years of experience in Indirect Procurement within Automotive industry.<\/li><li> At least 5 years of Team Management background.<\/li><li> SAP background.<\/li><li> Able to base in Bangkok or Rayong, Thailand.<\/li><li> Results-oriented, goal alignment approach<\/li><li> Suppliers\/Vendors Management: Sourcing, Evaluation, &amp; Comparison<\/li><li> Supplier base Development\/ Management<\/li><li> Able to use Microsoft office, Excel (advanced) program.<\/li><li> Advanced English skills.<\/li><li> Superb communication, interpersonal and leadership skills.<\/li><li> Problem solver with a strong analytical mindset.<\/li><li> High ethical code of conduct and compliance control.<br><br><\/li><\/ul><strong>What's On Offer<br><br><\/strong><ul><li> Competitive Base Salary<\/li><li> Bonus<\/li><li> Leading Organisation<br><br><\/li><\/ul><strong>Contact: Paam Yanaranop<br><br><\/strong><strong>Quote job ref: 4212382<\/strong>\"}"
}