{
    "id":"Kaggle::techmap::61446165ce85b02e20996c57::seek_au::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Who we are. From humble beginnings in 1999 as a small grower, Prestige Plants Australia today offers one of the most comprehensive and highest quality range of plants to enrich the landscapes of this great country. We are one of the largest suppliers of plants to the commercial landscaping industry and are passionate in our quest to remain at the forefront of plant quality and customer service. Prestige Plants is based in beautiful Kinglake, Victoria. What you’ll do. We are currently seeking a Key Account Manager to join our team in this exciting period of change and progression under new ownership. Reporting directly to the COO, the Key Account Manager will manage and grow key accounts, with a focus on large commercial projects. You will play an integral role in propelling sales and developing our internal processes, while ensuring our vision and long-term strategies are brought to life. You will be responsible for delivering outstanding products and service to your clients while quoting, converting, procuring, and driving the delivery of orders. Account Management. Manage a significant number of projects through our order pipeline. Effectively manage the estimation and tender process to maximise conversion. Procure stock from across our three nurseries and from numerous other external suppliers. Ensure the delivery of your orders meet 100% DIFOT. Maintain and grow relationships with key accounts. Have regular contact with our customers, including major landscapers, landscape architects, arborists, and other industry specialists. Develop and utilise your comprehensive knowledge of the horticulture wholesale industry and a wide range of plants. Gather and evaluate ideas for process and product improvements to increase execution and enhance customer experience. Develop and protect the Prestige Plants brand and market reputation. Sales. Provide accurate and strategic sales intelligence to inform production planning and drive operational excellence. Develop and implement sales plans for new sectors\/geographies. Develop clients in strategically identified segments by winning and servicing new key accounts. What you'll need. An eye for detail and a zeal for customer satisfaction. A hands-on, commercial self-starter mentality. A mature mindset and exceptional work ethic. An ability to build long term relationships. Prior experience in key account management and\/or business development. A passion for plants, with horticultural knowledge preferred (but not a requirement). Full Australian working rights. What’s on offer. A competitive salary. Relocation expenses covered for the perfect candidate. Take part in a dynamic business undergoing a period of internal change.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61446165ce85b02e20996c57::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Prestige Plants Australia Pty Ltd\", \"position\": \"Key Account Manager\", \"notes\": \"\", \"original\": \"<p><strong>Who we are<\/strong><\/p><p>From humble beginnings in 1999 as a small grower, Prestige Plants Australia today offers one of the most comprehensive and highest quality range of plants to enrich the landscapes of this great country.<\/p><p>We are one of the largest suppliers of plants to the commercial landscaping industry and are passionate in our quest to remain at the forefront of plant quality and customer service.<\/p><p>Prestige Plants is based in beautiful Kinglake, Victoria.<\/p><p>\\u00a0<\/p><p><strong>What you\\u2019ll do<\/strong><\/p><p>We are currently seeking a Key Account Manager to join our team in this exciting period of change and progression under new ownership.<\/p><p>Reporting directly to the COO, the Key Account Manager will manage and grow key accounts, with a focus on large commercial projects.<\/p><p>You will play an integral role in propelling sales and developing our internal processes, while ensuring our vision and long-term strategies are brought to life.<\/p><p>You will be responsible for delivering outstanding products and service to your clients while quoting, converting, procuring, and driving the delivery of orders.<\/p><p><em>Account Management<\/em><\/p><ul><li>Manage a significant number of projects through our order pipeline<\/li><li>Effectively manage the estimation and tender process to maximise conversion<\/li><li>Procure stock from across our three nurseries and from numerous other external suppliers<\/li><li>Ensure the delivery of your orders meet 100% DIFOT<\/li><li>Maintain and grow relationships with key accounts<\/li><li>Have regular contact with our customers, including major landscapers, landscape architects, arborists, and other industry specialists<\/li><li>Develop and utilise your comprehensive knowledge of the horticulture wholesale industry and a wide range of plants<\/li><li>Gather and evaluate ideas for process and product improvements to increase execution and enhance customer experience<\/li><li>Develop and protect the Prestige Plants brand and market reputation<\/li><\/ul><p><em>Sales<\/em><\/p><ul><li>Increase share of wallet with key accounts<\/li><li>Provide accurate and strategic sales intelligence to inform production planning and drive operational excellence<\/li><li>Develop and implement sales plans for new sectors\/geographies<\/li><li>Develop clients in strategically identified segments by winning and servicing new key accounts<\/li><\/ul><p>\\u00a0<\/p><p><strong>What you'll need<\/strong><\/p><ul><li>An eye for detail and a zeal for customer satisfaction<\/li><li>A hands-on, commercial self-starter mentality<\/li><li>A mature mindset and exceptional work ethic<\/li><li>An ability to build long term relationships<\/li><li>Prior experience in key account management and\/or business development<\/li><li>A passion for plants, with horticultural knowledge preferred (but not a requirement)<\/li><li>Full Australian working rights<\/li><\/ul><p>\\u00a0<\/p><p><strong>What\\u2019s on offer<\/strong><\/p><ul><li>A competitive salary<\/li><li>Relocation expenses covered for the perfect candidate<\/li><li>Take part in a dynamic business undergoing a period of internal change<\/li><li>Join a well-established and respected business, and a team that is supportive and driven<\/li><li>Work in a beautiful environment where you are not just sitting at a desk<\/li><li>Enjoy a staff discount on wholesale plant prices and monthly team sausage sizzles<\/li><\/ul><p>\\u00a0<\/p><p><strong>How to apply<\/strong><\/p><p>If you have the experience and passion we are looking for, we would love to hear from you!<\/p><p>Please click the \\u2018Apply\\u2019 button now and send through your resume and cover letter, detailing your previous experience and why you are the ideal candidate.<\/p>\"}"
}