{
    "id":"Kaggle::techmap::614bb966cf74c43a967a2048::aarp_us::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The phrase \"he \/she\" can be seen as excluding those who do not identify as male or female.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Business Operations Analyst Job ID: 2021-28834 Location: 1111 Stewart Ave, Bethpage, NY Altice USA (NYSE: ATUS) is one of the largest broadband communications and video services providers in the United States, delivering broadband, pay television, telephony services, proprietary content and advertising services to approximately 4. 9 million Residential and Business customers across 21 states through its Optimum and Suddenlink brands. From high-speed broadband and ultra-HD video, to digital advertising solutions, local news and voice offerings, we are making connections possible around the country -. to businesses, to consumers, to communities, to schools, to hospitals, and everyone in between Responsibilities The Business Operations Analyst's primary objective is the development and communication of business performance effectiveness\/efficiency insights and opportunities. The Business Analyst may work in any of the following functions Finance, Operations, Fiscal Operations, Billing and Audits, or Capital Investments. Responsibilities: Provide performance and insights analysis design and execution to isolate people, process, and technology business opportunities and the coordination for resolution recommendations guidance to executives with the business groups. * He\/she will interface with functional directors to ensure performance targets are met and improved across Customer Experience and Business Performance KPIs and project goals. These goals span business effectiveness, efficiency, interaction reduction, and customer experience themes. * He\/she will be responsible for performing end to end performance assessments and the design of measure and control phases across several AUSA product lines and business areas. These responsibilities will include basic six sigma methodology conducted in an internal consultant fashion to analyze, manage the collection of improvement recommendations, and monitor\/control the performance of specific processes through partnerships with cross-functional departments. Process gaps will be briefed to Network Engineering, Field, and Contact Center department management owners. Elicit requirements using interviews, document analysis, requirements workshops, surveys, site visits, business process descriptions, use cases, scenarios, business analysis, task and workflow analysis. Identify customer experience and business issues and coordinate with CX teams for escalation and\/or improvement design. Critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs. Proactively communicate and collaborate with external and internal customers to analyze information needs and functional requirements and deliver the following artifacts as needed. Successfully engage in multiple initiatives simultaneously. Work independently with users to define concepts and as part of team to accomplish team strategic goals..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614bb966cf74c43a967a2048::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Altice USA\", \"position\": \"Business Operations Analyst\", \"notes\": \"\", \"original\": \"Business Operations Analyst Job ID: 2021-28834 Location: 1111 Stewart Ave, Bethpage, NY Altice USA (NYSE: ATUS) is one of the largest broadband communications and video services providers in the United States, delivering broadband, pay television, telephony services, proprietary content and advertising services to approximately 4.9 million Residential and Business customers across 21 states through its Optimum and Suddenlink brands. From high-speed broadband and ultra-HD video, to digital advertising solutions, local news and voice offerings, we are making connections possible around the country -- to businesses, to consumers, to communities, to schools, to hospitals, and everyone in between Responsibilities The Business Operations Analyst's primary objective is the development and communication of business performance effectiveness\/efficiency insights and opportunities. The Business Analyst may work in any of the following functions Finance, Operations, Fiscal Operations, Billing and Audits, or Capital Investments. Responsibilities: * Provide performance and insights analysis design and execution to isolate people, process, and technology business opportunities and the coordination for resolution recommendations guidance to executives with the business groups. * He\/she will interface with functional directors to ensure performance targets are met and improved across Customer Experience and Business Performance KPIs and project goals. These goals span business effectiveness, efficiency, interaction reduction, and customer experience themes. * He\/she will be responsible for performing end to end performance assessments and the design of measure and control phases across several AUSA product lines and business areas. These responsibilities will include basic six sigma methodology conducted in an internal consultant fashion to analyze, manage the collection of improvement recommendations, and monitor\/control the performance of specific processes through partnerships with cross-functional departments. * Projects require a high degree of analytical skills to break down problems in a structured fashion to identify pain points and process gaps via end to end process and performance data analysis. Process gaps will be briefed to Network Engineering, Field, and Contact Center department management owners. * Elicit requirements using interviews, document analysis, requirements workshops, surveys, site visits, business process descriptions, use cases, scenarios, business analysis, task and workflow analysis. * Identify customer experience and business issues and coordinate with CX teams for escalation and\/or improvement designCritically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs. * Proactively communicate and collaborate with external and internal customers to analyze information needs and functional requirements and deliver the following artifacts as needed. * Successfully engage in multiple initiatives simultaneously. * Work independently with users to define concepts and as part of team to accomplish team strategic goals. * Drive and challenge business units on their assumptions of how they will successfully execute their plans. * Strong analytical and product management skills required, including a thorough understanding of how to interpret customer business needs and translate them into application and operational requirements. * Collaborate with developers and subject matter experts to establish the technical vision and analyze tradeoffs between usability and performance needs. * Be the liaison between the business units, technology teams and support teams. Qualifications * Bachelor's degree in related field * Six Sigma experience is a plus * SQL skills a plus * Strong professional verbal and written communication skills * Ability to multi-task, prioritize and organize effectively * Create data visualizations in software, such as Tableau and Business Objects, to illustrate drivers, trends and anomalies in key operational metrics for all levels of the organization. * 2 or more years' experience in quantitative analyses. Can't find the job you're looking for? Join our Talent Community and receive job alerts when we have new opportunities that match your interests. Share This Page\"}"
}