{
    "id":"Kaggle::techmap::613253a1d840e378ca49583f::cvlibrary_uk::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Who are we? Thames Water is the UK’s largest water and wastewater company. We make a daily difference to our 15 million customers by supplying 2. 6 billion litres of water through 32, 000 km’s of pipes, to keep taps flowing and toilets flushing. We are an essential service and have operated throughout the Covid19 pandemic. At Thames Water, every one of our actions, big and small, matters every day. Water is essential to daily life, and that means our business is always open. Who are we looking for? We are looking to recruit a M & E Dual skilled technician for this multi-faceted role. Covering all aspects of engineering from mechanical and maintenance to complex electrical diagnostic work, this is to ensure that all equipment at our waste treatment works is running safely and efficiently using proactive and reactive maintenance methods. What you will be doing. Working on will be various pumps and associated control gear, 3 phase motors, starters and controls, electronic control systems such as VSD’s, automatic valves and penstocks, flow, level and pressure measurement, programmable logic controllers, variable speed drives and controls, chemical handling, and dosing equipment. Investigating plant failures and carrying out repairs as quickly and efficiently as possible in order to avoid interruptions for our customers. This may involve investigating and diagnosing complex faults and carrying out repairs during incidents. Carrying out scheduled planned maintenance work on mechanical and electrical equipment in compliance with company standards and procedures in order to improve plant resilience. Participation in a 24\/7 out of hours’ standby Rota will be required after a suitable period of training and assessment. What qualifications we are looking for: ONC\/HNC in engineering, NVQ, or C&G level 3 in Electrical engineering. Qualification in mechanical NVQ 2\/3 would also be beneficial although not essential. A valid driving license is essential. Having previous experience in an electrical apprenticeship, with an 18th Edition qualification beneficial. Physically fit as you will work in confined spaces with successful completion of the appropriate training. Knowledge and awareness of health and safety issues are crucial. Be a time served apprentice with significant experience of electrical systems ideally working in a “true multi-skilled” capacity We’re looking for you to:.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613253a1d840e378ca49583f::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Pertemps Thames Water\", \"position\": \"Mechanical & Electrical Technician\", \"notes\": \"\", \"original\": \"Who are we?<br><br>Thames Water is the UK&rsquo;s largest water and wastewater company. We make a daily difference to our 15 million customers by supplying 2.6 billion litres of water through 32,000 km&rsquo;s of pipes, to keep taps flowing and toilets flushing. We are an essential service and have operated throughout the Covid19 pandemic.<br><br>At Thames Water, every one of our actions, big and small, matters every day. Water is essential to daily life, and that means our business is always open.<br><br>Who are we looking for?<br><br>We are looking to recruit a M &amp; E Dual skilled technician for this multi-faceted role.&nbsp; Covering all aspects of engineering from mechanical and maintenance to complex electrical diagnostic work, this is &nbsp;to ensure that all equipment at our waste treatment works is running safely and efficiently using proactive and reactive maintenance methods.<br><br>What you will be doing<br><br>Working on will be various pumps and associated control gear, 3 phase motors, starters and controls, electronic control systems such as VSD&rsquo;s, automatic valves and penstocks, flow, level and pressure measurement, programmable logic controllers, variable speed drives and controls, chemical handling, and dosing equipment<br>Investigating plant failures and carrying out repairs as quickly and efficiently as possible in order to avoid interruptions for our customers. This may involve investigating and diagnosing complex faults and carrying out repairs during incidents.<br>Carrying out scheduled planned maintenance work on mechanical and electrical equipment in compliance with company standards and procedures in order to improve plant resilience.<br>Providing technical advice to the wider team, referring to up-to-date technical knowledge, and provide training or support for technical trainees if required.<br><br>Participation in a 24\/7 out of hours&rsquo; standby Rota will be required after a suitable period of training and assessmentWhat qualifications we are looking for:<br><br>ONC\/HNC in engineering, NVQ, or C&amp;G level 3 in Electrical engineering<br>Qualification in mechanical NVQ 2\/3 would also be beneficial although not essential<br>A valid driving license is essential<br>Having previous experience in an electrical apprenticeship, with an 18th Edition qualification beneficial<br>Physically fit as you will work in confined spaces with successful completion of the appropriate training<br>Knowledge and awareness of health and safety issues are crucial<br>Be a time served apprentice with significant experience of electrical systems ideally working in a &ldquo;true multi-skilled&rdquo; capacity&nbsp;We&rsquo;re looking for you to: <br><br>Be a self-motivated individual that can immerse themselves into the team around them, you need to be very disciplined and have the desire to learn from those around you and have a can-do attitude. This role can be demanding at times but very rewarding too.<br>Take Ownership of responding quickly to faults, being curious to fully understand the problem and identify the best solution to resolve it first time<br>Have excellent communication and interpersonal skills, to clearly interact with the team<br>Deliver exceptional service through an enthusiastic and positive approach, taking accountability for your role while working accurately and flexibly within a busy team<br>Be a team player &ndash; We are one team, and our end goal are the same.<br>Proactive &ndash; take the lead on recommendations and improvements around site and communicate effectively.What&rsquo;s in it for you?<br><br>Our competitive salary package includes an excellent contributory pension, 24 days holiday per year increasing to 28 with length of service and a wider benefits scheme.&nbsp;&nbsp;<br>We&rsquo;re proud of the positive ways of working we have adopted during the pandemic. We want to create a more flexible and dynamic environment so all our colleagues can thrive. For our office-based roles we are moving to a hybrid approach where we will provide options around working from our offices, our operational sites and home dependent on role\/team\/individual. This will be discussed during the assessment process.<br><br>Thames Water is a unique,&nbsp;rewarding&nbsp;and diverse place to work. If you join our team, you&rsquo;ll enjoy fast-tracked career opportunities, flexible working&nbsp;arrangements&nbsp;and unparalleled benefits. We&rsquo;re also proud to be an equal opportunity employer, Stonewall Diversity Champion and Disability Confident Leader and we are a Times Top 50 Employer for Women.&nbsp;<br>&nbsp;\"}"
}