{
    "id":"Kaggle::techmap::614c19b718b5fa38c85b59a2::britishjobs_uk::5",
    "label_age":true,
    "analysis_age":"The description targets recent graduates and the culture described is young and social.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The emphasis on competitiveness, uncapped commission structures, and rewards for top performers can lean towards traditional masculine stereotypes. Social incentives like \"Friday Drinks\" and \"Karting\" may cater more to stereotypically masculine interests.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Role: Graduate Trainee Recruitment Consultant. Location: Bristol. Package: £20-24K Basic Salary. Uncapped Commission Structure (£35K OTE Year 1) (£45K OTE Year 1) (£60K OTE Year 3). Graduate Trainee Recruitment Consultant. The Company. Our client is based in central Bristol and launched in 2010. This specialist IT Recruitment Agency is fast growing and looking to add to their award-winning graduate team. Rather than a traditional purely KPI driven environment they believe in empowering their consultants and working with them to become experts in their niche markets and to build a business that suits their approach. The culture drives the business which revolves around rewarding people for their hard work, whether that be with their industry leading commission structure, progression opportunities or two paid holidays a year! Graduate Trainee Recruitment Consultant. The Role. Using Recruitment tools to source talent and fill vacancies. Conducting business development calls to attract new business from clients. Researching your market. Meeting clients and candidates face to face. Account Management. Interviewing candidates. Building relationships with existing and new clients. Networking. Negotiating. Calling prospective candidates and clients. Building a personal brand in your chosen market. Attending networking events. Closing new business Graduate Trainee Recruitment Consultant. The Benefits. Competitive basic salary which rises quickly as you progress up the ranks. Competitive uncapped commission structure up to 40% of what you bill. way above other agencies. A full Career development programme up to Director level which is very black and white, hit your target. get promoted. Simple! 12-week graduate training academy and lots of continuous support and e-learning. Quarterly Trip away, recently been to Marbella, Barcelona and Amsterdam. Linked. In Recruiter accounts, company mobiles and other tech to streamline your recruitment process and get you earning your bonus ASAP. Monthly Lunch Club for top performers in Bristol's top restaurants. Karting etc. Table tennis, pool table and Xbox in the office. Very Social graduate environment. Monthly Top Biller Rewards. Friday Drinks. Dining Discounts. Annual Luxury Christmas & Summer Party Graduate Trainee Recruitment Consultant. The Requirements. The Company are looking for dynamic recent graduates or experienced sales professionals who are outgoing by nature with exceptional drive, resilience and ambition. Excellent interpersonal skills. Good academics, ideally degree educated. Financially motivated. Competitive. A sense of achievement. sport, internships etc. Work ethic.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c19b718b5fa38c85b59a2::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Virtus Talent\", \"position\": \"Graduate Trainee Recruitment Consultant\", \"notes\": \"\", \"original\": \"Role: Graduate Trainee Recruitment Consultant<br><br> Location: Bristol<br><br> Package: &pound;20-24K Basic Salary + Uncapped Commission Structure (&pound;35K OTE Year 1) (&pound;45K OTE Year 1) (&pound;60K OTE Year 3)<br><br> Graduate Trainee Recruitment Consultant - The Company<br><br> Our client is based in central Bristol and launched in 2010. This specialist IT Recruitment Agency is fast growing and looking to add to their award-winning graduate team. Rather than a traditional purely KPI driven environment they believe in empowering their consultants and working with them to become experts in their niche markets and to build a business that suits their approach. The culture drives the business which revolves around rewarding people for their hard work, whether that be with their industry leading commission structure, progression opportunities or two paid holidays a year!<br><br> Graduate Trainee Recruitment Consultant - The Role<br><br>Using Recruitment tools to source talent and fill vacancies<br>Conducting business development calls to attract new business from clients<br>Researching your market<br>Meeting clients and candidates face to face<br>Account Management<br>Interviewing candidates<br>Building relationships with existing and new clients<br>Networking<br>Negotiating<br>Calling prospective candidates and clients<br>Building a personal brand in your chosen market<br>Attending networking events<br>Closing new business Graduate Trainee Recruitment Consultant - The Benefits<br><br>Competitive basic salary which rises quickly as you progress up the ranks<br>Competitive uncapped commission structure up to 40% of what you bill - way above other agencies<br>A full Career development programme up to Director level which is very black and white, hit your target - get promoted. Simple!<br>12-week graduate training academy and lots of continuous support and e-learning<br>Quarterly Trip away, recently been to Marbella, Barcelona and Amsterdam<br>LinkedIn Recruiter accounts, company mobiles and other tech to streamline your recruitment process and get you earning your bonus ASAP.<br>Monthly Lunch Club for top performers in Bristol&#39;s top restaurants<br>Regular team building exercises - GoKarting etc<br>Table tennis, pool table and Xbox in the office<br>Very Social graduate environment<br>Monthly Top Biller Rewards<br>Friday Drinks<br>Dining Discounts<br>Annual Luxury Christmas &amp; Summer Party Graduate Trainee Recruitment Consultant - The Requirements<br><br> The Company are looking for dynamic recent graduates or experienced sales professionals who are outgoing by nature with exceptional drive, resilience and ambition<br><br>Excellent interpersonal skills<br>Good academics, ideally degree educated<br>Financially motivated<br>Competitive<br>A sense of achievement - sport, internships etc<br>Work ethic<br>Self confidence Virtus Talent are here to guide you through the interview process, make sure you are fully prepared for interviews and coach you on how to get your transferable skills and traits across in the interview. We will aim to secure you several interviews with several companies that you like the look of with the view of securing you several job offers.<br><br> Technology Recruitment, Trainee Recruitment Consultant, Finance Recruitment, Trainee Recruitment Consultant, Oil Recruitment, Trainee Recruitment Consultant, Gas Recruitment, Trainee Recruitment Consultant, Energy Recruitment, Trainee Recruitment Consultant, IT Recruitment, Trainee Recruitment Consultant, Management Consultant Recruitment, Trainee Recruitment Consultant, Engineering Recruitment, Trainee Recruitment Consultant, SAP Recruitment, Trainee Recruitment Consultant, HR Recruitment, Trainee Recruitment Consultant, HR Trainee Recruitment Consultant, Legal Recruitment, Trainee Recruitment Consultant, Paralegal Recruitment, Trainee Recruitment Consultant, Investment Banking Recruitment, Trainee Recruitment Consultant, Hedge Fund Recruitment, Trainee Recruitment Consultant, Digital Recruitment, Trainee Recruitment Consultant, Media Recruitment, Trainee Recruitment Consultant, Marketing Recruitment, Trainee Recruitment Consultant, Public Sector Recruitment, Trainee Recruitment Consultant, International Recruitment, Trainee Recruitment Consultant, Pharmaceutical Recruitment, Trainee Recruitment Consultant, Bioscience Recruitment, Procurement Recruitment, Trainee Recruitment Consultant, Supply Chain Recruitment, Trainee Recruitment Consultant, Management Recruitment, Trainee Recruitment Consultant, Board Recruitment and Executive Recruitment, Trainee Recruitment Consultant, Banking Recruitment, Trainee Recruitment Consultant, Change Management Recruitment, Trainee Recruitment Consultant, Insurance Recruitment Trainee Recruitment Consultant,, Multi-lingual Recruitment, Trainee Recruitment Consultant.<br><br>\"}"
}