{
    "id":"Kaggle::techmap::6148734d462b720cfd97b89d::careerbuilder_vn::0",
    "label_age":true,
    "analysis_age":"\" Working in a youthful and professional environment. 90% of members are 9x.\" 9x is a term is used to denote people born in the 1990's. This will discourage people not in their 20s or 30s from applying.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Descriptions. Provide exceptional support to customers through company's channels including Helpdesk system, Live chat and Skype (all customers of BSS are foreigners). Solve problems of errors, refund, warranty and guarantee customer satisfaction. Coordinate with relevant departments to solve technical requirements of customers. Consult and offer solutions matching customers needs. Documenting all customer interactions in our database. Proactively identifying opportunities for the company to provide additional value to customers during interactions, and escalating relevant opportunities to development team. Consistently improving own knowledge and understanding of the product and platforms. Passing on customer feedback to team members and escalating issues to relevant departments. Benefits. Salary: $400 - $600(Review every 6 months). Office with a great view from the 18th floor and creative workplace design. At BSS, tea & coffee is free. Besides, we have a bookshelf with many interesting books for our members to borrow. Working hours are 5 days\/week (From Monday to Friday). Working in a youthful and professional environment. 90% of members are 9x, we always support each other. The State statutory holidays, travel, team building, health care, volunteer organized by the Company. Participating in the company's training sessions on product knowledge, English skills, and other working skills. Joining in the company's football, running, art clubs. Other benefits according to the provisions of the Company and the Labor Code.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148734d462b720cfd97b89d::careerbuilder_vn\", \"source\": \"careerbuilder_vn\", \"country\": \"VN\", \"company\": \"BSS Group\", \"position\": \"Customer Support Executive (Up to 14M Net)\", \"notes\": \"\", \"original\": \"<p><strong>1. Job Descriptions<\/strong><\/p><ul><li>Provide exceptional support to customers through company's channels including Helpdesk system, Live chat and Skype (all customers of BSS are foreigners).<\/li><li>Solve problems of errors, refund, warranty and guarantee customer satisfaction.<\/li><li>Coordinate with relevant departments to solve technical requirements of customers.<\/li><li>Consult and offer solutions matching customers\\u2019 needs.<\/li><li>Documenting all customer interactions in our database.<\/li><li>Proactively identifying opportunities for the company to provide additional value to customers during interactions, and escalating relevant opportunities to development team.<\/li><li>Consistently improving own knowledge and understanding of the product and platforms.<\/li><li>Passing on customer feedback to team members and escalating issues to relevant departments.<\/li><\/ul><p><strong>2. Benefits<\/strong><\/p><ul><li>Salary: $400 - $600(Review every 6 months).<\/li><li>Office with a great view from the 18th floor and creative workplace design.<\/li><li>At BSS, tea &amp; coffee is free. Besides, we have a bookshelf with many interesting books for our members to borrow.<\/li><li>Working hours are 5 days\/week (From Monday to Friday).<\/li><li>Working in a youthful and professional environment. 90% of members are 9x, we always support each other.<\/li><li>The State statutory holidays, travel, team building, health care, volunteer\\u2026 organized by the Company.<\/li><li>Participating in the company's training sessions on product knowledge, English skills, and other working skills ...<\/li><li>Joining in the company's football, running, art clubs ...<\/li><li>Other benefits according to the provisions of the Company and the Labor Code.<\/li><\/ul>\"}"
}