{
    "id":"Kaggle::techmap::61414ef48be8df1fa24c6ea0::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The phrase \"unless doing so would result in an undue hardship\" overlooks the importance of \"reasonable\" in reasonable accommodations and inadvertently suggests that accommodating individuals with disabilities is burdensome.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Physical and Work Conditions. Repetitive hand\/arm movements, grasping, bending, reaching, ability to lift, push or pull up to 50 pounds by oneself, exposure to extreme temperatures. Ability to use tools equipment: knives, ladders, stepstools, box cutters, pallet jacks, and other equipment. Required to spend long periods of time on feet and stand or walk without a break (for up to 4 hours or as required by law). Required to wear approved hat, hair net, and\/or beard guard, and personal protective equipment. REASONABLE ACCOMMODATIONS: Consistent with applicable laws, TFM will make reasonable accommodations for qualified applicants and team members, unless doing so would result in an undue hardship to TFM. This guiding principle applies to all aspects of employment, including hiring and job assignment, compensation, discipline, termination, and access to benefits and training. We are proud to be an Equal Opportunity Employer: Qualified applicants will receive consideration for employment without regard race, color, creed, religion, age, sex, gender, sexual orientation, gender identity, pregnancy and related medical conditions, national origin, genetic information, uniformed service, veteran status, disability, or any other basis prohibited by federal or state law. The statements in this job description are provided to describe the general nature and level of work expected in this role. While these statements include the essential functions of the job, they are not intended to be a complete list of all responsibilities, duties and skills required. As we work as a team, there may be times team members are needed to perform duties outside of their normal responsibilities based on business needs. INDHN.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61414ef48be8df1fa24c6ea0::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"The Fresh Market\", \"position\": \"Meat Cutter\", \"notes\": \"\", \"original\": \"The Fresh Market & You:\\r\\r\\r<\/b>\\r\\r\\r\\r\\r\\r\\r<p>Our mission is to make everyday eating extraordinary for our guests. We create a warm, welcoming, memorable experience with exceptional, personal service. We\\u2019re looking for a new team member who strives for excellence and brings positive energy, commitment and a \\u201ccan-do\\u201d attitude to work every day. We value teamwork and celebrate our successes as a team and will value your contribution!<\/p><p><strong>\\u00a0<\/strong><\/p><p><strong>Added Benefits for choosing The Fresh Market Team: <\/strong><\/p><ul><li>Team Member discount up to 40%<\/li><li>Health, Dental & Vision insurance available for individual, spouse, partner, and family.<\/li><li>401K contribution and match for part-time and full-time team members<\/li><\/ul><ul><li>Personal time off and additional time off purchase plans available<\/li><li><em>AND much more!<\/em><\/li><\/ul><p><\/p><p><\/p>\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r<b>\\r\\r\\r\\rAbout the Position:\\r\\r\\r<\/b>\\r\\r\\r\\r\\r\\r\\r<p>Do you have experience in meat cutting? Are you committed to delivering a first-class experience for guests? If so, this may be the perfect job for you. As our Meat Cutter, you will manage, cut and trim meat and seafood according to The Fresh Market standards and as requested by our Guests. You will also assist with department inventory, pricing integrity, merchandising, and other operational processes to provide the best product and excellent service at the right time for our guests and to drive sales.<\/p>\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r<b>\\r\\r\\r\\rWhat You'll Do:\\r\\r\\r<\/b>\\r\\r\\r\\r\\r\\r\\r<ul><li>Maintain knowledge of products\/weekly ad items throughout the store and work across departments to assist guests in finding products and complete meal solutions\\u00a0<\/li><li>Handle, slice, expertly cut and trim a variety of the department\\u2019s prime and premium meat and seafood products, and items for our convenient meal solutions throughout the day, while also managing quality product levels as indicated within TFM standards\\u00a0<\/li><li>Monitor temperature of cases, spill overs, and storage areas \\u00a0<\/li><li>Enforce and follow department practices regarding receiving, stocking, and the unloading deliveries of product to ensure freshness and quality; including but not limited to case, coolers, freezers, and sales floor \\u00a0<\/li><li>Ensure department adherence to all safety requirements and protocols, including food safety, per TFM policies, and per law<\/li><\/ul>\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r<b>\\r\\r\\r\\rAvailability:\\r\\r\\r<\/b>\\r\\r\\r\\r\\r\\r\\r<p>To meet the needs of our stores, guests and teams, this position requires the willingness to work a flexible schedule, including weekends, days, evenings and occasional overnight and holiday work. <\/p>\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r<b><\/b>\\r\\r\\r\\r\\r\\r\\r<p><strong>At a minimum, what <\/strong><strong>you\\u2019ll<\/strong><strong> need:<\/strong>\\u00a0<\/p><ul><li>2 years or more of experience in cutting meat\\u00a0<\/li><li>Must be at least 18 years of age\\u00a0<\/li><\/ul><p><strong>Preferred Qualifications<\/strong>\\u00a0<\/p><ul><li>Meat Cutting, Journey Cutting, Culinary and\/or Grocery experience\\u00a0<\/li><li>Production Planning Software experience <br \/><\/li><\/ul><p><strong>Physical and Work Conditions<\/strong>\\u00a0<\/p><ul><li>Repetitive hand\/arm movements, grasping, bending, reaching, ability to lift, push or pull up to 50 pounds by oneself, exposure to extreme temperatures\\u00a0\\u00a0<\/li><li>Ability to use tools equipment: knives, ladders, stepstools, box cutters, pallet jacks, and other equipment\\u00a0\\u00a0<\/li><li>Required to spend long periods of time on feet and stand or walk without a break (for up to 4 hours or as required by law)\\u00a0<\/li><li>Required to wear approved hat, hair net, and\/or beard guard, and personal protective equipment<\/li><\/ul><p><em>REASONABLE ACCOMMODATIONS: Consistent with applicable laws, TFM will make reasonable <\/em><em>accommodations for<\/em><em> qualified applicants and team members, unless doing so would result in an undue hardship to TFM. This guiding principle applies to all aspects of employment, including hiring and job assignment, compensation, discipline, termination, and access to benefits and training.<\/em>\\u00a0<\/p><p><\/p>\\r\\r\\r\\r\\r\\r\\r\\r\\r\\r<b>\\r\\r\\r\\rWe are proud to be an Equal Opportunity Employer:\\r\\r\\r<\/b>\\r\\r\\r\\r\\r\\r\\r<p>Qualified applicants will receive consideration for employment without regard race, color, creed, religion, age, sex, gender, sexual orientation, gender identity, pregnancy and related medical conditions, national origin, genetic information, uniformed service, veteran status, disability, or any other basis prohibited by federal or state law.\\u00a0<\/p><p><\/p><p><em>The statements in this job description are provided to describe the general nature and level of work expected in this role. While these statements include the essential functions of the job, they are not intended to be a complete list of all responsibilities, duties and skills required. As we work as a team, there may be times team members are needed to perform duties outside of their normal responsibilities based on business needs.\\u00a0<\/em>\\u00a0<\/p><p>#INDHN<\/p>\"}"
}