{
    "id":"Kaggle::techmap::614449e1a5224e6280f6f1fe::careerbuilder_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Salary: $17.00 an hour. R15942. Lawn Specialist. 5401 Perry Dr, Waterford Twp, Michigan 48329. Job Description. Do you like being outdoors? Do you like a job where every day is different? The Specialist role with Tru. Green is an excellent opportunity for an energetic, self-motivated, and goal oriented individual. Position Overview: Our Lawn Specialists provide service to residential or commercial customers by making timely lawn, landscape, and\/or irrigation applications, diagnosing and correcting customer problems through service calls and other communications, and selling\/up-selling services to new and existing customers, resulting in growth of our customer base. Specialists also provide customers with product and service information and resolve technical issues. Completing production reports, new sales forms, customer invoice forms, daily vehicle inspection report, and cancel\/skip notices are some of the daily responsibilities required of our Lawn Specialists. Some positions may require a valid driver's license and\/or appropriate state\/local licensing. Included Roles:. Lawn Specialists (Residential or Commercial). Tree & Shrub Specialist. Irrigation Specialist. Aerator. Laborer. Warehouse Technician. TruGreen is America's 1 lawn care company, serving more than 1.7 million residential and commercial customers across the United States and Canada with lawn, tree, and shrub care. Tru. Green focuses on developing our people by building dynamic, enthusiastic teams while helping associates reach their personal and professional goals. Tru. Green is committed to Diversity and Inclusion. We encourage diverse candidates to apply to this position. We are an Equal Opportunity\/Affirmative Action Employer - Minorities\/Females\/Protected Veterans\/Individuals with Disabilities. To learn more, Click Here or to request an application accommodation, Click Here. California Residents: for information on personal data we collect as part of the application process, Click Here. Tru. Green performs pre-employment testing. Disclaimer. The above statements are intended to describe the general nature and level of work being performed by associates assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed. By providing my cell phone number, I agree that Tru. Green may call or text\/SMS message me on that number using an automated telephone dialing system or prerecorded or artificial voice to discuss possible employment opportunities, my account, including current and possible future services, customer service and billing.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614449e1a5224e6280f6f1fe::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"TruGreen\", \"position\": \"Lawn Specialist\", \"notes\": \"\", \"original\": \"<b>Salary:<\/b><br \/><br \/>$17.00 an hour<br \/><br \/>R15942<br \/>Lawn Specialist<br \/><br \/>5401 Perry Dr, Waterford Twp, Michigan 48329<br \/><br \/><b> Job Description <\/b> <br \/>Do you like being outdoors? Do you like a job where every day is different? The Specialist role with TruGreen is an excellent opportunity for an energetic, self-motivated, and goal oriented individual.<br \/><br \/><b> Position Overview: <\/b><br \/><br \/>Our Lawn Specialists provide service to residential or commercial customers by making timely lawn, landscape, and\/or irrigation applications, diagnosing and correcting customer problems through service calls and other communications, and selling\/up-selling services to new and existing customers, resulting in growth of our customer base. Specialists also provide customers with product and service information and resolve technical issues. Completing production reports, new sales forms, customer invoice forms, daily vehicle inspection report, and cancel\/skip notices are some of the daily responsibilities required of our Lawn Specialists. Some positions may require a valid driver's license and\/or appropriate state\/local licensing.<br \/><br \/><b>Included Roles:<\/b><br \/>\\u2022 Lawn Specialists (Residential or Commercial)<br \/>\\u2022 Tree & Shrub Specialist<br \/>\\u2022 Irrigation Specialist<br \/>\\u2022 Aerator<br \/>\\u2022 Laborer<br \/>\\u2022 Warehouse Technician<br \/><br \/>TruGreen\\u00ae is America's #1 lawn care company, serving more than 1.7 million residential and commercial customers across the United States and Canada with lawn, tree, and shrub care.<br \/><br \/>TruGreen focuses on developing our people by building dynamic, enthusiastic teams while helping associates reach their personal and professional goals.<br \/><br \/>TruGreen is committed to Diversity and Inclusion. We encourage diverse candidates to apply to this position.<br \/><br \/>We are an Equal Opportunity\/Affirmative Action Employer - Minorities\/Females\/Protected Veterans\/Individuals with Disabilities. To learn more, Click Here or to request an application accommodation, Click Here .<br \/><br \/>California Residents: for information on personal data we collect as part of the application process, Click Here .<br \/><br \/>TruGreen performs pre-employment testing.<br \/><br \/>Disclaimer <br \/> The above statements are intended to describe the general nature and level of work being performed by associates assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.<br \/><br \/>By providing my cell phone number, I agree that TruGreen may call or text\/SMS message me on that number using an automated telephone dialing system or prerecorded or artificial voice to discuss possible employment opportunities, my account, including current and possible future services, customer service and billing. I understand that providing my cell phone number is not required to inquire about or apply for employment or purchase services, and that I may revoke this permission at any time.&nbsp;\"}"
}