{
    "id":"Kaggle::techmap::6155937834ad3648dae2c846::reed_uk::8",
    "label_age":true,
    "analysis_age":"Repeated references to \"graduates\" suggests a bias towards younger recently graduated candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Graduate TA. Aspiring secondary school teacher. I am eager to hear from Graduates who are aspiring secondary school teachers and are looking to spend the academic year developing experience in a secondary school setting ahead of commencing teacher training in the near future. This is a fantastic opportunity for secondary school teachers of the future who are looking to kick start their teaching career. Are you passionate about working with young people and are eager to develop your experience in a secondary school setting? Is your long term goal to become a qualified secondary school teacher? Do you have recent experience with young people? *. Graduate teaching Assistants (Secondary school role). *. Idea pre teacher training experience. *. Outstanding East London school. *. Full time. *. Recent child related experience required. I am urgently seeking Graduates who have an interest in teaching to work as Graduate teaching assistants within an East London secondary school. The teaching assistant role is a fantastic way to develop your existing experience with young people in anticipation for commencing teacher training. Over the past 7 years this secondary school have supported graduates who are embarking on their career in teaching. The Graduate TAs work closely with students with Special Educational Needs within mainstream classes and within the schools learning support department. The school are looking to appoint Graduates who have some form of recent experience with young people. paid or voluntary and are looking to begin teacher training in the next few years.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155937834ad3648dae2c846::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Academics\", \"position\": \"Graduate TA - Aspiring secondary school teacher\", \"notes\": \"\", \"original\": \"<p>Graduate TA - Aspiring secondary school teacher<\/p> <p>I am eager to hear from Graduates who are aspiring secondary school teachers and are looking to spend the academic year developing experience in a secondary school setting ahead of commencing teacher training in the near future. This is a fantastic opportunity for secondary school teachers of the future who are looking to kick start their teaching career.<\/p> <p>Are you passionate about working with young people and are eager to develop your experience in a secondary school setting?<\/p> <p>Is your long term goal to become a qualified secondary school teacher?<\/p> <p>Do you have recent experience with young people?<\/p> <p>** Graduate teaching Assistants (Secondary school role)<\/p> <p>** Idea pre teacher training experience<\/p> <p>** Outstanding East London school<\/p> <p>** Full time<\/p> <p>** Recent child related experience required<\/p> <p>I am urgently seeking Graduates who have an interest in teaching to work as Graduate teaching assistants within an East London secondary school.<\/p> <p>The teaching assistant role is a fantastic way to develop your existing experience with young people in anticipation for commencing teacher training.<\/p> <p>Over the past 7 years this secondary school have supported graduates who are embarking on their career in teaching.<\/p> <p>The Graduate TAs work closely with students with Special Educational Needs within mainstream classes and within the schools learning support department.<\/p> <p>The school are looking to appoint Graduates who have some form of recent experience with young people - paid or voluntary and are looking to begin teacher training in the next few years.<\/p> <p>To apply to this Graduate teaching assistant post please send your CV being sure to list all child related experience.<\/p>\"}"
}