{
    "id":"Kaggle::techmap::6146182ea9593a461f59a5cb::linkedin_es::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrases \"rolling up your sleeves\" and \"getting involved whenever necessary,\" as well as \"lead on numerous process improvement projects,\" use language that aligns with traditionally masculine-coded traits such as hands-on leadership and taking charge of technical projects.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description. At Amazon, we pioneer. At Amazon were constantly looking for leaders who can invent, think big, have a bias for action, and who want to deliver for customers, those principles look very familiar to the men and women who served their country in the armed forces. And also their spouses. Due to Amazons constant and sustained growth, we need strong, dynamic leaders and technical experts who can harness the skills developed within the military to make a significant impact on the business. Then we have the opportunity for you! Were seeking an experienced, Operations Manager to join our Customer Fulfillment team. Youll operate out of one of our dynamic Fulfillment Centers: these sit at the heart of Amazons world-class, rapidly growing business. Theyre where we manage our fast-moving inventory. Theyre also where we developed our smart, industry-leading workflows. As an Operations Manager, youll deliver inspiring, supportive leadership for the teams you manage. But at the same time, you dont shy away from rolling up your sleeves and getting involved whenever necessary. Youll be directly responsible for managing a team of Area Managers and their direct reports: meanwhile, you will report to the Senior Operations Manager of your Fulfillment Center. The quality of your leadership is key to success in this role: youll motivate and inspire your teams to do their best work, while planning schedules and activities that balance their needs with that of the business. Another key aspect of your role will be to lead on numerous process improvement projects, with the aim of streamlining all activities, both for yourself and the team members you manage. The ideas, innovation and leaps out of the status quo that you come up with could very well be rolled out across the Amazon network: this immense opportunity is yours for the taking. Job Description. Your role will be pivotal in the overall management, control, organisation and direction of either Outbound or Inbound operational areas of your FC. Your responsibilities will include, amongst others: Maintaining Health and Safety standards within your remit area, while promoting an inspiring Health and Safety culture on-site,. Become a subject matter expert on specific, larger-scale processes and activities within FCs, such as 5S audits,. In your inventory control and systems environment, youll manage timely data collection, updating operations metrics on an hourly basis,.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6146182ea9593a461f59a5cb::linkedin_es\", \"source\": \"linkedin_es\", \"country\": \"ES\", \"company\": \"Amazon\", \"position\": \"Operations Manager - Military Veterans\", \"notes\": \"\", \"original\": \"<strong><u>Description<br><br><\/u><\/strong>At Amazon, we pioneer.<br><br>At Amazon we\\u2019re constantly looking for leaders who can invent, think big, have a bias for action, and who want to deliver for customers, those principles look very familiar to the men and women who served their country in the armed forces. And also their spouses.<br><br>Due to Amazon\\u2019s constant and sustained growth, we need strong, dynamic leaders and technical experts who can harness the skills developed within the military to make a significant impact on the business.<br><br>Then we have the opportunity for you!<br>We\\u2019re seeking an experienced, Operations Manager to join our Customer Fulfillment team. You\\u2019ll operate out of one of our dynamic Fulfillment Centers: these sit at the heart of Amazon\\u2019s world-class, rapidly growing business. They\\u2019re where we manage our fast-moving inventory; they\\u2019re also where we developed our smart, industry-leading workflows.<br>As an Operations Manager, you\\u2019ll deliver inspiring, supportive leadership for the teams you manage. But at the same time, you don\\u2019t shy away from rolling up your sleeves and getting involved whenever necessary.<br>You\\u2019ll be directly responsible for managing a team of Area Managers and their direct reports: meanwhile, you will report to the Senior Operations Manager of your Fulfillment Center. The quality of your leadership is key to success in this role: you\\u2019ll motivate and inspire your teams to do their best work, while planning schedules and activities that balance their needs with that of the business.<br>Another key aspect of your role will be to lead on numerous process improvement projects, with the aim of streamlining all activities, both for yourself and the team members you manage. The ideas, innovation and leaps out of the status quo that you come up with could very well be rolled out across the Amazon network: this immense opportunity is yours for the taking.<br><br><strong><u>Job Description<br><br><\/u><\/strong>Your role will be pivotal in the overall management, control, organisation and direction of either Outbound or Inbound operational areas of your FC. Your responsibilities will include, amongst others:<br><ul><li> Maintaining Health and Safety standards within your remit area, while promoting an inspiring Health and Safety culture on-site,<\/li><li> Become a subject matter expert on specific, larger-scale processes and activities within FCs, such as 5S audits,<\/li><li> In your inventory control and systems environment, you\\u2019ll manage timely data collection, updating operations metrics on an hourly basis,<\/li><li> Therefore, you\\u2019ll aim to achieve productivity targets, reduce cost per unit, eliminate errors and ensure an excellent customer experience,<\/li><li> Work closely with other support teams (HR, Finance, Facilities, Safety and Security, IT) on staffing plans, schedules and performance levels,<\/li><li> Implement process change and contribute in cross-functional Six Sigma initiatives within your site and the broader Amazon EU Operations network,<br><br><\/li><\/ul><strong><u>Basic Qualifications<br><br><\/u><\/strong><strong>BASIC QUALIFICATIONS<br><\/strong><ul><li> Possess a degree from an accredited institution,<\/li><li> Previous experience in leading large, diverse teams,<\/li><li> You possess excellent communication skills, both verbal and written,<\/li><li> You\\u2019re competent in two or more production or supply chain areas, with an impressive track record in a similar, fast-paced logistics, distribution or manufacturing environment,<\/li><li> You possess the ability to manage details, establish and carry out root cause analysis, and then extract and analyse the data you generate,<\/li><li> You thrive on change, and are willing to relocate if necessary,<\/li><li> You are ready to work in 4 day shifts, either from Sunday until Wednesday or Wednesday until Saturday<br><br><\/li><\/ul><strong><u>Preferred Qualifications<br><br><\/u><\/strong><strong>PREFERRED QUALIFICATIONS<br><\/strong><ul><li> Master\\u2019s degree,<\/li><li> You possess a grasp of Kaizen and Lean methodologies and related techniques.<br><\/li><\/ul>What we offer<br>We\\u2019ll expect you to go the extra mile, but we\\u2019ll also make sure you\\u2019re well rewarded. As well as a competitive salary, stock units and site performance-related pay potential, we offer a whole host of other benefits, including an employee discount.<br><br>We\\u2019re looking forward to receiving your application, preferably in English.<br><br>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.<br>Amazon takes your personal data protection seriously and respects EU and local data protection laws. Unless you express otherwise, by submitting your CV you authorize the hiring Amazon company to store your personal data in the electronic database maintained by Amazon Corporate LLC. in the USA or one of its affiliates for the purpose of assessing your suitability for this and future job vacancies and to pursue your recruiting process.<br>If at any time you want your personal data to be deleted, you simply need to notify the hiring Amazon company. Amazon will not share your personal data with any third party without your prior consent. As part of your interview process with Amazon you may be asked to authorize the hiring Amazon company to separately verify your application data and personal background through a third party service provider<br><br><br><strong>Company<\/strong> - AMZN Spain Fulfillment, S.L.U.<br>Job ID: A1145779\"}"
}