{
    "id":"Kaggle::techmap::6145c4298502b911049889e7::linkedin_kr::0",
    "label_age":true,
    "analysis_age":"Stating \"Max 15 years\" could be interpreted as a deliberate intention to discourage more experienced and older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Some of the language e.g. \"Self-starter with ability to prioritize projects and drive change.\" is masculine leaning and my unintentionally discourage.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 3M has a long-standing reputation as a company committed to innovation. We provide the freedom to explore and encourage curiosity and creativity. We gain new insight from diverse thinking, and take risks on new ideas. Here, you can apply your talent in bold ways that matter. Job Description. Role & Responsibility. You will become member of APAC Treasury team in all expects of Treasury. Daily cash positioning and rolling cash flow forecasting. In-house banking. FX and settlement. Bank account management, etc. Partnering with other treasury\/finance areas to support closing cycles. Support SAP treasury module implement. Ensure relevant compliance on local statutory (such as FX control) requirement and 3M global financial standards. Leveraging knowledge of treasury technology & systems (such as SAP, SWIFT, Alteryx, Power BI, etc) to automate and improve current processes. Participating in global change management projects across cash and banking,. Partnering with business functions to provide proactive finance guidance to influence business thinking related to cash management, financial instruments, and banking strategies. ,  , FX      . SAP    . (: FX ). (ex. SAP, SWIFT, Alterx, PowerBI ). Qualification. To set you up for success in this role from day one, 3M requires (at a minimum) the following qualifications: Bachelors degree or higher (completed and verified prior to start) from an accredited institution. 5 years finance experience and at least 2 years treasury experience in international enterprise (Max. 15 years). Additional qualifications that could help you succeed even further in this role include: Excellent written and verbal communication skills. Fluent English both in written and verbal. Korean language skill. Familiar with general FX regulations and able to plan the response according to policy updates. Strong numeracy skills, experienced in using Microsoft Excel. SAP knowledge & experience would be an advantage. Capacity on technical tools (Power BI, Alteryx). Can problem solve and work through issues independently. Self-starter with ability to prioritize projects and drive change. Cross-cultural project management experience, good team player and able to motivate self and others. 5  (15   ). FX       . Microsoft Excel   . SAP, Power BI, Alteryx     . Condition. Type: RegularI() ( 3). Location: Seoul, Korea or Signapore. Relocation is NOT required. (The employee will work where they are staying whether KR or SG). Application Guidelines (   ). Click Apply  button. Fill in basic information such as employment? and education. Upload your both of Korean\/English Resume (merge your files into one file )(     ). Others. (veteran)      . (  Veteran   YES ). (Disability)     . ( Disablity   YES ). (, \/  ,      . ) ,         . \/    .",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145c4298502b911049889e7::linkedin_kr\", \"source\": \"linkedin_kr\", \"country\": \"KR\", \"company\": \"3M\", \"position\": \"Senior Treasury Analyst (Finance Div.)(\\uc7ac\\ubb34\\uad00\\ub9ac \\ub2f4\\ub2f9\\uc790)\", \"notes\": \"\", \"original\": \"3M has a long-standing reputation as a company committed to innovation. We provide the freedom to explore and encourage curiosity and creativity. We gain new insight from diverse thinking, and take risks on new ideas. Here, you can apply your talent in bold ways that matter.<br><br><strong>Job Description<br><br><\/strong><strong>Role &amp; Responsibility<br><br><\/strong>You will become member of APAC Treasury team in all expects of Treasury.<br><br><ul><li>Daily cash positioning and rolling cash flow forecasting; In-house banking; FX and settlement; bank account management, etc.<\/li><li>Partnering with other treasury\/finance areas to support closing cycles; Support SAP treasury module implement.<\/li><li>Ensure relevant compliance on local statutory (such as FX control) requirement and 3M global financial standards.<\/li><li>Leveraging knowledge of treasury technology &amp; systems (such as SAP, SWIFT, Alteryx, Power BI, etc) to automate and improve current processes. Participating in global change management projects across cash and banking,<\/li><li>Partnering with business functions to provide proactive finance guidance to influence business thinking related to cash management, financial instruments, and banking strategies;<\/li><li>\\uc720\\ub3d9 \\ud604\\uae08 \\ud750\\ub984 \\uc608\\uce21, \\uc0ac\\ub0b4 \\ubc45\\ud0b9, FX \\ubc0f \\uacb0\\uc81c \\ub4f1 \\uc804\\ubc18\\uc801\\uc778 \\uc7ac\\ubb34\\uad00\\ub9ac \\uc5c5\\ubb34<\/li><li>\\uc7ac\\ubb34 \\uc601\\uc5ed\\uacfc \\uad00\\ub828\\ub41c \\uc6d4\\ub9d0 \\ub9c8\\uac10 \\uc9c0\\uc6d0<\/li><li>SAP \\uc7ac\\ubb34 \\ubaa8\\ub4c8 \\uad6c\\ud604 \\uc9c0\\uc6d0<\/li><li>\\ud604\\uc9c0 \\ubc95\\uaddc\\uc694\\uac74 \\ubc0f \\uae00\\ub85c\\ubc8c \\uae08\\uc735 \\ud45c\\uc900\\uc5d0 \\ub300\\ud55c \\uad00\\ub828 \\uc900\\uc218 (\\uc608: FX \\uaddc\\uc81c\\uad00\\ub828)<\/li><li>\\uc7ac\\ubb34 \\uad00\\ub828 \\uc2dc\\uc2a4\\ud15c \\ud504\\ub85c\\uc138\\uc2a4 \\uc790\\ub3d9\\ud654 \\ubc0f \\uae00\\ub85c\\ubc8c \\ubcc0\\ud654 \\uad00\\ub9b0 \\ud504\\ub85c\\uc81d\\ud2b8 \\ucc38\\uac00 (ex. SAP, SWIFT, Alterx, PowerBI \\ub4f1)<\/li><li>\\ube44\\uc988\\ub2c8\\uc2a4 \\uae30\\ub2a5\\uacfc \\ud611\\ub825\\ud558\\uc5ec \\uc0ac\\uc804 \\uc608\\ubc29\\uc801 \\uc7ac\\ubb34 \\uc9c0\\uce68 \\uc81c\\uacf5<br><br><\/li><\/ul><strong>Qualification<br><br><\/strong>To set you up for success in this role from day one, 3M requires (at a minimum) the following qualifications:<br><br><ul><li>Bachelor\\u2019s degree or higher (completed and verified prior to start) from an accredited institution<\/li><li>5 years finance experience and at least 2 years treasury experience in international enterprise (Max. 15 years)<br><br><\/li><\/ul>Additional qualifications that could help you succeed even further in this role include:<br><br><ul><li>Excellent written and verbal communication skills\\uff1b<\/li><li>Fluent English both in written and verbal; Korean language skill;<\/li><li>Familiar with general FX regulations and able to plan the response according to policy updates;<\/li><li>Strong numeracy skills, experienced in using Microsoft Excel; SAP knowledge &amp; experience would be an advantage; Capacity on technical tools (Power BI, Alteryx);<\/li><li>Can problem solve and work through issues independently;<\/li><li>Self-starter with ability to prioritize projects and drive change<\/li><li>Cross-cultural project management experience, good team player and able to motivate self and others<\/li><li>\\ud559\\uc0ac \\uc774\\uc0c1<\/li><li>\\ucd1d \\uacbd\\ub825 5\\ub144 \\uc774\\uc0c1 (15\\ub144 \\uc774\\ud558\\uae4c\\uc9c0 \\uc9c0\\uc6d0 \\uac00\\ub2a5)<\/li><li>\\uc7ac\\ubb34\\uad00\\ub9ac \\uacbd\\ub825 2\\ub144 \\uc774\\uc0c1<\/li><li>\\uc601\\uc5b4 \\ucee4\\ubba4\\ub2c8\\ucf00\\uc774\\uc158\\uc774 \\uc6d0\\ud65c\\ud55c \\uc790<\/li><li>\\uc77c\\ubc18 FX \\uaddc\\uc815\\uc744 \\uc219\\uc9c0\\ud558\\uace0 \\uc815\\ucc45 \\ub300\\uc751 \\uacc4\\ud68d \\uac00\\ub2a5\\ud55c \\uc790<\/li><li>Microsoft Excel \\ud65c\\uc6a9 \\ub2a5\\uc219\\ud55c \\uc790<\/li><li>SAP, Power BI, Alteryx \\ub4f1\\uc758 \\uc720\\uad00 \\ud504\\ub85c\\uadf8\\ub7a8 \\uc0ac\\uc6a9 \\uac00\\ub2a5\\uc790<\/li><li>\\uae00\\ub85c\\ubc8c\\ud55c \\uae30\\uc5c5\\ud658\\uacbd\\uc5d0\\uc11c \\uc5c5\\ubb34 \\uacbd\\ud5d8\\uc744 \\uc313\\uc740 \\uc790 \\uc6b0\\ub300<br><br><\/li><\/ul><strong><strong><strong><strong><strong><u><strong><strong>Condition<br><br><\/strong><\/strong><\/u><\/strong><\/strong><\/strong><\/strong><\/strong><ul><li>Type: RegularI(\\uc815\\uaddc\\uc9c1) (\\uc218\\uc2b5\\uae30\\uac04 3\\uac1c\\uc6d4)<\/li><li>Location: Seoul, Korea or Signapore<\/li><li>Relocation is NOT required. (The employee will work where they are staying whether KR or SG)<br><br><\/li><\/ul><strong><strong><strong><strong><strong><u><strong><strong>Application Guidelines (\\uc785\\uc0ac \\uc9c0\\uc6d0 \\uc2dc \\uc8fc\\uc758\\uc0ac\\ud56d)<br><br><\/strong><\/strong><\/u><\/strong><\/strong><\/strong><\/strong><\/strong><ul><li>Click \\u2018Apply \\u2019 button<\/li><li>Fill in basic information such as employment ?and education<\/li><li>Upload your both of Korean\/English Resume (merge your files into one file )(\\uc774\\ub825\\uc11c \\ub0b4 \\uacbd\\ub825\\uae30\\uc220\\uc11c \\ubc0f \\uc790\\uae30\\uc18c\\uac1c\\uc11c \\ud3ec\\ud568)<br><br><\/li><\/ul><strong><strong><strong><strong><strong><u><strong><strong>Others<br><br><\/strong><\/strong><\/u><\/strong><\/strong><\/strong><\/strong><\/strong><ul><li>\\ud574\\uc678\\uc5ec\\ud589\\uc5d0 \\uacb0\\uaca9\\uc0ac\\uc720\\uac00 \\uc5c6\\uc5b4\\uc57c \\ud569\\ub2c8\\ub2e4.<\/li><li>\\uad6d\\uac00\\uc720\\uacf5\\uc790 \\ubc0f \\ubcf4\\ud6c8\\ub300\\uc0c1\\uc790(veteran) \\uc740 \\uad00\\ub828 \\ubc95\\uaddc\\uc5d0 \\ub530\\ub77c \\uc6b0\\ub300 \\ud569\\ub2c8\\ub2e4. (\\uc9c0\\uc6d0 \\uc2dc Veteran \\uad00\\ub828 \\uc9c8\\uc758\\uc5d0 YES \\uc120\\ud0dd) <\/li><li>\\uc7a5\\uc560\\uc778(Disability) \\uc740 \\uad00\\ub828 \\ubc95\\uaddc\\uc5d0 \\ub530\\ub77c \\uc6b0\\ub300\\ud569\\ub2c8\\ub2e4. (\\uc9c0\\uc6d0\\uc2dc Disablity \\uad00\\ub828 \\uc9c8\\uc758\\uc5d0 YES \\uc120\\ud0dd)<\/li><li>\\ucc44\\uc6a9\\uacfc\\uc815 \\uc911\\uc5d0 \\uc81c\\ucd9c\\ud558\\uc2e0 \\uc11c\\ub958\\uc5d0 \\ub300\\ud55c \\ubc18\\ud658\\uc744 \\uccad\\uad6c\\ud558\\uc2e4 \\uc218 \\uc788\\uc2b5\\ub2c8\\ub2e4.(\\ub2e8, \\uc628\\ub77c\\uc778\\uc811\\uc218\/\\uc804\\uc790\\uba54\\uc77c\\ub85c \\uc81c\\ucd9c\\ub41c \\uacbd\\uc6b0\\ub098, \\uad6c\\uc778\\uc790\\uc758 \\uc694\\uad6c\\uc5c6\\uc774 \\uc790\\ubc1c\\uc801\\uc73c\\ub85c \\uc81c\\ucd9c\\ud55c \\uacbd\\uc6b0\\uc5d0\\ub294 \\uc81c\\uc678\\ub429\\ub2c8\\ub2e4.)<\/li><li>\\ud5c8\\uc704\\uc0ac\\uc2e4 \\uae30\\uc7ac \\uc2dc \\ucc44\\uc6a9 \\ucde8\\uc18c\\ub429\\ub2c8\\ub2e4.<\/li><li>\\ubaa8\\ub4e0 \\uc9c0\\uc6d0\\uc790\\ubd84\\ub4e4\\uaed8 \\uacb0\\uacfc \\uc548\\ub0b4\\ub97c \\ub4dc\\ub9ac\\uace0 \\uc788\\uc2b5\\ub2c8\\ub2e4. \\ub2e4\\ub9cc, \\uac01 \\uc804\\ud615\\ubcc4 \\ud569\\uaca9\\uc790\\uc5d0\\uac8c \\uc6b0\\uc120 \\uc548\\ub0b4\\ud574 \\ub4dc\\ub9ac\\ub294 \\uc810 \\uc591\\ud574 \\ubd80\\ud0c1\\ub4dc\\ub9bd\\ub2c8\\ub2e4.<\/li><li>\\uc81c\\ucd9c\\ud574\\uc8fc\\uc2e0 \\uc774\\uba54\\uc77c\/\\ud578\\ub4dc\\ud3f0\\ubc88\\ud638\\ub85c \\uc5f0\\ub77d\\ub4dc\\ub9ac\\ub2c8 \\uc815\\ud655\\ud55c \\uae30\\uc7ac \\ubd80\\ud0c1\\ub4dc\\ub9bd\\ub2c8\\ub2e4.<br><br><\/li><\/ul>Learn more about 3M\\u2019s creative solutions to the world\\u2019s problems at www.3M.com or on Twitter @3M.<br><br><strong>Please note: your application may not be considered if you do not provide your education and work history, either by: 1) uploading a resume, or 2) entering the information into the application fields directly.<br><br><\/strong><u><strong>3M Global Terms of Use and Privacy Statement<br><br><\/strong><\/u>Carefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at 3M are conditioned on your acceptance and compliance with these terms.<br><br>Please access the linked document by clicking here, select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms.\"}"
}