{
    "id":"Kaggle::techmap::615c4bfadb23cb4230a782be::monster_uk::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The language is inclusive, designed to promote equal opportunities and a diverse workforce, aligning with modern best practices in HR. This approach is not generally viewed as implicitly biased. However, statements that explicitly encourage applications from specific demographic groups, such as male, or black and minority ethnic candidates, can sometimes be perceived as exclusive of others, despite the intention to enhance diversity. To make this more inclusive, consider rephrasing to encourage all underrepresented groups to apply. For example, \"We particularly welcome applications from those who are underrepresented in our organisation, including but not limited to, individuals from diverse racial backgrounds, genders, and abilities.\" This wording broadens the appeal and inclusivity, reflecting a commitment to diversity without limiting the encouragement to specific groups.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description About us: Princess Alice Hospice is one of the top ten adult hospices in the UK, providing specialist palliative care and support to a community of more than a million people living in Surrey, south west London and Middlesex. About the role: We are looking for someone with good communication, IT and knowledge management skills to join our Education and Research team as a Library and Learning Resource Coordinator. The right person will have experience of all aspects of managing hard copy and electronic resources within a Library or Learning Resource Center. As an Education and Research department, we support a large number of learners to develop their knowledge of end of life care and improved services. You will be joining a highly skilled team who deliver education to both internal staff and external health and social care colleagues. You will support learners with a wide range or requirements, from literature searches to helping them to access e. Learning, as well as coordinating our specialist collection of books, journals and electronic resources. Some of our employee benefits include: 27 days’ annual leave, plus recognised public holidays – rising to 29 days after 5 years’ service and 33 days after 10 years’ service (pro rata for part time). Training support and development opportunities. Free onsite parking. Subsidised meals at onsite canteen. Employee Assistance Programme – promoting staff wellbeing. Access to blue light card discount. Access to Pension Scheme. In – house laundry of uniforms, plus excellent changing facilities (with showers). Wellbeing. If you are enthusiastic about managing learning resources and supporting service users, we would love to hear from you. For an informal discussion about the role, please contact Clair Sadler (Senior Lecturer) at ***@pah. org. uk. We are particularly keen to see applications from male and black and minority ethnic candidates, as they are currently underrepresented in our organisation. At Princess Alice Hospice we are passionate about creating an inclusive workplace that values diversity. We are fully committed to equality of opportunities, and we warmly welcome applications from all backgrounds and cultures. We are signed up to the Disability Confident scheme and we guarantee to interview all disabled applicants who meet the minimum criteria for the vacancy. We are a place where you can be you. Please visit our Privacy Notices section to understand and be aware of how we use the data you provide to us.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615c4bfadb23cb4230a782be::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"Princess Alice Hospice\", \"position\": \"Library and Learning Resources Coordinator\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p><strong>About us<\/strong>:<\/p> <p>Princess Alice Hospice is one of the top ten adult hospices in the UK, providing specialist palliative care and support to a community of more than a million people living in Surrey, south west London and Middlesex.<\/p> <p><strong>About the role:<\/strong><\/p> <p>We are looking for someone with good communication, IT and knowledge management skills to join our Education and Research team as a Library and Learning Resource Coordinator. The right person will have experience of all aspects of managing hard copy and electronic resources within a Library or Learning Resource Center.<\/p> <p>As an Education and Research department, we support a large number of learners to develop their knowledge of end of life care and improved services. You will be joining a highly skilled team who deliver education to both internal staff and external health and social care colleagues. You will support learners with a wide range or requirements, from literature searches to helping them to access eLearning, as well as coordinating our specialist collection of books, journals and electronic resources<\/p> <p>&nbsp;<\/p> <p>Some of our employee benefits include:<\/p> <ul> <li>27 days\\u2019 annual leave, plus recognised public holidays \\u2013 rising to 29 days after 5 years\\u2019 service and 33 days after 10 years\\u2019 service (pro rata for part time)<\/li> <li>Training support and development opportunities<\/li> <li>Free onsite parking<\/li> <li>Subsidised meals at onsite canteen<\/li> <li>Employee Assistance Programme \\u2013 promoting staff wellbeing<\/li> <li>Access to blue light card discount<\/li> <li>Access to Pension Scheme<\/li> <li>In \\u2013 house laundry of uniforms, plus excellent changing facilities (with showers)<\/li> <li>Wellbeing - We provide a programme of activities, opportunities and guidance to inspire and support our employees to live a healthy life, at home and at work<\/li> <\/ul> <p>If you are enthusiastic about managing learning resources and supporting service users, we would love to hear from you. For an informal discussion about the role, please contact Clair Sadler (Senior Lecturer) at clairsadler@pah.org.uk&nbsp;<\/p> <p>We are particularly keen to see applications from male and black and minority ethnic candidates, as they are currently underrepresented in our organisation.<\/p> <p><i>At Princess Alice Hospice we are passionate about creating an inclusive workplace that values diversity. We are fully committed to equality of opportunities, and we warmly welcome applications from all backgrounds and cultures. <\/i><\/p> <p><i>We are signed up to the Disability Confident scheme and we guarantee to interview all disabled applicants who meet the minimum criteria for the vacancy.<\/i><i>We are a place where you can be you.<\/i><\/p> <p><i>Please visit our <a href=\\\"https:\/\/www.pah.org.uk\/privacy-notices\/\\\" rel=\\\"nofollow noopener noreferrer\\\" target=\\\"_blank\\\">Privacy Notices<\/a> section to understand and be aware of how we use the data you provide to us.<\/i><\/p> <p><i>All of our vacancies except from retail are subject to a relevant DBS check.<\/i><\/p> <p><strong>About us<\/strong>:<\/p> <p>Princess Alice Hospice is one of the top ten adult hospices in the UK, providing specialist palliative care and support to a community of more than a million people living in Surrey, south west London and Middlesex.<\/p> <p><strong>About the role:<\/strong><\/p> <p>We are looking for someone with good communication, IT and knowledge management skills to join our Education and Research team as a Library and Learning Resource Coordinator. The right person will have experience of all aspects of managing hard copy and electronic resources within a Library or Learning Resource Center.<\/p> <p>As an Education and Research department, we support a large number of learners to develop their knowledge of end of life care and improved services. You will be joining a highly skilled team who deliver education to both internal staff and external health and social care colleagues. You will support learners with a wide range or requirements, from literature searches to helping them to access eLearning, as well as coordinating our specialist collection of books, journals and electronic resources<\/p> <p>&nbsp;<\/p> <p>Some of our employee benefits include:<\/p> <ul> <li>27 days\\u2019 annual leave, plus recognised public holidays \\u2013 rising to 29 days after 5 years\\u2019 service and 33 days after 10 years\\u2019 service (pro rata for part time)<\/li> <li>Training support and development opportunities<\/li> <li>Free onsite parking<\/li> <li>Subsidised meals at onsite canteen<\/li> <li>Employee Assistance Programme \\u2013 promoting staff wellbeing<\/li> <li>Access to blue light card discount<\/li> <li>Access to Pension Scheme<\/li> <li>In \\u2013 house laundry of uniforms, plus excellent changing facilities (with showers)<\/li> <li>Wellbeing - We provide a programme of activities, opportunities and guidance to inspire and support our employees to live a healthy life, at home and at work<\/li> <\/ul> <p>If you are enthusiastic about managing learning resources and supporting service users, we would love to hear from you. For an informal discussion about the role, please contact Clair Sadler (Senior Lecturer) at clairsadler@pah.org.uk&nbsp;<\/p> <p>We are particularly keen to see applications from male and black and minority ethnic candidates, as they are currently underrepresented in our organisation.<\/p> <p><i>At Princess Alice Hospice we are passionate about creating an inclusive workplace that values diversity. We are fully committed to equality of opportunities, and we warmly welcome applications from all backgrounds and cultures. <\/i><\/p> <p><i>We are signed up to the Disability Confident scheme and we guarantee to interview all disabled applicants who meet the minimum criteria for the vacancy.<\/i><i>We are a place where you can be you.<\/i><\/p> <p><i>Please visit our <a href=\\\"https:\/\/www.pah.org.uk\/privacy-notices\/\\\" rel=\\\"nofollow noopener noreferrer\\\" target=\\\"_blank\\\">Privacy Notices<\/a> section to understand and be aware of how we use the data you provide to us.<\/i><\/p> <p><i>All of our vacancies except from retail are subject to a relevant DBS check.<\/i><\/p> <\/div> <div aria-label=\\\"Aggregated Job Source\\\" class=\\\"descriptionstyles__SourceHolder-sc-13ve12b-9 hkVglg\\\"> <!-- -->Source<!-- -->: <!-- -->Princess Alice Hospice <\/div>\"}"
}