{
    "id":"Kaggle::techmap::6155b71ed198905e9e611930::monster_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Test Engineer – Manufacturing. Salary $75, 000 - $90, 000. Benefits. Bonus. Paid Relocation to the Southern USA. A Global manufacturer of automotive parts is looking for a Test Engineer for their growing manufacturing facility. This Test Engineering position will support team efforts to maintain, improve, and innovate test systems design, processes, and methods. Overall, as the Test Engineer, you’ll work with and develop test equipment and\/or processes to identify opportunities & ideas to improve reliability and increase equipment uptime. Daily, you responsible for modifying software, electrical, mechanical, hydraulic, and\/or pneumatic systems to improve test equipment performance. Support equipment used to verify hardware and\/or software component functionality such as chart recorder, oscilloscope, multi-meter, etc. Need a strong software background in addition to hydraulics and pneumatics in a high-volume environment. By software, this means programming skills and experience in LabVIEW, C++, VB. Net, and VB6. 0. Ensures Preventative Maintenance and Spare Part systems on test equipment identify test process improvement opportunities and ideas as well as creates and specify control systems software and hardware. Salary $75, 000 - $90, 000. Benefits. Bonus. Paid Relocation to the Southern USA where you are close to the Mississippi River and several lakes with access to some of the best fishing around! You can keep your boat near as there are several places, you’ll love spending time. If you hunt turkey, rabbit, duck, or deer, then this will be a great area to live. Lower cost of living, temperate weather, gracious southern charm, antiquing, & small town living at its best. Access to museums, festivals, sports, & higher education. Easy drive to the Gulf beach or mountains. Lovely place to live & raise a family. Minimum Requirements for this Test Engineering position: Bachelor’s Degree in electrical, Mechanical or Engineering\/Industrial Technology. Three plus Years of experience in a similar role. Test equipment support and PM development. Data Analysis such as R&R studies, SPC and problem solving. PLC Programming, design and debugging. PC (Visual Basic, VB. Net, VB 6. 0, SQL, LabVIEW). Electrical, mechanical, pneumatic, and hydraulic print creation and revision. Lab Instrument setup and operation. Automated equipment troubleshooting and repair.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155b71ed198905e9e611930::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Austin Allen Company, LLC\", \"position\": \"Test Engineer \\u2013 Manufacturing\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div> <p><strong>Test Engineer \\u2013 Manufacturing<\/strong><\/p> <p><strong>&nbsp;<\/strong><\/p> <p><strong>Salary $75,000 - $90,000 + Benefits + Bonus + Paid Relocation to the Southern USA<\/strong><\/p> <p>&nbsp;<\/p> <p>A Global manufacturer of automotive parts is looking for a <strong>Test Engineer<\/strong> for their growing manufacturing facility.&nbsp; This Test Engineering position will support team efforts to maintain, improve, and innovate test systems design, processes, and methods.&nbsp;<\/p> <p>&nbsp;<\/p> <p>Overall, as the Test Engineer, you\\u2019ll work with and develop test equipment and\/or processes to identify opportunities &amp; ideas to <strong>improve reliability <\/strong>and<strong> increase equipment uptime<\/strong>.&nbsp; Daily, you responsible for modifying software, electrical, mechanical, hydraulic, and\/or pneumatic systems to <strong>improve test equipment performance<\/strong>.&nbsp; Support equipment used to verify hardware and\/or software component functionality such as <strong>chart recorder, oscilloscope, multi-meter<\/strong>, etc.&nbsp; Need a strong software background in addition to <strong>hydraulics<\/strong> and <strong>pneumatics<\/strong> in a high-volume environment.&nbsp; By software, this means programming skills and experience in <strong>LabVIEW, C++, VB.Net, and VB6.0<\/strong>.&nbsp; Ensures Preventative Maintenance and Spare Part systems on test equipment identify test process improvement opportunities and ideas as well as creates and specify control systems software and hardware.&nbsp;<\/p> <p><br><strong>Salary $75,000 - $90,000 + Benefits + Bonus + Paid Relocation to the Southern USA where <\/strong>you are close to the Mississippi River and several lakes with access to some of the best fishing around!&nbsp; You can keep your boat near as there are several places, you\\u2019ll love spending time.&nbsp; If you hunt turkey, rabbit, duck, or deer, then this will be a great area to live.&nbsp; Lower cost of living, temperate weather, gracious southern charm, antiquing, &amp; small town living at its best.&nbsp; You\\u2019ll have access to the bright lights of the big city or the charm of the Southern countryside.&nbsp; Access to museums, festivals, sports, &amp; higher education.&nbsp; Easy drive to the Gulf beach or mountains.&nbsp; Lovely place to live &amp; raise a family.<\/p> <p><strong>&nbsp;<\/strong><\/p> <p><strong>Minimum Requirements for this Test Engineering position:<\/strong><\/p> <ul> <li>Bachelor\\u2019s Degree in electrical, Mechanical or Engineering\/Industrial Technology<\/li> <li>Three plus Years of experience in a similar role<\/li> <li>Test equipment support and PM development<\/li> <li>Data Analysis such as R&amp;R studies, SPC and problem solving<\/li> <li>PLC Programming, design and debugging<\/li> <li>PC (Visual Basic, VB.Net, VB 6.0, SQL, LabVIEW)<\/li> <li>Electrical, mechanical, pneumatic, and hydraulic print creation and revision<\/li> <li>Lab Instrument setup and operation<\/li> <li>Automated equipment troubleshooting and repair.<\/li> <\/ul> <p>&nbsp;<\/p> <\/div> <\/div>\"}"
}