{
    "id":"Kaggle::techmap::6145ee657fc29a0be9bb88d5::linkedin_se::1",
    "label_age":true,
    "analysis_age":"The requirement for \"10 years of experience within Marketing\" and \"5 years of experience from manager position(s)\" can introduce age bias by favouring older candidates who are more likely to have accumulated this level of experience, potentially disadvantaging younger but equally capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":"The requirement for fluency in Swedish and English is relevant to the job's specific linguistic needs and does not introduce bias, as it ensures candidates can effectively perform the necessary communication tasks.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years of experience within Marketing. We are looking for someone with extensive knowledge of digital marketing combined with a solid understanding of the overall marketing process. 5 years of experience from manager position(s) with an excellent track record, preferably with experience from being part of a management team. Fluency in Swedish and English, written and spoken alike. Academic degree. Previous experience of B2B marketing or working hands-on with internal communications is meriting for this role... As a person, you radiate confidence and establish credibility, taking an active role in communication and decision making. You naturally provide direction on projects and gain cooperation and action from others by setting high-performance standards. We expect you to contribute with solid leadership skills and a result-oriented mindset. You identify challenging goals for yourself and the team, implement activities and roadmaps that align with the goals, and establishes both clarity and energy by creating milestones along the way. You are a person who focuses on the goals, even when difficulties arise along the way, and you communicate appropriately to strengthen your team's engagement. In conclusion, you are a team player and probably known as a people-person. We believe that you have achieved excellent results in your previous roles and have done so by developing good relationships and close cooperation with others. About the Company. Academic Work has helped more than 150, 000 young professionals find a job and start to grow in their careers. while also fulfilling our clients' recruitment needs and helping them to grow their business. We are approximately 1.000 internal employees in six countries, with revenue of 3, 5 MSEK and ambitious plans for the future. We are proud of what we have achieved so far, but we are still only in the early beginning of our journey! Do you want to know more about working at AW Group? Read more here... Practical info. Work area: Marketing. Place of employment: Stockholm. Extent: Full time. Start date: ASAP, with regard to notice period. In this process Academic Work is working together with AW Executive Search, if you have any questions please contact Recruitment Responsible: Emeli Bergenhag at awexecutivesearch. Our selection process is continuous and the advert may close before the recruitment process is completed if we have moved forward to the screening or interview phase.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145ee657fc29a0be9bb88d5::linkedin_se\", \"source\": \"linkedin_se\", \"country\": \"SE\", \"company\": \"Academic Work\", \"position\": \"Group Marketing Director to Academic Work Group\", \"notes\": \"\", \"original\": \"<p><em>Since the early beginning, we have strived to build a culture in which people feel energized, where curiosity is encouraged, and where support and care come naturally. Over the years, we have grown into becoming a family of brands, where each has an exciting journey ahead. <\/em> <br><br><br><\/p><p><strong>Job description<br><br><\/strong><\/p><p><\/p><span><br><br><\/span><p><\/p><span><br><br><\/span><p>We are now looking for an experienced leader within Marketing to become part of the Academic Work Group Management team. You will be responsible for leading our talented Marketing organization consisting of +40 co-workers within three functions: Communications Management, Creative and Digital marketing. <br><br><\/p><p>The Marketing function within Academic Work is a centralized department, managing the marketing activities for Academic Work in all six countries (Sweden, Finland, Norway, Denmark, Germany, and Switzerland). Over the years, Academic Work has grown into a portfolio of brands, all united under the AW Group umbrella. You and your organization have the operational responsibility of marketing the offerings for the entire group, which is a complex yet inspiring challenge. <br><br><\/p><p>You will have a close collaboration with the Directors within Sales, Operations, and People &amp; Performance, who are also part of the Academic Work Group Management team. In addition to this, you will keep close to the country management teams to ensure that our marketing strategy &amp; tactics align with our business priorities. <br><br><\/p><p>Here is how Anna G\\u00e4rder, our current Group Marketing Director describes why you should apply for this position:<br><br><br><\/p><p><em>For the last couple of years, we have been rebuilding our marketing organization, and we have indeed come far, but there is still so much untapped potential for you to continue to explore. Join our journey, and you will get the opportunity to drive performance and build several different brands within the HR sector. The Marketing Head of\\u2019s and the entire marketing team are simply the best, and you will have a great manager and committed Group Management colleagues by your side.<\/em> <br><br><\/p><p><strong>Who you are<\/strong> <br> <span><\/span><br> <br><br><\/p><p>To succeed in this position, we believe that you are a person who will thrive in a global and fast-changing environment with previous experience from complex international company-structures. It is considered meritorious if you have previous experience of leading or working within an international and centralized marketing function. You have a solid understanding of the digital marketing arena, as well as extensive experience from building brands, setting marketing strategies, and optimizing marketing spend. <br> <span><\/span><br> <br><br><\/p><p>In addition to this, you have:<br> <br><br><\/p><ul> <li>+10 years of experience within Marketing. We are looking for someone with extensive knowledge of digital marketing combined with a solid understanding of the overall marketing process. <span><\/span><br> <\/li><br><li>+5 years of experience from manager position(s) with an excellent track record, preferably with experience from being part of a management team. <span><\/span><br> <\/li><br><li>Fluency in Swedish and English, written and spoken alike<br> <\/li><br><li>Academic degree <br> <\/li><br><\/ul><p>Previous experience of B2B marketing or working hands-on with internal communications is meriting for this role. <br> <span><\/span><br> <br><br><\/p><p><br><br><br><\/p><p><strong>As a person<\/strong>, you radiate confidence and establish credibility, taking an active role in communication and decision making. You naturally provide direction on projects and gain cooperation and action from others by setting high-performance standards.<br><br><\/p><p>We expect you to contribute with solid leadership skills and a result-oriented mindset. You identify challenging goals for yourself and the team, implement activities and roadmaps that align with the goals, and establishes both clarity and energy by creating milestones along the way. You are a person who focuses on the goals, even when difficulties arise along the way, and you communicate appropriately to strengthen your team's engagement. <br><br><\/p><p>In conclusion, you are a team player and probably known as a people-person. We believe that you have achieved excellent results in your previous roles and have done so by developing good relationships and close cooperation with others.<br> <br><br><\/p><p> <br> <br><br><\/p><p><strong>About the Company<\/strong><span><\/span><br> <br><br><\/p><p>Academic Work has helped more than 150,000 young professionals find a job and start to grow in their careers - while also fulfilling our clients' recruitment needs and helping them to grow their business. We are approximately 1.000 internal employees in six countries, with revenue of 3,5 MSEK and ambitious plans for the future. We are proud of what we have achieved so far, but we are still only in the early beginning of our journey!<br><br><\/p><p>Do you want to know more about working at AW Group? Read more <strong>here<\/strong>.<br><br><\/p><p> <br><br><\/p><p> <br><br><\/p><p><strong>Practical info<br><br><br><\/strong><\/p><p>Work area: Marketing<br><br><\/p><p>Place of employment: Stockholm<br><br><\/p><p>Extent: Full time<br><br><\/p><p>Start date: ASAP, with regard to notice period<br><br><\/p><p>In this process Academic Work is working together with AW Executive Search, if you have any questions please contact Recruitment Responsible: Emeli Bergenhag at emeli.bergenhag@awexecutivesearch.se<br><br><\/p><p>Our selection process is continuous and the advert may close before the recruitment process is completed if we have moved forward to the screening or interview phase.<br><br><\/p>\"}"
}