{
    "id":"Kaggle::techmap::614b3ba87a36085d14ce955e::linkedin_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Using specific terms such as \"Lesbian, Gay, Bisexual, Transgender\" rather than the more inclusive \"LGBTQ+\" can appear non-inclusive and outdated, while referring to \"Minority, Female, Disabled\" instead of \"underrepresented groups\" or \"people with disabilities\" may seem exclusionary or tokenising.",
    "verified":true,
    "synthetic":false,
    "text":" Rotates through workstations as needed for coverage, relief, and training purposes as required in conjunction with on-the-job training. May operate can line briquetter, end line baler, and slug accumulator. Initiates, reviews and follows all standard operating procedures (SOPs) for area of responsibility. Supplies and maintains required hand tools. Position Requirement & Competencies. High School Diploma or education equivalent required. Job-related experience for 1 year minimum. Troubleshooting skills\/experience. Experience working in an industrial environment. Ability to apply standard evaluation, selection, and substantial adaptation and modification of standard manufacturing and plant quality techniques, procedures, and criteria. Ability to learn operating principles and nomenclature of all assigned equipment and products. Ability to learn nomenclature of all assigned equipment, products, and quality standards. Ability to learn to identify product defects. Ability to use hand and power tools. Ability to operate fork truck and aero lift. May require forklift license. Working knowledge of machine mechanics. Works in manufacturing environment. This position is exposed to occupational hazards, including but not limited to, high noise levels, physical obstacles, exposure to chemicals, etc. Must wear appropriate safety glasses, hearing protection, clothing, and footwear in appropriate areas and follow safety practices. Compensation & Benefits. Hiring Salary Range: $ 27.39 (Salary to be determined by the applicants education, experience, knowledge, skills, and abilities, as well as internal equity and alignment with market data. ) Job Grade: 12. Regular Full-Time Salaried and Hourly positions: Ball includes a comprehensive benefits structure, Go to our career site and click \"Total Rewards\" to learn more. Ball Corporation has been made aware of reports involving fraudulent job offers. These often appear legitimate, but Ball does not make job offers until after a candidate has submitted a job application and has participated in a face-to-face interview (In person or via WebEx). All email correspondence from Ball Corporation ends in ball. com. Please also be advised that Ball will never request payment or require candidates to deposit a check during the recruitment and onboarding processes. If you have questions about any open positions at Ball, please visit our careers website at httpsjobs. ball. com\/. If you have applied to a position and have been asked for personal information through Linked. In, please notify Linked. In directly. Equal Opportunity Employer. Minority, Female, Disabled, Lesbian, Gay, Bi-sexual, Transgender and Veterans.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b3ba87a36085d14ce955e::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"Ball Corporation\", \"position\": \"Production Technician\", \"notes\": \"\", \"original\": \"<strong>Do you want to work for a world-leading manufacturer who strives to build a better future through sustainability and innovation? Are you looking for a new challenge in a stable, fast-growing sector?<br><br><\/strong><strong>Join us, and build your career by helping us build the future.<br><br><\/strong>We are a global leader in sustainable products with more than 21,000 team members worldwide. From infinitely recyclable aluminum cans, cups, and aerosol bottles, to aerospace solutions that enable our customers to have a deeper understanding of our planet and the universe. We produce all these incredible things with one unique purpose: crafting a better community, a better society, a better world.<br><br>Moreover, each of us has a deep commitment to diversity and inclusion which is the foundation of our culture of belonging. And everyone at Ball is an everyday champion, making a difference by doing what we love.<br><br>We lead with our heads and our hearts and combine innovative thinking with a spirit of resiliency that keeps us moving forward in a relentless pursuit of new ways to make life, and the world, better. Whether we\\u2019re developing packaging that\\u2019s infinitely recyclable or aerospace innovations.<strong> Because what we create may change, but what we will always make is a difference.<br><br><\/strong><strong><u>Primary Purpose Of The Position<br><br><\/u><\/strong>Performs various manual or mechanical production functions by operating, adjusting, and repairing production equipment to meet customer specifications. Performs tasks and provides services to support the plant\\u2019s production goals, overall business plans and objectives as directed.<br><br><strong><u>Essential Responsible Areas<br><\/u><\/strong><ul><li> Complies with established job safety practices, policies, and procedures as specified in plant and corporate directives for the safe performance of the work assignment. <\/li><li> Supports and follows guidelines of the food safety system. <\/li><li> Performs duties as required to ensure compliance with the plant\\u2019s quality standards. <\/li><li> Performs various manual or mechanical production functions by operating, adjusting, and repairing production equipment to meet customer specifications. <\/li><li> Disassembles, overhauls, and rebuilds production equipment under the supervision of a qualified maintainer. <\/li><li> Performs troubleshooting on production equipment as required. <\/li><li> Performs preventative maintenance on production equipment as required. <\/li><li> Inputs data on a computer terminal to identify, label, and palletize finished products. <\/li><li> Operates forklift during routine performance of duties. <\/li><li> Conducts inspection of in-process or finished product to meet customer specifications. <\/li><li> Responsible for replenishing supplies required for assigned area. <\/li><li> Rotates through workstations as needed for coverage, relief, and training purposes as required in conjunction with on-the-job training. <\/li><li> May operate can line briquetter, end line baler, and slug accumulator. <\/li><li> Initiates, reviews and follows all standard operating procedures (SOPs) for area of responsibility. <\/li><li> Supplies and maintains required hand tools. <br><\/li><\/ul><strong><u>Position Requirement &amp; Competencies<br><\/u><\/strong><ul><li> High School Diploma or education equivalent required. <\/li><li> Job-related experience for 1 year minimum. <\/li><li> Troubleshooting skills\/experience. <\/li><li> Experience working in an industrial environment. <\/li><li> Ability to apply standard evaluation, selection, and substantial adaptation and modification of standard manufacturing and plant quality techniques, procedures, and criteria. <\/li><li> Ability to learn operating principles and nomenclature of all assigned equipment and products. <\/li><li> Ability to learn nomenclature of all assigned equipment, products, and quality standards. <\/li><li> Ability to learn to identify product defects. <\/li><li> Ability to use hand and power tools. <\/li><li> Ability to operate fork truck and aero lift. <\/li><li> May require forklift license. <\/li><li> Working knowledge of machine mechanics. <\/li><li> Works in manufacturing environment. <\/li><li> This position is exposed to occupational hazards, including but not limited to, high noise levels, physical obstacles, exposure to chemicals, etc. <\/li><li> Must wear appropriate safety glasses, hearing protection, clothing, and footwear in appropriate areas and follow safety practices. <br><\/li><\/ul><strong><u>Compensation &amp; Benefits<br><\/u><\/strong><ul><li> Hiring Salary Range: $ 27.39 (Salary to be determined by the applicant\\u2019s education, experience, knowledge, skills, and abilities, as well as internal equity and alignment with market data.) <\/li><li> Job Grade: 12 <\/li><li> Regular Full-Time Salaried and Hourly positions: Ball includes a comprehensive benefits structure, Go to our career site and click \\\"Total Rewards\\\" to learn more. <br><\/li><\/ul>Ball Corporation has been made aware of reports involving fraudulent job offers. These often appear legitimate, but Ball does not make job offers until after a candidate has submitted a job application and has participated in a face-to-face interview (In person or via WebEx). All email correspondence from Ball Corporation ends in \\u201c@ball.com.\\u201d Please also be advised that Ball will never request payment or require candidates to deposit a check during the recruitment and onboarding processes. If you have questions about any open positions at Ball, please visit our careers website at https:\/\/jobs.ball.com\/ .<br><br>If you have applied to a position and have been asked for personal information through LinkedIn, please notify LinkedIn directly.<br><br>Equal Opportunity Employer<br><br>Minority, Female, Disabled, Lesbian, Gay, Bi-sexual, Transgender and Veterans\"}"
}