{
    "id":"Kaggle::techmap::6137ad7e7d4ffc16c87f9703::careerbuilder_us::10",
    "label_age":true,
    "analysis_age":"\"Ability to work in a fast-paced, non-stop environment\" could be interpreted as biased towards younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"U Pull-&-Pay (UPAP) is a dynamic company with a nationwide network of retail self-serve used auto parts stores. As a customer focused organization, UPAP exists to provide low cost, used auto parts to our customers. Our inventory and interchange information services enhance the customer experience. Customers bring their own tools into UPAP stores and remove valuable auto parts from an environmentally processed inventory of autos. These auto parts are purchased according to a specific price list shared with our customers. UPAPs inventory of autos is rotated continuously. UPAP is a wholly owned subsidiary of The David J Joseph Company (DJJ) which was founded in 1885 and is a world leader in scrap metal recycling & trading. With over 80 locations, the Joseph Company is headquartered in Cincinnati, Ohio and is a wholly owned subsidiary of Nucor Corporation (NUE) a Fortune 200 Company. DJJ has a well-earned reputation for safety, integrity and innovation. We are recognized as a good community citizen who is trustworthy, financially strong and environmentally proactive. If you are ready to grow with a successful company, please apply online or in person. Properly follow company and OSHA safety procedures. Attend safety meetings and participate in safety program. General labor duties that may include but not limited to sweeping, shoveling and general clean-up of any area and\/or equipment throughout the yard. Fluid removal and reclaiming. Keep grounds clear of debris and maintain safety standards. Operate small equipment. Potential to operate larger industrial equipment. Perform daily inspections on equipment reporting any defects or needed repairs to supervisor. Willing to cross-train in other positions and assist other employees as needed. Other duties as assigned by your manager. Able to take direction and work on a team. Physically able to stand for long periods of time and lift up to 50 lbs. Comfortable working outdoors. Willing to work weekends and overtime as needed. Prior automotive experience a plus. Pre-employment criminal background and drug screen required. Ability to work in a fast-paced, non-stop environment while providing excellent customer service. Ability to work standing or walking for up to 12 hours per day. Ability to adapt to frequent changes of priority and complete job tasks safely and effectively without constant supervision. Ability to meet attendance schedule with dependability and consistency.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137ad7e7d4ffc16c87f9703::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"U-Pull & Pay\", \"position\": \"Laborer\", \"notes\": \"\", \"original\": \"<p>U Pull-&-Pay (UPAP) is a dynamic company with a nationwide network of retail self-serve used auto parts stores. As a customer focused organization, UPAP exists to provide low cost, used auto parts to our customers. Our inventory and interchange information services enhance the customer experience. Customers bring their own tools into UPAP stores and remove valuable auto parts from an environmentally processed inventory of autos. These auto parts are purchased according to a specific price list shared with our customers. UPAPs inventory of autos is rotated continuously.<\/p><p><\/p><p>UPAP is a wholly owned subsidiary of The David J Joseph Company (DJJ) which was founded in 1885 and is a world leader in scrap metal recycling & trading. With over 80 locations, the Joseph Company is headquartered in Cincinnati, Ohio and is a wholly owned subsidiary of Nucor Corporation (NUE) a Fortune 200 Company. DJJ has a well-earned reputation for safety, integrity and innovation. We are recognized as a good community citizen who is trustworthy, financially strong and environmentally proactive.<\/p><p> If you are ready to grow with a successful company, please apply online or in person.<\/p><p><\/p><ul><li><p>Properly follow company and OSHA safety procedures<\/p><\/li><li><p>Attend safety meetings and participate in safety program<\/p><\/li><li><p>General labor duties that may include but not limited to sweeping, shoveling and general clean-up of any area and\/or equipment throughout the yard<\/p><\/li><li>Preparing autos for processing, such as trash removal, removing and disposing of designated parts, etc <\/li><li>Fluid removal and reclaiming <br \/><\/li><li>Keep grounds clear of debris and maintain safety standards<br \/><\/li><li>Operate small equipment. Potential to operate larger industrial equipment <\/li><li>Perform daily inspections on equipment reporting any defects or needed repairs to supervisor<br \/><\/li><li>Willing to cross-train in other positions and assist other employees as needed<br \/><\/li><li>Other duties as assigned by your manager<br \/><\/li><\/ul><p><\/p><ul><li>Able to take direction and work on a team<br \/><\/li><li>Physically able to stand for long periods of time and lift up to 50 lbs <br \/><\/li><li>Comfortable working outdoors<br \/><\/li><li>Willing to work weekends and overtime as needed<br \/><\/li><li>Prior automotive experience a plus<br \/><\/li><li>Pre-employment criminal background and drug screen required<br \/><\/li><li>Ability to work in a fast-paced, non-stop environment while providing excellent customer service <br \/><\/li><li>Ability to work standing or walking for up to 12 hours per day<br \/><\/li><li>Ability to adapt to frequent changes of priority and complete job tasks safely and effectively without constant supervision <br \/><\/li><li>Ability to meet attendance schedule with dependability and consistency<br \/><\/li><li>Flexible to work overtime, off-hours, weekends, and holidays in an industrial environment which includes being outdoors in all weather conditions<br \/><\/li><li>Bilingual preferred<br \/><\/li><\/ul><p>#UPAPslot<\/p><p><\/p>&nbsp;\"}"
}