{
    "id":"Kaggle::techmap::6152e5b82a8d023fe62f6f8e::britishjobs_uk::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"CASUAL LECTURER IN PLASTERING. Internal Ref: 0352. Hours: Casual. Full-time: £28. 15 or £25. 13 (based on qualifications & experience). As an award winning college, we are always looking for exceptional staff to help us to fulfil our ambitions. Providing aspirational teaching is vital to inspiring the next generation in the construction industry. We are looking for inspirational and confident lecturers who are passionate about the plastering trade, have good practical teaching skills and are able to inspire our learners to achieve. The focus of this role is to teach plastering students in practical and theory classes. The successful applicant will work in one of the most successful and largest plastering departments nationally. The team you will be working in have the responsibility for teaching Plastering students at Level 1, 2 and 3 apprentices, study programme and adult students. You will deliver lessons to a variety of different sized groups within our department, applicants should have relevant industry experience in the plastering trade area. The ability to communicate, motivate and understand the needs of young learners is essential. A good knowledge of learning disabilities and\/or difficulties is desirable. In return we offer a warm and welcoming college with outstanding facilities and an excellent benefits package that includes: A well-respected occupational pension scheme (Teachers Pensions). Free parking at all of our College site (on a first come, first served basis). Family friendly policies and opportunities for flexible working. Superb opportunities for training and development. Please note that all applications should be completed online. Please visit the vacancies section of our website or press APPLY and we shall send you our application link. Please note this position is subject to a Disclosure and Barring Service check. The College is committed to safeguarding children, young people and vulnerable adults. It is also committed to the ‘Prevent Duty’ and the requirement to prevent people being drawn into terrorism and expects all staff to share these commitments.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6152e5b82a8d023fe62f6f8e::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Only FE\", \"position\": \"Lecturer Plastering - Casual\", \"notes\": \"\", \"original\": \"CASUAL LECTURER IN PLASTERING &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br><br>Internal Ref: 0352<br><br>Hours: Casual &nbsp;<br><br>Full-time: &pound;28.15 or &pound;25.13 (based on qualifications &amp; experience)<br><br>As an award winning college, we are always looking for exceptional staff to help us to fulfil our ambitions. Providing aspirational teaching is vital to inspiring the next generation in the construction industry.<br><br>We are looking for inspirational and confident lecturers who are passionate about the plastering trade, have good practical teaching skills and are able to inspire our learners to achieve.&nbsp;<br><br>The focus of this role is to teach plastering students in practical and theory classes. The successful applicant will work in one of the most successful and largest plastering departments nationally. The team you will be working in have the responsibility for teaching Plastering students at Level 1, 2 and 3 apprentices, study programme and adult students.<br><br>You will deliver lessons to a variety of different sized groups within our department, applicants should have relevant industry experience in the plastering trade area.<br><br>The ability to communicate, motivate and understand the needs of young learners is essential.&nbsp; A good knowledge of learning disabilities and\/or difficulties is desirable.<br><br>In return we offer a warm and welcoming college with outstanding facilities and an excellent benefits package that includes:<br><br>A well-respected occupational pension scheme (Teachers Pensions)<br>Free parking at all of our College site (on a first come, first served basis)<br>Family friendly policies and opportunities for flexible working<br>Superb opportunities for training and development<br>Therefore, if you would like to be part of a unique organisation that supports one of the largest and most diverse employment sectors in the UK, we would love to hear from you!<br><br>Please note that all applications should be completed online.&nbsp; Please visit the vacancies section of our website or press APPLY and we shall send you our application link.<br><br>Please note this position is subject to a Disclosure and Barring Service check.<br><br>The College is committed to safeguarding children, young people and vulnerable adults. It is also committed to the &lsquo;Prevent Duty&rsquo; and the requirement to prevent people being drawn into terrorism and expects all staff to share these commitments.<br><br>\"}"
}