{
    "id":"Kaggle::techmap::615ddc008faf5f1e4d7b19c3::linkedin_iq::3",
    "label_age":true,
    "analysis_age":"The phrase \"10 plus years of field experience\" favours older candidates with extensive experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The phrase \"preferably with a sense of humor\" can introduce general bias by favouring candidates with a particular personality trait, potentially excluding those who handle difficulties effectively but in a different manner.",
    "verified":true,
    "synthetic":false,
    "text":" 10 plus years of field experience in international relief and development programs with demonstrable success in managing complex emergency response and its transfer into early recovery or development. Prior experience in setting country level strategy with annual implementation plans and resource managing towards the strategy. Great communication skills and prior experience in building, managing and leading a team of professionals. History of working effectively and respectfully with host country government, private sector, INGO and NGO partners in complex environments. Excellent writing skills and experience directing successful proposal development processes with prior experience with USAID, FCDO, EU and other bilateral funding agencies. Prior experience working and managing a program in a high security alert area, with demonstrated knowledge and skills to manage the security in conflict and post-conflict situations. Previous work experience in the Middle East and demonstrated ability to work comfortably, and sensitively, in the environment required. Proven skills in financial management. English proficiency required. Arabic or Kurdish language skills preferred. Success Factors. A successful Iraq CD will provide effective leadership to the Mercy Corps team. They will have high emotional intelligence, constructive mentoring skills and proven experience with capacity building. The Country Director will be committed to long-term program sustainability and the delivery of high-impact activities at the community level. The Iraq CD will represent programmatic priorities of the team to donors and regional counterparts. Successful Mercy Corps team members have a strong commitment to teamwork and accountability, thrive in evolving and challenging environments, and make effective written and verbal communication a priority. The ability to facilitate dialogue among a diverse group of individuals with various skill sets and working styles is essential. The Iraq CD will thrive with the uncertainty the context brings and can gracefully handle difficulties, preferably with a sense of humor. Living Conditions \/ Environmental Conditions. The position is based in Baghdad, Iraq and it requires frequent travel to offices throughout the country. In total Mercy Corps has offices in 7 governorates of Iraq. SMT members are based in Baghdad or Erbil. In Baghdad accommodation is in a guesthouse, with all efforts made to ensure a private living space for the Country Director. In Erbil team members live in shared high-rise apartment buildings with relative freedom of movement and good amenities. Elsewhere in the country, there is group accommodation with limited freedom of movement beyond the house\/office.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615ddc008faf5f1e4d7b19c3::linkedin_iq\", \"source\": \"linkedin_iq\", \"country\": \"IQ\", \"company\": \"Mercy Corps\", \"position\": \"Country Director - Baghdad, Iraq\", \"notes\": \"\", \"original\": \"<strong><u>About Mercy Corps<br><br><\/u><\/strong>Mercy Corps is a leading global organization powered by the belief that a better world is possible.<br><br>In disaster, in hardship, in more than 40 countries around the world, we partner to put bold solutions<br><br>into action \\u2014 helping people triumph over adversity and build stronger communities from within.<br><br>Now, and for the future.<br><br>Program \/ Department Summary<br><br>Mercy Corps seeks a passionate, visionary leader to manage major programming in Iraq. The Country Director (CD) role is an exciting opportunity to influence key outcomes and make a lasting difference in the lives of millions of Iraqis. Mercy Corps\\u2019 approach within Iraq has allowed us to continue to provide critical assistance to some of the country\\u2019s most vulnerable populations during a period of tremendous upheaval, while expanding early recovery and development programs to support sustained livelihoods for populations affected by years of conflict. Operational in Iraq since 2003 - and with a current annual budget of almost USD $80 million from programs funded by USAID, DRL, UN Pooled Fund, EUTF, Global Affairs Canada, SIDA, AFD, and others - we are now searching for an entrepreneurial leader to continue to nurture and expand sustainable programming. The country office is in the midst of a transition from humanitarian to longer-term development programming. This resulting combination brings together a diversity of staff, technical expertise and program learning, along with a critical opportunity to influence donor priorities moving forward. This exciting time requires a resourceful and proven leader who has held senior roles in large, complex organizations, preferably in conflict locations. They will be an experienced and thoughtful leader about questions of economic recovery, social cohesion and\/or governance. The CD will be able to lead on creative partnerships in tough environments and accountable delivery to program participants and donors. The successful candidate will be an inspirational leader, committed to advancing the organization\\u2019s strategy and building a healthy team culture that promotes collaboration and open communication.<br><br>General Position Summary<br><br>The Country Director (CD) is the top management position for Mercy Corps in Iraq with supervisory and managerial responsibility over all personnel, programs and policies. The CD is responsible for developing the overall strategic direction for programming in cooperation with Mercy Corps\\u2019 senior management team and local and international partners. They will ensure we learn from experience, through research and contextual analysis to develop high impact strategies that address both the current crises as well as longer-term solutions. The CD is also responsible for implementing systems, policies and procedures for Mercy Corps\\u2019 operations in Iraq. The CD is responsible for financial oversight and compliance, staff security, human resource management and representation. They are a skilled communicator, able to develop and utilize strong relationships with staff, partners, national government and donors.<br><br><strong><u>Essential Job Responsibilities<br><br><\/u><\/strong>Strategy &amp; Vision<br><ul><li>Formulate and plan, in consultation with key stakeholders, a clear vision of present and future program goals and strategies which can be clearly communicated to team members, local beneficiaries, international partners, governmental counterparts, and donors.<\/li><li>Recognize opportunities for innovative action and create an environment where alternative viewpoints are welcomed.<\/li><li>Set direction by prioritizing and organizing actions &amp; resources to achieve goals and objectives.<\/li><li>Explore, evaluate and present new project funding opportunities that leverage impact and integrate initiatives and activities; support and direct related fundraising activities with both institutional and private donors.<\/li><li>Evaluate program priorities within the country and participate in regional prioritization.<br><\/li><\/ul>Team Management<br><ul><li>Create and sustain a work environment of mutual respect where team members strive to achieve excellence.<\/li><li>Recruit, manage, motivate, and onboard an informed, skilled and efficient team with an emphasis on excellence and achievement; encourage a team culture of learning, creativity and innovation, incorporating staff development strategies and performance management systems into the team building process.<\/li><li>Establish leadership and personal credibility with the Mercy Corps team, and implement by example an organizational culture of accountability, responsibility and quality of services.<\/li><li>Ensure excellent human resource plans are available and consistent with Mercy Corps policies, including position descriptions, personnel orientation and professional development plans, personnel evaluation system, field, personnel policy manual, and personnel grievance procedure system.<\/li><li>Institute a disciplined culture of performance management and regular feedback between supervisors and their direct reports.<br><\/li><\/ul>Program Impact, Monitoring and Evaluation and Learning<br><ul><li>Oversee program quality and impact by ensuring programs are based on sound design principles and utilize Mercy Corps and donor required M&amp;E systems.<\/li><li>Gather evidence of program impact through robust agency standard procedures for data gathering, reporting, and evaluating program outputs and outcomes<\/li><li>Lead country team to strive for impact at country and regional level leading to sustained change based on solid systems and incorporation of learnings into programs.<\/li><li>Fulfill Mercy Corps Program Management Minimum Standards based on the organization-wide guide.<\/li><li>Ensure all interventions adhere to Mercy Corps\\u2019 Gender Policy, Do No Harm principles, and program participant accountability standards, including an effective Community Accountability Reporting Mechanism and safeguarding mechanisms across all programs.<br><\/li><\/ul>Personal Leadership<br><ul><li>Demonstrate flexibility, resilience and ability to maintain positive relationships and composure.<\/li><li>Maintain high ethical standards and treat people with respect and dignity.<\/li><li>Demonstrate awareness of his\/her own strengths and development needs.<br><\/li><\/ul>Influence &amp; Representation<br><ul><li>Maintain productive relationships with internal and external constituents such as private partners, national government, foundations, the private sector, etc.<\/li><li>Maintain productive relationships with the international community inclusive of the United Nations, International NGOs, Think Tanks, Research Institutes and Foreign Governments.<\/li><li>Anticipate needs, understand the donor pool and contribute to shaping donors\\u2019 views on humanitarian and development strategies.<\/li><li>Represent Mercy Corps programs with national and international media.<br><\/li><\/ul>Program Operations and Compliance<br><ul><li>Coordinate overall country budget; manage budget within approved spending levels and establish an annual cash flow plan to ensure a steady and adequate supply of funds for program activities.<\/li><li>Build and maintain operational structures that ensure proper segregation of duties between finance, administration and logistics and fully support field programs.<\/li><li>Build and maintain an environment of collaboration among program, finance, operations and human resource team members resulting in optimal support for program activities.<\/li><li>Ensure program implementation is on time, target and budget, using effective M&amp;E systems to reach desired impacts.<\/li><li>Create and maintain systems ensuring effective and transparent use of financial resources for timely and informative reporting in line with donor and Mercy Corps policies and procedures.<\/li><li>Ensure compliance with donor and Mercy Corps regulations, policies and procedures, and the implementation of appropriate risk mitigation measures to reduce Mercy Corps exposure to potential risk.<br><\/li><\/ul>Security<br><ul><li>Manage security and safety of the entire country team and Mercy Corps assets according to best practices, MC operating standards and field realities.<\/li><li>Liaise with the Regional Director and Global Security Advisor on crucial events, high risk periods, incident reporting or security policy changes.<br><\/li><\/ul>Supervisory Responsibility<br><br>The Senior Management Team in Iraq<br><br>Accountability<br><br><strong>Reports Directly To: <\/strong>Regional Director<br><br><strong>Works Directly With: <\/strong>Regional team, Global Programs team, Finance and Technical Support Unit, Country Directors of Jordan, Lebanon, and Syria<br><br>Knowledge and Experience<br><ul><li>MA\/S or equivalent in social science, management, and international development preferred.<\/li><li>10 plus years of field experience in international relief and development programs with demonstrable success in managing complex emergency response and its transfer into early recovery or development.<\/li><li>Prior experience in setting country level strategy with annual implementation plans and resource managing towards the strategy.<\/li><li>Great communication skills and prior experience in building, managing and leading a team of professionals.<\/li><li>History of working effectively and respectfully with host country government, private sector, INGO and NGO partners in complex environments.<\/li><li>Excellent writing skills and experience directing successful proposal development processes with prior experience with USAID, FCDO, EU and other bilateral funding agencies.<\/li><li>Prior experience working and managing a program in a high security alert area, with demonstrated knowledge and skills to manage the security in conflict and post-conflict situations.<\/li><li>Previous work experience in the Middle East and demonstrated ability to work comfortably, and sensitively, in the environment required.<\/li><li>Proven skills in financial management.<\/li><li>English proficiency required; Arabic or Kurdish language skills preferred.<br><\/li><\/ul>Success Factors<br><br>A successful Iraq CD will provide effective leadership to the Mercy Corps team. They will have high emotional intelligence, constructive mentoring skills and proven experience with capacity building. The Country Director will be committed to long-term program sustainability and the delivery of high-impact activities at the community level. The Iraq CD will represent programmatic priorities of the team to donors and regional counterparts. Successful Mercy Corps team members have a strong commitment to teamwork and accountability, thrive in evolving and challenging environments, and make effective written and verbal communication a priority. The ability to facilitate dialogue among a diverse group of individuals with various skill sets and working styles is essential. The Iraq CD will thrive with the uncertainty the context brings and can gracefully handle difficulties, preferably with a sense of humor.<br><br>Living Conditions \/ Environmental Conditions<br><br>The position is based in Baghdad, Iraq and it requires frequent travel to offices throughout the country; in total Mercy Corps has offices in 7 governorates of Iraq. SMT members are based in Baghdad or Erbil. In Baghdad accommodation is in a guesthouse, with all efforts made to ensure a private living space for the Country Director. In Erbil team members live in shared high-rise apartment buildings with relative freedom of movement and good amenities. Elsewhere in the country, there is group accommodation with limited freedom of movement beyond the house\/office. This position is unaccompanied and is eligible for hardship and R&amp;R breaks.<br><br>Mercy Corps team members represent the agency both during and outside work hours when deployed in a field posting or on a visit\/TDY to a field posting. Team members are expected to conduct themselves in a professional manner and respect local laws, customs and MC's policies, procedures, and values at all times and in all in-country venues.<br><br><strong>Ongoing Learning<br><br><\/strong>In support of our belief that learning organizations are more effective, efficient and relevant to the communities we serve, we empower all team members to dedicate 5% of their time to learning activities that further their personal and\/or professional growth and development.<br><br><strong>Diversity, Equity &amp; Inclusion<br><br><\/strong>Achieving our mission begins with how we build our team and work together. Through our commitment to enriching our organization with people of different origins, beliefs, backgrounds, and ways of thinking, we are better able to leverage the collective power of our teams and solve the world\\u2019s most complex challenges. We strive for a culture of trust and respect, where everyone contributes their perspectives and authentic selves, reaches their potential as individuals and teams, and collaborates to do the best work of their lives.<br><br>We recognize that diversity and inclusion is a journey, and we are committed to learning, listening and evolving to become more diverse, equitable and inclusive than we are today.<br><br><strong>Equal Employment Opportunity<br><br><\/strong>Mercy Corps is an equal opportunity employer that does not tolerate discrimination on any basis. We actively seek out diverse backgrounds, perspectives, and skills so that we can be collectively stronger and have sustained global impact.<br><br>We are committed to providing an environment of respect and psychological safety where equal employment opportunities are available to all. We do not engage in or tolerate discrimination on the basis of race, color, gender identity, gender expression, religion, age, sexual orientation, national or ethnic origin, disability (including HIV\/AIDS status), marital status, military veteran status or any other protected group in the locations where we work.<br><br><strong>Safeguarding &amp; Ethics<br><br><\/strong>Mercy Corps is committed to ensuring that all individuals we come into contact with through our work, whether team members, community members, program participants or others, are treated with respect and dignity. We are committed to the core principles regarding prevention of sexual exploitation and abuse laid out by the UN Secretary General and IASC. We will not tolerate child abuse, sexual exploitation, abuse, or harassment by or of our team members. As part of our commitment to a safe and inclusive work environment, team members are expected to conduct themselves in a professional manner, respect local laws and customs, and to adhere to <strong>Mercy Corps Code of Conduct Policies<\/strong> and values at all times. Team members are required to complete mandatory Code of Conduct elearning courses upon hire and on an annual basis.\"}"
}