{
    "id":"Kaggle::techmap::61507d86681fda47d1a15599::linkedin_us::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Hiring Event will be onsite October 13th, 830 a. m. 6 p. m. 1410a N Augusta Street, Staunton, VA 24401. Sign up below for a time slot! Benefits Of Joining Our Team. We offer flexible scheduling, paid training, great benefits, competitive salary, tuition reimbursement and a diverse and inclusive culture where people of all backgrounds build the best team. Our We CARE values and Guiding Principles are the heart of who we are and how we treat each other. If you are looking for a great place to work, consider us for your next position! Click here to hear from our team. About Us. Located in the heart of a charming American small town, Staunton, VA, The Legacy at North Augusta provides a lifestyle of greater fulfillment in an exceptional assisted living senior living community. This is the true definition of southern hospitality and a welcoming environment while offering health and wellness services that are designed to maintain and maximize our residents personal comfort, independence and social engagement. Click here to learn more about the community. We will be recruiting for C. N. A. 's, DCA's, LPN's, Medication Aides, Cooks, Dishwashers, Servers and a Dining Services Supervisor. We will have full time, part time and on-call shifts to work with your schedule and availability. No experience required and recent graduates welcome. Inquire about our Sign-On Bonus for select positions! Work today and get paid tomorrow with our Rapid. Pay on Demand! Come meet our team and sign up for an interview, CLICK HERE and choose your 30 minute time slot. Please also fill out our online application prior to the event. We will be practicing safe Covid standards.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61507d86681fda47d1a15599::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"National Lutheran Communities &amp; Services\", \"position\": \"The Legacy at North Augusta Hiring Event (October 13th)\", \"notes\": \"\", \"original\": \"<strong>Hiring Event will be onsite October 13th, 830 a.m. - 6 p.m.<br><br><\/strong><strong>1410a N Augusta Street, Staunton, VA 24401<br><br><\/strong><strong>Sign up below for a time slot!<br><br><\/strong><strong>Benefits Of Joining Our Team<br><br><\/strong>We offer flexible scheduling, paid training, great benefits, competitive salary, tuition reimbursement and a diverse and inclusive culture where people of all backgrounds build the best team. Our We CARE values and Guiding Principles are the heart of who we are and how we treat each other. If you are looking for a great place to work, consider us for your next position! Click here to hear from our team.<br><br><strong>About Us<br><br><\/strong>Located in the heart of a charming American small town, Staunton, VA, <strong>The Legacy at North Augusta <\/strong>provides a lifestyle of greater fulfillment in an exceptional assisted living senior living community. This is the true definition of southern hospitality and a welcoming environment while offering health and wellness services that are designed to maintain and maximize our residents personal comfort, independence and social engagement. Click here to learn more about the community.<br><br>We will be recruiting for C.N.A.'s, DCA's, LPN's, Medication Aides, Cooks, Dishwashers, Servers and a Dining Services Supervisor. We will have full time, part time and on-call shifts to work with your schedule and availability. No experience required and recent graduates welcome.<br><br><strong>Inquire about our Sign-On Bonus for select positions!<br><br><\/strong><strong>Work today and get paid tomorrow with our RapidPay on Demand!<br><br><\/strong>Come meet our team and sign up for an interview, CLICK HERE and choose your 30 minute time slot. Please also fill out our online application prior to the event. This will assist in the interview process.<br><br>We will be practicing safe Covid standards.\"}"
}