{
    "id":"Kaggle::techmap::614f1f4b851e286af097a6ca::linkedin_jp::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Inclusion of masculine leaning terms like \"lead\" and \"strong\"",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 7 years experience, pure sales (both direct and indirect) or Business Development for accounts. Proven knowledge in selling consumer goods within both online and retail capacity with experience of the leading Consumer Electronics retailers (Amazon, Yodobashi, Bic, Yamada, GEO). Business level English. Strong internal and external communication management skills. Well to understand Merchandizing program for retail store. 4 Cs (confidence, commitment, closing, control). Knowledge of digital marketing and sales. Negotiation experience in retail & distribution agreements. Ability to lead and inspire clients. Can clearly illustrate ROI, in tandem to building strong relationships with key stakeholders. Preferred Qualification. Data analytics.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f1f4b851e286af097a6ca::linkedin_jp\", \"source\": \"linkedin_jp\", \"country\": \"JP\", \"company\": \"Facebook\", \"position\": \"FRL AR\/VR Strategic Account Manager, Japan\", \"notes\": \"\", \"original\": \"Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.<br><br>Facebook is looking for a hardworking, proactive Account manager to drive revenue growth within sales accounts in an exciting high paced environment. The position will involve building and leveraging strong retail relationships in Japan retail market in support of the Facebook hardware vision. This person will be charged with developing and executing a comprehensive sales strategy at the customer level as a subset of the overall organizational vision.The Account manager is responsible for delivering revenue and exceeding sales targets through a combination of direct and partner selling activities.<br><br><strong><u>Responsibilities<br><\/u><\/strong><ul><li>Working with our key strategic partners across many industries (retail, EC, etc). Manage Online\/EC and Physical store both at retails<\/li><li>Create sales plan, work with clients, collaborate in house, close deals<\/li><li>Plan all new product launches in collaboration with marketing and business operations, deliver clear and concise communication and plan to partners<\/li><li>Identify and develop new business opportunities, business models and channels to extend AR\/VR market reach that drives new revenue<\/li><li>Represent FACEBOOK with the utmost amount of professionalism and effectively establish and grow relationships at an executive level (VP and above) with partners<\/li><li>Accomplish individually assigned Sales half year goals.<\/li><li>Communicate effectively with HQ, contracts, legal, etc<\/li><li>Own inventory planning with forecast management for named retailers.<\/li><li>Manage quarterly Joint Business Plan process.<\/li><li>Manage annual promo budget and reconciliation process allocation and reconciliation process<\/li><li>Review Sell In\/Out data to identify new opportunities within existing product ranges.<\/li><li>Develop retail merchandising and branding in store and online to promote the FACEBOOK products work with Channel marketing members<\/li><li>Maintain sales placement at new accounts and new stores<br><\/li><\/ul><strong>Minimum Qualification<br><\/strong><ul><li>Project management experience<\/li><li>Strong and compelling presentation skills<\/li><li>7+ years\\u2019 experience, pure sales (both direct and indirect) or Business Development for accounts<\/li><li>Proven knowledge in selling consumer goods within both online and retail capacity with experience of the leading Consumer Electronics retailers (Amazon, Yodobashi, Bic, Yamada, GEO)<\/li><li>Business level English<\/li><li>Strong internal and external communication management skills<\/li><li>Well to understand Merchandizing program for retail store<\/li><li>4 Cs (confidence, commitment, closing, control)<\/li><li>Knowledge of digital marketing and sales<\/li><li>Negotiation experience in retail &amp; distribution agreements<\/li><li>Ability to lead and inspire clients<\/li><li>Can clearly illustrate ROI, in tandem to building strong relationships with key stakeholders<br><\/li><\/ul><strong><u>Preferred Qualification<br><\/u><\/strong><ul><li>Data analytics<\/li><\/ul>\"}"
}