{
    "id":"Kaggle::techmap::61531b03efaba73ff54e72b5::cvlibrary_uk::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The job description emphasises initiatives and support specifically for women in technology, such as a mentoring scheme, women's network forum, and events to inspire girls in tech. This focus on female-specific programs could be seen as subtly favouring female candidates.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You care about outcomes, not output. You love data and see the power in data-driven decisions. Who are Proagrica? Proagrica is a global provider of independent connectivity and data-driven support solutions for the agriculture and animal health industries. We deliver actionable intelligence to drive business growth across the value chain. Our superior products and services connect and empower industry participants to address their key needs around trading, productivity, and compliance. Our solutions are built around the key competences of data connectivity and data analytics delivering seamless supply chain management, supply chain standards compliance, and customer insight and engagement, essential for businesses looking to improve their value offering and expand in the modern marketplace. Proagrica is part of LexisNexis Risk Solutions Group (RSG), we are passionate about an environment focused on innovation, real passion for our products, and teamwork, where working in an agile manner is par for the course. RSG is part of RELX, a FTSE100 global provider of data, information, and solutions for professional customers. RELX has recently been ranked by Forbes as 53 in their Top-2000 Global Employers and is also listed in Forbes Top-100 Most Innovative Businesses. Women in technology: RSG is very supportive of women in Technology and has been a founding signature for the Tech Talent Charter. We have the following initiatives in place to support women in technology: Mentoring scheme for women in technology. Women's network forum. Regularly run events for schools about careers in technology to inspire the next generation of girls in tech. Women in Technology Employee Resource Group (ERG)We are an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact or if you are based in the US you may also contact us on (phone number removed).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61531b03efaba73ff54e72b5::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"LexisNexis Risk Solutions Group\", \"position\": \"Product Technology Operations Director\", \"notes\": \"\", \"original\": \"Global Product Technology Operations Director<br> <br> Proagrica<br> <br> Sutton, Greater London<br> <br> Proagrica<br> <br> Explore how you can grow<br> <br> The future of food sustainability is complex. That&#39;s why over 20,000 customers across five continents rely on our cutting-edge networks, workflow tools and analytics platform to drive change. The key to our success is our ability to empower people to revolutionize the agri-food and animal health supply chains. So if you bring curiosity, ambition and inventiveness, we&#39;ll help you think big, aim high, and explore more with Proagrica<br> <br> We are looking for a Product Technology Operations Director to take the lead in establishing and managing our work operations across our product technology group.<br> <br> You will lead the effort to unify our technology operations and processes. You would be responsible for the overall program management of Proagrica investment cases, key projects as well as our technology operating model.<br> <br> Reporting to the VP of Technology and working with senior stakeholders to manage the program of work across Proagrica at the leadership team level, building data collection pipelines for governance and visibility, and building new tools to enable better data driven decision making.<br> <br> You will work closely with the technology leadership team across Proagrica, specifically helping our product delivery leaders to gain visibility on workforce, assets and roadmaps. Reviewing delivery milestones, calling out risks and celebrating successes.<br> <br> In your first year you will define and drive the evolution of our operating models, rooted in a common SDLC across our many teams. You will champion change, process, and visibility across our technology group, designing and owning the change process, ensuring engagement and commitment from the whole of the technology group. You will liaise with and bring together sales, product and technology leaders and facilitating their alignment, driving ownership and accountability and supporting them with facts to make data driven decisions.<br> <br> Responsibilities<br><br>Manage the capital investment process and technology governance model<br>Architecting and owning the operating model and common SDLC definitions<br>Create a view of dependencies and interfaces between projects across the portfolio, and proactively monitor progress, highlighting issues and initiating appropriate corrective action<br>Owning the single source of truth across the portfolio to drive informed management decisions<br>Critically analysing portfolio performance to provide insights, highlighting patterns and areas of risk to senior management<br>Managing a robust Change Control across the portfolio, ensuring the upcoming changes are impacted and assessed appropriately against delivery plans, budget and scope<br>Aligning and working within the Product Technology Governance &amp; Operating framework, ensuring standards (tools, documents and templates) and processes are in place and adhered to<br>Work with the Tech Leadership Team to drive technical strategy and culture into the operating model<br>Work with directors and managers to understand requirements for tools they need to better utilize internal data<br>Create outputs (visualizations, reports, etc) that can be understood by various target audiences<br>Work with tech, finance, product and sales leaders to integrate cross-discipline datasets to better understand business context<br>Empower the staff to be accountable and responsible for their own actions and decisionsKey Skills<br><br>Excellent organization\/project planning, time management, risk and change management skills across multiple functional groups and departments, and excellent delegation skills involving prioritizing and reprioritizing projects and managing projects of various size and complexity. Experience supporting large complex portfolios and\/or programs<br>Data data data - you should be comfortable working with data schemas and the data itself, in multiple tools.<br>Design and work with complex data models<br>Encourage diverse ideas and perspectives from a variety of sources to create better solutions, products, and services<br>Strong analytical capabilities, especially with regards to data. Structuring, analyzing and presenting conclusions<br>Good knowledge of the software development life cycle, and technology operating models<br>Ability to work with people to build better communications, processes and relationships<br>Basic understanding of corporate finance<br>Ability to leverage technical metrics to drive effective business decisions<br>Proven ability to adapt to new roles and responsibilities<br>Excellent communication (verbal and written) and customer service skills. Strong interpersonal, communication, and presentation skills applicable to a wide audience including senior and executive management, customers, etc., including diction\/terminology and presenting information in a concise and effective manner to clients, management, and various departments using assorted communication mediums<br>Experience of support or working in an agile development environment an advantageKey Behaviours<br><br>Positive attitude and the ability to assume best intent in all conversations<br>Frequent, open and honest communication, written and verbal<br>Ability to collaborate globally across time zones<br>Foster a culture of ownership and accountability<br>Ability to recognize, learn from, and celebrate both successes and failures<br>Ability to get the right people in the same room at the right time<br>You value products over projects<br>You care about outcomes, not output<br>You love data and see the power in data-driven decisionsWho are Proagrica?<br> <br> Proagrica is a global provider of independent connectivity and data-driven support solutions for the agriculture and animal health industries. We deliver actionable intelligence to drive business growth across the value chain. Our superior products and services connect and empower industry participants to address their key needs around trading, productivity, and compliance. Our solutions are built around the key competences of data connectivity and data analytics delivering seamless supply chain management, supply chain standards compliance, and customer insight and engagement, essential for businesses looking to improve their value offering and expand in the modern marketplace.<br> <br> Proagrica is part of LexisNexis&reg; Risk Solutions Group (RSG), we are passionate about an environment focused on innovation, real passion for our products, and teamwork, where working in an agile manner is par for the course. RSG is part of RELX, a FTSE100 global provider of data, information, and solutions for professional customers; RELX has recently been ranked by Forbes as #53 in their Top-2000 Global Employers and is also listed in Forbes Top-100 Most Innovative Businesses.<br> <br> Women in technology:<br> <br> RSG is very supportive of women in Technology and has been a founding signature for the Tech Talent Charter. We have the following initiatives in place to support women in technology:<br><br>Mentoring scheme for women in technology<br>Women&#39;s network forum<br>Regularly run events for schools about careers in technology to inspire the next generation of girls in tech.<br>Women in Technology Employee Resource Group (ERG)We are an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact or if you are based in the US you may also contact us on (phone number removed)<br><br>\"}"
}