{
    "id":"Kaggle::techmap::614c43e0bfb8e7511d3b0046::careerbuilder_us::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Adecco is hiring immediately for General Labor Associates at a local client in Bowling Green, KY. In this role, you will assist machine operators with gathering production supplies, packaging materials, and loading equipment, assist in hand-packing and hand-stacking product\/cases onto pallets, operate cardboard baler, manual pallet jacks and other equipment, and perform other duties as required. Requirements: Must be at least 18 years of age. High School Diploma or GED equivalent. Experience in manufacturing of goods. Must be able to follow verbal and written instructions. Must be able to perform basic math skills. Ability to stand and\/or walk for the entire shift. Must be able to stand, stoop, and bend frequently. Must be able to work in an environment with temperature ranges from 40 to 85 degrees. Must be able to work in a wet environment. Must be able to lift up to 50 lbs. What's in this for you? Weekly pay starting at $14. 00\/hr. Multiple shifts available. Benefits after 1 week. medical, dental, vision, options. Click on apply now for immediate consideration for these General Labor positions in Bowling Green, KY! Equal Opportunity Employer\/Veterans\/Disabled. To read our Candidate Privacy Information Statement, which explains how we will use your information, please navigate to [Link available when viewing the job] \/>. The Company will consider qualified applicants with arrest and conviction records.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c43e0bfb8e7511d3b0046::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Adecco USA\", \"position\": \"General Labor\", \"notes\": \"\", \"original\": \"Adecco is hiring immediately for General Labor Associates at a local client in Bowling Green, KY. In this role, you will assist machine operators with gathering production supplies, packaging materials, and loading equipment, assist in hand-packing and hand-stacking product\/cases onto pallets, operate cardboard baler, manual pallet jacks and other equipment, and perform other duties as required.<br \/> <br \/> Requirements:<br \/> <li>Must be at least 18 years of age<\/li> <li>High School Diploma or GED equivalent<\/li> <li>Experience in manufacturing of goods<\/li> <li>Must be able to follow verbal and written instructions<\/li> <li>Must be able to perform basic math skills<\/li> <li>Ability to stand and\/or walk for the entire shift<\/li> <li>Must be able to stand, stoop, and bend frequently<\/li> <li>Must be able to work in an environment with temperature ranges from 40 to 85 degrees<\/li> <li>Must be able to work in a wet environment<\/li> <li>Must be able to lift up to 50 lbs.<\/li> \\u00a0<br \/> What's in this for you?<br \/> <li>Weekly pay starting at $14.00\/hr.<\/li> <li>Multiple shifts available<\/li> <li>Benefits after 1 week - medical, dental, vision, options<\/li> \\u00a0<br \/> Click on apply now for immediate consideration for these General Labor\\u00a0positions in Bowling Green, KY!<br \/><br \/>Equal Opportunity Employer\/Veterans\/Disabled<br \/><br \/>To read our Candidate Privacy Information Statement, which explains how we will use your information, please navigate to [Link available when viewing the job] \/><br \/>The Company will consider qualified applicants with arrest and conviction records <br \/><br \/>&nbsp;\"}"
}