{
    "id":"Kaggle::techmap::6151cebcad864b3454ed00cf::linkedin_ne::0",
    "label_age":true,
    "analysis_age":"The description's emphasis on recruiting a \"talented young professional\" subtly favours younger candidates, potentially excluding older, equally qualified individuals from considering the role.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Your job. Kempen is an international investment bank, headquartered in Amsterdam, The Netherlands. This specific vacancy is in the Corporate Advisory team, which is part of Kempen Corporate Finance. The Corporate Advisory team serves both institutional and private clients across a wide variety of sectors in the Benelux. Our private customers are primarily family and director-owned companies, and are generally also clients of Van Lanschot Private Banking. While the team primarily focuses on M&A (and in particular sell-side transactions), they also execute capital market transactions such as IPOs and delistings. For this team, we are looking for a talented young professional who has the ambition to develop their commercial and project management skills in a dynamic team. Alongside Kempen Corporate Advisory, the corporate finance department constists of several specific sector teams, including European Real Estate, Life Sciences & Healthcare, Tech & Fintech and Infrastructure & Renewables. Besides the sector teams, the team also works closely with the capital markets advisory teams, which provide both ECM and Debt Advisory. In this way, Kempen Corporate Finance can offer its clients distinctive and integrated propositions. An important element of this is our independent position as an advisor. Our broad knowledge and international experience allow us to provide our clients with relevant, added value, while striving to exceed their expectations. In 2020, a tumultuous year, we completed 41 transactions with a total value of more than €23 billion. You'll Apply Your Entrepreneurial Spirit And Dedication To. As an Analyst in the Corporate Advisory team, you will work in close partnership with your colleagues to win new commissions and clients and implement transactions. You will also be encouraged to contribute creative ideas. Are you interested in reaping the full benefits of this position, and making a difference for our clients. Analysing company and market information. Performing detailed valuation and financial analyses. Preparing presentations for clients and\/or other advisors. Preparing transaction documentation, including bid letters, contracts and memos. Information memoranda for sales processes. And prospectuses for capital market transactions. Managing due diligence processes for mergers, acquisitions and capital market transactions. And. Maintaining contact with clients and external advisors during transactions. You will work in teams on the execution of different types of transactions as well as conduct strategic studies and prepare pitches to win new mandates. Your Experience. We are looking for candidates with a masters degree and  more importantly  affinity with the financial sector.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6151cebcad864b3454ed00cf::linkedin_ne\", \"source\": \"linkedin_ne\", \"country\": \"NE\", \"company\": \"Van Lanschot Kempen\", \"position\": \"Analyst Corporate Finance \/ Corporate Advisory(EN)\", \"notes\": \"\", \"original\": \"<strong>Your job<br><br><\/strong>Kempen is an international investment bank, headquartered in Amsterdam, The Netherlands. This specific vacancy is in the Corporate Advisory team, which is part of Kempen Corporate Finance. The Corporate Advisory team serves both institutional and private clients across a wide variety of sectors in the Benelux. Our private customers are primarily family and director-owned companies, and are generally also clients of Van Lanschot Private Banking. While the team primarily focuses on M&amp;A (and in particular sell-side transactions), they also execute capital market transactions such as IPOs and delistings. For this team, we are looking for a talented young professional who has the ambition to develop their commercial and project management skills in a dynamic team.<br><br>Alongside Kempen Corporate Advisory, the corporate finance department constists of several specific sector teams, including European Real Estate, Life Sciences &amp; Healthcare, Tech &amp; Fintech and Infrastructure &amp; Renewables. Besides the sector teams, the team also works closely with the capital markets advisory teams, which provide both ECM and Debt Advisory. In this way, Kempen Corporate Finance can offer its clients distinctive and integrated propositions.<br><br>An important element of this is our independent position as an advisor. Our broad knowledge and international experience allow us to provide our clients with relevant, added value, while striving to exceed their expectations. In 2020, a tumultuous year, we completed 41 transactions with a total value of more than \\u20ac23 billion.<br><br><strong><u>You'll Apply Your Entrepreneurial Spirit And Dedication To<br><br><\/u><\/strong>As an Analyst in the Corporate Advisory team, you will work in close partnership with your colleagues to win new commissions and clients and implement transactions. You will also be encouraged to contribute creative ideas. Are you interested in reaping the full benefits of this position, and making a difference for our clients.<br><ul><li>Analysing company and market information;<\/li><li>Performing detailed valuation and financial analyses;<\/li><li>Preparing presentations for clients and\/or other advisors;<\/li><li>Preparing transaction documentation, including bid letters, contracts and memos; information memoranda for sales processes; and prospectuses for capital market transactions;<\/li><li>Managing due diligence processes for mergers, acquisitions and capital market transactions; and<\/li><li>Maintaining contact with clients and external advisors during transactions. <br><\/li><\/ul>You will work in teams on the execution of different types of transactions as well as conduct strategic studies and prepare pitches to win new mandates.<br><br><strong><u>Your Experience<br><br><\/u><\/strong>We are looking for candidates with a master\\u2019s degree and \\u2013 more importantly \\u2013 affinity with the financial sector. You have excellent analytical capabilities, excellent communication skills and you are a real team player. You have commercial insight, are proactive, see opportunities and dare to take the initiative. You prefer project-based work, are not afraid of deadlines and are willing to take chances. Are you result-oriented and driven? Do you think you fit in our organization and do you want to take the challenge?<br><br>Your profile<br><ul><li>Scientific or financial master\\u2019s degree;<\/li><li>Strong affinity and experience with the financial sector;<\/li><li>Between one and two years working experience;<\/li><li>Above average grades;<\/li><li>Fluent in English (Dutch is an advantage);<\/li><li>Extracurricular activities; and<\/li><li>Strong communication skills.<br><\/li><\/ul><strong><u>Our Company<br><br><\/u><\/strong>Kempen is an international investment bank, headquartered in Amsterdam, The Netherlands. We are part of Van Lanschot Kempen and employ around 450 people in our offices in Amsterdam, New York, London, Antwerp and Paris. We are specialised in Corporate Finance, Securities and Asset Management. Kempen represents professionalism, entrepreneurship and drive.<br><br>To work in a sustainable and future-oriented way, inclusion and diversity are essential. A highly inclusive and diverse workforce helps to drive business performance and innovation, workforce agility and resilience, as well as positive social and environmental impact. It is our ambition for the inflow of each department to be more diverse than the outflow. For example, if an employee leaves or more headcount becomes available, we aim to increase diversity by hiring someone who brings something new to the team. Whether that\\u2019s gender, age, nationality, background or anything else.<br><br>In addition, our purpose is to create sustainable value for all our stakeholders in a way that contributes to sustainable solutions to the most pressing global challenges. We believe that preserving and growing wealth in a sustainable way is a peoples job.<br><br><strong>We offer<br><br><\/strong><strong><u>To Reflect This, We Offer Attractive Terms Of Employment With a Focus On The Future, Personal And Professional Development, And Plenty Of Flexibility<br><br><\/u><\/strong>Turning talent into value. That's what we do. The fact is, if you add value, you can obviously expect the same from us in return. Our employees are our most important asset, so they have countless opportunities to grow both as individuals and in their professional fields.<br><ul><li>A salary that matches your knowledge, experience and background; <\/li><li>With a flexible budget (consisting of vacation pay, 13th month and 7 non-statutory vacation days) you can partly put together your secondary employment conditions with us. Think of extra leave, discover the world with a sabbatical, a subscription at the gym or a new bicycle; it's all possible;<\/li><li>The possibility to take a longer period like a sabbatical, or to spend a longer period at home with your children or, for example, to take care of a family member if necessary; <\/li><li>We finance part of the childcare for working mothers; <\/li><li>Do you want to exchange Good Friday, Easter Monday, Ascension Day and Whit Monday for another religious holiday? That is also possible! <\/li><li>A training costs scheme for personal and professional training opportunities <br><\/li><\/ul><strong>Interested?<br><br><\/strong>Are you ready to join us and make the difference? Do you want to acquire skills and experience at our leading firm? And are you committed to growing alongside us and our clients? If you can answer a resounding yes to all three questions, we\\u2019d love to meet you.<br><br>Do you have questions or do you want to have more information? Please contact Sophie via s.koopman@vanlanschotkempen.com.<br><br>Unlock your full potential\"}"
}