{
    "id":"Kaggle::techmap::615ac3fb85c64c0517b6aede::linkedin_iq::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The term \"him\/her\" introduces sexuality bias by not including non-binary or gender non-conforming individuals, thereby assuming a binary understanding of gender.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" ROLE PURPOSE: The job holder is responsible for supporting and functionalizing of MEAL in Education in Emergencies project by designing and implementing a robust MEAL system. He\/she will adequately plan, monitor, and report in an accurate and timely manner on the program performance. In collaboration with the MEAL Manager, Head of MEAL, Programme team and partners, the job holder ensures that the Programme undertakes effective MEAL system through routine monitoring & data quality assessment, information sharing, collecting, tracking and responding to feedback and complaints from Programme stakeholders. The job holder will also work with partners to periodically collect information on impact, satisfaction and ensure learning among partners. The role holder will be required to travel to partner and SCI field offices in Iraq and KRI to provide on-site support and expected to work outside the normal role profile and be able to vary working hours accordingly. SCOPE OF ROLE: Reports to: MEAL Manager. Staff reporting to this post: None. Role Dimensions: The position involves working closely with the MEAL manager, Project Managers, Localisation officer, project team, Partners, Education cluster and MEAL working group. The MEAL Officer will routinely update project teams on project performance and externally communicates with relevant stakeholders in relations to joint monitoring, support supervision, mentorship and tracking project performance. The position will also involve communication with members' MEAL contacts for a harmonised implementation of MEAL activities and approaches as well ensuring effective and systematic use of the MELA system both by MEAL and the programme team. KEY AREAS OF ACCOUNTABILITY : Program design:. Assess the needs and capacities of the target communities, especially in Education, Child rights, child protection for benchmarking the response activities. Actively involved in participatory community's problem analyses for program design through outcome mapping, learning events etc. Document critical lessons and challenges to be used for programme decision and future intervention. Set up a strong MEAL system and operationalize MEAL in the EiE response. In close collaboration with the HoM, MEAL manager, Education Program Manager and TS put in place an operational MEAL system including setting up of project based mechanisms to monitor and document the progress of the implementation of programme activities, Specifically. Lead the design\/ review of MEAL pack, to include the Indicator Performance Tracking Table, Log frame, Activity Tracking Table and MEAL plan.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615ac3fb85c64c0517b6aede::linkedin_iq\", \"source\": \"linkedin_iq\", \"country\": \"IQ\", \"company\": \"Save the Children International\", \"position\": \"MEAL Officer\", \"notes\": \"\", \"original\": \"<p><strong>ROLE PURPOSE: <br><\/strong> The job holder is responsible for supporting and functionalizing of MEAL in Education in Emergencies project by designing and implementing a robust MEAL system. He\/she will adequately plan, monitor, and report in an accurate and timely manner on the program performance. In collaboration with the MEAL Manager, Head of MEAL, Programme team and partners, the job holder ensures that the Programme undertakes effective MEAL system through routine monitoring &amp; data quality assessment, information sharing, collecting, tracking and responding to feedback and complaints from Programme stakeholders. The job holder will also work with partners to periodically collect information on impact, satisfaction and ensure learning among partners <br><br><\/p><p>The role holder will be required to travel to partner and SCI field offices in Iraq and KRI to provide on-site support and expected to work outside the normal role profile and be able to vary working hours accordingly.<br><br><\/p><p><strong>SCOPE OF ROLE: <br><br><\/strong><\/p><p><strong>Reports to:<\/strong> MEAL Manager <br> <strong>Staff reporting to this post: <\/strong>None<br> <strong>Role Dimensions:<\/strong> The position involves working closely with the MEAL manager, Project Managers, Localisation officer, project team, Partners, Education cluster and MEAL working group. The MEAL Officer will routinely update project teams on project performance and externally communicates with relevant stakeholders in relations to joint monitoring, support supervision, mentorship and tracking project performance. The position will also involve communication with members' MEAL contacts for a harmonised implementation of MEAL activities and approaches as well ensuring effective and systematic use of the MELA system both by MEAL and the programme team.<br><br><\/p><p><strong>KEY AREAS OF ACCOUNTABILITY : <br> Program design:<br><\/strong> * Assess the needs and capacities of the target communities, especially in Education, Child rights, child protection for benchmarking the response activities. <br> * Actively involved in participatory community's problem analyses for program design through outcome mapping, learning events etc <br> * Document critical lessons and challenges to be used for programme decision and future intervention. <br><br><\/p><p><strong>Set up a strong MEAL system and operationalize MEAL in the EiE response<br><\/strong> * In close collaboration with the HoM, MEAL manager, Education Program Manager and TS put in place an operational MEAL system including setting up of project based mechanisms to monitor and document the progress of the implementation of programme activities, Specifically;<br> * Lead the design\/ review of MEAL pack, to include the Indicator Performance Tracking Table, Log frame, Activity Tracking Table and MEAL plan. Maintain an updated Programme Indicator Performance Tracker Table (IPTT) and Output tracker, in additional other report requirements as may be requested.<br> * Provide technical guidance and lead capacity building of the Programme staff, partners and stakeholders on implementation of MEAL activities within the programme; to include capacities for data collection, storage, analysis, indicator definition and reporting. <br> * Lead Quality Benchmark monitoring and ensure actions plans agreed on after QB monitoring are implemented in a timely manner. Provide feedback on monthly action plan tracker to the project manager<br><br><\/p><p><strong>Design and operationalize Accountability mechanism <br><\/strong> * Support the response and advocacy and communications teams in the development of information sharing materials\/briefs, posters and brochures, and dissemination of the project information materials to relevant stakeholders, partners and beneficiaries.<br> * Facilitate the project staff to set up relevant contextualized feedback and complaints infrastructures, mechanisms, and approaches to receive feedback and complaints from beneficiaries including children<br> * Collect and manage complaints and feedback in close coordination with the program staff. Track timeliness of response to complaints and maintain an updated project complaints tracker<br> * Adopt Child Safe Guarding and Safe programming into accountability mechanisms for the response<br> * Ensure that relevant data collection exercises with human subjects is submitted ethical considerations, per Save the Children's Ethics Policy with the view of preventing harm and ensure informed consent. <br> * Complying with and promoting all Save the Children Global policies such as Child Safeguarding, Whistle blowing, Fraud, and Health and Safety.<br><br><\/p><p><strong>Integrate ICT in the project MEAL system <br><\/strong> * Enhance use of digital data management, through use of Kobo, ODK, or other programs.<br> * Ensure safeguards and integrity of data management on MIS and\/or other online platforms inline with the protection policy.<br><br><\/p><p><strong>Build culture of Learning and Knowledge Management<br><\/strong> * Participate\/coordinate in the design of quantitative and qualitative participatory evaluations (baseline, annual and final evaluations), assessments, reviews and other special studies in conjunction with Save the Children technical staff and partners.<br> * Facilitate documentation of the programms results, impact, best practices and the most significant changes. <br> * Document learnings and best practices; disseminate learnings, reports, publications and participate in learning sessions, and ensuring that the lessons learnt are utilized to inform programming and advocacy, in line with Save the children learning Agenda and country strategic plan and approach.<br> * Support conceptualization and planning of learning events\/activities <br> * Pull out the country learning agenda and customise them to the specific program learning questions to be used by program staff.<br> * Ensure and spearhead program reflection meetings on quarterly, Bi-annually and annually while reviewing the leaning Agenda and check if the available data answers the learning questions.<br><br><\/p><p><strong>Planning, Budgeting and Reporting:<br><\/strong> * Generate and propose MEAL activities that requires budget to be including during planning and Budget allocation.<br> * Oversee the MEAL budget utilization, and ensure timely implementation MEAL activities.<br><br><\/p><p><strong>Communication and Networking <br><\/strong> * Facilitate and sustain positive working relationships internally with other technical staff; externally with government and CSO partners, and other stakeholders, and also maintain an up to date understanding of key development trends in the project area.<br> * Represent the project in various thematic coordination fora as may be requested by the line manager. <br> * Ensure coordination with the government activities and structures in the implementation of the projects<br> * Coordinate regularly and solicit support from other MEAL to ensure programms expectations and requirements are met.<br><br><\/p><p><strong>Capacity building of program teams<br><\/strong> * Identify the capacity gaps and needs of the project and partners' staff in MEAL, program quality and utilization of the MEAL system.<br> * Develop a learning\/capacity building matrix to ensure teams capacity are built through continuous mentorship, coaching, training etc.<br> * Track performance of the team based on the capacity areas built <br><br><\/p><p><strong>BEHAVIOURS (Values in Practice)<br> Accountability:<br><\/strong> * holds self accountable for making decisions, managing resources efficiently, achieving and role modelling Save the Children values<br> * holds the team and partners accountable to deliver on their responsibilities - giving them the freedom to deliver in the best way they see fit, providing the necessary development to improve performance and applying appropriate consequences when results are not achieved.<br> <strong>Ambition:<br><\/strong> * sets ambitious and challenging goals for themselves and their team, takes responsibility for their own personal development and encourages their team to do the same<br> * widely shares their personal vision for Save the Children, engages and motivates others<br> * future orientated, thinks strategically and on a global scale.<br> <strong>Collaboration:<br><\/strong> * builds and maintains effective relationships, with their team, colleagues, Members and external partners and supporters<br> * values diversity, sees it as a source of competitive strength<br> * approachable, good listener, easy to talk to.<br> <strong>Creativity:<br><\/strong> * develops and encourages new and innovative solutions<br> * willing to take disciplined risks.<br> <strong>Integrity:<br><\/strong> * honest, encourages openness and transparency; demonstrates highest levels of integrity<br><br><\/p><p><strong>QUALIFICATIONS AND EXPERIENCE<br><\/strong> * At least 2 year experience in M&amp;E with other NGO or Private Organization;<br> * Willingness and ability to work efficiently with a wide diverse group of people.<br> * Familiarity with the governorate and communities, and ability to travel to all the target districts in the program area.<br> * University or College Graduate. <br> * Trained in data management and with at least one year experience working with Excel managing databases. <br> * Familiarity with project frameworks [design\/implementation\/M&amp;E] cycle. <br> * Experience in quantitative and qualitative data collection (M&amp;E methods) and data analysis.<br> * Experience in working through consultative and participatory processes and ability to balance multiple competing interests to work towards a common goal.<br> * Politically and culturally sensitive with qualities of patience, tact, and diplomacy.<br> * Ability to work simultaneously with multiple tasks, beside Good reporting skills.<br> * Working ability with tight deadlines and in a fast growing program environment.<br> * Proven technical knowledge and skills in the field of procurement.<br> * Excellent interpersonal and communication skills &amp; problem solving skills.<br> * Fluent in Arabic; good oral and written English\/ and Kurdish is preferable.<br> * Computer literate and strong organizational skills excellent sense of judgment, humor and patience.<br> * Commitment to and understanding of Child Rights and Save the Children's aims, values and principles including rights-based approaches.<br><br><\/p><p><strong>The Organisation<br><\/strong> We employ approximately 25,000 people across the globe and work on the ground in over 100 countries to help children affected by crises, or those that need better healthcare, education and child protection. We also campaign and advocate at the highest levels to realise the right of children and to ensure their voices are heard. <br><br><\/p><p>We are working towards three breakthroughs in how the world treats children by 2030:<br> * No child dies from preventable causes before their 5th birthday <br> * All children learn from a quality basic education and that,<br> * Violence against children is no longer tolerated <br><br><\/p><p>We know that great people make a great organization, and that our employees play a crucial role in helping us achieve our ambitions for children. We value our people and offer a meaningful and rewarding career, along with a collaborative and inclusive workplace where ambition, creativity, and integrity are highly valued. <br><br><\/p><p><strong>Application Information:<br><\/strong> Please apply using a cover letter and up-to-date CV as a single document. Please also include details of your current remuneration and salary expectations. <br><br><\/p><p>We need to keep children safe so our selection process, which includes rigorous background checks, reflects our commitment to the protection of children from abuse.<br><br><\/p><p><strong>Save the Children does not charge a fee at any stage of the recruitment process.<br><br><\/strong><\/p>\"}"
}