{
    "id":"Kaggle::techmap::61362a37fef18f227133fff9::itjobslist_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"$2, 000 sign on bonus current\/valid Gun Permit holders $500 upon 4-month anniversary. $500 upon 8-month anniversary. $1000 upon 12-month anniversary. Pay Range: $19. 00 - $23. 00 based on Experience, Qualification, and TrainingESSENTIAL JOB FUNCTIONS: Driving automatic and\/or standard shift vehicles from 8, 000 to 36, 000 pounds a minimum of 4 hours per day, 5 days per week, in accordance with a designated route, making stops at a minimum of 30 customer locations. Servicing ATM machines on a set schedule, including re-supplying replenishing, retrieving deposits, and monetarily balancing the machine. Picking up\/delivering customer change orders\/deposits carrying a minimum of 50 pounds by hand or up to several hundred pounds by cart, a minimum of 30 stops per day for a minimum of 4-5 hours, 5 days per week. Loading\/unloading vehicle cargo consisting of multiple bags and boxes of coins, weighing as much as 50 pounds per item, 5-6 days per week. Counting items, recording amounts and serial numbers, signing and dating receipts and manifests, sorting individual cargo items by route. Other duties assigned. PERFORMANCE REQUIREMENTS: Ability to repeatedly perform heavy lifting and carrying items by hand in an unrestricted manner for covering significant distances (several yards). Ability to push\/pull dollies\/carts loaded with cargo weighing up to several hundred pounds. Unrestricted ability to bend, stoop, squat, stand, walk, climb, twist, turn and reach out. Ability to operate a motor vehicle safely in accordance with Driver Physical Qualifications established by the US Department of Transportation, Federal Highway Administration. WORKING CONDITIONS: Full-time schedule possibly consisting of an average of 50 hours\/week. Approximately 90-95 percent of work performed in vehicle within individual compartments (front and rear). Exposure to wet and dry conditions, extreme heat and cold, constant vehicle and traffic noise and possibly to gasoline\/diesel fumes. Loomis is an equal opportunity employer. EEO A. A M\/F\/Vet\/Disability. Drug Free Workplace. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, protected veteran status or disability.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61362a37fef18f227133fff9::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"Loomis Armored US, LLC\", \"position\": \"Armored Service Technician\", \"notes\": \"\", \"original\": \"<b>$2,000 sign on bonus current\/valid Gun Permit holders<\/b><ul><li><b>$500 upon 4-month anniversary.<\/b><\/li><li><b>$500 upon 8-month anniversary<\/b><\/li><li><b>$1000 upon 12-month anniversary<\/b><\/li><\/ul><b>Pay Range: $19.00 - $23.00 based on Experience, Qualification, and Training<\/b><b>ESSENTIAL JOB FUNCTIONS:<\/b><ul><li>Driving automatic and\/or standard shift vehicles from 8,000 to 36,000 pounds a minimum of 4 hours per day, 5 days per week, in accordance with a designated route, making stops at a minimum of 30 customer locations.<\/li><li>Servicing ATM machines on a set schedule, including re-supplying replenishing, retrieving deposits, and monetarily balancing the machine.<\/li><li>Picking up\/delivering customer change orders\/deposits carrying a minimum of 50 pounds by hand or up to several hundred pounds by cart, a minimum of 30 stops per day for a minimum of 4-5 hours, 5 days per week.<\/li><li>Loading\/unloading vehicle cargo consisting of multiple bags and boxes of coins, weighing as much as 50 pounds per item, 5-6 days per week.<\/li><li>Counting items, recording amounts and serial numbers, signing and dating receipts and manifests, sorting individual cargo items by route.<\/li><li>Other duties assigned.<\/li><\/ul><b>PERFORMANCE REQUIREMENTS:<\/b><ul><li>Ability to repeatedly perform heavy lifting and carrying items by hand in an unrestricted manner for covering significant distances (several yards).<\/li><\/ul><ul><li>Ability to push\/pull dollies\/carts loaded with cargo weighing up to several hundred pounds.<\/li><li>Unrestricted ability to bend, stoop, squat, stand, walk, climb, twist, turn and reach out.<\/li><li>Ability to operate a motor vehicle safely in accordance with Driver Physical Qualifications established by the US Department of Transportation, Federal Highway Administration<\/li><\/ul><p><b>WORKING CONDITIONS:<\/b><\/p><ul><li>Full-time schedule possibly consisting of an average of 50 hours\/week.<\/li><li>Full-time work at a minimum of 5 days anytime during a 7-day period.<\/li><li>Approximately 90-95 percent of work performed in vehicle within individual compartments (front and rear).<\/li><li>Exposure to wet and dry conditions, extreme heat and cold, constant vehicle and traffic noise and possibly to gasoline\/diesel fumes.<\/li><\/ul>Loomis is an equal opportunity employer. EEO AA M\/F\/Vet\/Disability. Drug Free Workplace. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, protected veteran status or disability.\"}"
}