{
    "id":"Kaggle::techmap::613ac554ee58e5261c4cb164::linkedin_pt::1",
    "label_age":true,
    "analysis_age":"The phrase \"young and dynamic team\" implicitly favours younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" - Problem-Solving and Issue Resolution. Solid Negotiations Skills. Microsoft Office (Word, Excel, PowerPoint). Strategic Thinking. Presentation Skills. Project Management. Total Cost of Ownership (TCO) Knowledge. Time Management. Local  working remotely to Brasilia, from Portugal. Schedule  Availability to work Monday to Friday, between 01 pm  10 pm (09h  18h, Brasilia time). What does our client offer? Integration in an international project and a young and dynamic team. Base salary. Meal allowance. work material. Possibility to work for the major and top 1 brands in the World. If you are looking for an opportunity where you can make a difference, then this is for you! Send us right now your up to date cv and be part of a new project!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613ac554ee58e5261c4cb164::linkedin_pt\", \"source\": \"linkedin_pt\", \"country\": \"PT\", \"company\": \"Kelly - Portugal\", \"position\": \"Junior Procurement Advisor\", \"notes\": \"\", \"original\": \"<p>Kelly Services is looking for a&nbsp;<strong>Junior&nbsp;Procurement Advisor (m\/f),<\/strong>&nbsp;to join a project for a company that is the world\\u2019s largest and most broadly-based healthcare company.<\/p><p><br><\/p><p>The&nbsp;<strong>Junior Procurement Advisor (m\/f),<\/strong>&nbsp;will serve as the front-line contact for the client. They will be responsible for working with our client\\u2019s requisitioners to understand their needs and help them navigate their request through the appropriate buying channels and approval processes, based on the client\\u2019s policies and procedures.<\/p><p><br><\/p><p>This role may manage various transactional activities as related to systems and process and is responsible for learning, understanding, and following all client policies, in addition to all policies and procedures as part of the overarching delivery model.<\/p><p><br><\/p><p><strong><u>Main responsibilities<\/u><\/strong><\/p><p>- Serve as first point of contact to listen and triage requests from the client\\u2019s requisitioner;<\/p><p>- Leverage consultative and negotiating skills to influence the client\\u2019s requisitioners in a manner that meets the broader objectives of the client and the program;<\/p><p>- Educate and remind requisitioners of the client\\u2019s spend policy guidelines and strategies;<\/p><p>- Educate client requisitioner on how to effectively purchase labor-related services and the appropriate sourcing channels;<\/p><p>- Work with client requisitioner to understand what end result is trying to be achieved through their purchase;<\/p><p>- Ensure that all key service delivery objectives are met by taking an active role in continuous improvement of service delivery processes and in maintaining and improving stakeholder experience;<\/p><p>- Proactively identify service delivery issues and coordinate timely resolution;<\/p><p>- Maintain case records in the designated technology platforms;<\/p><p>- Contribute to team meetings, and provide regular communication to outline risks and opportunities for respective areas of responsibility;<\/p><p>- Participate in internal discussions, provide category expertise, and ensure ongoing linkages with the Senior Operations Manager;<\/p><p>- Assume ownership and accountability for all assigned action items and follow-ups, and drive improvements in processes, capabilities, and systems within identified categories of spend;<\/p><p>- Use industry knowledge and economic indicators along with supply and industry data to provide guidance for cost savings with a TCO focus;<\/p><p>- Provide ownership and accountability for individual goal setting and achievement.<\/p><p><br><\/p><p><strong><u>What do you need to have?<\/u><\/strong><\/p><p>- Bachelor\\u2019s degree required;<\/p><p>- 2-4 years total work experience with an emphasis in Procurement Indirect Services, Strategic Sourcing or Category Management for the HR\/Labour and Consulting\/Professional Services categories&nbsp;<strong>(mandatory);<\/strong><\/p><p>- Fluency in Portuguese from Brazil and English (<strong>both native or C2 &gt; Written and Verbal &gt; mandatory<\/strong>);<\/p><p>-&nbsp;Business\/Financial Acumen, and&nbsp;Analytical Skills;<\/p><p>-&nbsp;Problem-Solving&nbsp;and&nbsp;Issue Resolution;<\/p><p>-&nbsp;Solid Negotiations Skills;<\/p><p>- Microsoft Office (<strong>Word, Excel, PowerPoint)<\/strong><\/p><p>- Strategic Thinking;<\/p><p>- Presentation Skills;<\/p><p>- Project Management;<\/p><p>-&nbsp;<strong>Total Cost of Ownership (TCO) Knowledge;<\/strong><\/p><p>- Time Management.<\/p><p><br><\/p><p><strong>Local&nbsp;<\/strong>\\u2013 working remotely to Bras\\u00edlia,&nbsp;<strong><u>from Portugal<\/u><\/strong><\/p><p><br><\/p><p><strong>Schedule<\/strong>&nbsp;\\u2013 Availability to work Monday to Friday, between 01 pm \\u2013 10 pm (09h \\u2013 18h, Bras\\u00edlia time)<\/p><p><br><\/p><p><strong>What does our client offer?<\/strong><\/p><p>- Integration in an international project and a young and dynamic team;<\/p><p>- Base salary + Meal allowance + work material;<\/p><p>- Possibility to work for the major and top 1 brands in the World.<\/p><p><br><\/p><p>If you are looking for an opportunity where you can make a difference, then this is for you!<\/p><p>Send us right now your up to date cv and be part of a new project!<\/p>\"}"
}