{
    "id":"Kaggle::techmap::6145b56d458d8e508baf5e4e::linkedin_tw::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"\" must provide his\/her own car\" instead of \"must capable of transport to worksites\"  - this is potentially biasing those from certain socioeconomic groups. ",
    "verified":true,
    "synthetic":false,
    "text":" This post is suitable for a Speech and Language Therapist with: A minimum of three years post graduate clinical Speech and Language Therapy experience. Clinical experience in the management of feeding, eating, drinking and swallowing disorders is essential. FEDS skills at an intermediate competency level (IASLT 2012) is essential. Clinical experience in the management of adults with an intellectual disability is desirable. Training and \/ or experience in the use of Lamh and PECS is an advantage. Working Hours. 74 hours a fortnight based on a 5 day week. Contracted hours of work are liable to change between the hours of 8am  8pm over seven days to meet the requirements of the services. The Brothers of Charity model of service is based on Personal Outcome Measures requiring employees to be flexible in their working hours to provide a quality service delivery for each individual. The Health Service is undergoing ongoing transformation and therefore it is critical that a flexible attitude to changing environments and work requirements is held by the successful candidate. Annual Leave. 29 days per annum. Remuneration. €54, 136 x 8 increments - €63, 743 per annum. Tenure. This post is temporary full-time and pensionable on a fixed term basis until the end of October 2022. Travel\/Base. The person appointed must provide his\/her own car and must furnish an indemnity from Insurers in favour of the employer. Travelling expenses at the appropriate rate will be paid in respect of travel necessarily performed in the discharge of duty. The base for this purpose will be determined on appointment. Probation. A probationary period of nine months from the date of appointment applies to the post. The employment may be terminated at any time during the probationary period should the employer find that the appointee is unsuitable to continue employment. The probation period may be extended at the employers discretion. Job Description. The Brothers of Charity Services Ireland model of service is based on Personal Outcome Measures requiring employees to be flexible both in their approach and their working hours to provide a quality service delivery for each individual. Specific Conditions. Staff should have a positive attitude towards working with persons with an intellectual disability and help to ensure that they lead as normal and enjoyable a life as possible.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145b56d458d8e508baf5e4e::linkedin_tw\", \"source\": \"linkedin_tw\", \"country\": \"TW\", \"company\": \"Brothers of Charity Services Ireland\", \"position\": \"Temporary Senior Speech and Language Therapist\", \"notes\": \"\", \"original\": \"<strong><u>Brothers Of Charity Services Ireland \\u2013 West Region<br><br><\/u><\/strong>POSTS OF: TEMPORARY FULL -TIME SENIOR SPEECH &amp; LANGUAGE THERAPIST<br><br>ADULT SERVICES, GALWAY CITY &amp; COUNTY<br><br>JOB REF: 152\/2021<br><br>A panel will be formed as a result of this campaign from which upcoming temporary vacancies within Adults and Children\\u2019s Services within the BOCSI- West region (Counties Galway and Roscommon) will be made over the next six months.<br><br><strong><u>The Role<br><br><\/u><\/strong>We are seeking a Senior Speech and Language Therapist to join our dynamic and evolving Speech and Language Therapy Department, providing services to adults with an intellectual disability in Galway city and county. This post will provide opportunities for the candidate to develop skills in the area of adults with an intellectual disability within a supportive SLT team and within the context of the interdisciplinary team.<br><br>Our Speech and Language Therapy Department has a strong commitment to ongoing professional development and specific interests are encouraged and supported. We meet regularly and you will be provided with a high level of support, supervision and mentoring.<br><br><strong><u>Reports \/ Responsible To<br><br><\/u><\/strong>Speech &amp; Language Therapy Manager \/ Acting Manager<br><br><strong><u>Accountable To<br><br><\/u><\/strong>Accountable to the Speech and Language Therapy Manager and locally to the East Sector Manager for the work carried out and service provided to the people supported.<br><br><strong><u>Qualifications\/Skills<br><br><\/u><\/strong>Successful candidates must be:<br><br>Registered with CORU, the regulator for health and social care professionals, and eligible for membership of the Irish Association of Speech and Language Therapists (I.A.S.L.T.).<br><br><strong><u>Qualifications As Follows<br><br><\/u><\/strong>Bachelor of Science in Clinical Speech and Language Studies, University of Dublin, Trinity College Dublin <strong>or,<br><br><\/strong>Bachelor of Science (Speech and Language Therapy), UCC\/NUIG <strong>or,<br><br><\/strong>Master of Science in Speech and Language Therapy (Professional Qualification), University of Limerick <strong>or<br><br><\/strong>A Speech &amp; Language qualification approved for registration with CORU and equivalent to the above.<br><br>A dysphagia qualification or equivalent as outlined in \\u201cStandards of Practice for Speech &amp; Language Therapists on the Management of Feeding, Eating, Drinking and Swallowing Disorders (Dysphagia)\\u201d Irish Association of Speech &amp; Language Therapists (IASLT) 2012 is essential for this post. Current skills at an intermediate or advanced practitioner level are essential.<br><br>A full clean Irish driving licence and use of your own car is an essential requirement.<br><br>Fluency in verbal and written English is an essential requirement of this post.<br><br><strong><u>Experience<br><br><\/u><\/strong>This post is suitable for a Speech and Language Therapist with:<br><ul><li>A minimum of three years post graduate clinical Speech and Language Therapy experience.<\/li><li>Clinical experience in the management of feeding, eating, drinking and swallowing disorders is essential.<\/li><li>FEDS skills at an intermediate competency level (IASLT 2012) is essential.<\/li><li>Clinical experience in the management of adults with an intellectual disability is desirable.<\/li><li>Training and \/ or experience in the use of L\\u00e1mh and PECS is an advantage.<br><\/li><\/ul><strong><u>Working Hours<br><br><\/u><\/strong>74 hours a fortnight based on a 5 day week. Contracted hours of work are liable to change between the hours of 8am \\u2013 8pm over seven days to meet the requirements of the services.<br><br>The Brothers of Charity model of service is based on Personal Outcome Measures requiring employees to be flexible in their working hours to provide a quality service delivery for each individual.<br><br>The Health Service is undergoing ongoing transformation and therefore it is critical that a flexible attitude to changing environments and work requirements is held by the successful candidate.<br><br><strong><u>Annual Leave<br><br><\/u><\/strong>29 days per annum.<br><br><strong><u>Remuneration<br><br><\/u><\/strong>\\u20ac54,136 x 8 increments - \\u20ac63,743 per annum.<br><br><strong><u>Tenure<br><br><\/u><\/strong>This post is temporary full-time and pensionable on a fixed term basis until the end of October 2022<br><br><strong><u>Travel\/Base<br><br><\/u><\/strong>The person appointed must provide his\/her own car and must furnish an indemnity from Insurers in favour of the employer. Travelling expenses at the appropriate rate will be paid in respect of travel necessarily performed in the discharge of duty. The base for this purpose will be determined on appointment.<br><br><strong><u>Probation<br><br><\/u><\/strong>A probationary period of nine months from the date of appointment applies to the post. The employment may be terminated at any time during the probationary period should the employer find that the appointee is unsuitable to continue employment. The probation period may be extended at the employer\\u2019s discretion.<br><br><strong><u>Job Description<br><br><\/u><\/strong>The Brothers of Charity Services Ireland model of service is based on Personal Outcome Measures requiring employees to be flexible both in their approach and their working hours to provide a quality service delivery for each individual.<br><br>Specific Conditions<br><ul><li>Staff should have a positive attitude towards working with persons with an intellectual disability and help to ensure that they lead as normal and enjoyable a life as possible.<\/li><li>Staff should treat each person with an intellectual disability as an individual and at all times acknowledge and respect the rights and personal dignity of the person with an intellectual disability.<\/li><li>Staff are required to establish and maintain relationships with adults with disabilities that are based on respect and equality and that promote their independence.<br><\/li><\/ul><strong><u>Professional\/Clinical<br><br><\/u><\/strong><strong>Principal Duties and Responsibilities<br><br><\/strong><strong><u>The Speech &amp; Language Therapist Will<br><\/u><\/strong><ul><li>Demonstrate initiative, flexibility, communication and organizational skills.<\/li><li>Demonstrate ability to work within a multi-disciplinary team providing services to adults with an intellectual disability.<\/li><li>Demonstrate an ability to apply knowledge to evidence-based practice.<\/li><li>Demonstrate a commitment to assuring high standards and strive for a person-centred service.<\/li><li>Operate within the scope of Speech &amp; Language Therapy practice as set out by the Irish Association of Speech &amp; Language Therapists.<\/li><li>Maintain professional standards in relation to confidentiality, ethics and legislation.<\/li><li>Participate in and develop activities which support Safe Feeding Practices, Independence and Health Promotion.<\/li><li>As part of a multidisciplinary team, provide a quality Speech &amp; Language Therapy Service to those who present with communication difficulties and\/or feeding, eating, drinking and swallowing difficulties as appropriate.<\/li><li>Demonstrate the ability to manage a complex feeding\/eating\/drinking and swallowing caseload, understand and prioritise the needs of each person supported, plan and deliver care in an effective and resourceful manner and the ability to manage self and basic grade staff in a busy working environment. <\/li><li>Work both directly and indirectly with persons supported and in a consultative capacity.<\/li><li>Arrange and carry out assessment and treatment \/ intervention programmes in appropriate settings in line with local policy and guidelines.<\/li><li>Document all assessment, diagnosis, treatment \/ intervention plans, clinical notes, relevant contacts and summaries in accordance with department and professional standards.<\/li><li>Communicate results of assessments and recommendations to the person supported, their family and relevant others as appropriate.<\/li><li>Collaborate with person supported, family, carers, educational staff and other staff in goal setting and treatment \/ intervention planning.<\/li><li>Work closely and in a co-operative manner with relevant Team Leaders in service areas.<\/li><li>Foster close working relationships with colleagues, other relevant professionals in maximising the potential of persons supported.<\/li><li>Liaise with and build linkages with other agencies as appropriate to the post.<\/li><li>Play an active role on the multidisciplinary team and represent department \/ profession \/ services \/ team at meetings and conferences as designated.<\/li><li>Actively engage in team based performance management, where appropriate.<\/li><li>Seek advice and assistance from Speech and Language Therapy Manager with any assigned cases or issues that prove to be beyond the scope of his \/ her professional competence in line with principles of best practice and clinical governance.<\/li><li>Manage their time and prioritize their case load in accordance with overall department goals, and manage their mileage allowance. Supervision and guidance will be provided by Manager.<\/li><li>Provide support and information in relation to communication and \/ or feeding, eating, drinking and swallowing disorders etc. to persons supported, their families and relevant others.<\/li><li>Perform such other duties appropriate to the post as may be assigned from time to time by the Speech &amp; Language Therapy Manager\/Deputy.<br><\/li><\/ul><strong><u>Education &amp; Training<br><br><\/u><\/strong>The Speech and Language Therapist will:<br><ul><li>Participate in mandatory and recommended training programmes in accordance with departmental \/ organisational guidelines.<\/li><li>Maintain continuing professional development e.g. by attending in-service events, training courses, conferences and involvement in research.<\/li><li>Develop expertise in the management of feeding, eating, drinking and swallowing disorders through attendance at external training courses.<\/li><li>Develop expertise in the use of AAC to support persons supported with complex communication needs.<\/li><li>Provide teaching \/ training \/ supervision to others (e.g. to staff, students, persons supported, carers) as appropriate.<\/li><li>Engage in reflective practice, support \/ supervision with designated supervisor(s) \/ manager<\/li><li>Attend practice educator courses as required.<\/li><li>Engage in planning and performance reviews as required with the Speech and Language Therapy Manager.<\/li><li>Participate where appropriate in preventative and educational programmes. This may include home, day centre and school visits, case conferences, team meetings, lectures to interested groups, staff &amp; parent courses, etc.<br><\/li><\/ul><strong><u>Health &amp; Safety<br><br><\/u><\/strong>The Speech and Language Therapist will:<br><ul><li>Comply with the policies, procedures and safe professional practice of the organisation, the IASLT and the Irish Healthcare System by adhering to relevant legislation, regulations and standards.<\/li><li>Document appropriately and report any near misses, hazards and accidents and bring them to the attention of the relevant person(s) and Speech and Language Therapy Manager \/ Deputy.<\/li><li>Work in a safe manner with due care and attention to the safety of self and others.<\/li><li>Be aware of risk management issues, identify risks and take appropriate action.<\/li><li>Support a culture that values diversity and respect.<\/li><li>Be aware of and become familiar with the Fire Drill procedures within the Service, i.e. fire detection, evacuation and fire fighting.<\/li><li>Be conscious of Health and Safety matters in the workplace and in particular to comply with Employees' obligations as set out under Chapter 2 of the Safety, Health and Welfare at Work Act 2005.<\/li><li>Maintain CPR skills while working with people with feeding, eating, drinking and swallowing difficulties.<\/li><\/ul> <strong>Administrative:<br><br><\/strong><strong><u>The Senior Speech And Language Therapist Will<br><\/u><\/strong><ul><li>Arrange for the keeping of any necessary or prescribed records. <\/li><li>Ensure that administrative records, reports, information and statistics relating to the area of responsibility are up-to-date and available.<\/li><li>Ensure confidentiality on all matters relating to the Services.<\/li><li>Provide supervision and peer support for basic grade staff.<\/li><li>Be responsible for organisation and maintenance of own clinical equipment and identification of equipment needs as appropriate.<\/li><li>Participate in the planning and development of the Speech &amp; Language Therapy Service.<\/li><li>Participate in the review, evaluation and audit of Speech and Language Therapy services, identifying changing needs and opportunities to improve services. <\/li><li>Contribute to the development and implementation of procedures, policies and guidelines while adhering to existing standards and protocols.<\/li><li>As the duties and responsibilities of any post in the Service are likely to change with the ongoing needs of people supported, i.e. age, level of disability, Personal Outcome Measures, etc, staff are expected to have a high level of flexibility, and a willingness and an ability to develop new approaches to their work as the needs of people supported demand.<br><\/li><\/ul>The role of the post holder will not be limited by reference to this job description. It would be expected that the role will evolve as professional, structural and person supported demands change and the post holder will be expected to demonstrate flexibility skills that will facilitate this.<br><br><strong>Informal enquiries welcome to Margaret McCormack Head of Speech and Language Therapy Department on<br><br>090 6628500 \/ 086 8342472<br><br><\/strong><strong>Closing Date for receipt of completed Application &amp; CVs on-line is:<br><br><\/strong><strong>5pm Thursday 23rd September 2021<br><br><\/strong><strong>Interviews will take place via Microsoft Teams on Friday 8th October 2021<br><br><\/strong><strong><em>The Brothers of Charity Services Ireland is an equal opportunities employer<\/em><\/strong>\"}"
}