{
    "id":"Kaggle::techmap::614d8046f4d2ff742d2705d7::linkedin_za::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The job description uses terms such as \"Strong Leadership abilities,\" \"Strategic Thinking,\" \"Highly innovative,\" \"Strong negotiations skills,\" and \"Energetic and motivated.\" These are often associated with masculine-coded language that may subtly favour male candidates over female candidates. Additionally, phrases like \"self-starter\" and \"operate unassisted\" may reinforce individualistic qualities that are traditionally viewed as masculine traits",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" What We Are Looking For. Strategic Planning for future development. Establish market trends and prepare organisation to meet such. Identify diversification opportunities. Initiate growth projects. Develop Stakeholder Management Strategy. Develop Stakeholder Management Procedure. Manage the implementation of Stakeholder Visits. Develop Communication Strategy. Manage External Communication and political affairs of RDM with the support from the CEO. To have a wide ranging familiarity with the core disciplines and technologies used within the armaments industry. Analysis of trends in global defence markets. Analysis of RDM competitors globally. Products. Pricing. Collaboration with other companies. Analysis of competitiveness of RDM product ranges vis a vis competitor products. To conduct extensive research and dialogue with end-users, industry players and potential partners to identify business growth opportunities. Development of new business initiatives with the aim of establishment of alliances and joint ventures with international companies. Interfacing with RDM Sales and Marketing team. PERSONAL ATTRIBUTES: Strong Leadership abilities. Strategic Thinking. Highly innovative. Strong negotiations skills. Energetic and motivated. What Qualifications You Should Have. Minimum Business\/ Engineering degree from a reputable University or relevant NQF 6 equivalent qualification. Masters Degree or equivalent will be an added advantage. Proven strategic business leader with a track record of concluding complex contracts. Strong Global Defence Networks. Strong Political Networks. Proven record of market penetration in the Defence Industry. Experience of leading negotiations for teaming, partnering and contracting for multi-million dollar deals. An entrepreneurial ability to see past the normal and bring home the new opportunities on which the future of the business will be predicated. The ability to develop, implement and execute business strategies. Business model design, presentation, acceptance and implementation. Be able to assess opportunities and present these effectively to the Executive and Board. Experience in doing international business with governments, corporations and the associated regulatory environment. International dealings experience would be an added advantage. Outstanding communications and negotiation skills, preferably multi-lingual. Strongly service oriented and well organized. Self-confidence, high energy level and a self-starter. Be able to operate unassisted in foreign environments with different cultures. Do commercial intelligence gathering on customers and competitors. Generate leads and contacts for potential sales and market research. Knowledge of best business and management practices. Ability to conduct extensive domestic and overseas travel. At Rheinmetall, your strengths and experience are worth something. We also highly value diversity and equal opportunity. We look forward to receiving your application. Who We Are.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d8046f4d2ff742d2705d7::linkedin_za\", \"source\": \"linkedin_za\", \"country\": \"ZA\", \"company\": \"Rheinmetall\", \"position\": \"General Manager: Strategic Communications and Political Affairs\", \"notes\": \"\", \"original\": \"<strong>What We Are Looking For<br><br><\/strong><ul><li>Strategic Planning for future development<\/li><li>Establish market trends and prepare organisation to meet such<\/li><li>Identify diversification opportunities<\/li><li>Initiate growth projects<\/li><li>Develop Stakeholder Management Strategy<\/li><li>Develop Stakeholder Management Procedure<\/li><li>Manage the implementation of Stakeholder Visits<\/li><li>Develop Communication Strategy<\/li><li>Manage External Communication and political affairs of RDM with the support from the CEO<\/li><li>To have a wide ranging familiarity with the core disciplines and technologies used within the armaments industry<\/li><li>Analysis of trends in global defence markets<\/li><li>Analysis of RDM competitors globally<\/li><li>Products<\/li><li>Pricing<\/li><li>Collaboration with other companies<\/li><li>Analysis of competitiveness of RDM product ranges vis a vis competitor products<\/li><li>To conduct extensive research and dialogue with end-users, industry players and potential partners to identify business growth opportunities<\/li><li>Development of new business initiatives with the aim of establishment of alliances and joint ventures with international companies<\/li><li>Interfacing with RDM Sales and Marketing team.<br><br><\/li><\/ul><strong>PERSONAL ATTRIBUTES:<br><br><\/strong><ul><li>Strong Leadership abilities<\/li><li>Strategic Thinking<\/li><li>Highly innovative<\/li><li>Strong negotiations skills<\/li><li>Energetic and motivated<br><br><\/li><\/ul><strong>What Qualifications You Should Have<br><br><\/strong><ul><li>Minimum Business\/ Engineering degree from a reputable University or relevant NQF 6 equivalent qualification.<\/li><li>Master\\u2019s Degree or equivalent will be an added advantage<\/li><li>Proven strategic business leader with a track record of concluding complex contracts.<\/li><li>Strong Global Defence Networks<\/li><li>Strong Political Networks<\/li><li>Proven record of market penetration in the Defence Industry<\/li><li>Experience of leading negotiations for teaming, partnering and contracting for multi-million dollar deals.<\/li><li>An entrepreneurial ability to see past the normal and bring home the new opportunities on which the future of the business will be predicated.<\/li><li>The ability to develop, implement and execute business strategies.<\/li><li>Business model design, presentation, acceptance and implementation.<\/li><li>Be able to assess opportunities and present these effectively to the Executive and Board.<\/li><li>Experience in doing international business with governments, corporations and the associated regulatory environment.<\/li><li>International dealings experience would be an added advantage<\/li><li>Outstanding communications and negotiation skills, preferably multi-lingual.<\/li><li>Strongly service oriented and well organized.<\/li><li>Self-confidence, high energy level and a self-starter.<\/li><li>Be able to operate unassisted in foreign environments with different cultures.<\/li><li>Do commercial intelligence gathering on customers and competitors.<\/li><li>Generate leads and contacts for potential sales and market research.<\/li><li>Knowledge of best business and management practices.<\/li><li>Ability to conduct extensive domestic and overseas travel.<br><br><\/li><\/ul>At Rheinmetall, your strengths and experience are worth something. We also highly value diversity and equal opportunity. We look forward to receiving your application.<br><br><strong>Who We Are<br><br><\/strong>Impact and cover \\u2013 the Weapon and Ammunition Division's portfolio includes solutions for threat-appropriate, effective and accurate firepower as well as comprehensive protection. Whether on land, at sea or in the air, Rheinmetall supplies impressive systems that ensure superiority on the battlefields and operational areas of today and the future. The division is divided into three business units: Weapon and Munition, Propulsion Systems and Protection Systems.<br><br>Rheinmetall AG, publicly listed and based in D\\u00fcsseldorf, Germany, is a powerful, internationally successful corporation. As an integrated technology group, Rheinmetall is a market leader in the areas of environmentally friendly mobility and threat-appropriate security technology. Rheinmetall commands a foremost position as a global first-tier supplier to the automotive industry for modules and systems. Furthermore, Rheinmetall is Europe\\u2019s foremost supplier of defence and security technology and a longstanding partner of the armed forces.\"}"
}