{
    "id":"Kaggle::techmap::61525fc2d6458c45ef9dcc6e::monster2_nl::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"Requiring deployability and the potential for long deployments is a justifiable job requirement for this NATO position due to the necessity for rapid and flexible response to military operations, as demonstrated by the 30 days Notice to Move (NTM) requirement.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" -Provides and coordinates a video archiving process and liaises with imagery sections of Higher Headquarters (HHQs) and subordinate commands to generate shared use and archiving of video products. Special RequirementsThe work is usually performed in a normal NATO office environment. Normal Working Conditions apply. The candidate has to be deployable. The employee may be required to undertake deployments in support of military operations and exercises, and\/or temporary assignments, both within and without NATO boundaries. Such operational deployment may exceed 30 days of duration up to 183 days in any period of 574 days, and may be on short notice. This post is subject to 30 days Notice to Move (NTM) for deployment. However, to meet deployable criteria this post, on a rotational basis, may be subject to a shorter NTM period of 2-14 days. For NATO International Civilian (NIC) staff, acceptance of an employment contract linked to this post constitutes agreement to deploy in excess of 30 days if required. Required Qualifications-Higher Secondary education and intermediate vocational training in related field \/ discipline and 2 years related experienceOR-Secondary education and completed advanced vocational training in related field \/ discipline leading to a professional qualification or professional accreditation with 4 years related experience. -Experience operating, maintaining and troubleshooting audio and video equipment with minimum 3 years experience in videography. -Experience using professional audio and\/or video tape editing and post-production procedures, techniques and standards. -Experience configuring, operating and maintaining studio and\/or field audio, lighting and associated production equipment. -Proficient with video editing software\/applications such as: Final Cut Pro, Adobe After Effects, Motion Design, Illustrator, In. Design or similar. -a valid car driving license. English  good  NATO Standard Language Proficiency 3322(Listening, Speaking, Reading and Writing) in accordance with NATO standard agreement (STANAG) 6001. NOTE: The work both oral and written in this post and in this Headquarters as a whole is conducted mainly in English. Desirable Qualifications-Experience in IT Network management and domain controller\/computer administration skills. -Experience working in a military video production environment. -Deployment experience. Personal AttributesThe successful candidate will possess the following competencies:Excellent communication ability. Very good interpersonal skills. Adaptability, tact and determination. Clarity and Accuracy  monitors data or projects. Customer Service Orientation  responds appropriately, maintains clear communication. Self-control  manages stress effectively. Teamworker  solicits inputs and encourages others.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61525fc2d6458c45ef9dcc6e::monster2_nl\", \"source\": \"monster2_nl\", \"country\": \"NL\", \"company\": \"NATO\", \"position\": \"Staff Assistant (Public Affairs - Videographer)\", \"notes\": \"\", \"original\": \"Staff Assistant (Public Affairs - Videographer)-210794&nbsp;<b>Primary Location<\/b>&nbsp;Netherlands-Brunssum<b>NATO Body<\/b>&nbsp;Joint Force Command Brunssum NLD<b>Schedule<\/b>&nbsp;Full-time<b>Salary (Pay Basis)<\/b>&nbsp;:&nbsp;4,318.29Euro (EUR)&nbsp;MonthlyGrade&nbsp;NATO Grade G10&nbsp;<b>Description<\/b>:&nbsp;&nbsp;Job Title:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Staff Assistant (Public Affairs - Videographer)Post Number:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; OJN UPXX 0160NATO Civilian Grade:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; NATO Grade 10Duty Location:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Brunssum, The NetherlandsPost filling date:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; as soon as possible&nbsp;Closing date for applications:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 24 October 2021&nbsp;&nbsp;<b><u>Our organisation<\/u><\/b>Joint Force Command Brunssum (JFCBS) provides a Joint Headquarters (HQ) to plan, prepare and conduct operations to support NATO\\u2019s core tasks, at the Joint Operational level, as directed by Supreme Allied Commander Europe (SACEUR). The Communications Directorate coordinates and synchronizes information activities and communications activities in support of NATO missions and objectives. The Military Public Affairs Branch communicates accurate information in a timely manner to improve public awareness and understanding of the Alliance, help achieve desired effects, enhance organizational credibility and sustain\/improve community support. The incumbent operates within the Digital Media Section serving primarily as videographer for JFCBS HQ internal and external communication products.<b><u>The Staff Assistant Public Affairs - Videographer:<\/u><\/b>-Serves as a video-journalist for JFCBS information products, editing content for publication on command digital channels under JFCBS responsibility.-Operates video cameras and related equipment in the production of video products, on location or in a studio, both during duty and non-duty hours, on and off post, to include deployment in support of exercises or operations.-Performs processing and digital editing of video materials in a variety of formats.-Uploads content to command digital channels under JFCBS responsibility.-Designs, transports and assembles video displays.-Generates and inserts on-screen text and graphics in video productions according to the theme\/format and adds narration as required.-Reviews video footage shot by others and edits as necessary.-Conducts Public Affairs (PA) and video-journalist activities in support of exercises and operations.-Represents PA in various HQ committees, boards and working groups.-Undertakes work as part of a project team or working group as directed or assigned.-Undertakes preventative maintenance assessments on video and audio production equipment.-Assists in repair and upkeep of studio and production sets and properties.-Maintains inventory of public affairs video equipment and support supplies requesting additional supplies as necessary to maintain a to be defined reserve stock.-Actions official requests for video from media and other authorized military and civilian sources.-Provides and coordinates a video archiving process and liaises with imagery sections of Higher Headquarters (HHQs) and subordinate commands to generate shared use and archiving of video products.&nbsp;<b><u>Special Requirements<\/u><\/b>The work is usually performed in a normal NATO office environment. Normal Working Conditions apply.The candidate has to be deployable.The employee may be required to undertake deployments in support of military operations and exercises, and\/or temporary assignments, both within and without NATO boundaries. Such operational deployment may exceed 30 days of duration up to 183 days in any period of 574 days, and may be on short notice. This post is subject to 30 days\\u2019 Notice to Move (NTM) for deployment. However, to meet deployable criteria this post, on a rotational basis, may be subject to a shorter NTM period of 2-14 days. For NATO International Civilian (NIC) staff, acceptance of an employment contract linked to this post constitutes agreement to deploy in excess of 30 days if required.&nbsp;<b><u>Required Qualifications<\/u><\/b>-Higher Secondary education and intermediate vocational training in related field \/ discipline and 2 years related experience <b><u>OR<\/u><\/b>-Secondary education and completed advanced vocational training in related field \/ discipline leading to a professional qualification or professional accreditation with 4 years related experience.-Experience operating, maintaining and troubleshooting audio and video equipment with minimum 3 years\\u2019 experience in videography.-Experience using professional audio and\/or video tape editing and post-production procedures, techniques and standards.-Experience configuring, operating and maintaining studio and\/or field audio, lighting and associated production equipment.-Proficient with video editing software\/applications such as: Final Cut Pro, Adobe After Effects, Motion Design, Illustrator, InDesign or similar.-a valid car driving license.- English \\u2013 good \\u2013 NATO Standard Language Proficiency 3322(Listening, Speaking, Reading and Writing) in accordance with NATO standard agreement (STANAG) 6001.<i>NOTE: The work both oral and written in this post and in this Headquarters as a whole is conducted mainly in English.<\/i>&nbsp;<b><u>Desirable Qualifications<\/u><\/b>-Experience in IT Network management and domain controller\/computer administration skills.-Experience working in a military video production environment.-Deployment experience.&nbsp;<b><u>Personal Attributes<\/u><\/b>The successful candidate will possess the following competencies:Excellent communication ability;Very good interpersonal skills;Adaptability, tact and determination;Clarity and Accuracy \\u2013 monitors data or projects;Customer Service Orientation \\u2013 responds appropriately, maintains clear communication;Self-control \\u2013 manages stress effectively;Teamworker \\u2013 solicits inputs and encourages others.&nbsp;The successful candidate needs to pass a NATO medical examination and have a NATO security clearance before an employment offer can be released. The medical examination will take place with our medical consultant and is required to determine if the recommended candidate is fit to perform assigned duties.&nbsp;Due date for receipt of applications: Sunday 24 October 2021Candidates have to apply electronically via the NATO Talent Acquisition Program at:https:\/\/nato.taleo.net\/careersection\/2\/jobsearch.ftl?lang=en&nbsp;<b>Please be aware that a Selection Board will assess the qualifications and experience of the candidates based on the information provided in the application form. Attachments are supporting documents and should not be referred to in the application form.<\/b>&nbsp;Results of the initial screening for this post may be expected early November 2021. Test and interviews for those invited are planned in second part of November 2021. Prior to the test and interview there may be a Hire Vue interview.\"}"
}