{
    "id":"Kaggle::techmap::6457f772f954f8220035a829::monster2_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The job description includes physical and mental demands, but these are relevant to the essential functions of the role and do not unnecessarily exclude individuals based on disabilities.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description As the region's dedicated experts in exceptional musculoskeletal care, our doctors and staff at Lakeshore Bone & Joint Institute have served the orthopedic needs of northwest Indiana since 1968. With state-of-the-art facilities, we are dedicated to delivering the exceptional, compassionate care patients need to keep moving and keep enjoying their life. The Physician Assistant (PA) provides medical care, medication management, and care coordination for patients with chronic or acute injuries. Essential Functions: Obtain patient history and perform assessments via observation and examination. Prescribe appropriate pharmacologic and non-pharmacologic treatment modalities. Order, perform and interpret diagnostic and therapeutic tests as needed. Implement interventions to support the patient to regain or maintain physiologic stability. Asses and revise care plans based on physician recommendations and patient changes. Consult with other staff regarding referrals, follow-ups, and transfer of care. Educate patient and family by providing educational tools and resources to aid in decision making. Participate in professional development activities and attend seminars as needed. Exercise initiative, judgement, discretion, and decision making to achieve medical objectives. Assist physician in orthopedic surgery. Conducts rounds at hospitals on ER and post-operative patients as directed by physician. Other duties as assigned. Education: Masters in PA studies from an accredited University. Experience: Minimum of 2-years Physician Assistant or orthopedic experience. Requirements: Current state PA license, certified by National Commission on Certification of Physician Assistants. Current CPR certification. Knowledge: Knowledge of acute and chronic care protocols, administration of medications, delivering physical care following treatment plan. Knowledge of how to assess patient health and measure\/record physiologic and growth indices. Knowledge of health promotion principles and techniques and patient learning measurement. Skills & Abilities: Ability to analyze situations and solve problems. Employ critical thinking and problem solving. Ethical reasoning and decision making. Strong attention to detail. Receptive and responsive to feedback. Excellent verbal and written communication skills,. Time management, prioritization, and sense of urgency. Maintain patient confidentiality. Physical\/Mental Demands: Standing, sitting, walking, bending, stooping and twisting. Requires ability to help transfer patients. Occasional stress from dealing with multiple tasks and tense patients. Requires full range of motion, manual dexterity, eye-hand coordination. Environmental\/Working Conditions: Work is performed in a clinical environment. Involves frequent contact with staff and the public. Work may be stressful at times. Occasional weekend or evening work required.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6457f772f954f8220035a829::monster2_us\", \"source\": \"monster2_us\", \"country\": \"US\", \"company\": \"Lakeshore Bone And Joint Institute\", \"position\": \"Physician Assistant\", \"notes\": \"\", \"original\": \"<h2 name=\\\"label_description\\\" class=\\\"jobdescriptioncomponent__Description-sc-my61fv-1 hICAkg\\\">Description<\/h2><div class=\\\"jobdescriptioncomponent__SanitizedHtmlContainer-sc-my61fv-2 ipgMhv\\\"><div name=\\\"sanitizedHtml\\\" class=\\\"sanitizehtmlcomponent__SanitizedContent-sc-1s5wjr7-0 kXZvZn\\\"><ul><li><p>As the region's dedicated experts in exceptional musculoskeletal care, our doctors and staff at Lakeshore Bone &amp; Joint Institute have served the orthopedic needs of northwest Indiana since 1968. With state-of-the-art facilities, we are dedicated to delivering the exceptional, compassionate care patients need to keep moving and keep enjoying their life. The Physician Assistant (PA) provides medical care, medication management, and care coordination for patients with chronic or acute injuries.<\/p><p><\/p><p><strong>Essential Functions:<\/strong><\/p><ol><li>Obtain patient history and perform assessments via observation and examination<\/li><li>Prescribe appropriate pharmacologic and non-pharmacologic treatment modalities<\/li><li>Order, perform and interpret diagnostic and therapeutic tests as needed<\/li><li>Implement interventions to support the patient to regain or maintain physiologic stability<\/li><li>Asses and revise care plans based on physician recommendations and patient changes<\/li><li>Consult with other staff regarding referrals, follow-ups, and transfer of care<\/li><li>Educate patient and family by providing educational tools and resources to aid in decision making<\/li><li>Participate in professional development activities and attend seminars as needed<\/li><li>Exercise initiative, judgement, discretion, and decision making to achieve medical objectives<\/li><li>Assist physician in orthopedic surgery<\/li><li>Conducts rounds at hospitals on ER and post-operative patients as directed by physician<\/li><li>Other duties as assigned<\/li><\/ol><p><strong><\/strong><\/p><p><strong>Education: <\/strong>Master\\u2019s in PA studies from an accredited University<\/p><p><strong>Experience: <\/strong>Minimum of 2-years Physician Assistant or orthopedic experience.<\/p><p><strong>Requirements:<\/strong> Current state PA license, certified by National Commission on Certification of Physician Assistants. Current CPR certification.<\/p><\/li><li><p><\/p><p><strong>Knowledge:<\/strong><\/p><ol><li>Knowledge of acute and chronic care protocols, administration of medications, delivering physical care following treatment plan<\/li><li>Knowledge of how to assess patient health and measure\/record physiologic and growth indices<\/li><li>Knowledge of health promotion principles and techniques and patient learning measurement<\/li><\/ol><p><\/p><p><strong>Skills &amp; Abilities:<\/strong><\/p><ol><li>Ability to analyze situations and solve problems<\/li><li>Employ critical thinking and problem solving<\/li><li>Ethical reasoning and decision making<\/li><li>Strong attention to detail<\/li><li>Receptive and responsive to feedback <\/li><li>Excellent verbal and written communication skills,<\/li><li>Time management, prioritization, and sense of urgency<\/li><li>Maintain patient confidentiality<\/li><\/ol><p><\/p><p><strong>Physical\/Mental Demands:<\/strong><\/p><p>Standing, sitting, walking, bending, stooping and twisting. Requires ability to help transfer patients. Occasional stress from dealing with multiple tasks and tense patients. Requires full range of motion, manual dexterity, eye-hand coordination.<\/p><p><\/p><p><strong>Environmental\/Working Conditions:<\/strong><\/p><p>Work is performed in a clinical environment. Involves frequent contact with staff and the public. Work may be stressful at times. Occasional weekend or evening work required.<\/p><p><\/p><p><strong>Compliance:<\/strong> All employees have a responsibility to comply with our organization\\u2019s policies and procedures, adhere to our Code of Conduct, complete required compliance training modules, and report any observations of non-compliance.<\/p><\/li><li><br><br><p>PI213782605<\/p><\/li><\/ul><\/div><\/div>\"}"
}