{
    "id":"Kaggle::techmap::61447ccb70d0ad15aec84e92::linkedin_cr::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The phrases \"repetitive keyboarding over 95% of the time\" and \"strong typing skills\" imply that a candidate must use their hands or can only enter data effectively through the use of hands, thus introducing disability bias by excluding individuals with disabilities who can perform the job with reasonable accommodations.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 3M has a long-standing reputation as a company committed to innovation. We provide the freedom to explore and encourage curiosity and creativity. We gain new insight from diverse thinking, and take risks on new ideas. Here, you can apply your talent in bold ways that matter. Job Description. As a 3M call center representative, you will be a key member of the Medical Solutions Division Advantage Center by enhancing our customers experience with their healthcare needs. You will be interacting with individuals such as: patients, family members, physicians, skilled nursing facilities, and other healthcare professionals. Responsibilities. Handle incoming calls for orders, service and product information in a timely and professional manner, following department procedures. Accurately enter required data and process orders in accordance with department procedures. Identify and probe for customers needs, clarify information, research issues and provide alternatives as needed. Refer requests for service or information outside departments' responsibility appropriately. Handle or refer billing requests as defined in desk procedures and reference tools. Escalate special customer or service center requests or problem issues as appropriate to a supervisor or designated representative. Notify supervisor or designated representative of issues or trends with impact on customer satisfaction. Participate in any and all reasonable work activities as assigned and deemed appropriate by management including but not limited to over time. Achieve and maintain Performance Objectives. Understand and comply with HIPPA regulations and PHI and all 3M policies. Basic Qualifications. The positions essential function requires but is not limited to repetitive keyboarding over 95% of the time and phone usage 95% of the time. Advanced English (oral and written) C1. The information listed above is not a comprehensive list of all duties\/responsibilities performed. This job description is not an employment agreement or contract. Management has the exclusive right to alter this job description at any time without notice. Ability to work in flexible schedule. At least one year of customer service experience. Strong typing skills. Capable of multitasking and toggling through 4-5 different systems (dual screens). Flexible & Adaptable  with schedule, workflow processes and priorities. Capability to work effectively and exercise sound business judgment in a team environment, as well as independently. Operate independently without close supervision. Ability to convey a positive customer service and team-oriented attitude. Maintain complete confidentiality and discretion in business relationships. Ability to work scheduled shifts and meet all attendance and performance standards.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61447ccb70d0ad15aec84e92::linkedin_cr\", \"source\": \"linkedin_cr\", \"country\": \"CR\", \"company\": \"3M\", \"position\": \"Customer Service Representative\", \"notes\": \"\", \"original\": \"3M has a long-standing reputation as a company committed to innovation. We provide the freedom to explore and encourage curiosity and creativity. We gain new insight from diverse thinking, and take risks on new ideas. Here, you can apply your talent in bold ways that matter.<br><br><strong>Job Description<br><br><\/strong>As a 3M call center representative, you will be a key member of the Medical Solutions Division Advantage Center by enhancing our customers experience with their healthcare needs. You will be interacting with individuals such as: patients, family members, physicians, skilled nursing facilities, and other healthcare professionals.<br><br><strong>Responsibilities<br><br><\/strong><ul><li>Handle incoming calls for orders, service and product information in a timely and professional manner, following department procedures.<\/li><li>Accurately enter required data and process orders in accordance with department procedures.<\/li><li>Identify and probe for customer\\u2019s needs, clarify information, research issues and provide alternatives as needed.<\/li><li>Refer requests for service or information outside departments' responsibility appropriately.<\/li><li>Handle or refer billing requests as defined in desk procedures and reference tools.<\/li><li>Escalate special customer or service center requests or problem issues as appropriate to a supervisor or designated representative.<\/li><li>Notify supervisor or designated representative of issues or trends with impact on customer satisfaction.<\/li><li>Participate in any and all reasonable work activities as assigned and deemed appropriate by management including but not limited to over time.<\/li><li>Achieve and maintain Performance Objectives.<\/li><li>Understand and comply with HIPPA regulations and PHI and all 3M policies.<br><br><\/li><\/ul><strong>Basic Qualifications<br><br><\/strong><ul><li>The positions essential function requires but is not limited to repetitive keyboarding over 95% of the time and phone usage 95% of the time.<\/li><li>Advanced English (oral and written) C1<\/li><li>The information listed above is not a comprehensive list of all duties\/responsibilities performed.<\/li><li>This job description is not an employment agreement or contract.<\/li><li>Management has the exclusive right to alter this job description at any time without notice.<\/li><li>Ability to work in flexible schedule.<\/li><li>At least one year of customer service experience.<\/li><li>Strong typing skills.<\/li><li>Capable of multitasking and toggling through 4-5 different systems (dual screens)<\/li><li>Flexible &amp; Adaptable \\u2013 with schedule, workflow processes and priorities.<\/li><li>Capability to work effectively and exercise sound business judgment in a team environment, as well as independently.<\/li><li>Operate independently without close supervision.<\/li><li>Ability to convey a positive customer service and team-oriented attitude.<\/li><li>Maintain complete confidentiality and discretion in business relationships.<\/li><li>Ability to work scheduled shifts and meet all attendance and performance standards.<\/li><li>Ability to maintain confidentiality and exercise discretion in all business dealings.<\/li><li>Experience with Microsoft Office applications including: Word, Excel &amp; Outlook.<\/li><li>High School Diploma or equivalent.<br><br><\/li><\/ul>Learn more about 3M\\u2019s creative solutions to the world\\u2019s problems at www.3M.com or on Twitter @3M.<br><br>3M es un empleador que ofrece las mismas oportunidades. 3M no discriminar\\u00e1 a ning\\u00fan solicitante de empleo por razones de raza, color, edad, religi\\u00f3n, sexo, orientaci\\u00f3n sexual, identidad o expresi\\u00f3n de g\\u00e9nero, origen nacional, discapacidad o estado de veterano.<br><br><strong>Please note: your application may not be considered if you do not provide your education and work history, either by: 1) uploading a resume, or 2) entering the information into the application fields directly.<br><br><\/strong><u><strong>3M Global Terms of Use and Privacy Statement<br><br><\/strong><\/u>Carefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at 3M are conditioned on your acceptance and compliance with these terms.<br><br>Please access the linked document by clicking here, select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms.\"}"
}