{
    "id":"Kaggle::techmap::614e57607d360e49a1f5e3a8::careerbuilder_us::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Is currently assisting a local client in their search to fill a Lab Technician role in Greensboro, NC. This is a contract position. Apply Now if you meet the qualifications listed below! Adecco is hiring a Lab Technician. Accountabilities: • Bachelor's in Chemistry (open to BA or BS) strongly preferred. Professional experience is preferred but not required. Open to recent graduates. Job Description & Requirements. We are currently seeking a Lab Technician for the Research & Development Analytical team in Greensboro, NC. Deliver accurate data\/results to customers independently, within the established deadlines. Maintain proficiency and ability to work independently using the necessary computer systems (StarLims, LINK, Mat. Ref, R\/Shiny applications) as well using more widely available software such as Smart. Sheet, Microsoft Office applications, etc. Be the PIC (person-in-charge) for certain laboratory instruments, to ensure full GLP documentation (logbooks, etc. ) and compliance is maintained. Independently track, schedule and document any necessary repairs and\/or preventative maintenance. Ensure that GLP compliance is maintained for all GLP tests and\/or equipment for which you are responsible. Manage infrastructure in assigned lab spaces. Strong attention to detail, ability to follow detailed procedures independently, and detailed recordkeeping. Excellent oral and written communications skills. Must have excellent organizational skills and strong attention to detail. Work to understand customer needs and timely delivery of quality service. Proactively contribute ideas and new solutions to improve efficiency of current procedures or processes.. Ability to independently and effectively manage your own sample analysis workload and support tasks but within a team environment. Ability to work collaboratively within a diverse and inclusive group of colleagues, customers and stakeholders. Ability to independently plan, organize and prioritize work in advance. Proficiency in troubleshooting and performing maintenance of laboratory equipment. Familiarity with and appreciation of basic lab safety, and strong adherence to safety policies. Adecco provides one of the most comprehensive benefits packages in the industry to contract workers. Click on Apply Now to be considered for this position in Greensboro, NC or you can visit our website www. adeccousa. com to search for other opportunities that are currently available..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614e57607d360e49a1f5e3a8::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Adecco Medical & Science\", \"position\": \"Laboratory Assistant I\", \"notes\": \"\", \"original\": \"<ol> <li>is currently assisting a local client in their search to fill a <strong>Lab Technician <\/strong>role in <strong>Greensboro<\/strong>, NC. This is a contract position. Apply Now if you meet the qualifications listed below!<\/li> <\/ol> \\u00a0<br \/><br \/>Adecco is hiring a Lab Technician.<br \/> <br \/> Accountabilities:<br \/> <br \/> \\u2022 Bachelor's in Chemistry (open to BA or BS) strongly preferred<br \/> \\u2022 Professional experience is preferred but not required; open to recent graduates<br \/><br \/>Job Description & Requirements<br \/> We are currently seeking a Lab Technician for the Research & Development Analytical team in Greensboro, NC.<br \/> \\u2022 Deliver accurate data\/results to customers independently, within the established deadlines.<br \/> \\u2022 Maintain proficiency and ability to work independently using the necessary computer systems (StarLims, LINK, MatRef, R\/Shiny applications) as well using more widely available software such as SmartSheet, Microsoft Office applications, etc.<br \/> \\u2022 Be the PIC (person-in-charge) for certain laboratory instruments, to ensure full GLP documentation (logbooks, etc.) and compliance is maintained.<br \/> \\u2022 Independently track, schedule and document any necessary repairs and\/or preventative maintenance.<br \/> \\u2022 Ensure that GLP compliance is maintained for all GLP tests and\/or equipment for which you are responsible.<br \/> \\u2022 Manage infrastructure in assigned lab spaces.<br \/> \\u2022 Strong attention to detail, ability to follow detailed procedures independently, and detailed recordkeeping. Excellent oral and written communications skills.<br \/> \\u2022 Must have excellent organizational skills and strong attention to detail.<br \/> \\u2022 Work to understand customer needs and timely delivery of quality service.<br \/> \\u2022 Proactively contribute ideas and new solutions to improve efficiency of current procedures or processes.<br \/> \\u2022 Work effectively within a diverse team environment, and be flexible to changing priorities and changes in personal responsibilities.<br \/> \\u2022 Ability to independently and effectively manage your own sample analysis workload and support tasks but within a team environment.<br \/> \\u2022 Ability to work collaboratively within a diverse and inclusive group of colleagues, customers and stakeholders.<br \/> \\u2022 Ability to independently plan, organize and prioritize work in advance.<br \/> \\u2022 Proficiency in troubleshooting and performing maintenance of laboratory equipment.<br \/> \\u2022 Familiarity with and appreciation of basic lab safety, and strong adherence to safety policies. \\u00a0 Adecco provides one of the most comprehensive benefits packages in the industry to contract workers.<br \/> Click on Apply Now to be considered for this position in Greensboro, NC or you can visit our website www.adeccousa.com to search for other opportunities that are currently available.<br \/> \\u00a0<br \/> <strong>Equal Opportunity Employer Minorities\/Women\/Veterans\/Disabled<\/strong><br \/> \\u00a0<br \/> \\u00a0<br \/><br \/>Equal Opportunity Employer\/Veterans\/Disabled<br \/><br \/>To read our Candidate Privacy Information Statement, which explains how we will use your information, please navigate to [Link available when viewing the job] \/><br \/>The Company will consider qualified applicants with arrest and conviction records <br \/><br \/>&nbsp;\"}"
}