{
    "id":"Kaggle::techmap::6132b9b48fe60a2ddb355c71::headhunter_kz::0",
    "label_age":true,
    "analysis_age":"\"be graduate of 2019-2021\" - although not explicitly targeting an age bracket, there is an implicit assumption that a young candidate is being sought.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" :  . ,  . KPMG is searching for Intern in Tax and Legal Department. KPMG supplies tax know-how to our clients: we advise businesses on how taxation fits into the broader business picture, and implement decisions that deliver real value. We gain an in-depth understanding of our clients' needs and then provide insights to help them optimize costs. things like where in the world they should base their business to ensure they take advantage of the best tax incentives, and how they should organize their internal structure and tax department. extremely important factors which can help determine cost effectiveness. What will I do in Tax? There are two main functions in Tax services: tax advisory and tax compliance. Tax advisory frequently involves working in a multi-disciplinary team and meeting Finance Directors and Senior Managers on client visits. Tax compliance implies that you will take a more specialized approach to analyzing clients' business and tax profiles, looking for process improvements and collaborating with advisory colleagues. But both functions have common principles. starting with an in-depth understanding of the client and a detailed knowledge of the technical issues coupled with communicating complex technical information in a clear and understandable manner. A typical client relationship involves: Extensive preparation and research into the business and client issues. Checking client tax returns for accuracy and identifying potential savings. Helping clients by checking they have all the information required by tax authorities. Organizing client files and preparing initial advice. Consulting and communicating with clients' senior management and auditors. Mastering and understanding the latest tax legislation and working practices. Closely monitoring the client. tax authority relationship. Data analysis and modeling to help clients understand the implications of different tax solutions. Preparing and presenting pitch proposals, client reports and recommendations. What do I need? A university degree (be graduate of 2019-2021). Good knowledge of Kazakh tax and accounting legislation is preferable. Fluent English. Strong analytical skills. Willingness to learn and develop professionally. Ability to work full-time.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6132b9b48fe60a2ddb355c71::headhunter_kz\", \"source\": \"headhunter_kz\", \"country\": \"KZ\", \"company\": \"KPMG\", \"position\": \"Intern, Tax Department, Nur-Sultan\", \"notes\": \"\", \"original\": \"<div class=\\\"bloko-gap bloko-gap_bottom\\\">\\n <p>\\u0422\\u0440\\u0435\\u0431\\u0443\\u0435\\u043c\\u044b\\u0439 \\u043e\\u043f\\u044b\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b<!-- -->: <span data-qa=\\\"vacancy-experience\\\">\\u043d\\u0435 \\u0442\\u0440\\u0435\\u0431\\u0443\\u0435\\u0442\\u0441\\u044f<\/span><\/p>\\n <p data-qa=\\\"vacancy-view-employment-mode\\\">\\u0421\\u0442\\u0430\\u0436\\u0438\\u0440\\u043e\\u0432\\u043a\\u0430<!-- -->, <span>\\u043f\\u043e\\u043b\\u043d\\u044b\\u0439 \\u0434\\u0435\\u043d\\u044c<\/span><\/p>\\n<\/div>\\n<div class=\\\"vacancy-section\\\">\\n <div class=\\\"g-user-content\\\" data-qa=\\\"vacancy-description\\\">\\n  <p><strong>KPMG is searching for Intern in Tax and Legal Department<\/strong><\/p> \\n  <p>KPMG supplies tax know-how to our clients: we advise businesses on how taxation fits into the broader business picture, and implement decisions that deliver real value. We gain an in-depth understanding of our clients' needs and then provide insights to help them optimize costs - things like where in the world they should base their business to ensure they take advantage of the best tax incentives, and how they should organize their internal structure and tax department - extremely important factors which can help determine cost effectiveness.<\/p> \\n  <p><strong>What will I do in Tax?<\/strong><\/p> \\n  <p>There are two main functions in Tax services: tax advisory and tax compliance. Tax advisory frequently involves working in a multi-disciplinary team and meeting Finance Directors and Senior Managers on client visits. Tax compliance implies that you will take a more specialized approach to analyzing clients' business and tax profiles, looking for process improvements and collaborating with advisory colleagues. But both functions have common principles - starting with an in-depth understanding of the client and a detailed knowledge of the technical issues coupled with communicating complex technical information in a clear and understandable manner.<\/p> \\n  <p>A typical client relationship involves:<\/p> \\n  <p>Extensive preparation and research into the business and client issues;<\/p> \\n  <p>Checking client tax returns for accuracy and identifying potential savings;<\/p> \\n  <p>Helping clients by checking they have all the information required by tax authorities;<\/p> \\n  <p>Organizing client files and preparing initial advice;<\/p> \\n  <p>Consulting and communicating with clients' senior management and auditors;<\/p> \\n  <p>Mastering and understanding the latest tax legislation and working practices;<\/p> \\n  <p>Closely monitoring the client - tax authority relationship;<\/p> \\n  <p>Data analysis and modeling to help clients understand the implications of different tax solutions;<\/p> \\n  <p>Preparing and presenting pitch proposals, client reports and recommendations.<\/p> \\n  <p> <\/p> \\n  <p><strong>What do I need?<\/strong><\/p> \\n  <p>A university degree (be graduate of 2019-2021);<\/p> \\n  <p>Good knowledge of Kazakh tax and accounting legislation is preferable;<\/p> \\n  <p>Fluent English;<\/p> \\n  <p>Strong analytical skills;<\/p> \\n  <p>Willingness to learn and develop professionally;<\/p> \\n  <p>Ability to work full-time.<\/p>\\n <\/div>\\n<\/div>\\n<div class=\\\"vacancy-section\\\"><\/div>\"}"
}