{
    "id":"Kaggle::techmap::6362745c15d33f5d59fc37ed::linkedin_ie::1",
    "label_age":true,
    "analysis_age":"\"thrives in a fast paced environment\" can be regarded as implicit bias against older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 5 years previous experience delivering full life cycle recruitment which enable the successful person to have the knowledge, skills and capabilities to perform the job autonomously. Proven experience of leading people in a busy recruitment environment. Proficient in use of Microsoft Excel \/ Powerpoint. Passion for working with people. Experience of building sustainable working relationships. Persuasive and influencing capabilities. Listen and demonstrate flexibility, patience and empathy. Able to prioritise and deliver on multiple projects. Loves to work independently and thrives in a fast paced environment. Nice To Have. Knowledge of using an HR Information System. Care sector experience. Relevant qualification in recruitment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6362745c15d33f5d59fc37ed::linkedin_ie\", \"source\": \"linkedin_ie\", \"country\": \"IE\", \"company\": \"Ashdale Care Ireland\", \"position\": \"Talent Acquisition Manager\", \"notes\": \"\", \"original\": \"<strong>Job Title:<\/strong>Talent Acquisition Manager<br><br><strong>Location:<\/strong>Hybrid, with travel throughout Ireland, namely, Counties Sligo; Galway; Kilkenny<br><br><strong>Hours of work:<\/strong> Full time<br><br><strong>Reports to:<\/strong> HR Operations Manager<br><br><strong><u>Job Overview<br><br><\/u><\/strong>Our Talent Acquisition Manager will work within our Human Resources Team by acting as the lead for all recruitment related activities within a defined geographical location, working collaboratively with our colleagues and external partners, helping to achieve the aims of the organisation, while conforming to relevant jurisdiction. You will be responsible for ensuring that all necessary checks are carried out on new staff to ensure the safeguarding of the children in our care and help us to transform the lives of those we care for.<br><br><strong><u>Job Description<br><br><\/u><\/strong>Our Talent Acquisition Manager will be a vital and integral part of the HR team and will:<br><ul><li>Lead the entire recruitment lifecycle for a defined geographical location, for all roles, including the creation of Job specifications, placing advertisements, and ensuring compliance checks are completed.<\/li><li>Lead and engage the Talent Acquisition Coordinator to assist with the talent acquisition process.<\/li><li>Work proactively to identify and fill our vacancies, including direct sourcing and working with external partners.<\/li><li>Participate in the selection process for a variety of roles to ensure that only the best people get to join the Ashdale community and work with our young people.<\/li><li>Provide exceptional candidate experience, extending and negotiating offers of employment.<\/li><li>Engage and influence the Talent Acquisition process to ensure it is embedded into the HR department.<\/li><li>Develop and execute sourcing plans in line with our growth plans.<\/li><li>Build and nurture relationships with Universities to secure a future pipeline of talent and showcasing the career paths available at Ashdale Care.<\/li><li>Embody Ashdale Care\\u2019s values in our recruitment and retention processes, which puts people at the centre of everything we do.<\/li><li>Collate feedback, hiring metrics and analytics that inform our recruitment and retention strategies and present findings monthly.<\/li><li>Management of regional recruitment budget and financial reporting in relation to same.<\/li><li>Adhere to safer recruitment policies \\u2013 ensuring that successful candidates are vetted by the relevant organisations and obtain relevant references as per regulations.<\/li><li>Support the implementation of HR systems or databases; to enter data and maintain these accordingly.<\/li><li>Participate in the onboarding process for new colleagues as required<\/li><li>Work alongside Home Managers and organisation leaders and build meaningful working relationships.<\/li><li>Any other duty as reasonably required.<br><\/li><\/ul><strong><u>Must Have<br><br><\/u><\/strong><strong>Requirements<br><\/strong><ul><li>Level 7 or higher degree qualification<\/li><li>5 years previous experience delivering full life cycle recruitment which enable the successful person to have the knowledge, skills and capabilities to perform the job autonomously.<\/li><li>Proven experience of leading people in a busy recruitment environment.<\/li><li>Proficient in use of Microsoft Excel \/ Powerpoint<\/li><li>Passion for working with people<\/li><li>Experience of building sustainable working relationships<\/li><li>Persuasive and influencing capabilities<\/li><li>Listen and demonstrate flexibility, patience and empathy<\/li><li>Able to prioritise and deliver on multiple projects<\/li><li>Loves to work independently and thrives in a fast paced environment<br><\/li><\/ul><strong><u>Nice To Have<br><\/u><\/strong><ul><li>Knowledge of using an HR Information System<\/li><li>Care sector experience<\/li><li>Relevant qualification in recruitment<\/li><\/ul>\"}"
}