{
    "id":"Kaggle::techmap::61414b75a71ddb73057863a1::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Calvary. Permanent Full Time, Permanent Part Time, Casual. Calvary Adelaide Hospital. Position Title. Join one of Australias leading health, community and aged care providers. Permanent full-time position\/Part time position\/ casual position. Excellent salary packaging options available. About the role. Join a dynamic team environment in an acute, fast paced 18 bay Recovery unit. Opportunity to grow, learn and be up skilled in Recovery nursing in a supportive environment. Flexibility to work across a Monday to Friday roster with weekend oncall options. What you bring. Minimum 2 years Recovery or recent acute hospital setting experience. Previous recovery room\/airway management experience would be preferable. Enjoy working in a fast paced environment. A desire to join a team committed to the care of others in a mission based organisation. Benefits. This is an excellent opportunity to be a part of a leading mission based health care organisation. We offer paid parental leave, salary packaging, career progression, flexible working hours and training and skills development. Calvary is also proud to be recognised as a leader in gender equality. Further details are available here: httpswww. calvarycare. org. au\/careers\/benefits\/. About Calvary. Calvary is a national Catholic provider of health, community and aged care services operating in six states and territories. Our services include public and private hospital care, acute and sub-acute care, home care services and retirement and aged care services, in both rural and metropolitan areas. Calvary employs over 11, 000 people and has over 1, 500 volunteers. Calvary continues the mission of the Sisters of the Little Company of Mary, a mission focused on caring for those who are sick, dying and in need. We express our values of hospitality, healing, stewardship and respect through being for others exemplified by the Spirit of Calvary and the example of Venerable Mary Potter. How to join the team. To join our diverse, compassionate and dedicated team for a rewarding Calvary career, please submit an online application. Please note: attached to the job advertisement on the Calvary Careers portal are important documents relating to the role. Please ensure you view these documents before beginning your application. It is suggested that you download a copy of these for your reference. Candidates must hold Australian or NZ Citizenship or the capacity to permanently work in Australia.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61414b75a71ddb73057863a1::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Calvary South Australia\", \"position\": \"Registered Nurse\", \"notes\": \"\", \"original\": \"<strong>Calvary<\/strong><br \/>Permanent Full Time,Permanent Part Time,Casual<br \/><br \/><p><strong><em>Calvary Adelaide Hospital<\/em><\/strong><\/p><p><strong><em>Position Title<\/em><\/strong><\/p><ul><li><div>Join one of Australia\\u2019s leading health, community and aged care providers<\/div><\/li><li><div>Permanent full-time position\/Part time position\/ casual position<\/div><\/li><li><div>Excellent salary packaging options available<\/div><\/li><\/ul><p><strong><em>About the role<\/em><\/strong><\/p><p>Join a dynamic team environment in an acute, fast paced 18 bay Recovery unit<\/p><p>Opportunity to grow, learn and be up skilled in Recovery nursing in a supportive environment<\/p><p>Flexibility to work across a Monday to Friday roster with weekend oncall options\\u00a0<\/p><p>\\u00a0<\/p><p><strong><em>What you bring<\/em><\/strong>\\u00a0\\u00a0<\/p><ul><li><div>Minimum 2 years Recovery or\\u00a0recent acute hospital setting experience<\/div><\/li><li><div>Previous recovery room\/airway management experience would be\\u00a0preferable<\/div><\/li><li><div>Enjoy working in a fast paced environment<\/div><\/li><li><div>A desire to join a team committed to the care of others in a mission based organisation<\/div><\/li><\/ul><p><strong><em>Benefits <\/em><\/strong><\/p><p>This is an excellent opportunity to be a part of a leading mission based health care organisation. We offer paid parental leave, salary packaging, career progression, flexible working hours and training and skills development. Calvary is also proud to be recognised as a leader in gender equality. \\u00a0Further details are available here: <a href=\\\"https:\/\/www.calvarycare.org.au\/careers\/benefits\/\\\" target=\\\"_blank\\\">https:\/\/www.calvarycare.org.au\/careers\/benefits\/<\/a><\/p><p><strong><em>About Calvary<\/em><\/strong><\/p><p>Calvary is a national Catholic provider of health, community and aged care services operating in six states and territories. Our services include public and private hospital care, acute and sub-acute care, home care services and retirement and aged care services, in both rural and metropolitan areas.\\u00a0 Calvary employs over 11,000 people and has over 1,500 volunteers.<\/p><p>Calvary continues the mission of the Sisters of the Little Company of Mary, a <a href=\\\"https:\/\/www.calvarycare.org.au\/about\/mission-and-values\\\" target=\\\"_blank\\\">mission<\/a> focused on caring for those who are sick, dying and in need.\\u00a0 We express our values of hospitality, healing, stewardship and respect through \\u201cbeing for others\\u201d exemplified by the <a href=\\\"https:\/\/www.calvarycare.org.au\/about\/mission-and-values\/\\\" target=\\\"_blank\\\">Spirit of Calvary<\/a> and the example of Venerable <a href=\\\"https:\/\/www.calvarycare.org.au\/about\/heritage\/\\\" target=\\\"_blank\\\">Mary Potter<\/a>.<\/p><p><strong><em>How to join the team<\/em><\/strong><\/p><p>To join our diverse, compassionate and dedicated team for a rewarding Calvary career, please submit an online application.<\/p><p>Please note: attached to the job advertisement on the Calvary Careers portal are important documents relating to the role. Please ensure you view these documents before beginning your application. It is suggested that you download a copy of these for your reference.<\/p><p>Candidates must hold Australian or NZ Citizenship or the capacity to permanently work in Australia. Employment of a temporary visa holder may only occur if no suitable permanent resident or citizen of Australia has been identified for this position following suitable labour market testing.<\/p><p>As part of the application process, you may be required to participate in a health evaluation, which could include face to face assessment and drug and alcohol testing, to ensure your suitability for the role.<\/p><p>Please note we are unable to accept emailed applications or resumes and phone calls from recruitment agencies.<\/p><p>\\u00a0<\/p><p>\\u00a0<\/p><br \/><br \/><strong>Enquiries:<\/strong> Kathryn Yates<br \/><strong>Ph:<\/strong> (08) 8227 6476<br \/><strong>Applications Close:<\/strong> <br \/><br \/>To view the position description or submit your application please click the 'Apply Now' button below.<br \/>\"}"
}