{
    "id":"Kaggle::techmap::61560dafa6740c534abc367b::monster_ca::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase \"Are YOU a HUNTER\" suggests a macho type candidate.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Are YOU a HUNTER? Are you interested in an amazing opportunity to achieve great financial and personal rewards? WE SEEK a dynamic, knowledgeable, and impressive individual who can share our vision and take us to the NEXT LEVEL! You will attract talent and lead our talented team. You will help us grow in agent count, agent productivity, sales volume, and market share all while being supported with Keller Williams's renowned world-class training. You are a strong communicator, who naturally connects with others and builds great relationships. You are a top producer with a track record of leadership. You are a highly assertive, passionate, people-oriented individual who operates with high urgency. You can self-manage and are results driven, committed to achieving every goal, with no ceiling in earning. You have the desire to develop and cultivate a dominant real estate company. You can prove this by demonstrating where you have used influence to recruit and lead others in your previous positions. You will become the next TEAM LEADER in our Keller Williams Market Centre, sharing in the KW culture. Compensation: $120, 000 - $140, 000 yearly. Responsibilities: Recruit Realtors – weekly (interview, select, hire). Willingness to cold call. Research competition and develop business prospecting and marketing strategies to successfully compete. Share Market Center values and opportunities with new and existing agents. Lead sales and business meetings. Develop and cultivate business relationships. Qualifications: Extraordinary people skills. Leadership, management, team-building skills. Goal setting, planning, accountability skills. Above-average hiring skills. Career development and training skills. Top-producing sales success track record in recent past. Real estate knowledge, experience, emphasis on residential real estate is a bonus. About Company. Keller Williams Realty Centres launched in Newmarket, Ontario on November 27, 2009. Since that date, the company has become the fastest-growing brokerage in the area with locations in Georgina, Newmarket and Aurora, with well over 200 REALTORS to date and still growing strong! The open, caring and sharing culture at Keller Williams Realty Centres has created a positive, enthusiastic atmosphere that has attracted associates who truly care about the decisions their clients make..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61560dafa6740c534abc367b::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Keller Williams Realty Centres\", \"position\": \"Real Estate Recruiter\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Are <strong>YOU <\/strong>a <strong>HUNTER<\/strong>? Are you interested in an amazing opportunity to achieve great financial and personal rewards?&nbsp;<\/p> <p><strong>WE SEEK<\/strong> a dynamic, knowledgeable, and impressive individual who can share our vision and take us to the <strong>NEXT LEVEL! <\/strong>&nbsp;You will attract talent and lead our talented team. You will help us grow in agent count, agent productivity, sales volume, and market share all while being supported with Keller Williams's renowned world-class training.&nbsp;<\/p> <p>You are a strong communicator, who naturally connects with others and builds great relationships. You are a top producer with a track record of leadership.&nbsp;You are a highly assertive, passionate, people-oriented individual who operates with high urgency. You can self-manage and are results driven, committed to achieving every goal, with no ceiling in earning.&nbsp;You have the desire to develop and cultivate a dominant real estate company. You can prove this by demonstrating where you have used influence to recruit and lead others in your previous positions. You will become the next TEAM LEADER in our Keller Williams Market Centre, sharing in the KW culture.<\/p><b>Compensation:<\/b> <p>$120,000 - $140,000 yearly<\/p><b>Responsibilities:<\/b> <p><\/p> <p><\/p> <ul> <li>Recruit Realtors \\u2013 weekly (interview, select, hire)<\/li> <li>Willingness to cold call<\/li> <li>Research competition and develop business prospecting and marketing strategies to successfully compete<\/li> <li>Share Market Center values and opportunities with new and existing agents<\/li> <li>Oversee training for existing sales associates (new and experienced) in key areas of business<\/li> <li>Lead sales and business meetings<\/li> <li>Develop and cultivate business relationships<\/li> <\/ul><b>Qualifications:<\/b> <p><\/p> <p><\/p> <ul> <li>Extraordinary people skills<\/li> <li>Leadership, management, team-building skills<\/li> <li>Goal setting, planning, accountability skills<\/li> <li>Above-average hiring skills<\/li> <li>Career development and training skills<\/li> <li>Top-producing sales success track record in recent past<\/li> <li>Real estate knowledge, experience, emphasis on residential real estate is a bonus.<\/li> <\/ul><b>About Company<\/b> <br> <p>Keller Williams Realty Centres launched in Newmarket, Ontario on November 27, 2009.&nbsp;Since that date, the company has become the fastest-growing brokerage in the area with locations in Georgina, Newmarket and Aurora, with well over 200 REALTORS to date and still growing strong! The open, caring and sharing culture at Keller Williams Realty Centres has created a positive, enthusiastic atmosphere that has attracted associates who truly care about the decisions their clients make.<\/p> <p><br><\/p> <p>Frequently recognized as the most innovative and agent-friendly brokerage in Canada, Keller Williams Realty Centres Aurora\/Newmarket is a busy well-established office with over 220 agents. We are #1 in market share in our area.<\/p> <p>&nbsp;<\/p> <p>Keller Williams Realty Centres is a positive environment that will push you to unlimited potential. Here you can make an impact; help people create wealth and make a difference in the community!<\/p> <\/div>\"}"
}