{
    "id":"Kaggle::techmap::614c7569c5d812020e5113e3::monsterasia_ph::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Description. Duration: Long Term. Positions Available: 2. Details: The Field Service Dispatcher I will be responsible for initial and intra-day scheduling. This individual should be detail oriented and be able to function under pressure, in a fast paced environment. Job Requirements. Details: Job Responsibilities: Managing multitude phone calls, emails and messages internally. Responsible for the timely\/accurate execution of tasks assigned by the Division Manager and Project Managers\/Service Managers. Initiation of jobs and tasks for field service technicians. Create work orders for field service technicians. Review candidates and preform phone interviews. Dispatching service employees to projects accordingly. Ensures all trip assignments are covered every day they are scheduled. Debrief technicians at the end of their call. Actively reviews completed work orders with technicians for accuracy prior to invoicing. Maintains knowledge of assigned market to insure we provide the best directions for technicians. Identify additional room for improvement in the team by bringing ideas to supervisor for review and implementation. Customer interaction skills to ensure a high level of customer satisfaction. Responsible for the timely\/accurate execution of tasks assigned by the Division Manager and Project Managers\/Service Managers. Ensures that administrative processes for projects are run in compliance with the organizations requirements. Assist in billing\/filing as needed. Provide administrative support to facilitate the planning and coordination of activities for a project, maintain files\/documents and provide any information needed by the Division Manager and Project Managers\/Service Managers. Provide basic status reporting to the Division Manager and Project Managers\/Service Managers and responds to requests for service\/assistance\/information to all internal\/external customers. Must be able to work flexible hours with the understanding that workdays can be in excess of normal hours and some weekend and holiday work may be required. Key Competencies: Strong detailed mindset and organizational skills. Strong sense of urgency is a MUST. Ability to maintain composure in stressful situations. Strong communication skills. Basic Microsoft Windows skills. Experienced with Microsoft Excel. Excellent verbal and basic writing skills. Analytical and data entry skills a must. Pleasant telephone manner. Strong work ethic with proven dependability. Education and Experience: Experience in scheduling and routing a plus. Additional Notes: The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c7569c5d812020e5113e3::monsterasia_ph\", \"source\": \"monsterasia_ph\", \"country\": \"PH\", \"company\": \"Stefanini Philippines, Inc.\", \"position\": \"Field Service Dispatcher\", \"notes\": \"\", \"original\": \"<br>Job Description<br>Duration:<br>Long Term<br>Positions Available:<br>2<br>Details:<br>The Field Service Dispatcher I will be responsible for initial and intra-day scheduling. This individual should be detail oriented and be able to function under pressure, in a fast paced environment.<br>Job Requirements<br>Details:<br><strong>Job Responsibilities:<\/strong><ul><li>Managing multitude phone calls, emails and messages internally.<\/li><li>Responsible for the timely\/accurate execution of tasks assigned by the Division Manager and Project Managers\/Service Managers.<\/li><li>Initiation of jobs and tasks for field service technicians<\/li><li>Create work orders for field service technicians<\/li><li>Review candidates and preform phone interviews<\/li><li>Dispatching service employees to projects accordingly.<\/li><li>Ensures all trip assignments are covered every day they are scheduled.<\/li><li>Debrief technicians at the end of their call<\/li><li>Actively reviews completed work orders with technicians for accuracy prior to invoicing.<\/li><li>Maintains knowledge of assigned market to insure we provide the best directions for technicians.<\/li><li>Identify additional room for improvement in the team by bringing ideas to supervisor for review and implementation<\/li><li>Customer interaction skills to ensure a high level of customer satisfaction.<\/li><li>Responsible for the timely\/accurate execution of tasks assigned by the Division Manager and Project Managers\/Service Managers.<\/li><li>Ensures that administrative processes for projects are run in compliance with the organizations requirements.<\/li><li>Assist in billing\/filing as needed.<\/li><li>Provide administrative support to facilitate the planning and coordination of activities for a project, maintain files\/documents and provide any information needed by the Division Manager and Project Managers\/Service Managers.<\/li><li>Provide basic status reporting to the Division Manager and Project Managers\/Service Managers and responds to requests for service\/assistance\/information to all internal\/external customers.<\/li><li>Must be able to work flexible hours with the understanding that workdays can be in excess of normal hours and some weekend and holiday work may be required.<\/li><\/ul><br><strong>Key Competencies:<\/strong><ul><li>Strong detailed mindset and organizational skills<\/li><li>Strong sense of urgency is a MUST<\/li><li>Ability to maintain composure in stressful situations<\/li><li>Strong communication skills<\/li><li>Basic Microsoft Windows skills<\/li><li>Experienced with Microsoft Excel<\/li><li>Excellent verbal and basic writing skills<\/li><li>Analytical and data entry skills a must<\/li><li>Pleasant telephone manner<\/li><li>Strong work ethic with proven dependability<\/li><\/ul><br><strong>Education and Experience:<\/strong><ul><li>Experience in scheduling and routing a plus<\/li><\/ul><br><strong>Additional Notes:<\/strong><br>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br>\"}"
}