{
    "id":"Kaggle::techmap::614e2ad4f4499e0e800ebd7c::linkedin_lu::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Expertise in foreign currency hedging and asset pooling techniques. Experience in fund migration (merger, TIK, fund restructure etc). Experience in funds accounting on Multifonds. Good knowledge in MS Office tool (mainly Excel). Language knowledge:. Professional command of French and English. Personal qualities:. Flexibility. Can-do attitude, client centric mindset. Sense of initiative and willing to learn. Good analytical skills. Rigorous and Organized. Manage Stress and prioritization. Team Spirit and Autonomy. Note. We will not accept any CVs via agencies. In accordance with the provisions of the Luxembourg law of 23 July 2016 amending the law of 29 March 2013, candidates may be required to provide an extract from their criminal record. This document, issued by the authorities, must not be older than three months. Such a document will be requested with the aim of carrying out a character check on candidates, bearing in mind the area of activity of our establishment and, more particularly, the tasks described in the job description. Diversity & Inclusion Pictet is an equal opportunity employer and is committed to creating a diverse environment. We respect all individuals and seek their inclusion in the workplace.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614e2ad4f4499e0e800ebd7c::linkedin_lu\", \"source\": \"linkedin_lu\", \"country\": \"LU\", \"company\": \"Pictet Group\", \"position\": \"Fund Client Support Officer\", \"notes\": \"\", \"original\": \"Your team <p> <br><br><\/p> <p>FundPartner Solutions (Europe) S.A. (\\\"FPS Europe\\\"), a Pictet Group company set up in January 2012, offers its clients a first-rate fund administration service and, in anticipating future regulatory challenges, positions itself as a management company dedicated to third-party fund clients. <br>FPS Europe is a Luxembourg UCITS and AIFM management company subject to Chapter 15 of the Luxembourg law of 17 December 2010 on undertakings for collective investment, as well as the Law of 12 July 2013. FPS Europe covers all the tasks related to fund administration, including fund accounting and NAV calculation, risk management, transfer agent, distribution and domiciliary services, together with investment controlling and a Director's Office. In doing so, it offers the entire range of services related to aspects of risk, governance and regulations.<br><br><\/p> <p><br>Within the fund accounting department, we are looking for a dynamic and experienced candidate to join the Fund Client Support team.<br><br><\/p> <p><br>The Fund Client Support officer performs the FA CSO activities (parametrization, fund fees, fund event projects). Have strong technical accounting skills and be driven to keep abreast with current requirements, his\/or her role is also to contribute improvement of the processes, procedures and operational platforms to guarantee the proper application of controls and consistently exceed client's needs and expectations.<br>He\/or she is also responsible for handling internal and external client queries, the position interacts with all levels of professionals both internally and externally. Therefore, a good interpersonal and communication skills are required.<br><br><\/p> <p> <br><br><\/p> Your role <p> <br><br><\/p> <ul> <li>Plan &amp; Coordinate fund events within FA, with Business Implementation;<\/li> <li>Ensure FA CSO key role in maintaining fees databases and parametrizing FA systems (e.g Multifonds);<\/li> <li>Be involved in fund events, fund migration or restructure activity; <\/li> <li>Point of contact for external, internal clients and auditors relating to FA CSO activities;<\/li> <li>Work closely with CRM, project managers to anticipate client needs and provide added value to them;<\/li> <li>Coordinate the funds fees payments and fees accounting activity;<\/li> <li>Log, Plan, Analyse and Report client support activities (Jira log &amp; KPIs);<\/li> <li>Manage escalating service issues, escalate to management if required;<\/li> <li>Stay abreast of all internal policies and compliance to legal and regulatory requirements.<\/li> <br><\/ul> <p> <br><br><\/p> Your profile <p> <br><br><\/p> <p>Educational background and employment experience: <br><br><\/p> <p> <br><br><\/p> <ul> <li>University degree in Finance or Economics;<\/li> <li>5 or more years of previous accounting experience; <\/li> <li>Project management and client service skills are required; <\/li> <li>Good knowledge of financial products and funds regulation;<\/li> <li>Outstanding communication skills.<\/li> <br><\/ul> <p> <br><br><\/p> <p>Specific knowledge: <br><br><\/p> <p> <br><br><\/p> <ul> <li>Expertise in foreign currency hedging and asset pooling techniques;<\/li> <li>Experience in fund migration (merger, TIK, fund restructure etc);<\/li> <li>Experience in funds accounting on Multifonds;<\/li> <li>Good knowledge in MS Office tool (mainly Excel).<\/li> <br><\/ul> <p> <br><br><\/p> <p>Language knowledge: <br><br><\/p> <p> <br><br><\/p> <ul> <li>Professional command of French and English.<\/li> <br><\/ul> <p> <br><br><\/p> <p>Personal qualities: <br> <br><br><\/p> <ul> <li>Flexibility - Can-do attitude, client centric mindset;<\/li> <li>Sense of initiative and willing to learn;<\/li> <li>Good analytical skills;<\/li> <li>Rigorous and Organized; <\/li> <li>Manage Stress and prioritization;<\/li> <li>Team Spirit and Autonomy. <\/li> <br><\/ul> <p> <br><br><\/p> Note <p> <br><br><\/p> <p>We will not accept any CVs via agencies.<br><br><\/p> <p> <br><br><\/p> <p>In accordance with the provisions of the Luxembourg law of 23 July 2016 amending the law of 29 March 2013, candidates may be required to provide an extract from their criminal record. This document, issued by the authorities, must not be older than three months. Such a document will be requested with the aim of carrying out a character check on candidates, bearing in mind the area of activity of our establishment and, more particularly, the tasks described in the job description.<br><br><\/p> <p> <br><br><\/p> Diversity &amp; Inclusion <p><strong>Pictet is an equal opportunity employer and is committed to creating a diverse environment. We respect all individuals and seek their inclusion in the workplace.<br><br><\/strong><\/p>\"}"
}