{
    "id":"Kaggle::techmap::615c4db3b0aa23063325e128::snagajob_us::9",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Geared for the Driven. Interested in a rewarding career with great pay, outstanding benefits and the opportunity to grow? Henley Enterprises Inc, the largest franchisee of Valvoline Instant Oil ChangeSM (VIOC), is hiring Automotive Technicians. Whether you’re looking for a part-time job with flexible hours or a full-time career with excellent advancement potential, you’ll find it all at VIOC. Interested in making the switch from retail? This position is for you! With an award-winning training program and fair and honest values, we’re here to help you advance your career. Safety is always top of mind for Valvoline Instant Oil ChangeSM (VIOC), and we want you to know that we are working hard to protect our team members and our guests with our stay-in-your-car oil change process plus newly added safety measures in line with CDC guidelines. What you’ll do. As an Entry Level Automotive Technician, you will help drive the continued success of VIOC by providing reliable and impeccable preventive maintenance service. You will act as a trusted advisor to our customers, evaluating their needs and performing maintenance to keep their vehicle serviced and safe on the road. Evaluate customers’ needs, working quickly and efficiently. Perform automotive preventive maintenance such as changing oil, checking and refilling other vehicle fluids, replacing filters, and inspecting and replacing lights and wipers. Contribute to a fun team atmosphere. Become an expert in our products, services, and a growing company. Maintain a clean and safe workplace. How you’ll succeed. You are friendly and ready to work as part of a customer-focused team. We prefer some experience in retail or a service industry – no automotive knowledge needed. Have effective interpersonal, oral communication skills. Have an eagerness to learn. You can lift up to 50 pounds. Must be 18 years of age or older. Can stand for extended periods of time and climb stairs. Benefits include: Flexible work schedule & competitive pay starting at $16. 50\/hour! Paid on-the-job training, based upon a nationally awarded training program. We promote from within– 95% of upper management started in an entry level position. Tuition reimbursement. Paid vacation and sick time*. Medical, dental, vision, and 401(k) savings plans*.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615c4db3b0aa23063325e128::snagajob_us\", \"source\": \"snagajob_us\", \"country\": \"US\", \"company\": \"Valvoline Instant Oil Change\", \"position\": \"Entry Level Automotive Technician - Rancho San Diego\", \"notes\": \"\", \"original\": \"<div _ngcontent-sc255=\\\"\\\" class=\\\"job-description\\\">\\n <div _ngcontent-sc255=\\\"\\\">\\n  <div _ngcontent-sc255=\\\"\\\" class=\\\"ng-star-inserted\\\">\\n   <p><strong>Geared for the Driven<\/strong><\/p>\\n   <p>Interested in a rewarding career with great pay, outstanding benefits and the opportunity to grow? Henley Enterprises Inc, the largest franchisee of Valvoline Instant Oil Change<sup>SM<\/sup>&nbsp;(VIOC), is hiring Automotive Technicians. Whether you\\u2019re looking for a part-time job with flexible hours or a full-time career with excellent advancement potential, you\\u2019ll find it all at VIOC. Interested in making the switch from retail? This position is for you! With an award-winning training program and fair and honest values, we\\u2019re here to help you advance your career.<\/p>\\n   <p><br>Safety is always top of mind for Valvoline Instant Oil Change<sup>SM<\/sup> (VIOC), and we want you to know that we are working hard to protect our team members and our guests with our stay-in-your-car oil change process plus newly added safety measures in line with CDC guidelines.<\/p>\\n   <p><strong>What you\\u2019ll do<\/strong><\/p>\\n   <p>As an Entry Level Automotive Technician, you will help drive the continued success of VIOC by providing reliable and impeccable preventive maintenance service. You will act as a trusted advisor to our customers, evaluating their needs and performing maintenance to keep their vehicle serviced and safe on the road.<\/p>\\n   <ul>\\n    <li>Evaluate customers\\u2019 needs, working quickly and efficiently<\/li>\\n    <li>Perform automotive preventive maintenance such as changing oil, checking and refilling other vehicle fluids, replacing filters, and inspecting and replacing lights and wipers<\/li>\\n    <li>Contribute to a fun team atmosphere<\/li>\\n    <li>Become an expert in our products, services, and a growing company<\/li>\\n    <li>Maintain a clean and safe workplace<\/li>\\n   <\/ul>\\n   <p><strong>&nbsp;How you\\u2019ll succeed<\/strong><\/p>\\n   <ul>\\n    <li>You are friendly and ready to work as part of a customer-focused team<\/li>\\n    <li>We prefer some experience in retail or a service industry \\u2013 no automotive knowledge needed<\/li>\\n    <li>Have effective interpersonal, oral communication skills<\/li>\\n    <li>Have an eagerness to learn<\/li>\\n    <li>You can lift up to 50 pounds<\/li>\\n    <li>Must be 18 years of age or older<\/li>\\n    <li>Have full mobility and the ability to work with your hands above your head<\/li>\\n    <li>Can stand for extended periods of time and climb stairs<\/li>\\n   <\/ul>\\n   <p><strong>Benefits include:<\/strong><\/p>\\n   <ul>\\n    <li>Flexible work schedule &amp; competitive pay starting at <strong>$16.50\/hour!<\/strong><\/li>\\n    <li>Paid on-the-job training, based upon a nationally awarded training program<\/li>\\n    <li>We promote from within\\u2013 95% of upper management started in an entry level position<\/li>\\n    <li>Tuition reimbursement<\/li>\\n    <li>Paid vacation and sick time*<\/li>\\n    <li>Medical, dental, vision, and 401(k) savings plans*<\/li>\\n   <\/ul>\\n   <p><em>*Terms and conditions apply and benefits may differ depending on location<\/em><\/p>\\n   <p><em>Henley Enterprises, Inc. and its affiliates are proud to be an Equal Opportunity Employer.&nbsp; All qualified applicants will receive consideration for employment without regard to race, color religion, sex, gender identity, sexual orientation, national origin, or protected veteran status and will not be discriminated against on the basis of disability.<\/em><\/p>\\n   <img src=\\\"https:\/\/www.applytracking.com\/tp\/rj6.fHNy-y-K\\\">\\n  <\/div>\\n <\/div>\\n<\/div>\"}"
}