{
    "id":"Kaggle::techmap::615473682806882b6abc6202::linkedin_us::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". Job Profile. Position Overview. At PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. In Commercial Lending Operations we want to inspire new and innovative ideas on how to provide “best in class” service to our customers. As an Operations Work Lead Sr. within the CLO. Participated Servicing organization, you will be based in Brecksville, OH. We seek motivated, driven and creative individuals that enjoy working as part of a team in a high-energy environment which thrives on innovation and ingenuity. You will work together to create new solutions which will provide our clients with an exceptional customer experience. Valued opinions, supported by collaborative teams, impact the success of CLO. Job Description. Oversees operations workflow and assists team with executing complex transactions\/processes. Monitors and coordinates operations workflow and resolves escalated issues. May process and\/or reconcile transactions of varying risk and financial value in accordance with established policies and procedures. Partners internally to identify, resolve, and provide guidance regarding escalations. May interact with external customers and third parties in completing transactions or resolving escalated issues. Coaches team members and provides applicable training. Leads team huddles\/meetings and\/or continuous improvement sessions. Provides input on team member performance and development. Provides consultation and advice to internal and external customers. Reviews existing processes and drives improvements\/implementation. Participates in and serves as subject matter resource for projects. Reviews transactions and related documents, and verifies work processes to ensure completeness, accuracy, and conformance to established service levels and applicable procedures. Reviews reports to identify exceptions, monitor quality, and ensure compliance. Participates in risk mitigation activities. Verifies completeness and accuracy of procedures. PNC Employees take pride in our reputation and to continue building upon that we expect our employees to be: Customer Focused. Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions. Managing Risk. Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework. Competencies. Accuracy and Attention to Detail – Understanding of the necessity and value of accuracy and attention to detail. Ability to process information with high levels of accuracy..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615473682806882b6abc6202::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"PNC\", \"position\": \"Operations Work Lead Sr\", \"notes\": \"\", \"original\": \"<br><br><br><strong>Job Profile<br><br><\/strong><strong>Position Overview<\/strong>At PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. In Commercial Lending Operations we want to inspire new and innovative ideas on how to provide \\u201cbest in class\\u201d service to our customers. As an Operations Work Lead Sr. within the CLO - Participated Servicing organization, you will be based in Brecksville, OH.<br><br>We seek motivated, driven and creative individuals that enjoy working as part of a team in a high-energy environment which thrives on innovation and ingenuity. You will work together to create new solutions which will provide our clients with an exceptional customer experience. Valued opinions, supported by collaborative teams, impact the success of CLO.<p><strong>Job Description<br><br><\/strong><\/p><ul><li>Oversees operations workflow and assists team with executing complex transactions\/processes.<\/li><li>Monitors and coordinates operations workflow and resolves escalated issues. May process and\/or reconcile transactions of varying risk and financial value in accordance with established policies and procedures. Partners internally to identify, resolve, and provide guidance regarding escalations. May interact with external customers and third parties in completing transactions or resolving escalated issues.<\/li><li>Coaches team members and provides applicable training. Leads team huddles\/meetings and\/or continuous improvement sessions. Provides input on team member performance and development.<\/li><li>Provides consultation and advice to internal and external customers. Reviews existing processes and drives improvements\/implementation. Updates standard operating procedures. Participates in and serves as subject matter resource for projects.<\/li><li>Reviews transactions and related documents, and verifies work processes to ensure completeness, accuracy, and conformance to established service levels and applicable procedures. Reviews reports to identify exceptions, monitor quality, and ensure compliance. Participates in risk mitigation activities. Verifies completeness and accuracy of procedures.<\/li><\/ul><p>PNC Employees take pride in our reputation and to continue building upon that we expect our employees to be:<br><br><\/p><ul><li><strong>Customer Focused<\/strong> - Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions.<\/li><li><strong>Managing Risk<\/strong> - Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework.<\/li><\/ul><strong>Competencies<\/strong>Accuracy and Attention to Detail \\u2013 Understanding of the necessity and value of accuracy and attention to detail; ability to process information with high levels of accuracy.Effective Communications \\u2013 Understanding of effective communication concepts, tools and techniques; ability to effectively transmit, receive, and accurately interpret ideas, information, and needs through the application of appropriate communication behaviors.Managing Multiple Priorities \\u2013 Ability to manage multiple concurrent objectives, projects, groups, or activities, making effective judgments as to prioritizing and time allocation.Operational Functions \\u2013 Knowledge of major functional processes and associated operating requirements; ability to apply this knowledge appropriately to diverse situations.Problem Management Process \\u2013 Knowledge of and ability to bring a reported problem to successful resolution.Process Management \\u2013 Knowledge of business process improvement tools and techniques and ability to understand, monitor, update, or enhance existing business or work processes.Products and Services \\u2013 Knowledge of major products and services and product and service groups; ability to apply this knowledge appropriately to diverse situations.Standard Operating Procedures \\u2013 Knowledge of and ability to design, implement and evaluate standard operating procedures affecting daily and strategic business operations in order to increase operational efficiency.<strong>Work Experience<\/strong>Roles at this level typically require a university \/ college degree with &lt; 1 year of professional experience and\/or successful completion of a formal development program. In lieu of a degree, a comparable combination of education and experience (including military service) may be considered.<strong>Education<\/strong>Bachelors<p><strong>Additional Job Description<br><br><\/strong><\/p><p><strong>Benefits<br><br><\/strong><\/p><p>PNC offers employees a comprehensive range of benefits to help meet your needs now and in the future. Depending on your eligibility, options for full-time employees include medical\/prescription drug coverage (with a Health Savings Account feature); dental and vision options; employee and spouse\/child life insurance; short- and long-term disability protection; maternity and parental leave; paid holidays, vacation days and occasional absence time; 401(k), pension and stock purchase plans; dependent care reimbursement account; back-up child\/elder care; adoption assistance; educational assistance and a robust wellness program with financial incentives. To learn more about these and other programs, including benefits for part-time employees, visit pncbenefits.com &gt; New to PNC.<br><br><\/p><p><strong>Disability Accommodations Statement:<br><br><\/strong><\/p><p><br>The PNC workplace is inclusive and supportive of individual needs. If you have a physical or other impairment that might require an accommodation, including technical assistance with the PNC Careers website or submission process, please call 877-968-7762 and select Option 4: Recruiting or contact us via email at pathfinder@pnc.com. <br><br><\/p><p>The Human Resources Service Center hours of operation are Monday - Friday 9:00 AM to 5:00 PM ET.<br><br><\/p><p><strong>Equal Employment Opportunity (EEO):<br><br><\/strong><\/p><p><br>PNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law.<br><br><\/p><p><strong>California Residents <br><br><\/strong><\/p><p>Refer to the California Consumer Privacy Act Privacy Notice to gain understanding of how PNC may use or disclose your personal information in our hiring practices.<br><br><\/p>\"}"
}