{
    "id":"Kaggle::techmap::6144500ca5224e6280f72e86::careerbuilder_us::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Warehouse Associate. Monday. Friday 7 am. 4 pm 15. 00hr. and up. Ferguson: Come Grow with Us! We realize that our greatest assets are our best-in-class associates, which is why we're dedicated to offering limitless opportunities for growth and advancement. We want to help you build a long-lasting career with Ferguson. Together, we can continue to lead the industry and help build our nation's infrastructure from the ground up. Join our team today. Ferguson is currently seeking the right individual to fill an immediate need for a Warehouse Associate. Responsibilities. As a Warehouse Associate, you will: Work in a fast-paced order fulfillment environment. Safely operate a stand-up forklift (order selector\/cherry picker) to pull and prepare outbound customer orders. Utilize a RF devices to complete shipping\/receiving transactions in our operating system. Accurately and timely receive, verify, stage and stock all incoming material. Clean the work-space as you go and participate with the team in keeping our facility clean, safe, and accident free. Qualifications. Positive attitude, dependability, and strong work ethic. Self-starter with the ability to learn our systems quickly. Prior Warehouse experience in shipping, receiving, delivery, or inventory is required. Previous stand up forklift (order selector\/cherry picker) operating at heights is strongly recommended. Previous forklift experience is strongly recommended. Must be able to lift items that weigh up to of 50lbs regularly. A safe individual with knowledge of safety regulations and procedures. Benefits. Ferguson is dedicated to providing meaningful benefits programs and products to our associates and their families-geared toward benefits, wellness, financial protection and retirement savings. Ferguson offers a competitive benefits package which includes medical, dental, vision, retirement savings with company match, paid leave (vacation, sick, personal and holiday), employee assistance programs, associate discounts, community involvement opportunities and much more!.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144500ca5224e6280f72e86::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Ferguson\", \"position\": \"Warehouse Associate\", \"notes\": \"\", \"original\": \"<p><strong>Warehouse Associate <\/strong><\/p><p><\/p><p><strong> Monday - Friday 7 am - 4 pm 15.00hr. and up<\/strong><\/p><p><\/p><p><em><strong>Ferguson: Come Grow with Us!<\/strong><\/em><\/p><p><\/p><p>We realize that our greatest assets are our best-in-class associates, which is why we're dedicated to offering limitless opportunities for growth and advancement. We want to help you build a long-lasting career with Ferguson. Together, we can continue to lead the industry and help build our nation's infrastructure from the ground up. Join our team today. <\/p><p><\/p><p>Ferguson is currently seeking the right individual to fill an immediate need for a Warehouse Associate. <\/p><p><\/p><p><strong>Responsibilities<\/strong> <\/p><p>As a Warehouse Associate, you will: <\/p><ul><li><p>Work in a fast-paced order fulfillment environment<\/p><\/li><li><p>Safely operate a stand-up forklift (order selector\/cherry picker) to pull and prepare outbound customer orders.<\/p><\/li><li><p>Utilize a RF devices to complete shipping\/receiving transactions in our operating system.<\/p><\/li><li><p>Accurately and timely receive, verify, stage and stock all incoming material <\/p><\/li><li><p>Clean the work-space as you go and participate with the team in keeping our facility clean, safe, and accident free.<\/p><\/li><\/ul><p><\/p><p><strong>Qualifications<\/strong> <\/p><ul><li><p>Positive attitude, dependability, and strong work ethic.<\/p><\/li><li><p>Self-starter with the ability to learn our systems quickly.<\/p><\/li><li><p>Prior Warehouse experience in shipping, receiving, delivery, or inventory is required. <\/p><\/li><li><p>Previous stand up forklift (order selector\/cherry picker) operating at heights is strongly recommended.<\/p><\/li><li><p>Previous forklift experience is strongly recommended.<\/p><\/li><li><p>Must be able to lift items that weigh up to of 50lbs regularly.<\/p><\/li><li><p>A safe individual with knowledge of safety regulations and procedures.<\/p><\/li><li><p>Product knowledge of the plumbing industry or the ability to quickly learn it is a plus.<\/p><\/li><\/ul><p><\/p><p><strong>Benefits<\/strong> <\/p><p>Ferguson is dedicated to providing meaningful benefits programs and products to our associates and their families-geared toward benefits, wellness, financial protection and retirement savings. Ferguson offers a competitive benefits package which includes medical, dental, vision, retirement savings with company match, paid leave (vacation, sick, personal and holiday), employee assistance programs, associate discounts, community involvement opportunities and much more! <\/p>&nbsp;\"}"
}