{
    "id":"Kaggle::techmap::6154996918d1697280f55ae1::linkedin_cn::0",
    "label_age":true,
    "analysis_age":"The assumption of a \"seasoned and experienced BPA\" implies that only candidates with extensive experience are suitable, potentially excluding younger or less experienced but capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The term \"he\/she\" reinforces a binary gender perspective, potentially excluding non-binary or gender-nonconforming individuals.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 18 million Chinese patients benefit from Novartis products! The role is responsible for management of full P&L for specific BU, to ensure effective and timely delivery of insightful, recurring or ad-hoc financial information to BU management. It requires proactive business partnering and cross-functional collaboration with commercial, sales and other teams. This BU is a key pillar of the overall Pharma China strategy, with China being one of the Novartis Global key priorities. All this requires significant expertise in all positions including BPA. There is significant complexity in the business, especially around various policies changes, evolution of China pharma market, access model and new product launch. The role will be working on business case, sales modeling, competition scenarios, investment analytics, performance tracking and operation effectiveness driving, etc., which require a very seasoned and experience BPA to act as trusted business partner. He\/she should be able to gain a deep understanding of the product and market to provide analytics to the BU Head, BPA Head, CFO and other management to support strategic decision making and achieve overall business objectives. Your key responsibilities: Your responsibilities include, but are not limited to: Provide Franchise Management with accurate, relevant business analysis to support monthly performance updates and ad-hoc requests on sales and expenses, cost centers, sales channels, P&L etc. Ensure on-going business performance is appropriately monitored and measured, and drive early warning for re-direction of resources. Develop robust monthly forecasts and the annual budget\/LF process, support the mid-term or long-term strategic planning of franchise. Ensure proactive Business Partnering with Marketing, Sales, Supply Chain and other Functions. Assist implementation of smooth processes to enable on-time and accurate information gathering. Also collaborate with other Finance functions to ensure consistent financial data reporting processes and results. Identify and manage key business risks and opportunities proactively through close interaction with business. Proactively carry out value-added analysis to support stakeholder decision making (e. g., business case, future launches, challenge status quo). Gain deep knowledge of the products, including market, competitors, indications, epidemiology and all relevant assumptions to ensure comprehensive understanding of the product commercial plan. Drive continuous learning within team by performing post-implementation financial analysis on past initiatives and sharing results across the organization. What youll bring to the role: University degree preferably in Finance \/ Economics related subject, or professional accounting qualification. MBA is preferred.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6154996918d1697280f55ae1::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"\\u8bfa\\u534e\", \"position\": \"Senior BPA Manager\", \"notes\": \"\", \"original\": \"<strong>\\u5de5\\u4f5c\\u63cf\\u8ff0<br><br><\/strong>18 million Chinese patients benefit from Novartis products!<br><br>The role is responsible for management of full P&amp;L for specific BU, to ensure effective and timely delivery of insightful, recurring or ad-hoc financial information to BU management. It requires proactive business partnering and cross-functional collaboration with commercial, sales and other teams.<br><br>This BU is a key pillar of the overall Pharma China strategy, with China being one of the Novartis Global key priorities. All this requires significant expertise in all positions including BPA. There is significant complexity in the business, especially around various policies changes, evolution of China pharma market, access model and new product launch.<br><br>The role will be working on business case, sales modeling, competition scenarios, investment analytics, performance tracking and operation effectiveness driving, etc., which require a very seasoned and experience BPA to act as trusted business partner.<br><br>He\/she should be able to gain a deep understanding of the product and market to provide analytics to the BU Head, BPA Head, CFO and other management to support strategic decision making and achieve overall business objectives.<br><br>Your key responsibilities:<br><br>Your responsibilities include, but are not limited to:<br><ul><li> Provide Franchise Management with accurate, relevant business analysis to support monthly performance updates and ad-hoc requests on sales and expenses, cost centers, sales channels, P&amp;L etc.<\/li><li> Ensure on-going business performance is appropriately monitored and measured, and drive early warning for re-direction of resources<\/li><li> Develop robust monthly forecasts and the annual budget\/LF process, support the mid-term or long-term strategic planning of franchise<\/li><li> Ensure proactive Business Partnering with Marketing, Sales, Supply Chain and other Functions; assist implementation of smooth processes to enable on-time and accurate information gathering; also collaborate with other Finance functions to ensure consistent financial data reporting processes and results<\/li><li> Identify and manage key business risks and opportunities proactively through close interaction with business<\/li><li> Proactively carry out value-added analysis to support stakeholder decision making (e.g., business case, future launches, challenge status quo)<\/li><li> Gain deep knowledge of the products, including market, competitors, indications, epidemiology and all relevant assumptions to ensure comprehensive understanding of the product commercial plan<\/li><li> Drive continuous learning within team by performing post-implementation financial analysis on past initiatives and sharing results across the organization<br><br><br><\/li><\/ul><strong>\\u57fa\\u672c\\u8981\\u6c42<br><br><\/strong>What you\\u2019ll bring to the role:<br><ul><li> University degree preferably in Finance \/ Economics related subject, or professional accounting qualification. MBA is preferred<\/li><li> Minimum 10 years experiences in finance planning &amp; analysis function in MNC, pharmaceutical industry preferred<\/li><li> Ability to work in a complex, matrix environment dealing with changes<\/li><li> International working experience required<\/li><li> Strong business &amp; finance acumen, strategic thinking and analytical skills<\/li><li> Strong communication skills, storytelling and influence the stakeholders to drive results<\/li><li> Fluent (oral &amp; writing) in English and Mandarin<br><br><br><\/li><\/ul>Desirable requirements:<br><ul><li> Passion for pharma industry<\/li><li> Professional curiosity and strong self-motivation<br><br><br><\/li><\/ul>Why Novartis?<br><br>769 million lives were touched by Novartis medicines in 2020, and while we\\u2019re proud of this, we know there is so much more we could do to help improve and extend people\\u2019s lives.<br><br>We believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.<br><br>We believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world\\u2019s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!<br><br>Imagine what you could do here at Novartis!<br><br>Commitment to Diversity &amp; Inclusion:<br><br>Novartis is committed to building an outstanding, inclusive work environment and diverse team\\u2019s representative of the patients and communities we serve.<br><br>Join our Novartis network: If this role is not suitable to your experience or career goals but<br><br>you wish to stay connected to hear more about Novartis and our career opportunities, follow us via Novartis Group WeChat Recruitment Account.<br><br><strong>\\u90e8\\u95e8<br><br><\/strong>PHARMA<br><br><strong>\\u4e1a\\u52a1\\u7c7b\\u522b<br><br><\/strong>Greater China<br><br><strong>\\u56fd\\u5bb6<br><br><\/strong>\\u4e2d\\u56fd<br><br><strong>\\u5de5\\u4f5c\\u5730\\u70b9<br><br><\/strong>\\u4e0a\\u6d77<br><br><strong>\\u516c\\u53f8\/\\u5b9e\\u4f53<br><br><\/strong>Novartis Pharma Beijing<br><br><strong>\\u804c\\u80fd\\u90e8\\u95e8<br><br><\/strong>\\u5ba1\\u8ba1\\u4e0e\\u8d22\\u52a1<br><br><strong>\\u5de5\\u4f5c\\u7c7b\\u578b<br><br><\/strong>\\u5168\\u804c<br><br><strong>\\u96c7\\u4f63\\u7c7b\\u578b<br><br><\/strong>\\u6b63\\u5f0f\\u5458\\u5de5<br><br><strong>\\u8f6e\\u73ed<br><br><\/strong>\\u5426<br><br><strong>\\u65e9\\u671f\\u4eba\\u624d<br><br><\/strong>\\u5426\"}"
}