{
    "id":"Kaggle::techmap::6136c5fb18e520633201b7af::reed_uk::6",
    "label_age":true,
    "analysis_age":"\"recent graduate\" is biased against older graduates",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Business Development Executive. Technology. London NW1. 30-35k Base, 45-50k OTE. Executive Benefits. As a small but fast-growing provider of automation software, our client works with companies of every size to deliver operating, inventory and management software solutions. To meet expectations, they now have an immediate and exciting opening for a Business Development Executive to further develop a sales function. As a Business Development Executive, you will:. Assume responsibility for developing new revenue streams. Identify and set up new business opportunities with both SME and corporate clients. Manage the entire sales process from research and lead generation through to negotiations and onto close as your product knowledge grows. Sell in a solution led manner, tailoring solutions to meet prospect requirements. Effectively manage a pipeline with varied sales cycles. The ideal candidate will:. Be a recent graduate. Possess 1 year's B2B sales experience. Be new business-focused (SME, corporate and enterprise). Have a credible, sophisticated and intelligent approach to lead generation and sales. Possess first-class communication and presentation skills. Have the ability to liaise at senior levels within a wide variety of companies. Be on the way up in your career and motivated by reward. Be looking for a fun, dynamic and autonomous place to work. The successful candidate can expect a base salary circa 30-35k with an uncapped OTE of 45-60k plus an additional and generous benefits package. Follow us at company\/certus-graduate for the latest news.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6136c5fb18e520633201b7af::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Certus Recruitment Group\", \"position\": \"Business Development Executive - Technology\", \"notes\": \"\", \"original\": \"Business Development Executive - Technology<br>London NW1<br>30-35k Base, 45-50k OTE + Executive Benefits<br><br>As a small but fast-growing provider of automation software, our client works with companies of every size to deliver operating, inventory and management software solutions. To meet expectations, they now have an immediate and exciting opening for a Business Development Executive to further develop a sales function.<br><br>As a Business Development Executive, you will: <br><br>* Assume responsibility for developing new revenue streams<br>* Identify and set up new business opportunities with both SME and corporate clients<br>* Manage the entire sales process from research and lead generation through to negotiations and onto close as your product knowledge grows<br>* Sell in a solution led manner, tailoring solutions to meet prospect requirements<br>* Effectively manage a pipeline with varied sales cycles<br><br>The ideal candidate will: <br><br>* Be a recent graduate<br>* Possess 1 year's B2B sales experience<br>* Be new business-focused (SME, corporate and enterprise)<br>* Have a credible, sophisticated and intelligent approach to lead generation and sales<br>* Possess first-class communication and presentation skills<br>* Have the ability to liaise at senior levels within a wide variety of companies<br>* Be on the way up in your career and motivated by reward<br>* Be looking for a fun, dynamic and autonomous place to work<br><br>The successful candidate can expect a base salary circa 30-35k with an uncapped OTE of 45-60k plus an additional and generous benefits package.<br><br>Certus Graduate is an established and experienced specialist consultancy providing graduate and early career recruitment services to the business community throughout the UK, Europe and North America. <br><br>Follow us at company\/certus-graduate for the latest news.\"}"
}