{
    "id":"Kaggle::techmap::61459e11d2c169066b9e1605::linkedin_ke::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Requiring agreement to a Statement of Faith before consideration for a position introduces bias by excluding qualified candidates based on their personal religious beliefs rather than their professional capabilities.",
    "verified":true,
    "synthetic":false,
    "text":" 3-5 years of experience working in a professional organization manipulating data sets and building data analytics and reporting solutions. Ability to query databases and use computer languages such as Python, SQL, etc. Proven ability to develop data visualizations and data reports for stakeholders. Excellent written and verbal communication skills for coordinating across teams. A drive to learn and master new technologies and techniques. Strong understanding of cloud-based and on-premise software and database system. In addition, all candidates should be familiar with the Statement of Faith and will be required to agree with the declarations of the Statement of Faith in order to be considered for this position. Please click here to read our. Statement of Faith. This is a one-year agreement contract with the opportunity for a renewal based on mutual agreement...",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61459e11d2c169066b9e1605::linkedin_ke\", \"source\": \"linkedin_ke\", \"country\": \"KE\", \"company\": \"CURE International, Inc.\", \"position\": \"Data Scientist\/Engineer (East Africa)\", \"notes\": \"\", \"original\": \"<p><span><strong>POSITION OVERVIEW:<br><br><\/strong><\/span><\/p><p><span><span><span><span><span><span>CURE is seeking to add a self-motivated, inquisitive Data Scientist\/Engineer to our growing team. This position could be based almost anywhere in Africa, where a CURE hospital exists or neighboring countries. The Data Scientist\/Engineer will be responsible for expanding and optimizing CURE\\u2019s data and data pipeline architecture and optimizing data flow and collection for our hospital network. The ideal candidate enjoys bringing efficiency to existing data systems and building them from the ground up.<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><p><span><span><span><span><span><span>The Data Scientist\/ Engineer will leverage data to answer questions, provide business intelligence insights, analyze performance, and enable positive outcomes within the organization, through data aggregation, analytics, exploration, and reporting.<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><p><span><span><span><span><span><span>The right candidate will be passionate about discovering solutions hidden in large data sets and be comfortable working with a wide range of stakeholders and functional teams to help improve business outcomes. They will be excited by the prospect of helping optimize, or even helping re-design, CURE\\u2019s data architecture to support our strategic initiatives and grant and donor reporting needs.<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><p><span><span><span><span><span><span>&nbsp;<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><p><span><span><span><span><span><span>ESSENTIAL FUNCTIONS AND RESPONSIBILITIES :<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><ul><li><span><span><span><span><span><span>Develop a data management architecture, including automated source system data extraction, loading, and transformation (normalization and enrichment) within a cloud-based data warehouse, accelerating information access and analysis.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Implement a decision support dashboarding solution that enables KPI visualization, reporting, and alerting, allowing the executive team and line of business leaders to rapidly gain business insights and easily perform data exploration across CURE\\u2019s various systems and processes.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using python, SQL, and other data extraction, manipulation, and analysis tools.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Assemble large, complex data sets that meet functional \/ non-functional business requirements.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Assess and monitor the effectiveness and accuracy of data sources and data gathering techniques.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Identify, design, and implement internal data collection and processing improvements: automating manual processes and optimizing data delivery.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Build data analytics and reporting capabilities that utilize data pipelines to provide actionable insights into operational efficiency and key business performance metrics.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Ensure compliance with data governance, security, privacy and protection guidelines, and best practices.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><\/ul><p><span><span><span><span><span><span>&nbsp;<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><p><span><span><span><span><span><span>CORE COMPETENCIES\/SKILLS\/EDUCATION NEEDED<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><ul><li><span><span><span><span><span><span>Bachelor\\u2019s Degree in Data Science, Computer Science, Engineering, or related field, or equivalent experience in related field.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Experience using computer languages (such as Python and SQL) and data analytics tools to manipulate data and draw insights from large data sets.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Experience working with and creating data architectures.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>3-5 years of experience working in a professional organization manipulating data sets and building data analytics and reporting solutions.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Ability to query databases and use computer languages such as Python, SQL, etc.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Proven ability to develop data visualizations and data reports for stakeholders.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Excellent written and verbal communication skills for coordinating across teams.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>A drive to learn and master new technologies and techniques.<\/span><\/span><\/span><\/span><\/span><\/span><\/li><li><span><span><span><span><span><span>Strong understanding of cloud-based and on-premise software and database system<\/span><\/span><\/span><\/span><\/span><\/span><\/li><\/ul><p>&nbsp;<br><br><\/p><p><span><strong><em>In addition, all candidates should be familiar with the Statement of Faith and will be required to agree with the declarations of the Statement of Faith in order to be considered for this position. <br><br><\/em><\/strong><\/span><\/p><p><span><span><span><span><span><span>Please click here to read our<\/span><\/span><\/span><\/span><\/span><\/span><span><span><span><span><span><span> <\/span><\/span><\/span><\/span><\/span><\/span><span><span><span><span><span><u><span><span>Statement of Faith<\/span><\/span><\/u><\/span><\/span><\/span><\/span><\/span><span><span><span><span><span><span>.<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><p><span><span><span><span><span><span>This is a one-year agreement contract with the opportunity for a renewal based on mutual agreement.<br><br><\/span><\/span><\/span><\/span><\/span><\/span><\/p><p>&nbsp;<br><br><\/p>\"}"
}