{
    "id":"Kaggle::techmap::6149da075a5bde6a60414ac6::linkedin_ne::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The phrase \"Near native level German and fluent in English\" is potentially biased as it favours native speakers and may exclude proficient non-native speakers; \"Advanced proficiency in both German and English\" is more inclusive, focusing on the necessary skill levels without implying a requirement for native language status.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" (Near) Native level German, and fluent in English. Preferably 1-2 years' experience in B2B or B2C customer service \/ order management role. Experience with ERP systems is a plus (SAP, Oracle, etc). Why should you apply? You will have the opportunity to work for an international company, with the possibility of obtaining an indefinite contract. Secondly, the compensation package is very appealing and the team you will be part of is very diverse, and supportive. There is always someone ready to jump in and help out, and the same is expected of you. If you are interested in this role please apply via the website or contact Jeroen Overwater via j. overwater(a)jpgray. We always strive to respond to all applications within 5 working days. Sometimes due to the number of responses we cannot. If you have not received a reply we regret to inform that we have continued with other candidates.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6149da075a5bde6a60414ac6::linkedin_ne\", \"source\": \"linkedin_ne\", \"country\": \"NE\", \"company\": \"JP Gray\", \"position\": \"Customer Service Representative French\", \"notes\": \"\", \"original\": \"<p>Are you looking for a commercial customer service position within in international company in the region of Utrecht? Do you want to be part of a hardworking and enthusiastic team of people? Do you have experience with B2B customer service, sales support, or have the ambition to work in such a role? Look no further, because this could be the job for you!<br><br><br><br><\/p>Customer Service Representative French<br><br><strong>Location: <\/strong>Utrecht, the Netherlands (remote working is possible 2-3 days a week) <strong>Contract: <\/strong>Full-time (40h); first 7 months via JP Gray <strong>Salary: <\/strong>2.400 - 3.000 EUR gross\/month + benefits <strong>Required Languages: <\/strong>French (near native), and English<p>In the region of Utrecht we are looking for a customer service representative with native level German. You will be part of a team servicing the French market for a thriving, fact growing international organisation.<br><br><\/p><p>You will be responsible for the entire OtC (Order to cash) process which includes shipment, order processing and customer management. You will make sure that clients are up to date, and satisfied with the entire operation from order to delivery and give them advice and support with complex technical products. You therefore have a good understanding of client relationships, and act always with the clients' interests in mind. You remain organised and focused in a changing environment, and thrive when pressure puts you to the test. Furthermore, you are a connection between different departments of the business - marketing, finance, sales, and logistics.`<br><br><\/p><p>The company you will work for is a worldwide organisation and provide you with sufficient challenges that come with it. They offer your long term stability and development in responsibilities.<br><br><\/p><p><strong>Responsibilities of a customer service representative french:<br><br><\/strong><\/p><ul><li>Process orders, and provide excellent customer support (OtC);<\/li><li>Communicate with insurance companies in the German market;<\/li><li>Assist sales managers;<\/li><li>Some financial administration;<\/li><li>Keep yourself up-to-date with policies and practices of the market;<\/li><li>Manage calls and ad-hoc queries relating to your clients wishes;<\/li><li>Manage returns and complaints;<\/li><li>Develop and maintain good relationships with internal\/external contacts.<\/li><li>You are able to work from how 2-3 days a week!<\/li><\/ul><p><strong>The profile of a good customer service representative french:<br><br><\/strong><\/p><p>A service oriented person that shows a strong character, is a team player, and has a strong analytic capacity. You are an excellent communicator and you love to solve problems in order to fully service your clients.<br><br><\/p><ul><li>Preferably HBO\/Bachelor degree or similar;<\/li><li>(Near) Native level German, and fluent in English;<\/li><li>Preferably 1-2 years' experience in B2B or B2C customer service \/ order management role;<\/li><li>Experience with ERP systems is a plus (SAP, Oracle, etc).<\/li><\/ul><p><strong>Why should you apply?<br><br><\/strong><\/p><p>You will have the opportunity to work for an international company, with the possibility of obtaining an indefinite contract. Secondly, the compensation package is very appealing and the team you will be part of is very diverse, and supportive. There is always someone ready to jump in and help out, and the same is expected of you.<br><br><\/p><p>If you are interested in this role please apply via the website or contact Jeroen Overwater via j.overwater(a)jpgray.nl. We always strive to respond to all applications within 5 working days. Sometimes due to the number of responses we cannot. If you have not received a reply we regret to inform that we have continued with other candidates.<br><br><\/p><p><\/p>\"}"
}