{
    "id":"Kaggle::techmap::61413bda8be8df1fa24beed8::careerbuilder_us::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"At SSM Health, we know the healing power of presence begins with compassionate employees like you. As an RN, you’ve chosen a career where patients matter—a lot. At SSM Health, you can expect a work environment where:. Employees feel valued, respected and free to express themselves.. Each employee finds meaning in work, leveraging skills and talents toward a greater purpose.. Teamwork and collaboration is encouraged, while management is supportive. If you’re a patient advocate first…. If you listen and respond with great care…. If the needs, wants, and goals of each patient matter to you…. Then we’d love to learn more! Please fill out your application today. Join a network of healthcare professionals just as kind and powerful as you. This is a FT day shift. Sign on bonus available. Licensed new graduate nurse from an accredited nursing program who actively participates in SSM Health New Graduate Nurse Residency Program. Provides professional nursing care to patients, which includes assessing, planning, implementing, coordinating, delegating and monitoring tasks assigned to other members of the care team in accordance with professional nursing standards. Responsible for the delivery of age appropriate care for assigned patients with a wide variety of medical conditions. PRIMARY RESPONSIBILITIES. Performs specialized tasks based on demonstrated competence to provide nursing care for patient population served. Performs patient assessments including biophysical, psychosocial, spiritual, cultural, and age appropriate needs of the patients, including the assessment of nutrition, pain management, and signs\/symptoms of abuse or neglect in order to develop, evaluate and modify patient's plan of care. Develops a realistic, comprehensive patient family educational plan, using appropriate resources and methods of instruction and provides patient\/family health education and coaching. Completes accurate and timely documentation including, but not limited to, the processing of physician orders, in accordance with policies and procedures. Monitors and evaluates delivery of nursing care given by team members based on patient needs and professional judgement. Collaborates with physicians and other health care professionals regarding all aspects of patient care. Completes competency requirements satisfactorily. Completes training as required. Seeks assistance and asks questions as needed to learn and understand regulations, standards and practices. As an SSM Health nurse, I will demonstrate the professional nursing standards defined in the professional practice model. Uses the ANA Code of Ethics for Nurses to guide his\/her response to the current and evolving health and nursing needs of our patients and our patient populations. Works in a constant state of alertness and safe manner.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61413bda8be8df1fa24beed8::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"SSM Health\", \"position\": \"RN - Cardiac Stepdown\/Telemetry\", \"notes\": \"\", \"original\": \"<div><p>At SSM Health, we know the healing power of presence begins with compassionate employees like you.\\u00a0<\/p><\/div><div><p>\\u00a0<\/p><\/div><div><p>As an RN, you\\u2019ve chosen a career where patients matter\\u2014a lot.\\u00a0<\/p>\\r\\n<div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><p>At SSM Health, you can expect a work environment where:\\u00a0<\/p><\/div><div><p>\\u00a0<br \/>- Employees feel valued, respected and free to express themselves;\\u00a0<br \/>- Each employee finds meaning in work, leveraging skills and talents toward a greater purpose;\\u00a0<br \/>- Teamwork and collaboration is encouraged, while management is supportive.\\u00a0<\/p><\/div><div><p>\\u00a0<\/p><\/div><div><p>If you\\u2019re a patient advocate first\\u2026\\u00a0<br \/>If you listen and respond with great care\\u2026\\u00a0<br \/>If the needs, wants, and goals of each patient matter to you\\u2026\\u00a0<br \/>Then we\\u2019d love to learn more! <b>Please fill out your application today.<\/b><b>\\u00a0<\/b><br \/>Join a network of healthcare professionals just as kind and powerful as you.\\u00a0<\/p>\\r\\n<p><b>This is a FT day shift. Sign on bonus available. <\/b><\/p><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div>Licensed new graduate nurse from an accredited nursing program who actively participates in SSM Health New Graduate Nurse Residency Program. Provides professional nursing care to patients, which includes assessing, planning, implementing, coordinating, delegating and monitoring tasks assigned to other members of the care team in accordance with professional nursing standards. Responsible for the delivery of age appropriate care for assigned patients with a wide variety of medical conditions.<p>PRIMARY RESPONSIBILITIES<\/p><ul><li>Performs specialized tasks based on demonstrated competence to provide nursing care for patient population served.<\/li><li>Performs patient assessments including biophysical, psychosocial, spiritual, cultural, and age appropriate needs of the patients, including the assessment of nutrition, pain management, and signs\/symptoms of abuse or neglect in order to develop, evaluate and modify patient's plan of care.<\/li><li>Develops a realistic, comprehensive patient family educational plan, using appropriate resources and methods of instruction and provides patient\/family health education and coaching.<\/li><li>Completes accurate and timely documentation including, but not limited to, the processing of physician orders, in accordance with policies and procedures. Monitors and evaluates delivery of nursing care given by team members based on patient needs and professional judgement.<\/li><li>Collaborates with physicians and other health care professionals regarding all aspects of patient care.\\u00a0<\/li><li>Completes competency requirements satisfactorily.<\/li><li>Completes training as required; seeks assistance and asks questions as needed to learn and understand regulations, standards and practices.<\/li><li>As an SSM Health nurse, I will demonstrate the professional nursing standards defined in the professional practice model.\\u00a0 Uses the ANA Code of Ethics for Nurses to guide his\/her response to the current and evolving health and nursing needs of our patients and our patient populations.<\/li><li>Works in a constant state of alertness and safe manner.<\/li><li>Performs other duties as assigned.<\/li><\/ul>\\r\\n<p>EDUCATION<\/p><ul><li>Graduate of accredited school of nursing<\/li><\/ul>\\r\\n<p>EXPERIENCE<\/p><ul><li>No experience required<\/li><\/ul>\\r\\n<p>PHYSICAL REQUIREMENTS<\/p><ul><li>Constant use of speech to share information through oral communication.<\/li><li>Constant standing and walking.<\/li><li>Frequent lifting\/carrying and pushing\/pulling objects weighing 0-25 lbs.<\/li><li>Frequent sitting, reaching and keyboard use\/data entry.<\/li><li>Frequent use of vision and depth perception for distances near (20 inches or less) and far (20 feet or more) and to identify and distinguish colors.<\/li><li>Frequent use of smell to detect\/recognize odors.<\/li><li>Frequent use of hearing to receive oral communication, distinguish body sounds and\/or hear alarms, malfunctioning machinery, etc.<\/li><li>Occasional lifting\/carrying and pushing\/pulling objects weighing 25-50 lbs.<\/li><li>Occasional lifting\/moving of patients.<\/li><li>Occasional bending, stooping, kneeling, squatting, twisting, gripping and repetitive foot\/leg and hand\/arm movements.<\/li><li>Occasional driving.<\/li><li>Rare crawling and running.<\/li><\/ul>&nbsp;\"}"
}