{
    "id":"Kaggle::techmap::61421f496b53cb5636217561::simplyhired_ie::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" We are growing our team & looking to recruit a part-time Beauty Therapist to cover a variety of luxurious beauty treatments in Drogheda. The ideal candidate should be passionate for the beauty industry, excellent customer service skills, the ability to run their own column, outgoing and enthusiastic. The ideal candidate: Fully qualified -ITEC, CIBTAC, CIDESCO or equivalent. Have a minimum of 2 years experience working in a salon. Proactive and passionate about beauty and sales. Excellent communication and customer service skills. Ability to work on their own initiative. BENEFITS: Extensive training (internal and external). Staff development. Staff social nights. 50% discount of treatments & 30% discount on products. Duties will included the normal day to day treatments in a beauty salon. All details can be seen on our website on www. havenholistic. These include manicures, pedicures, facials, waxing, tinting, tans, holistic treatments, HD Brows & LVL. We will provide a lot of training, both with the brands that we use and also in relation to customer service and retail sales. Part-time hours: 20-40 per week. Contract length: 3 months. Part-time hours: 20-30 per week. Job Types: Part-time, Temporary, Contract. Salary: From €1.00 per hour. Additional pay: Commission pay. Overtime pay. Tips. Benefits: Employee discount. Store discount. Schedule: 8 hour shift. Education: Leaving Certificate (preferred). Experience: Beauty: 2 years (required). Licence\/Certification: ITEC, CIBTEC  CIDESCO (required). Work remotely: No.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61421f496b53cb5636217561::simplyhired_ie\", \"source\": \"simplyhired_ie\", \"country\": \"IE\", \"company\": \"Haven Holistic & Beauty\", \"position\": \"Beauty Therapist\", \"notes\": \"\", \"original\": \"<p>We are growing our team &amp; looking to recruit a part-time Beauty Therapist to cover a variety of luxurious beauty treatments in Drogheda.<\/p><p>The ideal candidate should be passionate for the beauty industry, excellent customer service skills, the ability to run their own column, outgoing and enthusiastic.<\/p><p><b>The ideal candidate: <\/b><\/p><ul><li>Fully qualified -ITEC, CIBTAC, CIDESCO or equivalent<\/li><li>Have a minimum of 2 years experience working in a salon<\/li><li>Proactive and passionate about beauty and sales<\/li><li>Excellent communication and customer service skills<\/li><li>Ability to work on their own initiative<\/li><\/ul><p><b>BENEFITS: <\/b><\/p><ul><li>Extensive training (internal and external)<\/li><li>Staff development<\/li><li>Staff social nights<\/li><li>50% discount of treatments &amp; 30% discount on products<\/li><\/ul><p>Duties will included the normal day to day treatments in a beauty salon. All details can be seen on our website on www.havenholistic.ie . These include manicures, pedicures, facials, waxing, tinting, tans, holistic treatments, HD Brows &amp; LVL.<\/p><p>We will provide a lot of training, both with the brands that we use and also in relation to customer service and retail sales.<\/p><p>Part-time hours: 20-40 per week<\/p><p>Contract length: 3 months<\/p><p>Part-time hours: 20-30 per week<\/p><p>Job Types: Part-time, Temporary, Contract<\/p><p>Salary: From \\u20ac1.00 per hour<\/p><p>Additional pay:<\/p><ul><li>Commission pay<\/li><li>Overtime pay<\/li><li>Tips<\/li><\/ul><p>Benefits:<\/p><ul><li>Employee discount<\/li><li>Store discount<\/li><\/ul><p>Schedule:<\/p><ul><li>8 hour shift<\/li><\/ul><p>Education:<\/p><ul><li>Leaving Certificate (preferred)<\/li><\/ul><p>Experience:<\/p><ul><li>Beauty: 2 years (required)<\/li><\/ul><p>Licence\/Certification:<\/p><ul><li>ITEC, CIBTEC &#43;\/ CIDESCO (required)<\/li><\/ul><p>Work remotely:<\/p><ul><li>No<\/li><\/ul>\"}"
}