{
    "id":"Kaggle::techmap::61490951fb50747a19fabb84::linkedin_ch::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Program) empowers young women in Asia and the Pacific to build their skills, knowledge, and networks to be confident leaders, claim their rights and act together to create positive social change. The YWCAs RiseUp! young womens leadership model is a peer-to-peer approach that is led by young women, for young women and supports them to claim their rights as part of a life-long leadership journey. RiseUp! provides peer to peer leadership and advocacy training to young women and supports them to build knowledge, skills and networks to take action on issues that are important in their lives, such as violence against women and girls, sexual and reproductive health and rights, climate justice and gender equality. It creates safe spaces for young women to build knowledge and confidence, challenging the human rights violations and negative attitudes that are barriers to the full realization of their leadership capabilities. Through this, RiseUp! supports young women leaders to work together, share their knowledge and leadership with others, and inspire all young women to use their voices and act together for social change. Location: Asia-Pacific YWCA region[1]. Closing date: September 25, 2021. Starting date: as soon as possible. Type of agreement: consultancy (55-60 days). Reference: YWCA-Curriculum\/RiseUp! Purpose of the Consultancy: As an approach that builds young womens individual and collective power to drive change in their lives and communities, RiseUp! is a core method for the World YWCA to achieve Goal 2035 that 100 million young women and girls transform power structures to create justice, gender equality and a world without violence and war, leading a sustainable YWCA movement, inclusive of all. During Phase IV the RiseUp! model and resources will continue to be developed and adapted to meet young womens changing needs. New online platforms and resources will also be created so that RiseUp! can be used by young women in other countries and beyond the YWCA. With the support of the Department of Foreign Affairs and Trade, Government of Australia, in 2021, World YWCA seeks to review and update the content of the RiseUp! manual in consultation with young women from across its regions of reach. The consultancy call is for subject matter experts and facilitators who can work with young women to create a revised RiseUp!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61490951fb50747a19fabb84::linkedin_ch\", \"source\": \"linkedin_ch\", \"country\": \"CH\", \"company\": \"World YWCA\", \"position\": \"Consultancy Rise Up Leadership Model Curriculum: Content Revision and Development\", \"notes\": \"\", \"original\": \"<p><strong>Call for Consultancy<\/strong><\/p><p><strong>Rise Up Leadership Model Curriculum: Content Revision and Development<\/strong><\/p><p><br><\/p><p>The World YWCA is seeking a consultant (consulting agency\/firm\/group of consultants) passionate about youth leadership content development and design to lead the revision of curriculum for World YWCA-led RiseUp! Leadership model RiseUp! Under the Program in Asia and the Pacific, funded by the Department of Foreign Affairs and Trade, Government of Australia.&nbsp;<\/p><p><br><\/p><p><strong>About The World YWCA&nbsp;<\/strong><\/p><p><br><\/p><p>The World YWCA has an ambitious goal: to reach 100 million young women and girls and transform power structures to end gender inequality by 2035. Established in 1855, the World YWCA is the world\\u2019s oldest women\\u2019s movement. With member associations in 109 countries, it works to fulfil human rights and make gender equality a reality. The World YWCA is a learning organization in which there is recognized mentorship across generations. Sixty percent of the members of the World Board are aged 30 and under. The purpose of the World YWCA is to develop the leadership and collective power of women and girls around the world to achieve justice, peace, health, human dignity, freedom and a sustainable environment for all people.<\/p><p><br><\/p><p>The World YWCA mobilizes and connects millions of young women around transformational change, provides leadership opportunities in more than 100 countries around the world. It also actively works to influence policies, regulations and social and community norms which prevent the realisation of rights and leadership potential of women.&nbsp;<\/p><p>The World YWCA has three strategic priorities:&nbsp;<\/p><ul><li>Management and governance excellence towards Goal 2035<\/li><li>Strategic partnerships and communication towards Goal 2035<\/li><li>Engagement and mobilisation of girls, young women and women towards Goal 2035<\/li><\/ul><p><br><\/p><p>Young women in the Pacific and Asia live with constant violations of their human rights. The barriers they already faced to claiming their rights have increased with the COVID-19 pandemic and emergencies such as natural disasters and political crises. Discriminatory attitudes held across societies based on gender and age constrain leadership opportunities for young women, and block their ideas and solutions from being heard.<\/p><p><br><\/p><p>When young women have the space, support, and recognition to rise to become leaders, they are an influential force in championing young women\\u2019s rights and social change in their families, communities and beyond. The&nbsp;<em>RiseUp! Mobilising Young Women\\u2019s Leadership and Advocacy Program (\\u2018RiseUp! Program\\u2019)<\/em>&nbsp;empowers young women in Asia and the Pacific to&nbsp;build their skills, knowledge, and networks to&nbsp;be confident leaders, claim their rights and act together to create positive social change.<\/p><p><br><\/p><p>The YWCA\\u2019s&nbsp;<em>RiseUp!&nbsp;<\/em>young women\\u2019s leadership model is a peer-to-peer approach that is led by young women, for young women and supports them to claim their rights as part of a life-long leadership journey.&nbsp;<em>RiseUp!<\/em>&nbsp;provides peer to peer leadership and advocacy training to young women and supports them to build knowledge, skills and networks to take action on issues that are important in their lives, such as&nbsp;violence against women&nbsp;and girls, sexual and reproductive&nbsp;health&nbsp;and rights, climate justice and gender equality. It creates safe spaces for young women to build knowledge and confidence, challenging the human rights violations and negative attitudes that are barriers to the full realization of their leadership capabilities. Through this,&nbsp;<em>RiseUp!<\/em>&nbsp;supports young women leaders to work together, share their knowledge and leadership with others, and inspire all young women to use their voices and act together for social change.<\/p><p><br><\/p><p><strong>Location:&nbsp;<\/strong>Asia-Pacific YWCA region[1]<\/p><p><strong>Closing date: September 25, 2021<\/strong><\/p><p><strong>Starting date<\/strong>: as soon as possible<\/p><p><strong>Type of agreement<\/strong>: consultancy (55-60 days)<\/p><p><strong>Reference<\/strong>: YWCA-Curriculum\/RiseUp!<\/p><p><br><\/p><p><strong>Purpose of the Consultancy:<\/strong><\/p><p>As an approach that builds young women\\u2019s individual and collective power to drive change in their lives and communities,&nbsp;<em>RiseUp!<\/em>&nbsp;is a core method for the World YWCA to achieve Goal 2035 that \\u2018100 million young women and girls transform power structures to create justice, gender equality and a world without violence and war, leading a sustainable YWCA movement, inclusive of all.\\u2019 During Phase IV the&nbsp;<em>RiseUp!<\/em>&nbsp;model and resources will continue to be developed and adapted to meet young women\\u2019s changing needs. New online platforms and resources will also be created so that&nbsp;<em>RiseUp!<\/em>&nbsp;can be used by young women in other countries and beyond the YWCA.&nbsp;<\/p><p><br><\/p><p><strong>With the support of the Department of Foreign Affairs and Trade, Government of Australia<\/strong>, in 2021, World YWCA seeks to review and update the content of the RiseUp! manual in consultation with young women from across its regions of reach. The consultancy call is for subject matter experts and facilitators who can work with young women to create a revised RiseUp! curriculum and provide guidance and support on creating a more multi-media product to be used across nations globally by young women for leadership of young women on core issues that matter to them.&nbsp;<\/p><p><br><\/p><p>The consultancy will have several components and will be in strong collaboration with young women leads who will be key to implementation of RiseUp! in its fourth phase in Asia-Pacific region. World YWCA will provide guidance and support on the process to ensure it is co-created along with the young women leads to ensure a leadership project, by them and for them,&nbsp;thereby not only strengthening World YWCA\\u2019s design, but building a curriculum that answers to young women in all their diversity, an opportunity to co-design, co-create and co-decide for themselves.&nbsp;&nbsp;<\/p><p><br><\/p><p><strong>Scope of Work:&nbsp;<\/strong><\/p><p><strong><em>Proposed Activities, Timelines and Processes&nbsp;<\/em><\/strong><\/p><ul><li>This is a remote consultancy. The consultant must work through virtual communication and be proactive and engaging.&nbsp;<\/li><\/ul><p><br><\/p><ul><li>World YWCA has during the same period of the project created a \\u201cYoung Women Consultation Methodology\\u201d that has been developed by young women and has been tested and proven to be a great tool for engagement and evaluation, working with young women to understand their needs, their perspectives, work and impact on them. The Consultant will be required to use the methodology, as suitable, to facilitate the co-creation and validation of the revised curriculum when working with young women engaged in the RiseUp! Initiative. This will be finalised through a common understanding built during the process.&nbsp;<\/li><\/ul><p><br><\/p><ul><li>The Consultant will work closely with the regional coordinator and the young women leads, and other staff members as directed, to fulfil the consultancy requirements. The Consultant will be supervised by the Program Manager for RiseUp! Asia-Pacific and the Director of Global Engagement and Impact, World YWCA.&nbsp;&nbsp;.&nbsp;<\/li><\/ul><p><br><\/p><ul><li>The Consultancy requires high amount of interaction over time zones. English is the required language, with an open-ness to ensure inclusivity and language barriers are overcome in content creation.&nbsp;<\/li><\/ul><p><br><\/p><ul><li>The Consultant will use participatory, inclusive, and supportive methods of work as much as possible, to ensure that the young women leads and World YWCA contact points directly involved in the curriculum revision work from a learnings perspective.<\/li><\/ul><p><br><\/p><p>The timeframes listed below are tentative and subject to amendment during the planning phase. Expert consultants will review and update the content of the Rise Up manual guide and other relevant training content materials, drawing on relevant team members as needed. The activities below are tentative, and will be finalized after internal revisions and after the selection of subject matter experts and consultants. All materials and communication shall be written clearly in plain English, practical and applicable while conveying the key information necessary to ensure optimal usage of manual guide and materials.<\/p><p><br><\/p><p><br><\/p><p><strong>Ideal Profile of Consultants:<\/strong><\/p><ul><li>&nbsp;Excellent skills and experience in content review, upgrade, redesign, especially in the area of young women\\u2019s leadership development, gender, civil society engagement and women\\u2019s rights in general and feminism, ideally also areas of incorporating masculinity to feminism;<\/li><li>Expertise in Program Theory\/Program Logic and how to translate this into effective design;<\/li><li>Expertise and demonstrated experience in young women\\u2019s leadership and civil society engagement;<\/li><li>Comprehensive experience and understanding of gender equality issues including young women\\u2019s leadership issues;<\/li><li>Familiarity with frameworks, theoretical approaches and programming models for young women\\u2019s leadership, including key issues affecting young women in developing contexts;<\/li><li>Inter-personal skills and participatory tact in working with a range of young women and civil society stakeholders.&nbsp;<\/li><\/ul><p><br><\/p><p><strong>Application Process and Timelines:<\/strong><\/p><p><br><\/p><p><strong>Proposals will need to include the following information:&nbsp;<\/strong><\/p><ul><li>draft budget including reimbursable costs;&nbsp;<\/li><li>a draft scope of services\/ tentative plan of action on process;&nbsp;<\/li><li>Outline key skills, experiences and justification, including adviser fees and proposed role in meeting the design milestones outlined in this document.<\/li><li>Sample of previous work done<em>1-2 references<\/em><\/li><li>Evidence of registration\/status as a consultant (independent or working under a company) able to invoice the World YWCA in Switzerland and cover all taxes and legal obligations in the country where they are based\/work.&nbsp;<\/li><\/ul><p><br><\/p><ul><li>The consultant should send the package of above listed documents either in word or pdf format to:&nbsp;hresources@worldywca.org<\/li><\/ul><p><br><\/p><ul><li>Last date to submit applications is September&nbsp;25, 2021; Close of Business Day CET.&nbsp;<\/li><\/ul><p><br><\/p><p><br><\/p><p>For more information on the position you can download the terms of reference:<\/p><p>https:\/\/www.worldywca.org\/wp-content\/uploads\/2021\/09\/Rise-Up-Model-Content-Development-2021.pdf<\/p>\"}"
}