{
    "id":"Kaggle::techmap::615614d7a6740c534abc636a::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Provide mentorship to both entry level and less experienced engineers in reviewing and authenticating specification deviations and engineering packages. Other roles as required. Qualifications: Experience and Education: Bachelors Degree in Mechanical Engineering. Must be a Professional Engineer or eligible for membership in the Association of Professional Engineers, Geologists and Geophysicists of Alberta (APEGA). 7.10 years of related experience. CSO Common Safety Orientation (or equivalent) (or must obtain prior to start). If this position is classified as safety risk sensitive, you must also be able to pass pre-access drug & alcohol testing. Successfully pass a criminal background check. Authorized to legally work in Canada (eligible to work in the country for the duration of the assignment. Skills & Abilities: Experience in static equipment inspection, maintenance and design and have an extensive knowledge of commonly used design and fabrication codes as well as post construction specifications for Boilers, pressure vessels, furnaces, heat exchangers, tanks and process piping. Knowledge of materials engineering including Refractory to aid assessments, applications, repairs, as part of the design or repair process. Knowledge of risk based work selection process is a key asset. Active working knowledge of and experience with using mechanical design tools for static equipment (such as PV Elite, CAESAR I. I stress analysis, Sage. Plus, CodeCalc etc. ) to support design verification and FFS assessment. Participation in Root Cause Failure Analysis for static equipment. Knowledgeable with the jurisdictional requirements for pressure equipment in the Province of Alberta. Facilitates alignment and open, effective communication among stakeholders. Required Safety training \/ equipment (if applicable). Mask Fit (Includes 3M A Full). Confined and Restricted Space Entry (OSSA). Driving on site. CLOSES June 25, 2021 OR SOONER IF A SUCCESSFUL IS CANDIDATE IDENTIFIED - APPLY ASAP. Kindly submit your resume in Word format and ensure your work history includes the Month\/Year for every employer. We thank all applicants for applying, however only those considered for an interview will be contacted directly. Looking for more opportunities? Check out our website at www. spiritomega. org. Don't see a posting that suits you? Apply to our \"General Application\" and our recruiters will get in touch when they have a job that fits you! Follow us \"Spirit Omega\" on Linked. In, Facebook, and Twitter for all our new postings. Powered by JazzHR.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615614d7a6740c534abc636a::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Spirit Omega Inc.\", \"position\": \"Mechanical Engineer\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p><strong>Job Reference #:&nbsp;<u>MECHA02168<\/u><\/strong><\/p> <p><strong>Company Overview<\/strong><\/p> <p>Do you want to work with one of Canada\\u00e2\\u20ac\\u2122s top oil and gas companies represented by an award-winning staffing agency? Look no further and join the Spirit circle today!<\/p> <p><strong>Our well established Oil and Gas<\/strong> client's&nbsp;Equipment &amp; Reliability Engineering department is seeking an experienced and driven <u><em><strong>Mechanical Engineer<\/strong><\/em><\/u> to provide support to our Mechanical Engineering division&nbsp;in <strong>Fort McMurray, AB<\/strong><\/p> <p><strong>What's in it for you?<\/strong><\/p> <ul> <li>Work with one of Canada's \\\"Top 100 Employers,\\\" with possibility of extension or permanent placement.<\/li> <li>Full time shifts; Monday to Friday (subjected to change)<\/li> <li>The start date August 9, 2021&nbsp;with a contract review date of December 31, 2021.<\/li> <li>Competitive Compensation and Benefits.<\/li> <li>Representation by an award-winning staffing agency that takes pride in our personalized approach to staffing, ensuring you are a valued member of the team - not just a number.<\/li> <\/ul> <p><strong>Please note that this position is located in Fort McMurray, AB&nbsp;and local candidates are preferred. Non-local candidates will be&nbsp;considered but must be willing to secure their own accommodations, as there is no camp, LOA, or accommodation allowance provided.<\/strong><\/p> <p><strong>Job Description:<\/strong><\/p> <p>The Mechanical engineering division\\u00e2\\u20ac\\u2122s main focus is to maintain and improve safety and reliability on all Static Equipment classes (e.g. boilers, piping, tanks, pressure vessels, heat exchangers, furnaces, ducts, expansion joints, etc.) that enable business units to operate safely and reliably.&nbsp;<\/p> <p><strong>Key Accountabilities:&nbsp;<\/strong><\/p> <ul> <li>Provide general mechanical engineering support relating to static equipment fitness for service (FFS) assessment, repair specifications, re-rate assessment, failure investigation, purchase specification, equipment strategies support etc. to site operating units.<\/li> <li>Preparation of high quality engineering packages (both turnaround and running unit) to ensure the reliability of the plant. These include: <ul> <li>Repair packages (both emergency and routine maintenance)<\/li> <li>Upgrade packages with management of change, risk assessment \/ peer review, revised drawings and data sheets, etc.<\/li> <li>Provide support to turnaround activities by being available during turnaround to provide engineering assessment, perform risk assessments, provide critique, complete shutdown report etc.&nbsp;<\/li> <\/ul><\/li> <li>Provide input into shutdown scope development based on previous history and known future issues.<\/li> <li>Provide improvements to plant operation and reliability through innovative engineering and resolve root cause performance problems with static pressure equipment.<\/li> <li>Responsible for achieving code compliance and\/or governing authority endorsement of designs produced personally or by junior personnel under his\/her guidance.<\/li> <li>Provide mentorship to both entry level and less experienced engineers in reviewing and authenticating specification deviations and engineering packages.<\/li> <li>Other roles as required<\/li> <\/ul> <p><strong>Qualifications:<\/strong><\/p> <p><strong>Experience and Education:<\/strong><\/p> <ul> <li>Bachelors Degree in Mechanical Engineering&nbsp;<\/li> <li>Must be a Professional Engineer or eligible for membership in the Association of Professional Engineers, Geologists and Geophysicists of Alberta (APEGA)<\/li> <li>7 - 10 years of related experience<\/li> <li>CSO Common Safety Orientation (or equivalent) (or must obtain prior to start)<\/li> <li>If this position is classified as safety risk sensitive, you must also be able to pass pre-access drug &amp; alcohol testing.<\/li> <li>Successfully pass a criminal background check.<\/li> <li>Authorized to legally work in Canada (eligible to work in the country for the duration of the assignment.<\/li> <\/ul> <p><strong>Skills &amp; Abilities:<\/strong><\/p> <ul> <li>Experience in static equipment inspection, maintenance and design and have an extensive knowledge of commonly used design and fabrication codes as well as post construction specifications for Boilers, pressure vessels, furnaces, heat exchangers, tanks and process piping<\/li> <li>Knowledge of materials engineering including Refractory to aid assessments, applications, repairs, as part of the design or repair process.<\/li> <li>Knowledge of risk based work selection process is a key asset<\/li> <li>Active working knowledge of and experience with using mechanical design tools for static equipment (such as PV Elite, CAESAR II stress analysis, SagePlus, CodeCalc etc.) to support design verification and FFS assessment.<\/li> <li>Participation in Root Cause Failure Analysis for static equipment.<\/li> <li>Knowledgeable with the jurisdictional requirements for pressure equipment in the Province of Alberta.<\/li> <li>Facilitates alignment and open, effective communication among stakeholders<\/li> <\/ul> <p><strong>Required Safety training \/ equipment (if applicable)<\/strong><\/p> <ul> <li>Mask Fit (Includes 3M \\u00c2\\u00bd Full)<\/li> <li>Confined and Restricted Space Entry (OSSA)<\/li> <li>Driving on site<\/li> <\/ul> <p><strong>CLOSES June 25, 2021 OR SOONER IF A SUCCESSFUL IS CANDIDATE IDENTIFIED - APPLY ASAP<\/strong><\/p> <p><b>Kindly&nbsp;submit your resume in&nbsp;<u>Word format&nbsp;<\/u>and ensure your work history&nbsp;includes the&nbsp;<u>Month\/Year<\/u>&nbsp;for every employer.&nbsp;&nbsp;<\/b><\/p> <p>**We thank all applicants for applying, however only those considered for an interview will be contacted directly**<\/p> <p><em>Looking for more opportunities? Check out our website at www.spiritomega.org<\/em><\/p> <p><em>Don't see a posting that suits you? Apply to our \\\"General Application\\\" and our recruiters will get in touch when they have a job that fits you!<\/em><\/p> <p><em>Follow us \\\"Spirit Omega\\\" on LinkedIn, Facebook, and Twitter for all our new postings.<\/em><\/p> <p>Powered by JazzHR<\/p> <\/div>\"}"
}