{
    "id":"Kaggle::techmap::6155b8c4d198905e9e6122b1::monster_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" A follow-up visit will be made with the patient and the doula within the first two weeks postpartum to help support breastfeeding, provide counseling on safe sleep and positive parenting as well as initiate conversation on reproductive life planning. Any techniques used for support should be individualized to the mother\/familys needs. The doula focuses on normal labor, delivery, postpartum and newborn care providing unbiased evidence based information so the mother can make an informed decision on what is in the best interest of herself and her baby. Doulas do not prescribe treatment, and any suggestions or information provided within the role of the doula must include advising the mother to check with the primary care provider. The Doula does not perform clinical or medical tasks, such as taking blood pressure, temperature, fetal heart tone checks vaginal exams or postpartum clinical care. The Doula will not diagnose or treat in any modality. The doula is required to attend team meetings, trainings, and is required to ensure timely and accurate completion of case notes and other paperwork required by the department. QUALIFICATIONS. Completion of an approved birth doula certification training, as well as all the requirements set forth for certification. Basic Life Support (BLS), and at least 1 year of practical experience. Certification through a childbirth education association, as well as Lactation Counselor education\/certification required. Must possess a current unrestricted drivers license issued by the State of NJ, and any clearances required by Atlanti. Care Regional Medical Center. EDUCATION: High School diploma (or GED equivalent). Lactation Counselor education required. LICENSE\/CERTIFICATION: Valid NJ drivers license required, Doula certification required, Basic Life Support (BLS) certification through the American Heart Association required, Lactation Counselor certification preferred. EXPERIENCE: Minimum 1 year experience, Proficiency in Clinical Applications preferred at time of hire. Incumbents within position will be trained appropriately and then skill will be required for this position within 30-60 days from date of hire. PERFORMANCE EXPECTATIONS. Demonstrates the ability to perform the department specific competencies as listed on the Assessment and Evaluation Tool. Exhibits the core behavioral competencies as listed on the Assessment and Evaluation Tool. Demonstrates the knowledge and skills necessary to provide care appropriate to the age of the patients, as defined on the unit specific Assessment and Evaluation Tool.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155b8c4d198905e9e6122b1::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"AtlantiCare\", \"position\": \"Certified Doula\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>POSITION SUMMARY <\/p> <p> The certified community doula is a trained and certified companion that provides physical, emotional, and informational support to women and their families prenatally, during labor and delivery, and during the immediate postpartum period. The goal of the doula, is to ensure that the pregnant patient feels safe, confident and empowered during their birth experience. The doula assists in explaining and discussing practices, policies and procedures. They help the mother to acquire the knowledge necessary to make informed decisions about care, and the care of the baby. Doula\\u2019s also advocate for their client\\u2019s wishes as expressed in their birthing plan, in prenatal conversations, and intrapartum discussion. They encourage the client to ask questions and express preferences and concerns. Doula\\u2019s help enhance communication between the client and the care provider. <\/p> <p>DUTIES AND RESPONSIBILITIES <\/p> <p>The doula will provide mothers and families with support throughout their pregnancy and postpartum period. They will work alongside providers and staff both in the office setting, home setting as well as in the hospital L&amp;D, M\/B unit and NICU. <\/p> <p>Doula\\u2019s assist with childbirth education classes, support breastfeeding initiatives, and are a support for inter-conception care. Additionally, doulas are trained in screening for postpartum depression, food insecurities, intimate partner violence, and medical risk factors. <\/p> <p>Doula\\u2019s will also be trained on community resources and spend time with the Maternal Child Health Social Worker to help make referrals to services as needed. The doula would meet with the pregnant patients prenatally either in the office or at a location convenient to both, and go over prenatal care, stages of labor, birth preferences, and help her to come up with a plan for communicating with her care provider. Multiple visits give the doula and the patient time to talk, process information, ask questions and start to develop a trusting relationship. Once the patient goes into labor and is admitted, she will decide when the right time is to contact the doula. The doula will arrive at the hospital and stay with the patient and family through the labor and birth experience. <\/p> <p>The doula will provide physical, emotional and informational support, as well as help navigate the hospital environment, and help to facilitate communication between the patient and the medical staff. A follow-up visit will be made with the patient and the doula within the first two weeks postpartum to help support breastfeeding, provide counseling on safe sleep and positive parenting as well as initiate conversation on reproductive life planning. <\/p> <p>Any techniques used for support should be individualized to the mother\/family\\u2019s needs. The doula focuses on \\u201cnormal\\u201d labor, delivery, postpartum and newborn care providing unbiased evidence based information so the mother can make an informed decision on what is in the best interest of herself and her baby. <\/p> <p>Doulas do not \\u201cprescribe\\u201d treatment, and any suggestions or information provided within the role of the doula must include advising the mother to check with the primary care provider. The Doula does not perform clinical or medical tasks, such as taking blood pressure, temperature, fetal heart tone checks vaginal exams or postpartum clinical care. The Doula will not diagnose or treat in any modality. <\/p> <p>The doula is required to attend team meetings, trainings, and is required to ensure timely and accurate completion of case notes and other paperwork required by the department. <\/p> <p><\/p> <p>QUALIFICATIONS <\/p> <p>Completion of an approved birth doula certification training, as well as all the requirements set forth for certification. Basic Life Support (BLS), and at least 1 year of practical experience. Certification through a childbirth education association, as well as Lactation Counselor education\/certification required. <\/p> <p>Must possess a current unrestricted driver\\u2019s license issued by the State of NJ, and any clearances required by AtlantiCare Regional Medical Center. <\/p> <p><\/p> <p>EDUCATION: High School diploma (or GED equivalent); Lactation Counselor education required. <\/p> <p>LICENSE\/CERTIFICATION: Valid NJ driver\\u2019s license required, Doula certification required, Basic Life Support (BLS) certification through the American Heart Association required, Lactation Counselor certification preferred. <\/p> <p>EXPERIENCE: Minimum 1 year experience, Proficiency in Clinical Applications preferred at time of hire; incumbents within position will be trained appropriately and then skill will be required for this position within 30-60 days from date of hire. <\/p> <p><\/p> <p><\/p> <p>PERFORMANCE EXPECTATIONS <\/p> <p>Demonstrates the ability to perform the department specific competencies as listed on the Assessment and Evaluation Tool. <\/p> <p>Exhibits the core behavioral competencies as listed on the Assessment and Evaluation Tool. <\/p> <p>Demonstrates the knowledge and skills necessary to provide care appropriate to the age of the patients, as defined on the unit specific Assessment and Evaluation Tool. <\/p> <p>May require standing, sitting, squatting, stooping, bending, walking, lifting, carrying, stair climbing, sitting at desk for periods of time, long hours when patients are in labor. <\/p> <p><\/p> <p><\/p> <p><\/p> <p>WORK ENVIRONMENT <\/p> <p>Potential for exposure to the hazards and risk of the hospital or home environment, including exposure to infectious disease, hazardous substances, and potential injury. <\/p> <p>Position requires considerable walking and standing. Position requires frequent periods of driving a motor vehicle. <\/p> <p>Essential functions of this position are listed on the department specific Assessment and Evaluation Tool. <\/p> <p><\/p> <p>REPORTING RELATIONSHIP <\/p> <p>This position reports to Department and \/ or Service Line leadership. <\/p> <p><\/p> <p>Equal Opportunity Employer Minorities\/Women\/Protected Veterans\/Disabled<\/p> <\/div>\"}"
}