{
    "id":"Kaggle::techmap::6141272b8be8df1fa24b3e98::careerbuilder_us::3",
    "label_age":true,
    "analysis_age":"The phrase \"Recent college grad\" will discourage older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Entry Level inside Sales\/Account Manager needed in Irvine Pay $40, 000-$50, 000k plus commission Growing financial company is looking for driven, self motivated individuals that want to build a career in Investment Banking Must be outgoing and not afraid to hear 100 NO's before getting a YES. After the 1st year can make up to 100k! Will start making commissions after 6 plus months Apply for this great position as a sales representative today! Apple. One is proud to be an Equal Opportunity Employer. Pursuant to applicable state and municipal Fair Chance Laws and Ordinances, we will consider for employment qualified applicants with arrest and conviction records.,,,, If your a recent college grad or a dynamic person with sales experience, send me your resume to set up an interview. Call or email Jude Washington at [Email available when viewing the job] or call [Phone number shown when applying]",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6141272b8be8df1fa24b3e98::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"AppleOne\", \"position\": \"Sales Representative - Salary+ Commission\/ Entry Level Opportunity\", \"notes\": \"\", \"original\": \"Entry Level inside Sales\/Account Manager needed in Irvine\\r\\nPay $40,000-$50,000k plus commission\\r\\nGrowing financial company is looking for driven, self motivated individuals that want to build a career in Investment Banking\\r\\n\\r\\nMust be outgoing and not afraid to hear 100 NO's before getting a YES. . After the 1st year can make up to 100k!\\r\\n\\r\\nWill start making commissions after 6 plus months\\r\\n\\r\\n Apply for this great position as a sales representative today! AppleOne is proud to be an Equal Opportunity Employer. Pursuant to applicable state and municipal Fair Chance Laws and Ordinances, we will consider for employment qualified applicants with arrest and conviction records., , , , If your a recent college grad or a dynamic person with sales experience, send me your resume to set up an interview. Call or email Jude Washington at [Email available when viewing the job] or call [Phone number shown when applying]\"}"
}