{
    "id":"Kaggle::techmap::615644f47aa49c40310db528::monster_uk::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Physically fit and motivated\": This requirement could discourage individuals with physical disabilities, as it suggests a need for a level of physical fitness that might exclude those with different abilities who could perform the job effectively with reasonable accommodations.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description The RSK Group is one of Europe’s fastest growing environmental, geotechnical and contaminated land consultancies, with offices in the UK, Europe and the Gulf. It provides a range of services for a wide range of clients within the property, manufacturing, oil, gas and energy sector. Since 1989, our philosophy has remained the same: employ, develop and retain talented people. Working for RSK is an opportunity to evolve as a professional, to innovate and to make a difference. RSK Habitat Management, one of the companies within RSK Group, are a new and exciting business, providing practical ecological contracting solutions for our clients. We provide results-based outcomes for clients and biodiversity, with innovation at the heart of everything that we do. You will be joining a team of professionals who work closely with colleagues in other disciplines such as Ecology, Landscape and Arboriculture. The role: We are looking for trainee site operatives, who are outstanding team players to join our team to undertake projects locally and nationwide. This role will be of interest to those who love working outdoors in all weathers, who enjoy practical, hands on work, who have a positive, personable, and professional can-do attitude and are keen and willing to learn. We will provide guidance and training to undertake our site-based works which will include adhering to site health, safety, environmental and wellbeing standards. We are looking for individuals to be based within commuting distance of our Bristol \/ Lichfield offices, however as we work nationally, there will be an expectation to travel and stay away from home regularly. You will receive ongoing training and development in all aspects of the operational tasks and have a great opportunity for continued progression. Person specification: Ideally hold a valid CSCS card or equivalent. Ideally have experience of working or volunteering outdoors in a practical role. Full UK driving licence. Physically fit and motivated. Prepared to stay away Monday to Friday (where necessary). Positive can-do attitude. Salary and benefits: National minimum wage. Overtime with night and weekend enhancements. Paid accommodation and subsistence allowance (when working away). Access to a company vehicle. Contributory pension scheme. A flexible benefits programme including the option to buy additional holidays and private health care. Regular training and career development. Access to mental health support. Professional financial advice.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615644f47aa49c40310db528::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"RSK Group\", \"position\": \"Site Operative - Trainee\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>The RSK Group is one of Europe\\u2019s fastest growing environmental, geotechnical and contaminated land consultancies, with offices in the UK, Europe and the Gulf. It provides a range of services for a wide range of clients within the property, manufacturing, oil, gas and energy sector. Since 1989, our philosophy has remained the same: employ, develop and retain talented people. Working for RSK is an opportunity to evolve as a professional, to innovate and to make a difference.<\/p> <p>RSK Habitat Management, one of the companies within RSK Group, are a new and exciting business, providing practical ecological contracting solutions for our clients. We provide results-based outcomes for clients and biodiversity, with innovation at the heart of everything that we do. You will be joining a team of professionals who work closely with colleagues in other disciplines such as Ecology, Landscape and Arboriculture.<\/p> <p><strong>The role:<\/strong><\/p> <p>We are looking for trainee site operatives, who are outstanding team players to join our team to undertake projects locally and nationwide.<\/p> <p>This role will be of interest to those who love working outdoors in all weathers, who enjoy practical, hands on work, who have a positive, personable, and professional can-do attitude and are keen and willing to learn.<\/p> <p>We will provide guidance and training to undertake our site-based works which will include adhering to site health, safety, environmental and wellbeing standards. You\\u2019ll develop skills, knowledge and experience whilst working on the job, on a wide range of environmentally sensitive projects UK wide.<\/p> <p>We are looking for individuals to be based within commuting distance of our Bristol \/ Lichfield offices, however as we work nationally, there will be an expectation to travel and stay away from home regularly.<\/p> <p>You will receive ongoing training and development in all aspects of the operational tasks and have a great opportunity for continued progression.<\/p> <p><strong>Person specification: <\/strong><\/p> <ul> <li>Ideally hold a valid CSCS card or equivalent<\/li> <li>Ideally have experience of working or volunteering outdoors in a practical role<\/li> <li>Full UK driving licence<\/li> <li>Physically fit and motivated<\/li> <li>Prepared to stay away Monday to Friday (where necessary).<\/li> <li>Positive can-do attitude.<\/li> <\/ul> <p><strong>Salary and benefits:<\/strong><\/p> <ul> <li>National minimum wage<\/li> <li>Overtime with night and weekend enhancements<\/li> <li>Paid accommodation and subsistence allowance (when working away)<\/li> <li>Access to a company vehicle<\/li> <li>Contributory pension scheme<\/li> <li>A flexible benefits programme including the option to buy additional holidays and private health care<\/li> <li>Regular training and career development<\/li> <li>Access to mental health support<\/li> <li>Professional financial advice<\/li> <li>Discounted gym memberships<\/li> <\/ul> <p style=\\\"text-align:justify\\\"><\/p> <p style=\\\"text-align:justify\\\">At RSK we operate anopen and relaxed management culture that nurtures continuous improvement and innovation, adopting a proactive growth strategy helps us to run a sustainable and profitable business while providing new and exciting career opportunities for all. The company prides itself on providing employees with a rewarding and challenging career, encouraging Continuous Professional Development and enabling them to reach their full potential. Listed as being in the top 3 environmental consultancies and listed in the Sunday Times PwC Top Track 250,there has never been a more exciting time to join.<\/p> <p style=\\\"text-align:justify\\\"><\/p> <p style=\\\"text-align:justify\\\">Furthermore, retaining our employeesis the building block of a successful organisation and we want to ensure youmaintain a healthy work life balance, with many opportunities for flexible working,social activities, and community involvement projects.<\/p> <p style=\\\"text-align:justify\\\"><\/p> <p style=\\\"text-align:justify\\\">RSK is also committed to our Corporate Responsibility strategy. We seek to minimise our impact on the environment; to engage positively with the community and education groups; to provide a safe and supportive atmosphere in which to work; and to promote Corporate Responsibility throughout our supply chain.<\/p> <p style=\\\"text-align:justify\\\"><\/p> <p style=\\\"text-align:justify\\\">RSK Group is an Equal Opportunities Employer<\/p> <\/div>\"}"
}