{
    "id":"Kaggle::techmap::6148e0cbdba0986493c3de3b::linkedin_kr::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The term \"Able to qualify for a major credit card\" introduces general bias by potentially excluding candidates from lower socio-economic backgrounds who may not have the financial history required to obtain a major credit card.",
    "verified":true,
    "synthetic":false,
    "text":" Serve as CRA mentor and perform accompanied field assessment visits as required. Participate in the performance appraisal program by providing timely and accurate feedback regarding the performance of each respective CRA. Documentation Duties\/Responsibilities: Assure that the appropriate IQVIA Biotech and\/or sponsor SOPs are followed. Ensure all project documentation is appropriately filed per IQVIA Biotech SOPs. Assist PM in preparation of audit responses, as appropriate. Assist PM with preparation of information for inclusion in monthly report to client. Budget\/Contract Duties\/Responsibilities: Assist PM in review of project budgets, monitoring costs, potential overruns and propose\/implement cost effective solutions. Define the scope of work with the client and clinical monitoring team. Assist PM in identifying and generating changes in scope and notify client of potential changes in scope. Review and approve CRA travel expenses and time sheets. KNOWLEDGE, SKILLS & ABILITIES: Thorough knowledge of clinical research process. Prior experience as a Clinical Research Associate. Strong communication skills (verbal and written) to express complex ideas. Excellent organizational and interpersonal skills. Positive attitude and ability to interact with all levels of staff to coordinate and execute study activities. Ability to manage multiple priorities within various clinical trials. Ability to reason independently and recommend specific solutions in clinical settings. Understanding of basic data processing functions, including electronic data capture. Working knowledge of current ICH GCP guidelines and applicable regulations. Ability to work independently, prioritize and work within a matrix team environment is essential. Working knowledge of Word and Excel. Able to mentor CRAs. Able to qualify for a major credit card. Valid drivers license. Ability to rent automobile. Willingness and ability to travel domestically and internationally, as required. CRITICAL JOB FUNCTIONS IN ACCORDANCE WITH ADA CRITERIA: Ability to travel domestically and internationally. Very limited physical effort required to perform normal job duties. MINIMUM RECRUITMENT STANDARDS: BS\/BA (or equivalent) in one of the life sciences plus a minimum of 4 years direct experience in clinical studies. At least 2 years experience as a Clinical Monitor\/CRA, as well as experience in data handling or analysis. Previous experience in personnel management within a scientific\/clinical environment preferred. Prior experience in electronic data capture (EDC) preferred. Equivalent combination of education, training and experience. At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible  to help our customers create a healthier world.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148e0cbdba0986493c3de3b::linkedin_kr\", \"source\": \"linkedin_kr\", \"country\": \"KR\", \"company\": \"IQVIA\", \"position\": \"Clinical Trial Manager - Biotech JAPAC\", \"notes\": \"\", \"original\": \"<em>IQVIA Biotech is IQVIA\\u2019s global solution targeting the biotech customer segment. Teams 100% dedicated to Biotech, with a wide range of therapeutic expertise. A flat, agile organizational structure with the power of the IQVIA CORE\\u2122 enabling data-driven decisions. Global Center of Excellence support across specialties with Advanced Analytics and disease-specific data services.<br><br><\/em><strong><u>BASIC FUNCTIONS:<br><br><\/u><\/strong>Responsible for the successful planning, implementation and execution of contracted clinical monitoring activities. Functionally responsible for all clinical monitoring team members throughout the duration of each clinical trial. Assures clear client and internal team communication, process documentation, and compliance with Good Clinical Practices and procedures set forth by IQVIA Biotech and its clients.<br><br><strong><u>ESSENTIAL JOB FUNCTIONS, DUTIES AND RESPONSIBILITIES:<br><br><\/u><\/strong>Responsible for all activities related to implementation and execution of clinical studies that include:<br><br><br>Client Duties\/Responsibilities:<br><br><ul><li>Work with Project Manager (PM) to define program targets for clinical monitoring staff and assure work is documented within contracted project scope. Communicate and document all interactions with client as required by SOP.<\/li><li>Serve as client advocate within IQVIA Biotech.<\/li><li>Develop and implement Clinical Monitoring Plan.<br><\/li><\/ul>Team Duties\/Responsibilities:<br><br><ul><li>Responsible for assuring needs of clinical sites are met by facilitating clinical monitoring processes, including:<\/li><li>Coordinate site management activities<\/li><li>Site identification, recruitment, and selection<\/li><li>Regulatory document collection and review<\/li><li>Overall scheduling and management of all site visits<\/li><li>Develop site\/monitoring tools and training materials<\/li><li>Review and identify trends in enrollment and data entry at sites and proactively interface with clinical monitoring team and client to identify solutions<br><\/li><\/ul>Coordinate and oversee daily operations of clinical monitoring team:<br><br><ul><li>Set and enforce project timelines with the assigned study team<\/li><li>Coordinate remote review of clinical data within EDC system<\/li><li>Oversee monitoring visit schedule to ensure compliance with frequency set forth in contract<\/li><li>Review and approve trip reports and follow-up letters within required timeframe<\/li><li>Schedule and manage weekly CRA project team meetings<\/li><li>Ensure CRAs assigned to team receive therapeutic and project-specific training<\/li><li>Manage quality and regulatory compliance among clinical monitoring team and investigational sites<br><\/li><\/ul>Manage project milestones and proactively address deficiencies:<br><br><ul><li>Attend and provide information at monthly projections meetings<\/li><li>Attend and provide information at weekly client teleconferences\/team meetings<\/li><li>Assist Project Manager in identifying Out of Scope activities and assuring that such activities do not begin until the client provides authorization<br><\/li><\/ul>Manage CRA performance:<br><br><ul><li>Define and implement functional standards, goals, and expectations with clinical monitoring team.<\/li><li>Serve as CRA mentor and perform accompanied field assessment visits as required<\/li><li>Participate in the performance appraisal program by providing timely and accurate feedback regarding the performance of each respective CRA<br><\/li><\/ul>Documentation Duties\/Responsibilities:<br><br><ul><li>Assure that the appropriate IQVIA Biotech and\/or sponsor SOPs are followed<\/li><li>Ensure all project documentation is appropriately filed per IQVIA Biotech SOPs<\/li><li>Assist PM in preparation of audit responses, as appropriate<\/li><li>Assist PM with preparation of information for inclusion in monthly report to client<br><\/li><\/ul>Budget\/Contract Duties\/Responsibilities:<br><br><ul><li>Assist PM in review of project budgets, monitoring costs, potential overruns and propose\/implement cost effective solutions<\/li><li>Define the scope of work with the client and clinical monitoring team<\/li><li>Assist PM in identifying and generating changes in scope and notify client of potential changes in scope<\/li><li>Review and approve CRA travel expenses and time sheets<br><\/li><\/ul><strong><u>KNOWLEDGE, SKILLS &amp; ABILITIES:<br><\/u><\/strong><ul><li>Thorough knowledge of clinical research process.<\/li><li>Prior experience as a Clinical Research Associate.<\/li><li>Strong communication skills (verbal and written) to express complex ideas.<\/li><li>Excellent organizational and interpersonal skills.<\/li><li>Positive attitude and ability to interact with all levels of staff to coordinate and execute study activities.<\/li><li>Ability to manage multiple priorities within various clinical trials.<\/li><li>Ability to reason independently and recommend specific solutions in clinical settings.<\/li><li>Understanding of basic data processing functions, including electronic data capture.<\/li><li>Working knowledge of current ICH GCP guidelines and applicable regulations.<\/li><li>Ability to work independently, prioritize and work within a matrix team environment is essential.<\/li><li>Working knowledge of Word and Excel<\/li><li>Able to mentor CRAs.<\/li><li>Able to qualify for a major credit card.<\/li><li>Valid driver\\u2019s license; ability to rent automobile.<\/li><li>Willingness and ability to travel domestically and internationally, as required.<br><\/li><\/ul><strong><u>CRITICAL JOB FUNCTIONS IN ACCORDANCE WITH ADA CRITERIA<\/u><\/strong>:<br><br><ul><li>Ability to travel domestically and internationally<\/li><li>Very limited physical effort required to perform normal job duties<br><\/li><\/ul><strong><u>MINIMUM RECRUITMENT STANDARDS:<br><\/u><\/strong><ul><li>BS\/BA (or equivalent) in one of the life sciences plus a minimum of 4 years direct experience in clinical studies<\/li><li>At least 2 years\\u2019 experience as a Clinical Monitor\/CRA, as well as experience in data handling or analysis.<\/li><li>Previous experience in personnel management within a scientific\/clinical environment preferred.<\/li><li>Prior experience in electronic data capture (EDC) preferred. <\/li><li>Equivalent combination of education, training and experience<br><\/li><\/ul>At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible \\u2013 to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70,000+ employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs.iqvia.com.<br><br>\"}"
}