{
    "id":"Kaggle::techmap::615560bde073bc782c1ae1fc::seek_au::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Analyse and interpret asset condition data and other relevant information to develop the current and forward year works programs. Monitor and report on project progress. Please click here to view a copy of the role description. About you. You have completed a four year civil\/structural engineering degree and have a knowledge of the technical aspects of materials, equipment and techniques used in bridge maintenance and construction projects. Youre an excellent communicator and have the ability to use computer based tools and techniques for project and information management. You will possess a current and valid Australian motor vehicle drivers license and be willing to work outside normal working hours and travel on occasion. Salary and Benefits. Joining Transport for NSW, youll have access to a range of unique government benefits in a flexible work environment like no other. If youre ready to step into this meaningful and rewarding role, we want to hear from you. The salary for this position is Engineer Level 1.2 ($94, 184- $124, 862) per annum plus superannuation and leave loading. For more information on Employee Benefits at TfNSW please click here. We are the community we serve. We are committed to being an inclusive, diverse and flexible workplace where differences are valued. We welcome people of all backgrounds, experience and abilities. We enable our people to work in ways that work for them and their teams. Working virtually and from different locations including regional locations, staggering work hours and job sharing are just some of the ways our people can work flexibly. Please contact the Talent Specialist below if you require any adjustments to be made to how you interact with us throughout the recruitment process or would like to discuss flexible work options. How to apply. Joining Transport for NSW, youll have access to a range of unique government benefits in a flexible work environment like no other. If youre ready to step into this meaningful and rewarding role, we want to hear from you! To apply for this position, please submit a resume, cover letter and answer the screening questions within the online application process. Find out more about Transport for NSW at httpswww. transport. nsw. gov. au\/about-us. For more information on how to apply for a role in the NSW Public Sector please click here. For any enquiries, please contact Marcia Pinto on transport. nsw. gov. au.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615560bde073bc782c1ae1fc::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Transport for NSW\", \"position\": \"Project Engineer\", \"notes\": \"\", \"original\": \"<p>\\u00a0<\/p><ul> <li>Opportunity to drive and influence change in regional NSW<\/li> <li>Based in Wagga Wagga\/Hay<\/li> <li>Permanent Full time opportunity<\/li> <\/ul><p>\\u00a0<\/p><p><strong>About us<\/strong><\/p><p>Transport for NSW (TfNSW) is the lead agency of the NSW Transport cluster. Our role is to lead the development of a safe, efficient, integrated transport system that keeps people and goods moving, connects communities and shapes the future of our cities, centres and regions. We work with several government agencies to coordinate metro, train, bus, ferry, light rail,\\u00a0road\\u00a0and maritime services, always keeping the safety and comfort of our customers at the heart of what we do.<\/p><p>\\u00a0<\/p><p><strong>The Division<\/strong><\/p><p>The\\u00a0Regional and Outer Metropolitan\\u00a0division is\\u00a0focused\\u00a0on understanding the particular needs of regional communities across NSW and delivering\\u00a0customer-centred integrated transport services and infrastructure.\\u00a0\\u00a0<\/p><p>\\u00a0<\/p><p><strong>The opportunity<\/strong><\/p><p>We currently have a permanent full time Project Engineer opportunity in Wagga Wagga\/Hay South Region to be a part of an innovative team that delivers for our regional customers and communities. The role will report to Bridge Works Manager.The role will assist the Engineering Team in the development and delivery of maintenance and improvement programs of work including monitoring and reporting on project progress, through to the delivery of projects as per the agreed milestones and costs.<\/p><p>The position involves project delivery, site work and travel across the South West of NSW. It is expected you will be based centrally, working from the regional head office in Wagga Wagga. Other locations within the region may also be negotiable for successful candidates. This is an exciting opportunity to be a part of a growing Division that values regional NSW and strives towards excellent outcomes for regional communities!<\/p><p>\\u00a0<\/p><p>\\u00a0<strong>What you will be involved in:<\/strong><\/p><p><strong>\\u00a0<\/strong>Some of your key accountabilities will include:<\/p><ul> <li>Develop project plans for nominated projects to identify the needs and outcomes to be addressed by the delivery organisation and to negotiate project scope to ensure that agreed project milestones, quality standards and costs are met.<\/li> <li>Use your knowledge of the technical aspects of materials, equipment and techniques used in road, bridge and other related traffic infrastructure construction and maintenance to develop projects.<\/li> <li>Prepare competitive and accurate estimates, job programs, project delivery briefs and WH&amp;S management plans, quality management plans, environmental management plans, and traffic management plans for assigned projects.<\/li> <li>\\u00a0Manage a direct control workforce to successfully undertake construction and maintenance projects<\/li> <li>\\u00a0Analyse and interpret asset condition data and other relevant information to develop the current and forward year works programs. Monitor and report on project progress.<\/li> <\/ul><p><strong>\\u00a0<\/strong>Please <a href=\\\"https:\/\/talent832612951.files.wordpress.com\/2021\/08\/rom-network-amp-assets-project-engineer-el1-2-civ.project-engineer....pdf\\\" target=\\\"_blank\\\">click here<\/a> to view a copy of the role description<\/p><p><strong>\\u00a0<\/strong><\/p><p><strong><strong>About you\\u00a0<\/strong><\/strong><\/p><p>You have completed a four year civil\/structural engineering degree and have a knowledge of the technical aspects of materials, equipment and techniques used in bridge maintenance and construction projects. You\\u2019re an excellent communicator and have the ability to use computer based tools and techniques for project and information management. You will possess a current and valid Australian motor vehicle driver\\u2019s license and be willing to work outside normal working hours and travel on occasion.<\/p><p>\\u00a0<\/p><p><strong>Salary and Benefits<\/strong><\/p><p>Joining Transport for NSW, you\\u2019ll have access to a range of unique government benefits in a flexible work environment like no other. If you\\u2019re ready to step into this meaningful and rewarding role, we want to hear from you. The salary for this position is Engineer Level 1 - 2 ($94,184- $124,862) per annum plus superannuation and leave loading.<\/p><p>For more information on Employee Benefits at TfNSW please click\\u00a0<a href=\\\"https:\/\/www.transport.nsw.gov.au\/about-us\/careers\/why-join-us\/benefits\\\" target=\\\"_blank\\\">here<\/a>.<\/p><p>\\u00a0<\/p><p><strong>We are the community we serve<\/strong><br \/>We are committed to being an inclusive, diverse and flexible workplace where differences are valued. We welcome people of all backgrounds, experience and abilities.We enable our people to work in ways that work for them and their teams. Working virtually and from different locations including regional locations, staggering work hours and job sharing are just some of the ways our people can work flexibly.Please contact the Talent Specialist below if you require any adjustments to be made to how you interact with us throughout the recruitment process or would like to discuss flexible work options.<br \/><br \/>\\u00a0<\/p><p><strong>How\\u00a0to\\u00a0apply\\u00a0<\/strong><\/p><p>Joining Transport for NSW, you\\u2019ll have access to a range of unique government benefits in a flexible work environment like no other. If you\\u2019re ready to step into this meaningful and rewarding role, we want to hear from you! To apply for this position, please submit a resume, cover letter and answer the screening questions within the online application process.\\u00a0<\/p><p>\\u00a0<\/p><p>Find out more about Transport for\\u00a0<a href=\\\"https:\/\/www.transport.nsw.gov.au\/about-us\\\" target=\\\"_blank\\\">NSW at https:\/\/www.transport.nsw.gov.au\/about-us<\/a><\/p><p>For more information on how to apply for a role in the NSW Public Sector please click\\u00a0<a target=\\\"_blank\\\">here<\/a>.\\u00a0<\/p><p>For any enquiries, please contact\\u00a0Marcia Pinto on\\u00a0marcia.pinto@transport.nsw.gov.au<\/p><p>\\u00a0<\/p><p><strong>Closing Date for Applications<\/strong>: 5th October 2021 at 11:59pm<\/p>\"}"
}