{
    "id":"Kaggle::techmap::61521d6b7d6e695df2bbbbdd::linkedin_be::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Duration. 15\/11\/2021 - 30\/12\/2022. Location. Brussels. Description. Group Technology Services (GTS) plans, builds and runs the global infrastructure of the company, and is additionally responsible for the IT service management to the operating entities of the various Group markets. GTS operates its IT systems and IT services in such a way that, at an appropriate and benchmarked cost level, it can deliver the agreed levels of service to support the requirements of the business processes, for both normal operations and during disaster recovery. We are currently looking for an experienced project leader. Epic Enabler to strengthen its team. Responsibilities. You will join the GTS Epic Enablement team and will be accountable for the delivery of end-to-end infrastructure projects business market needs as well as technical product evolutions. Your overall responsibility of the project includes: Build the business case (Epic Investment Resquest) with the help of the project Sponsors\/Epic Owners. Define the benefits, scope (MVPs and increment), timing and budget of the project. Deliver the project scope on time (manaing risk-issue-change request), on budget and with the expected quality. Ensure quality of deliverables and delivered services through a structured project \/ EPIC or set of EPICS management approach (project planning tools, project reporting, project management methodology, project risks management, etc) (adapted to agile methodology). Collaborate with teams across various divisions, entities and locations. Coordinate all parties involved in the project: both inside the organization (Infrastructure, Security, Software Development, Operations, Risk, Audit, etc) and externally (for example IT suppliers or clients). Maintain compliance with architecture principles, productino acceptance criteria and recommendations. Hand over the finalized project to the maintenance and operational teams. On top of the delivery of the projects, you will also contribute to the Agile transformation that the team and the division started end 2019. Opportunities to broaden your expertise will be offered by participating to different projects with different profiles and different level of complexity. You will also benefit from the support of our most senior PLs. Skills. Your Profile: You already have 10. years of proven Project Management experience in an IT infrastructrure delivery environment. You are experienced in managing end to end several projects or features in parallel with size varying from 50 to 3, 000 man-days.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61521d6b7d6e695df2bbbbdd::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"Brainbridge - Workforce Solutions\", \"position\": \"Program Project Manager\", \"notes\": \"\", \"original\": \"<p><strong>Duration<\/strong><\/p><p>15\/11\/2021 - 30\/12\/2022<\/p><p><strong>Location<\/strong><\/p><p>Brussels<\/p><p><br><\/p><p><strong>Description<\/strong><\/p><p>Group Technology Services (GTS) plans, builds and runs the global infrastructure of the company, and is additionally responsible for the IT service management to the operating entities of the various Group markets. GTS operates its IT systems and IT services in such a way that, at an appropriate and benchmarked cost level, it can deliver the agreed levels of service to support the requirements of the business processes, for both normal operations and during disaster recovery.&nbsp;<\/p><p>&nbsp;We are currently looking for an experienced project leader - Epic Enabler to strengthen its team.<\/p><p><strong>Responsibilities<\/strong><\/p><p>You will join the GTS Epic Enablement team and will be accountable for the delivery of end-to-end infrastructure projects business market needs as well as technical product evolutions.&nbsp;<\/p><p>Your overall responsibility of the project includes:<\/p><ul><li>Build the business case (Epic Investment Resquest) with the help of the project Sponsors\/Epic Owners<\/li><li>Define the benefits, scope (MVPs and increment), timing and budget of the project<\/li><li>Deliver the project scope on time (manaing risk-issue-change request), on budget and with the expected quality<\/li><li>Ensure quality of deliverables and delivered services through a structured project \/ EPIC or set of EPICS management approach (project planning tools, project reporting, project management methodology, project risks management, etc) (adapted to agile methodology)<\/li><li>Collaborate with teams across various divisions, entities and locations<\/li><li>Coordinate all parties involved in the project: both inside the organization (Infrastructure, Security, Software Development, Operations, Risk, Audit, etc) and externally (for example IT suppliers or clients)<\/li><li>Maintain compliance with architecture principles, productino acceptance criteria and recommendations<\/li><li>Hand over the finalized project to the maintenance and operational teams<\/li><\/ul><p>On top of the delivery of the projects, you will also contribute to the Agile transformation that the team and the division started end 2019.<\/p><p>&nbsp;Opportunities to broaden your expertise will be offered by participating to different projects with different profiles and different level of complexity. You will also benefit from the support of our most senior PL\\u2019s.&nbsp;<\/p><p>&nbsp;<\/p><p><strong>Skills<\/strong><\/p><p><strong>Your Profile:<\/strong><\/p><ul><li>You already have 10+ years of proven Project Management experience in an IT infrastructrure delivery environment.<\/li><li>You are experienced in managing end to end several projects or features in parallel with size varying from 50 to 3,000 man-days.<\/li><li>You have demonstrated through your career strong leadership skills with the ability as well to adapt your style according to the context and the different project stakeholders.<\/li><li>These projects were managed according to one of the industry standard methodologies Agile@Scale. Waterfall experience is a plus.<\/li><li>Your responsibilities encompassed the different aspects of these ones (Planning, Budgets, Risks &amp; Issues, Resources management ). Previous experience of outsourced projects management is a plus.<\/li><li>You naturally have strong negotiation and conflict management skills and you are able to influence different levels of management towards your projects targets.<\/li><li>You are fluent in English and have excellent communication skills (listening, writing, and presenting) at all levels, from staff members to senior management level.<\/li><li>You have a natural affinity with the technical domains and experienced at least 3 of them in your past experience (e.g. Network LAN\/WAN, Cyber-Security, Windows, Unix\/Linux, Mainframe or Tandem). This allows you to understand the IT infrastructures &amp; architectures in a complex environment and to synthesize the situation in an understandable way for different audiences.<\/li><\/ul><p><strong>Job Specificities:<\/strong><\/p><p>One of the 2 positions needs having had close experience with:<\/p><ul><li>Network security in a complex environments<\/li><li>Security aspects<\/li><li>Projects dealing with large-scale firewall cleaning (definitely an asset)<\/li><li>Good general knowledge of firewall technologies (HLB, Alta Vista, Check Point) and general knowledge of Cisco, ACI, IAF, DDOS is an asset.<\/li><\/ul><p>&nbsp;<strong>Qualifications:<\/strong><\/p><ul><li>Certified Prince 2 &amp; Scrum<\/li><li>Strong Stakeholder management<\/li><li>Ability to streamline and structure efficiently deliveries and benefits<\/li><\/ul><li><\/li>\"}"
}