{
    "id":"Kaggle::techmap::613b1f7491a86b2536b800c5::itjobslist_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"it is not a manual job, therefore comments about standing, crouching etc should not be necessary",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Overview:At Cube. Smart, our culture makes the difference. When we say it’s what’sinsidethat counts, we are saying “you count”Responsibilities:What Cube. Smart offers:NON-TRADITIONAL HOURS COMPETITIVE HOURLY RATE and BONUS OPPORTUNITIES 401k RETIREMENT PLAN with COMPANY MATCH SHORT TERM DISABILITY TUITION RRIMBURSEMENT STORAGE DISCOUNTSYour role at CubeSmart… Listen to customers to understand their unique situation. Become an expert in self-storage by renting storage spaces and managing the leasing process. Take ownership of your store’s retail business. Participate in operations activities such as keeping the property clean, performing lock checks and showing units to potential customers. Utilize our Point of Sales system (POS) to take payments, manage customer accounts, and maintain inventory. Other duties as assigned. You’ll love working here because…YOU WILL MAKE A DIFFERENCE – YOU WILL BELONG TO A TEAM – YOU WILL GROW WITH USQualifications:You’d be great in this role if you have… A positive and outgoing personality with a passion for helping people. Experience in retail or customer service preferred. Basic computer skills. We also want you to know that. You must have the ability to work Saturdays and Sundays. Valid driver’s license and insurance with access to reliable transportation used during the workday. While performing the duties of this job, you will be frequently required to stand, sit, kneel, crouch, crawl, bend, climb or balance on a ladder. On occasion, you may need to lift and\/or move up to 50 pounds. We are an Equal Opportunity Employer, Minority\/Female\/Veteran\/Individuals with Disabilities\/Sexual Orientation\/Gender Identity. #LI-RD1",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613b1f7491a86b2536b800c5::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"Cubesmart\", \"position\": \"Retail Sales Associate\", \"notes\": \"\", \"original\": \"Overview: <b>At CubeSmart, our culture makes the difference. When we say it\\u2019s what\\u2019s <\/b><b>inside <\/b><b>that counts, we are saying \\u201cyou count\\u201d<\/b>Responsibilities:<b>What CubeSmart offers:<\/b>NON-TRADITIONAL HOURS COMPETITIVE HOURLY RATE and BONUS OPPORTUNITIES 401k RETIREMENT PLAN with COMPANY MATCH SHORT TERM DISABILITY TUITION RRIMBURSEMENT STORAGE DISCOUNTS <b>Your role at CubeSmart\\u2026<\/b><ul><li>Listen to customers to understand their unique situation<\/li><li>Become an expert in self-storage by renting storage spaces and managing the leasing process<\/li><li>Take ownership of your store\\u2019s retail business<\/li><li>Participate in operations activities such as keeping the property clean, performing lock checks and showing units to potential customers<\/li><li>Utilize our Point of Sales system (POS) to take payments, manage customer accounts, and maintain inventory<\/li><li>Other duties as assigned<\/li><\/ul><b>You\\u2019ll love working here because\\u2026<\/b><b> <\/b><b>YOU WILL MAKE A DIFFERENCE \\u2013 YOU WILL BELONG TO A TEAM \\u2013 YOU WILL GROW WITH US<\/b>Qualifications:<b>You\\u2019d be great in this role if you have\\u2026<\/b><ul><li>A positive and outgoing personality with a passion for helping people<\/li><li>Experience in retail or customer service preferred<\/li><li>Basic computer skills<\/li><\/ul><b>We also want you to know that.<\/b><ul><li>You must have the ability to work Saturdays and Sundays<\/li><li>Valid driver\\u2019s license and insurance with access to reliable transportation used during the workday<\/li><li>While performing the duties of this job, you will be frequently required to stand, sit, kneel, crouch, crawl, bend, climb or balance on a ladder<\/li><li>On occasion, you may need to lift and\/or move up to 50 pounds<\/li><\/ul><b>Note:<\/b> If you have experience working in any of the following types of jobs, we encourage you to apply: Sales Associate, Customer Service Representative (CSR), Retail Associate, Cashier, Store Associate, Keyholder, Restaurant, Hospitality, and Hotel, Front Desk Agent, Leasing Agent, Rental Agent (i.e. car rental, RV rental, self-storage rental, storage rental, apartment rental, etc.) Property Management, Retail Sales Lead or Team Lead. We are an Equal Opportunity Employer, Minority\/Female\/Veteran\/Individuals with Disabilities\/Sexual Orientation\/Gender Identity. #LI-RD1\"}"
}