{
    "id":"Kaggle::techmap::614b3075ee6d16322baf63ad::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"\"we promote ROCKSTARS!\" is often associated with masculine stereotypes.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" $11\/HR  CASH TIPS  MILEAGE. FREE SHIFT MEAL. FLEXIBLE SCHEDULE. NO FRYERS, GRIDDLES OR PLAYGROUNDS TO CLEAN. ONE MINUTEEASY APPLICATION. We provide industry leading customer service in aCLEAN andFUN environment. Whether you're just looking to make a few extra bucks or taking the next step in your restaurant management career (or anything in between), we have a place forFRIENDLY andDEPENDABLE people. Great opportunity to advance into management. we promote ROCKSTARS! Visit us atwww. nowhiring. com\/jjfresh for more information. NOW HIRING. Immediate openings for Delivery Drivers. Must be eighteen (18) years or older. Uber Eats, Grubhub, Door. Dash, Postmates, Customer Service, Part Time, Part-time, Full Time, Full-time, Cashier, Customer Service Representative, Customer Services Representative, Driver, Delivery Driver, Manager, Restaurant, Fast Food, Quick Service Restaurant, Casual Dining, Courier.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b3075ee6d16322baf63ad::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Jimmy Johns\", \"position\": \"Delivery Driver Up To 25\/HR at Jimmy John's\", \"notes\": \"\", \"original\": \"<div><p><b>* <\/b><b>$11\/HR + CASH TIPS + MILEAGE<\/b><b> <\/b><b>*<\/b><\/p><p><b>*<\/b><b> FREE SHIFT MEAL<\/b><b> <\/b><b>*<\/b><\/p><p><b>*<\/b><b> FLEXIBLE SCHEDULE <\/b><b>*<\/b><\/p><p><b>* <\/b><b>NO FRYERS, GRIDDLES OR PLAYGROUNDS TO CLEAN <\/b><b>*<\/b><\/p><p><b>* <\/b><b>ONE MINUTE<\/b><b> <\/b><b>EASY<\/b><b> APPLICATION<\/b><b> <\/b><b>*<\/b><\/p><p><\/p><p>We provide industry leading customer service in a <b>CLEAN<\/b> and <b>FUN<\/b> environment. Whether you're just looking to make a few extra bucks or taking the next step in your restaurant management career (or anything in between), we have a place for <b>FRIENDLY<\/b> and <b>DEPENDABLE<\/b> people. Great opportunity to advance into management - we promote ROCKSTARS!<\/p><p><\/p><p>Visit us at <b>www.nowhiring.com\/jjfresh<\/b> for more information.<\/p><p><\/p><p><\/p><p>NOW HIRING - Immediate openings for Delivery Drivers. Must be eighteen (18) years or older.<\/p><p>Uber Eats, Grubhub, DoorDash, Postmates, Customer Service, Part Time, Part-time, Full Time, Full-time, Cashier, Customer Service Representative, Customer Services Representative, Driver, Delivery Driver, Manager, Restaurant, Fast Food, Quick Service Restaurant, Casual Dining, Courier<\/p><\/div><br \/>\"}"
}