{
    "id":"Kaggle::techmap::615650a0c439044a476be0a4::monster_us::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Apply today, work tomorrow, get paid weekly! We re now hiring immediately for our Assembler job in North Salt Lake, UT. Comment or tag a friend below if you're interested! What We Offer Weekly Pay of $14. 00 per hour. Direct deposit & debit card payment options. Health, vision, dental, life, and disability insurance. Get weekends off. Overtime available. Training provided. Temp-to-hire opportunity. No experience needed. Assembler Tasks & Duties (What You'll Do) Read, view and follow written and visual (picture) instructions for how to put parts together. Check assembled products to make sure they're put together correctly (quality control). Look for issues or broken products, write these down and tell the supervisor. Fix products to make them match the product picture diagram. Write down any issues with products and record how many products you've assembled. Make sure your work station has enough parts to assemble. Assembler Shift Info Day Shift, 05:00 am to 05:00 pm. rotating schedule. Assembler Qualifications (Requirements \/ Skills) Knowledge of manufacturing, equipment maintenance, safety management, and controls and instrumentation. Reading comprehension skills with the ability to interpret and follow written directions, blueprints, and engineering diagrams. Basic math skills to measure parts and product. Physical ability to stand for long periods and lift 30-50 pounds. Assembler experience preferred. Able to pass a background check. Able to work in the US. Apply today, Assembler. Hiring Immediately essential jobs near Layton, UT 84041 typically fill quickly! About Ascend Staffing Ascend Staffing has been connecting great people with real opportunities for over 50 years. We are always looking for great people. If you re ready to earn more, get real benefits and achieve your goals, you ve come to the right place. We do what we say we will do. We are direct and transparent. We find real opportunities with great employers. Want to contact us? Ascend Staffing Layton. 1771 N Main St, Ste 2 Layton, UT 84041. 801-776-2929. https:\/\/www. ascendstaffing. com\/contact-us\/layton\/. Related Job Titles Assembler. Assembly. Electronic Assembly. Manufacturing Associate. Production Worker. Packaging Assembly Specialist. Manufacturer. Hiring Immediately Jobs. #essentialwork. #jobshiringinNorth Salt Lake. #nowhiring. #hiringimmediately. #jobsnearme. #jobsnearNorth Salt Lake, UT. #56293 @IN2003 @ZR2003..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615650a0c439044a476be0a4::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Ascend Staffing\", \"position\": \"Plastic Mold Machine Operator\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Apply today, work tomorrow, get paid weekly! Are you looking for a company that is hiring immediately? We re now hiring immediately for our Assembler job in North Salt Lake, UT. Comment or tag a friend below if you're interested! <\/p> <p><br><\/p> <h4><strong><u>What We Offer<\/u><\/strong><\/h4> <ul> <li> Weekly Pay of $14.00 per hour<\/li> <li> Direct deposit &amp; debit card payment options<\/li> <li> Health, vision, dental, life, and disability insurance<\/li> <li> Get weekends off<\/li> <li>Overtime available<\/li> <li> Training provided<\/li> <li> Temp-to-hire opportunity<\/li> <li> No experience needed<\/li> <\/ul> <p><br><\/p> <h4><strong><u>Assembler Tasks &amp; Duties (What You'll Do)<\/u><\/strong><\/h4> <ul> <li>Read, view and follow written and visual (picture) instructions for how to put parts together<\/li> <li>Check assembled products to make sure they're put together correctly (quality control)<\/li> <li>Look for issues or broken products, write these down and tell the supervisor<\/li> <li>Fix products to make them match the product picture diagram<\/li> <li>Write down any issues with products and record how many products you've assembled<\/li> <li>Make sure your work station has enough parts to assemble<\/li> <\/ul> <p><br><\/p> <h4><strong><u>Assembler Shift Info<\/u><\/strong><\/h4> <ul> <li>Day Shift, 05:00 am to 05:00 pm<\/li> <li>rotating schedule<\/li> <\/ul> <p><br><\/p> <h4><strong><u>Assembler Qualifications (Requirements \/ Skills)<\/u><\/strong><\/h4> <ul> <li>Knowledge of manufacturing, equipment maintenance, safety management, and controls and instrumentation<\/li> <li>Reading comprehension skills with the ability to interpret and follow written directions, blueprints, and engineering diagrams<\/li> <li>Basic math skills to measure parts and product<\/li> <li>Physical ability to stand for long periods and lift 30-50 pounds<\/li> <li>Assembler experience preferred<\/li> <li>Able to pass a background check<\/li> <li>Able to work in the US<\/li> <\/ul> <p>Apply today, Assembler - Hiring Immediately essential jobs near Layton, UT 84041 typically fill quickly! <\/p> <p><br><\/p> <h4><strong><u>About Ascend Staffing<\/u><\/strong><u><\/u><\/h4> <p>Ascend Staffing has been connecting great people with real opportunities for over 50 years. We are always looking for great people. If you re ready to earn more, get real benefits and achieve your goals, you ve come to the right place. <\/p> <ul> <li>We do what we say we will do.<\/li> <li>We are direct and transparent.<\/li> <li>We find real opportunities with great employers.<\/li> <\/ul> <p><br><\/p> <h4><strong><u>Want to contact us?<\/u><\/strong><\/h4> <p><em>Ascend Staffing Layton<\/em><\/p> <p>1771 N Main St, Ste 2 Layton, UT 84041 <\/p> <p>801-776-2929 <\/p> <p><a href=\\\"https:\/\/www.ascendstaffing.com\/contact-us\/layton\/\\\" rel=\\\"noopener noreferrer nofollow noopener noreferrer\\\" target=\\\"_blank\\\">https:\/\/www.ascendstaffing.com\/contact-us\/layton\/<\/a><\/p> <p><br><\/p> <h4>Related Job Titles<strong><u><\/u><\/strong><\/h4> <ul> <li>Assembler<\/li> <li>Assembly<\/li> <li>Electronic Assembly<\/li> <li>Manufacturing Associate<\/li> <li>Production Worker<\/li> <li>Packaging Assembly Specialist<\/li> <li>Manufacturer<\/li> <li>- Hiring Immediately Jobs<\/li> <\/ul> <p><br><\/p> <p>#essentialwork <\/p> <p> #jobshiringinNorth Salt Lake <\/p> <p> #nowhiring <\/p> <p> #hiringimmediately <\/p> <p> #jobsnearme <\/p> <p> #jobsnearNorth Salt Lake, UT <\/p> <p> #56293 @IN2003 @ZR2003 <\/p> <p><\/p> <p><\/p> <\/div>\"}"
}