{
    "id":"Kaggle::techmap::615eae21e8edc618af066a7e::monster_ie::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description Service & Commissioning Engineer. About the role: Adecco are recruiting for an exciting opportunity for a Service and Commissioning Engineer with a world-wide leading provider of clean utility systems for pharma & biotech. This company is providing optimal solutions for all clean media applications such as Purified Water, Water for Injection (WFI) and Pure Steam. The successful candidate will be responsible for commissioning and service maintenance work on existing and new plants. The engineer will be working on a multitude of systems including the following technologies: Filtration, Ion Exchange, UV, Reverse Osmosis (RO), EDI, Ozone, WFI and Pure Steam. The engineer will be required to interface with end users and customers. Duties and Responsibilities: Perform preventative and corrective maintenance on water treatment equipment including electro-mechanical repairs along with replacements of parts. Troubleshoot issues remotely over the phone and at the customer's site for both electrical and mechanical questions. Commission new systems at customer sites including completing detailed commissioning documentation and reporting. Provide training of site personnel in the operation and maintenance of the equipment. Maintain internal documentation and submit external reports to customers. Ensure customer satisfaction by always delivering professional and pro-active service. Qualifications: 3-5 years' experience in working with electro-mechanical equipment including pumps, valves, motors etc. Experience with electrical \/ control panels, I\/O, PLC's and automation of plants including tuning control loops and programming of instrumentation. Must have the ability to read and interpret basic electrical and mechanical drawings, P&IDs, and the ability to discuss. Water treatment industry experience. Proven ability to work remotely, independently without supervision and be customer-facing. Proficiency in computers and Windows software. Must enjoy providing customer satisfaction through a pro-active and committed response to customers. Must be willing to travel regionally covering the Leinster region and occasionally throughout Ireland. Must have a valid driver's license and clean driving record. Ability to work flexible hours, sometimes outside \"normal business hours\" and travel as required sometimes on short notice. Adecco Ireland is acting as an Employment Agency in relation to this vacancy.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615eae21e8edc618af066a7e::monster_ie\", \"source\": \"monster_ie\", \"country\": \"IE\", \"company\": \"Adecco Retail\", \"position\": \"Service & Commissioning Engineer\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <img height=\\\"1\\\" src=\\\"https:\/\/counter.adcourier.com\/bmlhbGwucmFtc2JvdHRvbS44ODU4OS40NzlAYWRlY2NvaXIuYXBsaXRyYWsuY29t.gif\\\" width=\\\"1\\\">Service &amp; Commissioning Engineer <br>About the role: <br>Adecco are recruiting for an exciting opportunity for a Service and Commissioning Engineer with a world-wide leading provider of clean utility systems for pharma &amp; biotech. This company is providing optimal solutions for all clean media applications such as Purified Water, Water for Injection (WFI) and Pure Steam <br>The successful candidate will be responsible for commissioning and service maintenance work on existing and new plants. The engineer will be working on a multitude of systems including the following technologies: Filtration, Ion Exchange, UV, Reverse Osmosis (RO), EDI, Ozone, WFI and Pure Steam. The engineer will be required to interface with end users and customers. <br>Duties and Responsibilities: <br>*Perform preventative and corrective maintenance on water treatment equipment including electro-mechanical repairs along with replacements of parts. <br>*Troubleshoot issues remotely over the phone and at the customer's site for both electrical and mechanical questions <br>*Commission new systems at customer sites including completing detailed commissioning documentation and reporting. <br>*Provide training of site personnel in the operation and maintenance of the equipment <br>*Maintain internal documentation and submit external reports to customers <br>*Ensure customer satisfaction by always delivering professional and pro-active service <br>Qualifications: <br>*3-5 years' experience in working with electro-mechanical equipment including pumps, valves, motors etc. <br>*Experience with electrical \/ control panels, I\/O, PLC's and automation of plants including tuning control loops and programming of instrumentation <br>*Must have the ability to read and interpret basic electrical and mechanical drawings, P&amp;IDs, and the ability to discuss <br>*Water treatment industry experience <br>*Proven ability to work remotely, independently without supervision and be customer-facing <br>*Proficiency in computers and Windows software <br>*Must enjoy providing customer satisfaction through a pro-active and committed response to customers <br>*Must be willing to travel regionally covering the Leinster region and occasionally throughout Ireland. <br>*Must have a valid driver's license and clean driving record <br>*Ability to work flexible hours, sometimes outside \\\"normal business hours\\\" and travel as required sometimes on short notice <br> <br> <br>Adecco Ireland is acting as an Employment Agency in relation to this vacancy. <\/div>\"}"
}