{
    "id":"Kaggle::techmap::645906eb60ff1c61cfee1c9c::snagajob_us::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"WE ARE LOOKING FOR GREAT PEOPLE TO JOIN OUR TEAM. just like you! Our associates have a lot in common. They have great interpersonal skills, enjoy working independently, are self-motivated, and have a relentless drive. Did we mention that while they are working hard, they also like to have fun? We offer flexible hours, competitive pay, and great benefits for both full and part-time associates. If this sounds like a good fit for you, come join our team! The majority of responsibility for the Territory Sales Lead is the supervision and development of the assigned associates to drive sales and meet retailer and client expectations. The Territory Sales Lead will also be responsible for project completion, stocking and maintaining the areas we are responsible for, and store communication. This responsibility is demonstrated by effectively selling and educating customers and store personnel about product lines and other project (s) deemed necessary. The Territory Sales Lead reports directly to the Market Sales Manager. What would you do in this role? DUTIES andRESPONSIBILITIES include but are not limited to the following: Build rapport through daily communication with store associates and management. Train, supervise, and develop skills of Sales Merchandisers, fellow Territory Sales Leads, and seasonal associates. Educate customers and store personnel on the features and benefits of our client’s brands and product lines. Maintain accuracy and high quality of work in all areas of the store to meet or exceed client expectations. Have detailed knowledge of all company policies. Knowledgeable, detailed understanding and consistent use of all available functions of handheld device. Maintain company, client and retailer confidentiality. REQUIREMENTS and QUALIFICATIONS, including but not limited to the following: Lifting objects and product up to a maximum of 50 lbs. with frequent lifting and\/or carrying of objects\/product up to 35 lbs, in addition, the ability to lift heavy objects up to 100lbs with assistance from another associate. Work performed could be while sitting, standing, or walking. Work performed will entail fine manipulation of hands or fingers, bending, twisting, squatting, and climbing as well as upper and lower body mobility. Experience\/comfort level with electronics\/technical products. Independent and self-motivated. Must be able to work a flexible schedule, including nights, overnights and weekends. High School diploma or equivalency certification required.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::645906eb60ff1c61cfee1c9c::snagajob_us\", \"source\": \"snagajob_us\", \"country\": \"US\", \"company\": \"Anderson Merchandisers, L.L.C.\", \"position\": \"Lead Retail Sales Merchandiser - Hiring Immediately\", \"notes\": \"\", \"original\": \"<div _ngcontent-sc412=\\\"\\\" class=\\\"job-description relative prose body-md text-gray-900\\\">\\n <div _ngcontent-sc412=\\\"\\\">\\n  <div _ngcontent-sc412=\\\"\\\" class=\\\"ng-star-inserted\\\">\\n   <p><b>WE ARE LOOKING FOR GREAT PEOPLE TO JOIN OUR TEAM- just like you!&nbsp;<\/b><\/p>\\n   <p>Our associates have a lot in common.&nbsp; They have great interpersonal skills, enjoy working independently, are self-motivated, and have a relentless drive. Did we mention that while they are working hard, they also like to have fun?<\/p>\\n   <p>We offer flexible hours, competitive pay, and great benefits for both full and part-time associates.<\/p>\\n   <p>If this sounds like a good fit for you, come join our team!<\/p>The majority of responsibility for the Territory Sales Lead is the supervision and development of the assigned associates to drive sales and meet retailer and client expectations. The Territory Sales Lead will also be responsible for project completion, stocking and maintaining the areas we are responsible for, and store communication. This responsibility is demonstrated by effectively selling and educating customers and store personnel about product lines and other project (s) deemed necessary. The Territory Sales Lead reports directly to the Market Sales Manager.\\n   <p>What would you do in this role?<\/p>\\n   <p><b>DUTIES and <\/b><span>RESPONSIBILITIES<\/span><b> include but are not limited to the following:<\/b><\/p>\\n   <ul>\\n    <li>Build rapport through daily communication with store associates and management<\/li>\\n    <li>Train, supervise, and develop skills of Sales Merchandisers, fellow Territory Sales Leads, and seasonal associates<\/li>\\n    <li>Educate customers and store personnel on the features and benefits of our client\\u2019s brands and product lines<\/li>\\n    <li>Maintain accuracy and high quality of work in all areas of the store to meet or exceed client expectations<\/li>\\n    <li>Have detailed knowledge of all company policies<\/li>\\n    <li>&nbsp;Communicate successes or potential barriers to the Market Sales Manager<\/li>\\n    <li>Knowledgeable, detailed understanding and consistent use of all available functions of handheld device<\/li>\\n    <li>Maintain company, client and retailer confidentiality<\/li>\\n   <\/ul>\\n   <p><b>REQUIREMENTS and QUALIFICATIONS, including but not limited to the following: <\/b><\/p>\\n   <ul>\\n    <li>Lifting objects and product up to a maximum of 50 lbs. with frequent lifting and\/or carrying of objects\/product up to 35 lbs, in addition, the ability to lift heavy objects up to 100lbs with assistance from another associate<\/li>\\n    <li>Work performed could be while sitting, standing, or walking<\/li>\\n    <li>Work performed will entail fine manipulation of hands or fingers, bending, twisting, squatting, and climbing as well as upper and lower body mobility<\/li>\\n    <li>Experience\/comfort level with electronics\/technical products<\/li>\\n    <li>Independent and self-motivated<\/li>\\n    <li>Must be able to work a flexible schedule, including nights, overnights and weekends<\/li>\\n    <li>High School diploma or equivalency certification required<\/li>\\n    <li>Valid driver's license is required as travel to additional locations may be necessary<\/li>\\n    <li>Automobile liability insurance is required to be maintained<\/li>\\n    <li>Computer, printing capability, internet access, and email required<\/li>\\n    <li>Customer service or sales experience required<\/li>\\n   <\/ul>\\n   <p>Rate of Pay<\/p>$17.00\\n   <p>As an Anderson Merchandisers Associate, you may be eligible for these benefits*.<\/p>\\n   <p>\\u2022&nbsp;&nbsp; &nbsp;Flexible work schedules<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;401(k) retirement plan<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Health Insurance \\u2013 including Dental and Vision&nbsp;<\/p>\\n   <p>\\u2022&nbsp;&nbsp; &nbsp;Telehealth<\/p>\\n   <p>\\u2022&nbsp;&nbsp; &nbsp;Health Savings Account<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Accident Insurance<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Critical Illness Insurance<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Life Insurance<\/p>\\n   <p>\\u2022&nbsp;&nbsp; &nbsp;Long Term Care<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Short Term Disability<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Long Term Disability<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Associate Assistance Fund<\/p>\\n   <p>\\u2022&nbsp;&nbsp; &nbsp;Anderson Cares Natural Disaster Fund<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Associate Savings Plan<\/p>\\n   <p>\\u2022&nbsp;&nbsp; &nbsp;Anderson Cares Fund<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Paid Time Off<\/p>\\n   <p>\\u2022&nbsp;&nbsp; &nbsp;Discounts - Cell Phone, Vehicle, Pet Insurance<br>\\n    \\u2022&nbsp;&nbsp; &nbsp;Training &amp; Career Development<\/p>\\n   <p>*All benefits subject to eligibility per company policy.<\/p>\\n   <p>IND-123<\/p>\\n  <\/div>\\n <\/div>\\n <div _ngcontent-sc412=\\\"\\\" class=\\\"mt-32 ng-star-inserted\\\">\\n  <button _ngcontent-sc412=\\\"\\\" class=\\\"flex items-center mb-4 ml-4 bg-white\\\" tabindex=\\\"0\\\">\\n   <saj-icon-flag _ngcontent-sc412=\\\"\\\" class=\\\"w-16 h-16 text-primary-500 inline-block\\\">\\n    <svg viewbox=\\\"0 0 20 20\\\">\\n     <path fill-rule=\\\"evenodd\\\" d=\\\"M4 1.833a1 1 0 0 1 1 1V18a1 1 0 1 1-2 0V2.833a1 1 0 0 1 1-1ZM16.8 1.895a1 1 0 0 1 1 1v8.667a1 1 0 1 1-2 0V2.895a1 1 0 0 1 1-1Z\\\"><\/path><path fill-rule=\\\"evenodd\\\" d=\\\"M7.099 11.91a4.588 4.588 0 0 0-2.626.516 1 1 0 1 1-.946-1.762 6.586 6.586 0 0 1 3.723-.748c1.359.01 2.488.432 3.45.792l.05.018c1.015.38 1.855.684 2.85.684 1.08 0 1.746-.19 2.11-.344a1.887 1.887 0 0 0 .39-.216 1 1 0 0 1 1.426 1.401l-.727-.687c.727.687.727.688.726.688l-.001.001-.002.002-.005.005-.01.01a1.443 1.443 0 0 1-.09.085c-.052.045-.119.099-.204.159-.17.12-.407.26-.724.394-.635.27-1.57.502-2.889.502-1.381 0-2.527-.428-3.5-.791l-.05-.02c-1.016-.379-1.856-.683-2.85-.683a.994.994 0 0 1-.101-.005ZM7.088 3.023a3.674 3.674 0 0 0-2.513.631 1 1 0 0 1-1.15-1.637 5.672 5.672 0 0 1 3.83-.987c1.356.01 2.484.432 3.445.791l.05.019c1.015.38 1.855.684 2.85.684a1 1 0 0 1 .1.005 4.588 4.588 0 0 0 2.626-.515 1 1 0 0 1 .946 1.762 6.587 6.587 0 0 1-3.722.747c-1.36-.01-2.488-.432-3.45-.791l-.05-.019c-1.016-.38-1.856-.684-2.85-.684a1 1 0 0 1-.112-.006Z\\\"><\/path>\\n    <\/svg>\\n   <\/saj-icon-flag><span _ngcontent-sc412=\\\"\\\" class=\\\"text-primary-500 ml-8 ui-strong-md\\\">Report this job<\/span><\/button>\\n <\/div>\\n<\/div>\"}"
}