{
    "id":"Kaggle::techmap::613f1056dd099f6e402dd75c::linkedin_be::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The job description specifies that candidates must be \"skilled and physically able to operate equipment & tools, lift & carry heavy loads.\" This could unintentionally exclude candidates with disabilities who might still be able to perform the essential functions of the job with reasonable accommodations.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Perform small installation works when instructed by your manager, have all new equipment reported. Provide technical support and knowhow within the team. Work closely together on daily base. Able to work upon request out of normal working hours, weekend & Bank holiday if needed. Contribute to update of As-built files, drawings, technical data sheets. Mark up drawings and documentation to show changes and issue to your line manager. Accountable for ensuring that all activities are carried out, in compliance with the tasks as set out in site SOPs, Processes and any adopted procedures. Keep up to date mandatory Logbooks and records. (Fgas, Heating, Extinguish, Gasses). Issue Purchase Requests, Work Orders in respect to the budget. HSSE. Ensure your mandatory and specialist Training plan is up to date (VCA, BA4-BA5, GI-GII, LV-HV, or other. ) Contribute to updated site SOPs, processes, and procedures to ensure that R&M activities are carried out in compliance. Ensure that all your entrusted activities are carried out in a health and safe environment following the safety instructions according the SSoW JLL policies. Receive Permits to Work, Risk Assessments and Method Statements where appropriate to do this. Contribute to keep Risk Assessments up to date and make reviews when systems are been modified. Contribute Toolbox meeting with your team. Ensure to wear PPE when required. Drive and demonstrate safe culture, maintain a safe place of work. General. Achieve operational excellence. Maintain a high level of confidentiality. Report potential for better practices with an innovative approach in liaison with you line manager. Look out for problems with the above, reporting them as appropriate to your line manager. Skills Required. Multi-skilled in technical building management, technologies, hard services. Specialist in HVAC, HVAC-R, ELEC, HV-LV systems. Familiar with building automation systems Johnson Controls and Domotics. Vision to link customer needs with what can be made technological possible. Oral and written language: fluent Dutch or French and knowledge of English. Stress resistant, able to resist and control in emergencies. Skilled and physically able to operate equipment & tools, lift & carry heavy loads. Team player, efficient worker, social and accountable. Familiar with computer equipment and programs. (Word, Excel, Outlook). Results-oriented, does what it takes to deliver, doesnt make excuses. Experience. 5 years experience HVAC specialities in Building Management, Maintenances and Technologies. Qualifications. Essential.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613f1056dd099f6e402dd75c::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"JLL\", \"position\": \"Heating Air Conditioning Technician\", \"notes\": \"\", \"original\": \"<p><strong>We are looking for a HVAC Technician for our Integrated Facilities Management business line. <\/strong><\/p><p><br><\/p><p><strong>About JLL <\/strong>\\u2013<\/p><p>We\\u2019re JLL\\u2014a leading professional services and investment management firm specializing in real estate. We have operations in over 80 countries and a workforce of over 92,000 individuals around the world who help real estate owners, occupiers and investors achieve their business ambitions. As a global Fortune 500 company, we also have an inherent responsibility to drive sustainability and corporate social responsibility. That\\u2019s why we\\u2019re committed to our purpose to shape the future of real estate for a better world. We\\u2019re using the most advanced technology to create rewarding opportunities, amazing spaces and sustainable real estate solutions for our clients, our people and our communities.<\/p><p><br><\/p><p>Our core values of teamwork, ethics and excellence are also fundamental to everything we do and we\\u2019re honoured to be recognized with awards for our success by organizations both globally and locally.<\/p><p><br><\/p><p>Creating a diverse and inclusive culture where we all feel welcomed, valued and empowered to achieve our full potential is important to who we are today and where we\\u2019re headed in the future. And we know that unique backgrounds, experiences and perspectives help us think bigger, spark innovation and succeed together.<\/p><p><br><\/p><p>If this job description resonates with you, we encourage you to apply even if you don\\u2019t meet all of the requirements below. We\\u2019re interested in getting to know you and what you bring to the table!<\/p><p><br><\/p><p><strong><u>Essential Duties and Responsibilities<\/u><\/strong><\/p><p><br><\/p><p><u>Operational<\/u><\/p><ul><li>In liaison with the Maintenance Lead ensure the site is operated and monitored in accordance with local legislation and manufacturers guidelines.<\/li><li>Ensure that all your assigned maintenances and reactive works are professionally performed within SLA &amp; KPI . That all work orders completed in full compliance with the Equipment Maintenance System<\/li><li>Maintenance of plants and utilities to ensure proper operation within specifications, efficient and reliable installations and that records are filed as required by Operational, Legal and Statutory practice.<\/li><li>Contribute to maximum availability and proper functioning of technical installations. Ensure prompt response to faults and emergencies with accurate reporting of the events.<\/li><li>Carryout all work in a healthy and safe environment following safety instructions and policy.<\/li><li>Guide the specialist contractors through the site, evaluate and reports performance issues to the engineering lead.<\/li><li>Be part to the On Call rota 24\/24 for technical issues.<\/li><li>Ensure control through BMS of proper functioning with most energy efficiency.<\/li><li>Perform small installation works when instructed by your manager, have all new equipment reported.<\/li><li>Provide technical support and knowhow within the team. Work closely together on daily base<\/li><li>Able to work upon request out of normal working hours, weekend &amp; Bank holiday if needed.<\/li><li>Contribute to update of As-built files, drawings, technical data sheets. Mark up drawings and documentation to show changes and issue to your line manager.<\/li><li>Accountable for ensuring that all activities are carried out, in compliance with the tasks as set out in site SOPs, Processes and any adopted procedures.<\/li><li>Keep up to date mandatory Logbooks and records. (Fgas, Heating, Extinguish, Gasses)<\/li><li>Issue Purchase Requests, Work Orders in respect to the budget.<\/li><\/ul><p><br><\/p><p><u>HSSE<\/u><\/p><ul><li>Ensure your mandatory and specialist Training plan is up to date (VCA, BA4-BA5, GI-GII, LV-HV, or other...)<\/li><li>Contribute to updated site SOP\\u2019s, processes, and procedures to ensure that R&amp;M activities are carried out in compliance.<\/li><li>Ensure that all your entrusted activities are carried out in a health and safe environment following the safety instructions according the SSoW JLL policies.<\/li><li>Receive Permits to Work, Risk Assessments and Method Statements where appropriate to do this.<\/li><li>Contribute to keep Risk Assessments up to date and make reviews when systems are been modified.<\/li><li>Contribute Toolbox meeting with your team.<\/li><li>Ensure to wear PPE when required.<\/li><li>Drive and demonstrate safe culture, maintain a safe place of work.<\/li><\/ul><p><br><\/p><p><u>General<\/u><\/p><ul><li>Achieve operational excellence.&nbsp;Maintain a high level of confidentiality.<\/li><li>Report potential for better practices with an innovative approach in liaison with you line manager.<\/li><li>Look out for problems with the above, reporting them as appropriate to your line manager.<\/li><\/ul><p><br><\/p><p><strong><u>Skills Required<\/u><\/strong><\/p><ul><li>Multi-skilled in technical building management, technologies, hard services<\/li><li>Specialist in HVAC, HVAC-R, ELEC, HV-LV systems<\/li><li>Familiar with building automation systems Johnson Controls and Domotics.<\/li><li>Vision to link customer needs with what can be made technological possible.<\/li><li>Oral and written language: fluent Dutch or French and knowledge of English.<\/li><li>Stress resistant, able to resist and control in emergencies.<\/li><li>Skilled and physically able to operate equipment &amp; tools, lift &amp; carry heavy loads.<\/li><li>Team player, efficient worker, social and accountable.<\/li><li>Familiar with computer equipment and programs. (Word, Excel, Outlook)<\/li><li>Results-oriented, does what it takes to deliver, doesn\\u2019t make excuses.<\/li><\/ul><p><br><\/p><p><strong><u>Experience<\/u><\/strong><\/p><ul><li>5 years\\u2019 experience HVAC specialities in Building Management, Maintenances and Technologies.<\/li><\/ul><p><br><\/p><p><strong><u>Qualifications<\/u><\/strong><\/p><p><br><\/p><p><u>Essential<\/u><\/p><ul><li>A1 - Bachelor degree in Electro-Mechanics Air Conditioning or Industrial Electric or equal with proven experience.<\/li><li>Certificate VCA and BA5<\/li><li>Driver\\u2019s license<\/li><li>Strong technical background and educations<\/li><\/ul><p><br><\/p><p><u>Desirable<\/u><\/p><ul><li>Supplementary trainings in Heating, Cooling, Energy, Steam,\\u2026<\/li><\/ul><p><br><\/p><p><strong>What you can expect from us<\/strong><\/p><p>We succeed together and believe the best inspire the best, so we invest in supporting each other, learning together and celebrating our success.<\/p><p><br><\/p><p>Our Total Rewards program reflects our commitment to helping you achieve your career ambitions, recognizing your contributions, investing in your well-being and providing competitive benefits and pay.<\/p><p><br><\/p><p>We can\\u2019t wait to see where your ambitions take you at JLL. Apply today!<\/p><p><br><\/p><p>Apply quoting reference <strong>REQ162010<\/strong> at jll.com\/careers.<\/p><p><br><\/p><p>#LI-JB2<\/p><p><\/p>\"}"
}