{
    "id":"Kaggle::techmap::64558f71cf666163916fa73a::simplyhired_us::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Details: Stand approximately 18-20 inches from the conveyor. Use both hands, grab the live chicken by the legs, being careful not to hurt the chicken or break any part. Lift the chicken and turn it upside down with the breast facing away. Keep all shackles full. Wear all required safety equipment. You must have good eye\/hand coordination. Any other task assigned by the Supervisor. You must be able to back up all other positions. Must be able to perform essential work functions to the standard within 10 days. You must be able to work at a fast pace throughout the shift. You must be able to work flexible hours and some weekends as production requires. Must be able to work in a cold, hot, humid and dusty environment. You must observe all required hygiene and safety procedures at all times. You must be able to stand throughout the shift. The job requires bending, lifting, twisting and turning. You must set an example for other team members in complying with all policies and good support. Párese aproximadamente a 18-20 pulgadas del transportador. Use ambas manos, agarre el pollo vivo por las piernas, teniendo cuidado de no lastimar al pollo ni romper ninguna parte. Levante el pollo y gírelo boca abajo con la pechuga hacia el otro lado. Mantenga todos los grilletes llenos. Use todo el equipo de seguridad requerido. Debe tener una buena coordinación ojo\/mano. Cualquier otra tarea asignada por el Supervisor. Debe poder realizar una copia de seguridad de todas las demás posiciones. Debe poder trabajar a un ritmo rápido durante todo el turno. Debe poder trabajar en horarios flexibles y algunos fines de semana según lo requiera la producción. Debe ser capaz de trabajar en un ambiente frío, caliente, húmedo y polvoriento. Debe observar todos los procedimientos de higiene y seguridad requeridos en todo momento. Debe poder estar de pie durante todo el turno. El trabajo requiere doblar, levantar, torcer y girar. Debe dar ejemplo a otros miembros del equipo para cumplir con todas las políticas y un buen soporte. Relocation Assistance Eligible: No. Work Shift: 1ST SHIFT (United States of America) Hourly Applicants ONLY -You must complete the task after submitting your application to provide additional information to be considered for employment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::64558f71cf666163916fa73a::simplyhired_us\", \"source\": \"simplyhired_us\", \"country\": \"US\", \"company\": \"Tyson Foods, Inc.\", \"position\": \"Harvest Room Labor\/Live Hang PR05 Nashville\", \"notes\": \"\", \"original\": \"<div><div>Job Details:<\/div><div><div><div><div><div><div><div><div><div><div><div><div><div><div>\\nStand approximately 18-20 inches from the conveyor.<\/div><div>\\nUse both hands, grab the live chicken by the legs, being careful not to hurt the chicken or break any part.<\/div><div>\\nLift the chicken and turn it upside down with the breast facing away.<\/div><div>\\nKeep all shackles full.<\/div><div>\\nWear all required safety equipment.<\/div><div>\\nYou must have good eye\/hand coordination.<\/div><div>\\nAny other task assigned by the Supervisor.<\/div><div>\\nYou must be able to back up all other positions.<\/div><div>\\nMust be able to perform essential work functions to the standard within 10 days.<\/div><div>\\nYou must be able to work at a fast pace throughout the shift.<\/div><div>\\nYou must be able to work flexible hours and some weekends as production requires.<\/div><div>\\nMust be able to work in a cold, hot, humid and dusty environment.<\/div><div>\\nYou must observe all required hygiene and safety procedures at all times.<\/div><div>\\nYou must be able to stand throughout the shift.<\/div><div>\\nThe job requires bending, lifting, twisting and turning.<\/div><div>\\nYou must set an example for other team members in complying with all policies and good support.<\/div><div><\/div><div><div>\\nP&aacute;rese aproximadamente a 18-20 pulgadas del transportador.<\/div><div>\\nUse ambas manos, agarre el pollo vivo por las piernas, teniendo cuidado de no lastimar al pollo ni romper ninguna parte.<\/div><div>\\nLevante el pollo y g&iacute;relo boca abajo con la pechuga hacia el otro lado.<\/div><div>\\nMantenga todos los grilletes llenos.<\/div><div>\\nUse todo el equipo de seguridad requerido.<\/div><div>\\nDebe tener una buena coordinaci&oacute;n ojo\/mano.<\/div><div>\\nCualquier otra tarea asignada por el Supervisor.<\/div><div>\\nDebe poder realizar una copia de seguridad de todas las dem&aacute;s posiciones.<\/div><div>\\nDebe ser capaz de realizar funciones de trabajo esenciales seg&uacute;n el est&aacute;ndar dentro de los 10 d&iacute;as.<\/div><div>\\nDebe poder trabajar a un ritmo r&aacute;pido durante todo el turno.<\/div><div>\\nDebe poder trabajar en horarios flexibles y algunos fines de semana seg&uacute;n lo requiera la producci&oacute;n.<\/div><div>\\nDebe ser capaz de trabajar en un ambiente fr&iacute;o, caliente, h&uacute;medo y polvoriento.<\/div><div>\\nDebe observar todos los procedimientos de higiene y seguridad requeridos en todo momento.<\/div><div>\\nDebe poder estar de pie durante todo el turno.<\/div><div>\\nEl trabajo requiere doblar, levantar, torcer y girar.<\/div><div>\\nDebe dar ejemplo a otros miembros del equipo para cumplir con todas las pol&iacute;ticas y un buen soporte.<\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><div><\/div><div>\\nRelocation Assistance Eligible:<\/div>\\nNo<div><\/div><div><br>\\nWork Shift:<\/div><br>\\n<div><\/div>\\n1ST SHIFT (United States of America)<div><\/div><div>\\nHourly Applicants ONLY -You must complete the task after submitting your application to provide additional information to be considered for employment.<\/div><div><\/div><div>\\nTyson is an Equal Opportunity\/Affirmative Action Employer. All qualified applicants will be considered without regard to race, national origin, color, religion, age, genetics, sex, sexual orientation, gender identity, disability or veteran status.<\/div><div><\/div><div>\\nWe provide our team members and their families with paid time off; 401(k) plans; affordable health, life, dental, vision and prescription drug benefits; and more.<\/div><div><\/div><div>\\nCCPA Notice. If you are a California resident, and would like to learn more about what categories of personal information we collect when you apply for this job, and how we may use that information, please read our CCPA Job Applicant Notice at Collection<div><\/div>.<\/div><\/div>\"}"
}