{
    "id":"Kaggle::techmap::6144465fa5224e6280f6ccb6::careerbuilder_us::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Create Your Career With Us! Sanford Health is one of the largest and fastest-growing not-for-profit health systems in the United States. We're proud to offer many development and advancement opportunities to our nearly 50, 000 members of the Sanford Family who are dedicated to the work of health and healing across our broad footprint. Facility: Woodsedge. Location: Bemidji, MN. Address: 1000 Anne St NW, Bemidji, MN 56601, USA. Shift: 8 Hours. Varied Shifts. Job Schedule: Full time. Weekly Hours: 32. 00. Department Details. Position hours:10:30-7:00 Monday-Saturday and 7:00-3:30 on Sunday's. Perks:. Sanford Healthcare Accessories - 20% off discount for items not covered by insurance. • Americ. Inn – Discounted rates Mon-Thursday. Holiday Inn – Discounted rates. Ashley Furniture, Furniture Mart and Unclaimed Freight Furniture – 35% discount. Job Summary. Responsible for certain duties including, but not limited to, monitoring and recording proper temperature of food, setting up and maintaining a clean and sanitized serving area, preparing and serving food items, restocking food areas, cleaning and sanitizing equipment, receiving payment for food and beverages using a computerized register and other related responsibilities. Complies with Hazardous Analysis and Critical Control Point (HACCP) guidelines for food service. Provides outstanding customer service and effectively communicates with patrons and co-workers. Demonstrates ability to establish effective working relationships. May operate equipment such as, but not limited to, grills, beverage machines, toasters, ice cream dispensers, cash registers, computerized cash registers, steam equipment, dishwashers, telephones, refrigerators and freezers. Preferably, displays experience working in the food industry. Possesses ability to work independently when necessary. Possesses an understanding of food safety and sanitation processes. Demonstrates ability to be on feet for the majority of the day and walk far distances. Qualifications. High School graduate or equivalent is preferred. Previous customer service experience or knowledge of food service operations is desirable. Benefits. Sanford Health offers an attractive benefits package for qualifying full-time and part-time employees. Depending on eligibility, a variety of benefits include health insurance, dental insurance, vision insurance, life insurance, a 401(k) retirement plan, work\/life balance benefits, sick leave and paid time off. To review your benefit eligibility, visit [Link available when viewing the job].",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144465fa5224e6280f6ccb6::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Sanford Health\", \"position\": \"Food Service Worker - WoodsEdge Senior Living - FT\", \"notes\": \"\", \"original\": \"<p><strong>Create Your Career With Us!<\/strong><\/p> <p><strong>Sanford Health is one of the largest and fastest-growing not-for-profit health systems in the United States. We're proud to offer many development and advancement opportunities to our nearly 50,000 members of the Sanford Family who are dedicated to the work of health and healing across our broad footprint.<\/strong><\/p> <p><strong>Facility:<\/strong> Woodsedge <\/p><p><strong>Location:<\/strong> Bemidji, MN <\/p><p><strong>Address:<\/strong> 1000 Anne St NW, Bemidji, MN 56601, USA <\/p><p><strong>Shift:<\/strong> 8 Hours - Varied Shifts <\/p><p><strong>Job Schedule:<\/strong> Full time <\/p><p><strong>Weekly Hours:<\/strong> 32.00<\/p> <p><strong>Department Details<\/strong><\/p> <p>Position hours:10:30-7:00 Monday-Saturday and 7:00-3:30 on Sunday's.<\/p> <p>Perks:<\/p> <p>\\r\\n\\u2022 Sanford Healthcare Accessories - 20% off discount for items not covered by insurance<\/p> <p>\\r\\n\\u2022 AmericInn \\u2013 Discounted rates Mon-Thursday<\/p> <p>\\r\\n\\u2022 Holiday Inn \\u2013 Discounted rates<\/p> <p>\\r\\n\\u2022 Ashley Furniture, Furniture Mart and Unclaimed Freight Furniture \\u2013 35% discount<\/p> <p><strong>Job Summary<\/strong><\/p> <p>Responsible for certain duties including, but not limited to, monitoring and recording proper temperature of food, setting up and maintaining a clean and sanitized serving area, preparing and serving food items, restocking food areas, cleaning and sanitizing equipment, receiving payment for food and beverages using a computerized register and other related responsibilities. Complies with Hazardous Analysis and Critical Control Point (HACCP) guidelines for food service. Provides outstanding customer service and effectively communicates with patrons and co-workers. Demonstrates ability to establish effective working relationships.<\/p> <p>Maintains quality control standards. May operate equipment such as, but not limited to, grills, beverage machines, toasters, ice cream dispensers, cash registers, computerized cash registers, steam equipment, dishwashers, telephones, refrigerators and freezers. Preferably, displays experience working in the food industry.<\/p> <p>Possesses ability to work independently when necessary. Possesses an understanding of food safety and sanitation processes. Demonstrates ability to be on feet for the majority of the day and walk far distances.<\/p> <p><strong>Qualifications<\/strong><\/p> <p>High School graduate or equivalent is preferred.<\/p> <p>Previous customer service experience or knowledge of food service operations is desirable.<\/p> <p><strong>Benefits<\/strong><\/p> <p>Sanford Health offers an attractive benefits package for qualifying full-time and part-time employees. Depending on eligibility, a variety of benefits include health insurance, dental insurance, vision insurance, life insurance, a 401(k) retirement plan, work\/life balance benefits, sick leave and paid time off. To review your benefit eligibility, visit [Link available when viewing the job] .<\/p> <p>Sanford is an EEO\/AA Employer M\/F\/Disability\/Vet. If you are an individual with a disability and would like to request an accommodation for help with your online application, please call [Phone number shown when applying] or send an email to [Email available when viewing the job] .<\/p> <p>Sanford Health has a Drug Free Workplace Policy. An accepted offer will require a drug screen and pre-employment background screening as a condition of employment.<\/p> <p><strong>Job Function:<\/strong> Facilities and General Services <\/p><p><strong>Req Number:<\/strong> R-61282 <\/p><p><strong>Featured:<\/strong> Yes<\/p>&nbsp;\"}"
}