{
    "id":"Kaggle::techmap::614a7a40287b955e077cffc8::monsterasia_my::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job Description : Posting Date Sep 21, 2021 Job Number 21106112 Job Category Housekeeping & Laundry Location Four Points by Sheraton Desaru, Jalan Kempas 2, Bandar Penawar, Johor, Malaysia VIEW ON MAP Brand Four Points Schedule Full-Time Relocation? N Position Type Non-Management Located Remotely? N Where timeless classics are woven with modern details. Where business meets pleasure. Where even when you're global, you can experience the local. Designed for the independent traveler seeking balance, there's Four Points. POSITION SUMMARY Operate and monitor washing, dry cleaning, and drying machinery, including adding chemicals and cleaning lint traps. Identify stained or damaged items and determine status for repair, spot treatment, rewash, or discard. Inspect cleanliness of articles removed from the washer, dryer, or dry-cleaning machines and place in clean linen carts. Set dryers to designated times and temperatures based on fabrics contained in load. Remove lint and debris from dryer screens, dry cleaning filters, and drain trap after each load. Fold cleaned articles into designated, either by hand or using folding machine. Maintain accurate records of items laundered. Follow all company safety and security policies and procedures report accidents, injuries, and unsafe work conditions to manager complete safety training and certifications. Follow all company policies and procedures ensure uniform and personal appearance are clean and professional maintain confidentiality of proprietary information protect company assets. Develop and maintain positive working relationships with others support team to reach common goals listen and respond appropriately to the concerns of other employees. Ensure adherence to quality expectations and standards identify, recommend, develop, and implement new ways to increase organizational efficiency, productivity, quality, safety, and\/or cost-savings. Visually inspect tools, equipment, or machines (e. g., to identify defects). Stand, sit, or walk for an extended period of time or for an entire work shift. Move, lift, carry, push, pull, and place objects weighing less than or equal to 25 pounds without assistance. Move through narrow, confined, or elevated spaces. Move over sloping, uneven, or slippery surfaces as well as up and down stairs and\/or service ramps. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614a7a40287b955e077cffc8::monsterasia_my\", \"source\": \"monsterasia_my\", \"country\": \"MY\", \"company\": \"Marriott International\", \"position\": \"Uniform Attendant - Four Points by Sheraton Desaru\", \"notes\": \"\", \"original\": \"<br>Job Description :<br>Posting Date Sep 21, 2021 Job Number 21106112 Job Category Housekeeping & Laundry Location Four Points by Sheraton Desaru, Jalan Kempas 2, Bandar Penawar, Johor, Malaysia VIEW ON MAP Brand Four Points Schedule Full-Time Relocation? N Position Type Non-Management Located Remotely? N Where timeless classics are woven with modern details. Where business meets pleasure. Where even when you're global, you can experience the local. Designed for the independent traveler seeking balance, there's Four Points. POSITION SUMMARY Operate and monitor washing, dry cleaning, and drying machinery, including adding chemicals and cleaning lint traps. Identify stained or damaged items and determine status for repair, spot treatment, rewash, or discard. Inspect cleanliness of articles removed from the washer, dryer, or dry-cleaning machines and place in clean linen carts. Set dryers to designated times and temperatures based on fabrics contained in load. Remove lint and debris from dryer screens, dry cleaning filters, and drain trap after each load. Fold cleaned articles into designated , either by hand or using folding machine. Maintain accurate records of items laundered. Follow all company safety and security policies and procedures report accidents, injuries, and unsafe work conditions to manager complete safety training and certifications. Follow all company policies and procedures ensure uniform and personal appearance are clean and professional maintain confidentiality of proprietary information protect company assets. Develop and maintain positive working relationships with others support team to reach common goals listen and respond appropriately to the concerns of other employees. Ensure adherence to quality expectations and standards identify, recommend, develop, and implement new ways to increase organizational efficiency, productivity, quality, safety, and\/or cost-savings. Visually inspect tools, equipment, or machines (e.g., to identify defects). Stand, sit, or walk for an extended period of time or for an entire work shift. Move, lift, carry, push, pull, and place objects weighing less than or equal to 25 pounds without assistance. Move through narrow, confined, or elevated spaces. Move over sloping, uneven, or slippery surfaces as well as up and down stairs and\/or service ramps. Reach overhead and below the knees, including bending, twisting, pulling, and stooping. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law.\"}"
}