{
    "id":"Kaggle::techmap::6145c09c3c8c3c3b03cbb0b8::linkedin_id::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The term \"he\/she\" is non-inclusive and assumes a binary understanding of gender, potentially excluding non-binary and genderqueer individuals. Using \"they\" or \"the candidate\" is more inclusive and appropriate.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" (DSA) is a specialist FDI practice that has grown into one of Asia's most versatile, full-service market entry, legal, tax, accounting, HR and operational consultancies for international businesses and corporate investors and with numerous offices throughout Vietnam, Singapore, Indonesia, China, Hong Kong SAR, India, Europe and North America. Our publishing subsidiary Asia Briefing (AB), leverages DSAs experts to publish thousands of regional daily business updates, and regular guides and magazines for business investors via its brands, Vietnam Briefing, ASEAN Briefing among others. This acts as a source of valuable regional news, research and thought leadership for our business audiences around the world and both firms underpin our global information-led content engagement and marketing model. Marketing Lead for ASEAN:. Our ASEAN businesses are growing rapidly, and we seek a Regional Marketing Leadto join our team and help to further accelerate that. The ideal candidate will be an experienced, motivated and services-value-aware B2B marketer, with excellent English skills, and effective organizational skills. He\/she will be well-rounded in marketing, and enjoys driving hands-on execution of highly effective, mixed-campaigns (email, social, event, web, multimedia), as well as create and develop strong networks of key marketing partner relationships. Besides carrying a regional market focuses, opportunities will exist to grow into managing group initiatives and a service line. all of which target measurable growth in value, awareness, audience reach, engagement, leads, and partnerships. If you have the relevant experience, are motivated to join a fast-growing and dynamic team, love what we are doing, and are ready to bring your best each day, please send a CV and cover letter to asiabriefing. com  and we look forward to speaking with you! Key duties\/responsibilities:. Market and Campaign Responsibilities:. Grow your regions and service lines brand awareness, engagement, audiences and leads generated. Maintain monthly and quarterly pipeline of campaigns for your regions and business lines, including webinars and seminars, promoted services and business updates, media,. Effectively promote DSAs news, briefings and thought leadership via mixed channels, such as social media, email, events and others. Moderate speaking events and short media productions for technical experts and advisory staff in your region. Manage and grow DSA & AB regional audiences by developing syndication and media partners. Manage printed marcoms stock in your region. Coordinate with design to produce effective marcoms, such as EDMs, brochures, posts, mini-videos.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145c09c3c8c3c3b03cbb0b8::linkedin_id\", \"source\": \"linkedin_id\", \"country\": \"ID\", \"company\": \"Dezan Shira &amp; Associates\", \"position\": \"Marketing Lead \\u2013ASEAN (Jakarta and Singapore)\", \"notes\": \"\", \"original\": \"<p>(DSA) is a specialist FDI practice that has grown into one of Asia's most versatile, full-service market entry, legal, tax, accounting, HR and operational consultancies for international businesses and corporate investors and with numerous offices throughout Vietnam, Singapore, Indonesia, China, Hong Kong SAR, India, Europe and North America.&nbsp;Our publishing subsidiary&nbsp;<strong>Asia Briefing<\/strong>&nbsp;(AB), leverages DSA\\u2019s experts to publish thousands of regional daily business updates, and regular guides and magazines for business investors via its brands, Vietnam Briefing,&nbsp;ASEAN Briefing among others. This acts as a source of valuable regional news, research and thought leadership for our business audiences around the world and both firms underpin our global information-led content engagement and marketing model.<\/p><p><br><\/p><p><strong>Marketing Lead for ASEAN:&nbsp;<\/strong><\/p><p><br><\/p><p>Our ASEAN businesses are growing rapidly, and we seek a Regional Marketing Lead<strong>&nbsp;<\/strong>to join our team and help to further accelerate that.&nbsp;The ideal candidate will be an experienced, motivated and services-value-aware B2B marketer, with excellent English skills, and effective organizational skills; He\/she will be well-rounded in marketing, and enjoys driving hands-on execution of highly effective, mixed-campaigns (email, social, event, web, multimedia), as well as create and develop strong networks of key marketing partner relationships.&nbsp;Besides carrying a regional market focuses, opportunities will exist to grow into managing group initiatives and a service line - all of which target measurable growth in value, awareness, audience reach, engagement, leads, and partnerships.<\/p><p><br><\/p><p>If you have the relevant experience, are motivated to join a fast-growing and dynamic team, love what we are doing, and are ready to bring your best each day, please send a CV and cover letter to&nbsp;<em>hr@asiabriefing.com&nbsp;<\/em>\\u2013 and we look forward to speaking with you!<\/p><p><br><\/p><p><strong>Key duties\/responsibilities:<\/strong><\/p><p><br><\/p><p><strong><em>Market and Campaign Responsibilities:<\/em><\/strong><\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Grow your regions\\u2019 and service lines\\u2019 brand awareness, engagement, audiences and leads generated;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Maintain monthly and quarterly pipeline of campaigns for your regions and business lines, including webinars and seminars, promoted services and business updates, media,<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Effectively promote DSA\\u2019s news, briefings and thought leadership via mixed channels, such as social media, email, events and others;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Moderate speaking events and short media productions for technical experts and advisory staff in your region;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Manage and grow DSA &amp; AB regional audiences by developing syndication and media partners;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Manage printed marcoms stock in your region.<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Coordinate with design to produce effective marcoms, such as EDM\\u2019s, brochures, posts, mini-videos;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Act as first responder to media enquiries and help to coordinate interview requests across the firm.<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Provide regular campaign and monthly activity and performance reports;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Collaborate closely with marketing and editorial, BD&nbsp;and business line teams, across the group.<\/p><p><br><\/p><p><em>&nbsp;<\/em><strong><em>Relationship Management:<\/em><\/strong><\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Drive and grow partner engagements with chamber of commerce, trade organizations, embassy &amp; consulates, service providers, and other relevant organizations in the region;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Attend and Represent DSA and AB every month at business networking events, building new connections, creating awareness and identifying potential leads and partners for the firm;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Help to individually develop potential leads, clients, partners and stakeholders, as appropriate;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Maintain all your activity and relationships records in CRM, including campaigns, scheduled events, participants, leads, subscribers, partners and agreements, journalists, contacts, and activities;<\/p><p><br><\/p><p><strong><em>General Role Responsibilities:<\/em><\/strong><\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Drive multiple tasks efficiently with strong time management to meet quality and timeline goals.<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Regularly share ideas, topics and suggestions between marketing, editorial and business teams, to help promote and align thought leadership with practical realities and local insights;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Develop and maintain a business understanding DSA services; Keep abreast of DSA\\u2019s latest publications every day to continually enhance your knowledge;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contribute to DSA and AB weekly and monthly marketing meetings;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assist with intern\/ employee recruitment when required, intern supervision, as they assist on projects, routine tasks, and on marketing research;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assist with group marketing projects as required from time to time.<\/p><p><br><\/p><p>&nbsp;<strong>Who we are looking for:<\/strong><\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A solid understanding of content marketing, in terms of digital, events and direct marketing<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;An interest and knowledge of one or more of our business areas: market entry, legal, tax, finance, HR, payroll, IT;<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Skilled and comfortable with giving internal and external presentations which represent the firm, marketing and BD interests.<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Strong initiative to lead new marketing campaigns<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A track record of developing business and partner relationships.<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to multi-task and work independently under deadline<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Willingness to travel in the region<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Works very effectively across cultures and with different teams;<\/p><p><br><\/p><p><strong>Basic Requirements<\/strong><\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3+ years\\u2019 experience in marketing, media, or public relations within a B2B environment (within the professional services sector is desirable).<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A Bachelor\\u2019s degree in marketing, communications, journalism, or a related field preferred<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Must currently be resident in the country of the open position, preferably in the city of hire.<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Native or Fluent Business English, with excellent communication skills; Other EU or Asia languages may be an asset.<\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Good knowledge of Microsoft Office and CRM systems; Other software knowledge is a plus.<\/p><p><br><\/p><p>DSA is committed to creating a diverse work environment. All applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, or age. DSA is proud to be an equal opportunity employer.<\/p><p><br><\/p><p><em>If you are interested in this position, please send your CV and cover letter (Include: your availability start and end date; Confirm if you match \\u201cWho we are looking for\\u201d and \\u201cMinimum Requirements\\u201d and tell us why you\\u2019re interested in this position) to hr@asiabriefing.com .<\/em><\/p>\"}"
}