{
    "id":"Kaggle::techmap::61505a3593c0842553433cee::linkedin_ng::1",
    "label_age":true,
    "analysis_age":"\"fast-paced environment\" could be seen as indirectly favouring younger candidates. ",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Minimum Requirements: Bachelors degree plus a minimum of five (5) years of recruitment experience knowledge of HRIS, applicant tracking, and onboarding systems. Knowledge of general principles of recruiting. Experience in managing applicant databases. Preferred Requirements: Recent Human Resources experience specific to recruitment, preferably within the past 3 years. Most Critical Proficiencies: Ability to work under pressure, in a fast-paced and team-oriented environment, handling multiple deadlines and with minimal direction. Knowledge of federal, state, local, and international recruiting and compensation laws and regulations in order to ensure organizational compliance. Ability to read and interpret state and federal regulations. Ability to use tools and skills to manage time effectively. Strong problem-solving experience and skills. Demonstrated Microsoft Office skills, including Word and Excel, are required. Power. Point will be useful. Strong writing and presentation skills. Essential Job Functions and Physical Demands: Proven interpersonal and communication skills with the ability to relate to individuals and groups diplomatically and tactfully, and to convey information to all levels of staff, vendors, and customers with diverse backgrounds. Ability to proofread correspondence and audit system data for correct punctuation, grammar, and data entry error. May require constant sitting. Working at a computer for extended periods. Ability to prepare and present documents in a well-designed and attractive format with impeccable attention to detail. Well organized and confident to work independently but can also function as a strong team player. Ability to work with sensitive information and maintain confidentiality. Ability and willingness to work outside of the normal 8:00 a. m.  5:00 p. m. hours to accommodate customers in different time zones. Constant face-to-face, telephone, and electronic communication with colleagues and the public.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61505a3593c0842553433cee::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"Heifer International\", \"position\": \"Talent Acquisition Specialist\/ Recruiter -Africa\", \"notes\": \"\", \"original\": \"<strong>Description<br><br><\/strong>Heifer Project International (Heifer) is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability.<br><br><strong>FUNCTION<br><br><\/strong>This position is responsible for providing an excellent recruitment\/onboarding experience to potential Heifer talent and key internal stakeholders while supporting the Global Recruitment Manager in the timely recruitment, selection, hiring, and onboarding of global talent for Heifer.<br><br><strong>ESSENTIAL CHARACTER TRAITS: <br><br><\/strong>A confidential, reliable, resourceful, and emotionally intelligent individual who thrives in a fast-paced and agile environment. Highly professional in demeanor and approachable by all.<br><br><strong>Responsibilities &amp; Deliverables<\/strong><strong>B. Provide administrative support for global recruitment and onboarding activity. (25%)<\/strong><strong>C. Provide an excellent experience to potential Heifer talent. (20%)<\/strong><strong> Maintain Human Resources related information and records. (10%)<\/strong><strong>May perform other job-related duties as assigned (5%).<br><\/strong><ul><li> Recruitment Activities (40%)<\/li><li>Determines applicant qualifications by interviewing applicants; analyzing responses, comparing qualifications to job requirements<\/li><li>Partnering with hiring managers to determine staffing needs<\/li><li>Screening resumes<\/li><li>Performing in-person and phone interviews with candidates<\/li><li>Administering appropriate company assessments<\/li><li>Coordinating interviews with the hiring managers<\/li><li>Maintaining relationships with both internal and external clients to ensure staffing goals are achieved<\/li><li>Communicating Heifer\\u2019s benefits during the screening process<\/li><li>Evaluates applicants by discussing job requirements and applicant qualifications with managers; interviewing applicants on a consistent set of qualifications.<\/li><li>Develop and place job postings and advertisements.<\/li><li>Conduct reference, background and counterterrorism checks as appropriate for potential employees, interns, temporary workers and volunteers; prepare notifications of offer and non-selection.<\/li><li>Coordinate interview scheduling including any associated travel and lodging logistics.<\/li><li>Prepare materials and packets needed for interviews.<\/li><li>Coordinate appropriate onboarding processes with HR Team and hiring manager.<\/li><li>Monitor and track recruitment-related spending.<\/li><li>Coordinate all relocation activities.<\/li><li>Support the HR Team with the administrative responsibilities of immigration activities as necessary.<\/li><li>Respond to all recruitment and onboarding related inquires in a responsive, customer-focused and timely manner. This includes responding internally to requests for status updates.<\/li><li>Provide support and guidance to those using applicant tracking and onboarding systems and troubleshoot problems as necessary.<\/li><li>Ensure recruitment and onboarding files are up-to-date in compliance with various Heifer systems.<\/li><li>Create and generate accurate recruitment reports and metrics as requested.<\/li><li>Develop and implement new hire orientation on regular basis.<br><br><\/li><\/ul><strong>Minimum Requirements:<br><\/strong><ul><li>Bachelor\\u2019s degree plus a minimum of five (5) years of recruitment experience knowledge of HRIS, applicant tracking, and onboarding systems.<\/li><li>Knowledge of general principles of recruiting<\/li><li>Experience in managing applicant databases<br><br><\/li><\/ul><strong>Preferred Requirements:<br><\/strong><ul><li>Recent Human Resources experience specific to recruitment, preferably within the past 3 years.<br><br><\/li><\/ul><strong>Most Critical Proficiencies:<br><\/strong><ul><li>Ability to work under pressure, in a fast-paced and team-oriented environment, handling multiple deadlines and with minimal direction.<\/li><li>Knowledge of federal, state, local, and international recruiting and compensation laws and regulations in order to ensure organizational compliance.<\/li><li>Ability to read and interpret state and federal regulations.<\/li><li>Ability to use tools and skills to manage time effectively.<\/li><li>Strong problem-solving experience and skills.<\/li><li>Demonstrated Microsoft Office skills, including Word and Excel, are required. PowerPoint will be useful.<\/li><li>Strong writing and presentation skills.<br><br><\/li><\/ul><strong>Essential Job Functions and Physical Demands:<br><\/strong><ul><li>Proven interpersonal and communication skills with the ability to relate to individuals and groups diplomatically and tactfully, and to convey information to all levels of staff, vendors, and customers with diverse backgrounds.<\/li><li>Ability to proofread correspondence and audit system data for correct punctuation, grammar, and data entry error.<\/li><li>May require constant sitting; working at a computer for extended periods.<\/li><li>Ability to prepare and present documents in a well-designed and attractive format with impeccable attention to detail.<\/li><li>Well organized and confident to work independently but can also function as a strong team player.<\/li><li>Ability to work with sensitive information and maintain confidentiality.<\/li><li>Ability and willingness to work outside of the normal 8:00 a.m. \\u2013 5:00 p.m. hours to accommodate customers in different time zones.<\/li><li>Constant face-to-face, telephone, and electronic communication with colleagues and the public.<\/li><\/ul>\"}"
}