{
    "id":"Kaggle::techmap::614583d8671d8e74d33e76b8::linkedin_iq::1",
    "label_age":true,
    "analysis_age":"The requirement for \"10 to 15 years of teaching and leadership experience\" may subtly favour older candidates who have had more time to accumulate this level of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The request for \"passport data page\" and \"copies of degrees and certificates\" could be seen as potentially exclusive, as not all candidates may have easy access to these documents immediately.",
    "verified":true,
    "synthetic":false,
    "text":" 10 to 15 years of teaching and leadership experience in U. S. higher education. Proven record of effective leadership, organizational and managerial skills, and the ability to build critical, collaborative partnerships across a university and stakeholders. Experience with undergraduate and graduate education and a high level of understanding of major issues and emerging trends within higher education in the U. S. and MENA region. Demonstrated ability to work collaboratively with faculty to develop and implement programs. Evidence of cooperative management style and understanding of distributed leadership. Ability to envision new academic opportunities and alternative approaches. Proven ability to solve problems, address conflicts in a constructive manner, and resolve complex personnel issues. Familiarity with U. S. and regional accreditation requirements. Ability to facilitate the development of an academic master plan. Demonstrated commitment to diversity, equity, and inclusion. Outstanding written and oral communication skills in English. Reporting: The Vice President for Academic Affairs will report directly to the President. Procedure for Candidacy: Applications should include a cover letter addressing qualifications for the position, a curriculum vitae, passport data page, copies of degrees and certificates, and the names and contact information for three (3) professional references, within the last three (3) years. Applications and nominations will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately. Please send your application with supporting documents to the email address: auib. edu. iq with auib. edu. iq in copy.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614583d8671d8e74d33e76b8::linkedin_iq\", \"source\": \"linkedin_iq\", \"country\": \"IQ\", \"company\": \"\\u0627\\u0644\\u062c\\u0627\\u0645\\u0639\\u0629 \\u0627\\u0644\\u0623\\u0645\\u0631\\u064a\\u0643\\u064a\\u0629 \\u0641\\u064a \\u0628\\u063a\\u062f\\u0627\\u062f AUIB\", \"position\": \"Vice President For Academic Affairs\", \"notes\": \"\", \"original\": \"<p>Vice President for Academic Affairs<\/p><p>Academic Affairs<\/p><p>Job Summary:<\/p><p>American University of Iraq Baghdad (AUIB) is a newly established American style university seeking to be a premier university of higher education. Under the direction of the Associate Director, The Vice President for Academic Affairs (VPAA) provides oversight and strategic leadership for the AUIB\\u2019s Colleges, academic departments, and degree programs. The VPAA has responsibility for matters related to recruitment, hiring, retention, and advancement of all Deans and faculty. The VPAA is responsible for ensuring consistency of policies in the hiring, annual review, evaluation, and promotion for faculty, all aspects of curriculum including liberal arts and discipline-specific curricula, and program assessment and continuous improvement. The VPAA supervises the Deans for all Colleges and the Director for the Continuing Education Institute. The VPAA reports directly to the President and serves as a member of the President\\u2019s Cabinet, University Council, and Deans\\u2019 Council. This is a full-time, twelve-month position. The person should embrace learning and commit to excellence in customer service.<\/p><p>This position will be responsible for:<\/p><p>\\u2022 Promotes the fulfillment of the University\\u2019s mission, vision, and strategic priorities.<\/p><p>\\u2022 Provide leadership in promoting and safeguarding academic quality while ensuring academic rigor for all degree and non-degree programs offered within the University.<\/p><p>\\u2022 Ensures the evaluation and professional development of all academic personnel.<\/p><p>\\u2022 Ensures the alignment of academic resources to the needs of students and other stakeholders.<\/p><p>\\u2022 Is responsible for the delivery and ongoing evaluation of all academic programs and services.<\/p><p>\\u2022 Maintains knowledge of faculty workload policies and practices and makes recommendations accordingly.<\/p><p>\\u2022 Work with the Deans, and Department Chairs to provide support, analysis, and feedback to academic programs in developing feasibility of new academic programs.<\/p><p>\\u2022 VPAA is:<\/p><p>o Responsible for institutional accreditation.<\/p><p>o Responsible for the oversight of academic policy and procedures and compliance with all.<\/p><p>o Provide input and direction for the creation of program-specific agreements (articulation and mutual understandings) with other colleges, universities, and international agencies.<\/p><p>o Participate in review of program performance metrics, academic master plan development, and academic strategic plan development.<\/p><p>\\u2022 Maintains productive relationships with other educational institutions, including schools, technology centers, and other colleges and universities within Iraq and the region.<\/p><p>\\u2022 Performs other duties as assigned.<\/p><p>Vice President for Academic Affairs<\/p><p>Academic Affairs<\/p><p>Required Skills\/Abilities: Candidates for this position must have: - Doctoral degree - 10 to 15 years of teaching and leadership experience in U.S. higher education - Proven record of effective leadership, organizational and managerial skills, and the ability to build critical, collaborative partnerships across a university and stakeholders. - Experience with undergraduate and graduate education and a high level of understanding of major issues and emerging trends within higher education in the U.S. and MENA region. - Demonstrated ability to work collaboratively with faculty to develop and implement programs. - Evidence of cooperative management style and understanding of distributed leadership. - Ability to envision new academic opportunities and alternative approaches. - Proven ability to solve problems, address conflicts in a constructive manner, and resolve complex personnel issues. - Familiarity with U.S. and regional accreditation requirements. - Ability to facilitate the development of an academic master plan. - Demonstrated commitment to diversity, equity, and inclusion. - Outstanding written and oral communication skills in English. -<\/p><p>Reporting:<\/p><p>The Vice President for Academic Affairs will report directly to the President.<\/p><p>Procedure for Candidacy: Applications should include a cover letter addressing qualifications for the position, a curriculum vitae, passport data page, copies of degrees and certificates, and the names and contact information for three (3) professional references, within the last three (3) years. Applications and nominations will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately. Please send your application with supporting documents to the email address: jobs@auib.edu.iq with Karin.Jesuis@auib.edu.iq in copy.<\/p>\"}"
}