{
    "id":"Kaggle::techmap::61561319a6740c534abc529c::monster_ca::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Beauty Advisor Needed Is your interest in beauty and health more than “skin deep”? Do your friends and family members ask you for cosmetics advice? Are you up-to-date with the latest beauty trends and products? Do you like meeting new people, and helping make their outer beauty shine as brightly as their inner beauty? If so, you could be just the person we’re looking for. The London Drugs team is on the hunt for client-focused beauty and cosmetics experts to share their enthusiasm and their expertise for all-things beautiful. As a London Drugs BEAUTY ADVISOR, you’ll be a trusted expert to our customers, helping them select the cosmetics and beauty products perfectly suited to them. WHAT’S THE JOB ABOUT? The job of a London Drugs BEAUTY ADVISOR is to help the beauty department meet its sales and marketing objectives while ensuring top-notch customer service and retail beauty advice. Specifically, you’ll be asked to: work independently to advise clients on specific products and services throughout the beauty and cosmetic department. position London Drugs as destination for trusted experts when it comes to beauty and cosmetics. provide quality service in a professional, courteous, and helpful manner. stay up to date on department and store products and promotions. set up and work with promotional displays and point-of-sale merchandising tools. QUALIFICATIONS: Need to have: proven skills to provide advice and guidance to customers on beauty products, services and store promotions. excellent knowledge of various beauty products and services available with the ability to effectively demonstrate use of products. superior makeup and cosmetic application skills. ability to work in a fast-paced retail environment, including evenings and weekends. ability to communicate clearly and positively with customers, vendors, employees, and management. ability to be flexible and handle change in a positive manner. keen interest in learning more about health, fashion and beauty. Nice to have: past experience as a makeup artist, cosmetician, beauty advisor, counter manager, skin care specialist, or similar job. education in aesthetics, makeup design or a related field. demonstrated understanding of retail merchandising. WHY YOU WANT TO WORK HERE: London Drugs is one of Canada’s fastest-growing and most successful retail chains. We offer significant opportunities for you to advance your career through our promote-from-within policies.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61561319a6740c534abc529c::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"London Drugs Limited\", \"position\": \"Beauty Advisor\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div> <div> <strong>Beauty Advisor Needed<\/strong> <\/div> <div> Is your interest in beauty and health more than \\u201cskin deep\\u201d? Do your friends and family members ask you for cosmetics advice? Are you up-to-date with the latest beauty trends and products? Do you like meeting new people, and helping make their outer beauty shine as brightly as their inner beauty? <\/div> <div> If so, you could be just the person we\\u2019re looking for . . . <\/div> <div> The London Drugs team is on the hunt for client-focused beauty and cosmetics experts to share their enthusiasm and their expertise for all-things beautiful. As a London Drugs BEAUTY ADVISOR, you\\u2019ll be a trusted expert to our customers, helping them select the cosmetics and beauty products perfectly suited to them. <\/div> <div><\/div> <div> <strong>WHAT\\u2019S THE JOB ABOUT?<\/strong> <\/div> <div> The job of a London Drugs BEAUTY ADVISOR is to help the beauty department meet its sales and marketing objectives while ensuring top-notch customer service and retail beauty advice. <\/div> <div> Specifically, you\\u2019ll be asked to: <\/div> <ul> <li>work independently to advise clients on specific products and services throughout the beauty and cosmetic department<\/li> <li>position London Drugs as destination for trusted experts when it comes to beauty and cosmetics<\/li> <li>provide quality service in a professional, courteous, and helpful manner<\/li> <li>stay up to date on department and store products and promotions<\/li> <li>set up and work with promotional displays and point-of-sale merchandising tools<\/li> <\/ul> <div><\/div> <div> <strong>QUALIFICATIONS:<\/strong> <\/div> <div> Need to have: <\/div> <ul> <li>proven skills to provide advice and guidance to customers on beauty products, services and store promotions<\/li> <li>excellent knowledge of various beauty products and services available with the ability to effectively demonstrate use of products<\/li> <li>superior makeup and cosmetic application skills<\/li> <li>ability to work in a fast-paced retail environment, including evenings and weekends<\/li> <li>ability to communicate clearly and positively with customers, vendors, employees, and management<\/li> <li>ability to maintain a professional image and demeanor, which will reflect positively on the cosmetics department and overall London Drugs brand<\/li> <li>ability to be flexible and handle change in a positive manner<\/li> <li>keen interest in learning more about health, fashion and beauty<\/li> <\/ul> <div> Nice to have: <\/div> <ul> <li>past experience as a makeup artist, cosmetician, beauty advisor, counter manager, skin care specialist, or similar job<\/li> <li>education in aesthetics, makeup design or a related field<\/li> <li>demonstrated understanding of retail merchandising<\/li> <\/ul> <div><\/div> <div> <strong>WHY YOU WANT TO WORK HERE:<\/strong> <\/div> <div> London Drugs is one of Canada\\u2019s fastest-growing and most successful retail chains. We offer significant opportunities for you to advance your career through our promote-from-within policies. We offer salaries commensurate with experience, as well as the potential to earn bonuses based on your ability to meet sales goals and other success metrics. <\/div> <div> Specifically, here\\u2019s what we have to offer: <\/div> <ul> <li>competitive pay that rewards strong and consistent performance<\/li> <li>flexible and varied schedules<\/li> <li>access to extensive product training and development opportunities<\/li> <li>a high-energy and varied workplace that strives for and rewards excellence<\/li> <li>a comprehensive benefits program including: <ul> <li>team member discounts on in-store purchases (we want you to share in our success)<\/li> <li>ongoing in-house training and education courses (lifelong learning)<\/li> <li>employee family assistance program (free confidential counseling)<\/li> <li>employee recognition program (tangible rewards for great work!)<\/li> <li>community involvement (giving back to our communities)<\/li> <\/ul><\/li> <\/ul> <div><\/div> <div> <strong>Apply Now!<\/strong> <\/div> <div> We are an equal opportunity employer. The above statements are intended to describe the general nature and level of work applicable to this position and are not intended to be an exhaustive list of all responsibilities, duties and skills required. Be advised, London Drugs DOES NOT use third party recruitment services. <\/div> <div> London Drugs may collect, use, and\/or disclose your personal information (including the information in this application) where it is reasonable for establishing, managing or terminating an employment relationship. This includes the use or disclosure of your personal information to persons inside or external to our organization, for the purpose of checking references or gathering other information to support an assessment of your candidacy. <\/div> <div> <em>To protect yourself, do not respond to unsolicited job offers from individuals or e-mail addresses, and never disclose any sensitive details about your identity (including personal or financial) to anyone you do not know or trust or on any unverified website, or website you do not trust.<\/em> <\/div> <\/div> <\/div>\"}"
}