{
    "id":"Kaggle::techmap::6155ac01f0765305b474ef58::linkedin_gr::18",
    "label_age":true,
    "analysis_age":"\"young graduates and experienced professionals\" is biased against older graduates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all. We are excited to announce the launch of our new EY offices in Patras and are inviting young graduates and experienced professionals from Patras and the wider Western Greece region to join our dynamic consulting team. We are a leader in consulting services and are seeking individuals with the right mix of skill, enthusiasm and curiosity that want an opportunity to enhance their knowledge and develop professionally within a truly global organization. The opportunity. Modern technology produces more data than ever before, but also provides the tools to store, organize, analyze and share this data, resulting in new opportunities and substantiated business insights in support of new and deeper insights and more informed decision making. EY delivers leading services and solutions in the area of big data, business intelligence and data engineering built on a blend of tools and custom-developed methods. As part of our Data and Analytics team of the Technology Consulting practice, you will work with multi-disciplinary teams to support clients in a wide range of data initiatives aiming to generate and present new, useful and actionable insights. Your Key Responsibilities. Participation in large-scale client engagements. Contribution towards, or even leading delivery of innovative and engaging data engineering solutions. Understanding of business and technical requirements, provision of subject matter expertise and implementation of data engineering techniques. Conducting of data discovery activities, performing root cause analysis, and making recommendations for the remediation of data quality issues. Putting good organizational and time management skills into practice, with the ability to prioritize and complete multiple complex projects under tight deadlines. To qualify for the role, you must have. A BSc or MSc degree in Computer Science, Mathematics, Engineering or other related, quantitative fields. Advanced SQL skills. Knowledge and experience in PowerBI. Ideally, you’ll also have: Relevant professional experience. What We Look For. Strong analytical, problem solving and critical thinking skills. Desire to investigate and try-out new tools and technologies as they are released. Ability to work under tight timelines, in cases for multiple project deliveries.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155ac01f0765305b474ef58::linkedin_gr\", \"source\": \"linkedin_gr\", \"country\": \"GR\", \"company\": \"EY\", \"position\": \"Data Engineer (Patras)\", \"notes\": \"\", \"original\": \"At EY, you\\u2019ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we\\u2019re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all<br><br>We are excited to announce the launch of our new EY offices in Patras and are inviting young graduates and experienced professionals from Patras and the wider Western Greece region to join our dynamic consulting team. We are a leader in consulting services and are seeking individuals with the right mix of skill, enthusiasm and curiosity that want an opportunity to enhance their knowledge and develop professionally within a truly global organization.<br><br><strong>The opportunity<br><br><\/strong>Modern technology produces more data than ever before, but also provides the tools to store, organize, analyze and share this data, resulting in new opportunities and substantiated business insights in support of new and deeper insights and more informed decision making. EY delivers leading services and solutions in the area of big data, business intelligence and data engineering built on a blend of tools and custom-developed methods.<br><br>As part of our Data and Analytics team of the Technology Consulting practice, you will work with multi-disciplinary teams to support clients in a wide range of data initiatives aiming to generate and present new, useful and actionable insights. You will have the opportunity to work and take responsibilities in challenging engagements, gaining exposure to clients in various sectors both in Greece and abroad.<br><br><strong>Your Key Responsibilities<br><\/strong><ul><li>Participation in large-scale client engagements.<\/li><li>Contribution towards, or even leading delivery of innovative and engaging data engineering solutions.<\/li><li>Understanding of business and technical requirements, provision of subject matter expertise and implementation of data engineering techniques.<\/li><li>Conducting of data discovery activities, performing root cause analysis, and making recommendations for the remediation of data quality issues.<\/li><li>Putting good organizational and time management skills into practice, with the ability to prioritize and complete multiple complex projects under tight deadlines.<br><br><\/li><\/ul><strong>To qualify for the role, you must have<br><\/strong><ul><li>A BSc or MSc degree in Computer Science, Mathematics, Engineering or other related, quantitative fields.<\/li><li>Advanced SQL skills<\/li><li>Knowledge and experience in PowerBI<br><br><\/li><\/ul><strong>Ideally, you\\u2019ll also have:<br><\/strong><ul><li>Relevant professional experience.<br><br><\/li><\/ul><strong>What We Look For<br><\/strong><ul><li>Strong analytical, problem solving and critical thinking skills.<\/li><li>Desire to investigate and try-out new tools and technologies as they are released.<\/li><li>Ability to work under tight timelines, in cases for multiple project deliveries.<\/li><li>Good interpersonal skills and ability to work effectively within high-performing teams.<\/li><li>Confidence to convey technical advice and guidance to clients.<\/li><li>Advanced technical writing skills in Greek and English (additional languages a plus).<\/li><li>Evidence of self-motivation for continuous development.<br><br><\/li><\/ul><strong>What We Offer<br><br><\/strong>We offer a competitive compensation package where you will be rewarded based on your performance and recognized for the value you bring to our business. In addition, our rewards package includes a range of programs and benefits designed to support your physical, financial and social well-being. Plus, we offer:<br><ul><li>Continuous learning: You\\u2019ll develop the mindset and skills to navigate whatever comes next.<\/li><li>Success as defined by you: We\\u2019ll provide the tools and flexibility, so you can make a meaningful impact, your way.<\/li><li>Transformative leadership: We\\u2019ll give you the insights, coaching and confidence to be the leader the world needs.<\/li><li>Diverse and inclusive culture: You\\u2019ll be embraced for who you are and empowered to use your voice to help others find theirs.<br><br><\/li><\/ul>If you can demonstrate that you meet the criteria above, please contact us as soon as possible.<br><br>The exceptional EY experience. It\\u2019s yours to build.\"}"
}