{
    "id":"Kaggle::techmap::614a830af5bd0f6a1df6039e::indeed_de::1",
    "label_age":true,
    "analysis_age":"The phrase \"12 years of strong sales leadership experience\" may introduce age bias by setting an unattainable standard for younger workers, thereby favouring older candidates with more years of experience.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 12 years of strong sales leadership experience and direct sales in a pharmaceutical, biotechnology or related environment. Knowledge, Skills and Experience:  Strong understanding of the drug discovery and development, and regulatory processes, lifecycle management and commercialization of therapeutics. Successful track record in sales management role in motivating sales organizations to consistently achieve assigned revenue and growth goals. Direct experience in managing EMEA regions, with understanding of country regulations, cultural distinctions, differential buying patterns, etc. Excellent presentation, communication, and negotiation skills Strong understanding of the drug development and regulatory processes, lifecycle management and commercialization of therapeutics. Proven track record of selling directly to Life Science Customers. Demonstrated ability to influence senior level execs both internally and at customer organizations. Ability to work independently and engage wider go to market stakeholders across organization both internally and externally. Strategic business and Industry awareness and the ability to translate emerging Industry trends relevant to the organization. Expert ability to analyze metrics and information. Ensuring activities and strategies are data driven and demonstrate results and ROI. Demonstrated ability to deliver results to the appropriate quality and time metrics. Excellent attention to detail and ability to work simultaneously on multiple priorities. Ability to analyze and comprehend large quantities of information across scientific, commercial, and financial fronts. Ability to influence without direct authority including demonstrated functional integration skills such as motivating and securing project commitment from cross-functional evaluation teams not in a direct reporting line. In-depth, hands-on experience with market analysis and business case development. Work Environment: Work is remote (home-based). Up to 40% of time will be spent traveling to customer visits, including extended driving trips and airplane trips. All Soma. Logic qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Job Type: Full-time. Work Location: Multiple Locations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614a830af5bd0f6a1df6039e::indeed_de\", \"source\": \"indeed_de\", \"country\": \"DE\", \"company\": \"SomaLogic, Inc.\", \"position\": \"Head of EMEA Sales - Life Sciences\", \"notes\": \"\", \"original\": \"<p><b>Position Summary: <\/b><br>SomaLogic was founded in 2000 with the goal of improving the well-being and quality of life of every individual by transforming how diseases were detected, diagnosed and managed. Building on decades of aptamer research, SomaLogic scientists developed a ground-breaking proteomics technology that overcomes the significant challenges of existing protein measuring technologies, with multiple applications across the biological and medical sciences. Our mission is to leverage our proprietary technology to create, develop and commercialize innovative life science research tools and breakthrough clinical products that transform healthcare.<\/p><p>SomaLogic is currently looking to strengthen our successful Life Sciences Sales team through the recruitment of a Head of EMEA Sales.<\/p><p>This role will lead EMEA Sales for SomaLogic\\u2019s suite of products and services and will be responsible for the EMEA Sales Strategy and Forecasting.<\/p><p><b>Key Job Responsibilities: <\/b><\/p><ul><li>Leads Sales for the EMEA region, including responsibility for developing long-term business strategies<\/li><li>Implement strategic regional and\/or country-specific sales strategies to increase exposure and market share<\/li><li>Establish and maintain effective and long-term relationships with senior levels within the broader SomaLogic organization and with key executives and decision makers within all of SomaLogic\\u2019s customer accounts.<\/li><li>Work collaboratively with client representatives and other functions &amp; leadership to manage commercial operations performance and achieve exemplary customer service.<\/li><li>Regularly interface with all of the Life Sciences Leadership Team seeking optimal integration of EMEA with all of Life Sciences activities<\/li><li>Interface directly with Strategic Account leadership and representatives to ensure smooth and successful commercial operations within EMEA<\/li><li>Build out the European territory<\/li><li>Build and manage a sales team. Responsibilities include planning, assigning, appraising performance, and guiding professional development.<\/li><li>Collaborate with internal departments at the strategic level to identify additional sales and or service line offerings and enhancements or improvements to current offerings.<\/li><li>Create, where profitable, cross-geography sales opportunities.<\/li><li>Provide executive reporting and support annual budget planning process - provide ongoing review of performance against plan and EMEA sales forecasting as examples<\/li><li>Effectively communicate and describe SomaLogic Life Sciences offerings to internal and external customers. Lead high-level presentations with SomaLogic Customers and Executive Management.<\/li><li>Support and perform any other duties in line with the Life Sciences Strategy and Vision, as directed by EVP, Life Sciences Market<\/li><\/ul><p><b>Qualifications: <\/b><br><b>Education: <\/b><br>\\uf09f Bachelor\\u2019s degree in science or relevant discipline<br>\\uf09f<br>12 years of strong sales leadership experience and direct sales in a pharmaceutical, biotechnology or related environment.<br><b>Knowledge, Skills and Experience: <\/b><br>\\uf09f Strong understanding of the drug discovery and development, and regulatory processes, lifecycle management and commercialization of therapeutics.<br>\\uf09f Successful track record in sales management role in motivating sales organizations to consistently achieve assigned revenue and growth goals.<br>\\uf09f Direct experience in managing EMEA regions, with understanding of country regulations, cultural distinctions, differential buying patterns, etc.<br>\\uf09f Excellent presentation, communication, and negotiation skills Strong understanding of the drug development and regulatory processes, lifecycle management and commercialization of therapeutics.<br>\\uf09f Proven track record of selling directly to Life Science Customers<br>\\uf09f Demonstrated ability to influence senior level execs both internally and at customer organizations<br>\\uf09f Ability to work independently and engage wider go to market stakeholders across organization both internally and externally<br>\\uf09f Strategic business and Industry awareness and the ability to translate emerging Industry trends relevant to the organization<br>\\uf09f Expert ability to analyze metrics and information; ensuring activities and strategies are data driven and demonstrate results and ROI<br>\\uf09f Demonstrated ability to deliver results to the appropriate quality and time metrics<br>\\uf09f Excellent attention to detail and ability to work simultaneously on multiple priorities<br>\\uf09f Ability to analyze and comprehend large quantities of information across scientific, commercial, and financial fronts.<br>\\uf09f Ability to influence without direct authority including demonstrated functional integration skills such as motivating and securing project commitment from cross-functional evaluation teams not in a direct reporting line.<br>\\uf09f In-depth, hands-on experience with market analysis and business case development.<\/p><p><b>Work Environment: <\/b><br>Work is remote (home-based)<br>Up to 40% of time will be spent traveling to customer visits, including extended driving trips and airplane trips.<\/p><p>All SomaLogic qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<\/p><p>Job Type: Full-time<\/p><p>Work Location: Multiple Locations<\/p>\"}"
}