{
    "id":"Kaggle::techmap::615a6e5e7b7b7c7cc61ebb64::seek_au::0",
    "label_age":true,
    "analysis_age":"Phrases such as \"Energetic, outgoing and entertaining individual\" and \"Desires an Extreme. Social. Fun! job (or side hustle) that doesn't feel like a job.\" implies a preference for younger candidates and subtly discourage older candidates from applying.",
    "label_disability":true,
    "analysis_disability":"The physical demands section states \"Be friendly and able to smile frequently\", which could disadvantage candidates with certain facial or neurological disabilities that affect their ability to smile or express emotions in a typical manner. The job description should focus on the essential functions of the role and avoid unnecessary physical requirements that could exclude qualified candidates with disabilities.",
    "label_masculine":true,
    "analysis_masculine":"The description's emphasis on a \"punk ethos,\" \"extrovert\" personality, and phrases like \"captivating new throwers\" may resonate more with a masculine audience, potentially discouraging some women from applying.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement to \"be friendly and able to smile frequently\" can be seen as a form of emotional labour, which is disproportionately expected of women and may be considered unfair if not applied equally across all genders.",
    "verified":true,
    "synthetic":false,
    "text":" About the business. Lumber Punks Axe Throwing is more than an activity, its a movement. We bring the Punk ethos to everything we do and make sure every guest who visits us leaves knowing why Lumber Punks are the best Axe Throwing Venues in Australia. What started as a group of friends throwing axes together for fun has transformed into a rapidly growing and exciting business captivating new throwers everyday. With a focus on culture, teamwork and individuality we remain grassroots in terms of our environment and the way we interact with each other and our guests. Always seeking out the extrovert, challenging the boring status quo, pushing boundaries and striving to spread our passion for throwing axes therefore building the Axe Throwing community in Australia. About the role. Casual position available starting at 10-15 hours per week to increase with experience. Friday and Saturday night availability is a must. This not a normal job. If you prefer sitting at a desk then please feel free to scroll past. We are looking for a confident, hard working, responsible team player to join our Perth crew assisting to facilitate the daily running of the venue. Full training provided. You will be required to. Provide safety instruction to all guests and ensure equipment is in working condition prior to throwing sessions. Welcome guests with an enthusiastic, authentic greeting, including check-in, waiver sign-in etc. Provide captivating axe throwing instruction at the beginning of each session. Coach by offering guidance throughout axe throwing sessions. Effectively manage interactive tournaments\/games. Entertain, energize and engage your groups by reading people and communicating accordingly. Promote provided marketing and promotional initiatives and solicit referrals as needed. Job Requirements. Energetic, outgoing and entertaining individual. Professional and well-spoken in front of large or small groups. Safety conscious with a strong attention to detail. Loves to entertain, put on a show and can engage with our guests. Creative and can think on your feet. Excellent time management skills. Great attitude and likes to learn. Flexible schedule including evenings and weekends. Desires an Extreme. Social. Fun! job (or side hustle) that doesn't feel like a job. Only successful candidates will be notified. Physical Demands. While performing the duties of this position, you will regularly be required to: Be friendly and able to smile frequently. Work days, nights, and\/or weekends as required.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615a6e5e7b7b7c7cc61ebb64::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Lumber Punks Axe Throwing\", \"position\": \"Axe Throwing Coach\", \"notes\": \"\", \"original\": \"<p><strong>About the business<\/strong><\/p><p>\\u00a0<\/p><p>Lumber Punks Axe Throwing is more than an activity, its a movement. We bring\\u00a0the Punk ethos to everything we do and make sure every guest\\u00a0who visits us leaves knowing why Lumber Punks are\\u00a0the best Axe Throwing Venues\\u00a0in Australia. What started as a group of friends throwing axes together for fun has transformed into a rapidly growing and exciting business captivating new throwers everyday.<\/p><p>With a focus on culture, teamwork and individuality we remain grassroots in terms of our environment and the way we interact with each other and our guests.<\/p><p>Always seeking out the extrovert, challenging the boring status quo, pushing boundaries\\u00a0and striving to spread our passion \\u00a0for\\u00a0throwing axes therefore\\u00a0building the Axe Throwing community in Australia.<\/p><p>\\u00a0<\/p><p><strong>About the role<\/strong><\/p><p>\\u00a0<\/p><p><strong>Casual position available starting at 10-15 hours per week to increase with experience. Friday and Saturday night availability is a must.<\/strong> This not a\\u00a0normal job. If you prefer sitting at a desk then please feel free to scroll\\u00a0past. \\u00a0We are looking for a confident, hard working, responsible team player to join our Perth\\u00a0crew assisting to facilitate the daily running of the venue. \\u00a0Full training provided. You will be required to<\/p><ul><li>Provide safety instruction to all guests and ensure equipment is in working condition prior to throwing sessions<\/li><li>Welcome guests with an enthusiastic, authentic greeting, including check-in, waiver sign-in etc<\/li><li>Provide captivating axe throwing instruction at the beginning of each session<\/li><li>Coach by offering guidance throughout axe throwing sessions<\/li><li>Effectively manage interactive tournaments\/games<\/li><li>Entertain, energize and engage your groups by reading people and communicating accordingly<\/li><li>Promote provided marketing and promotional initiatives and solicit referrals as needed<\/li><\/ul><p><strong>Job Requirements<\/strong><\/p><ul><li>\\u200dEnergetic, outgoing and entertaining individual<\/li><li>Professional and well-spoken in front of large or small groups<\/li><li>Safety conscious with a strong attention to detail<\/li><li>Loves to entertain, put on a show and can engage with our guests<\/li><li>Creative and can think on your feet<\/li><li>Excellent time management skills<\/li><li>Great attitude and likes to learn<\/li><li>Flexible schedule including evenings and weekends<\/li><li>Desires an Extreme. Social. Fun! job (or side hustle) that doesn't feel like a job<\/li><li>Only successful candidates will be notified<\/li><\/ul><p><strong>Physical Demands<\/strong><\/p><p>While performing the duties of this position, you\\u00a0will regularly be required to:<\/p><ul><li>Be friendly and able to smile frequently<\/li><li>Work days, nights, and\/or weekends as required<\/li><li>Work in a noisy, fast paced environment with distracting conditions<\/li><li>Read and write handwritten notes<\/li><li>Walk or stand 100% of shift<\/li><\/ul><p>\\u00a0<\/p><p><strong>Benefits and perks<\/strong><\/p><p>\\u00a0<\/p><p>You get to spend you're days\/nights showing people how to throw axes!!!! Are you serious right now?<\/p><p>\\u00a0<\/p><p><strong>Skills and experience<\/strong><\/p><p>\\u00a0<\/p><p>No Axe Throwing experience necessary full training provided however the following would be advantageous<\/p><ul><li>A background in training<\/li><li>Strong communication skills<\/li><li>Previous experience in Hospitality<\/li><li>First Aid certified<\/li><li>RSA or willing to obtain<\/li><li>Blue card or willing to obtain<\/li><li>Experience at Public Speaking<\/li><li>A strong sense of humour<\/li><li>The ability to read people and adjust demeanour depending on the situation<\/li><\/ul><p>\\u00a0<\/p>\"}"
}