{
    "id":"Kaggle::techmap::613fbc9b5295a24eaa7fdb1a::xing_de::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The job description emphasises the intention to increase the number of women in leadership positions and states that women will be given preference in the case of equal qualifications. This could inadvertently imply a bias against male candidates.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Experience in a clinical management role and extensive experience as head of a scientific work group. Cooperation and leadership skills, as well as the willingness to play an active part in academic self-governance. Proof of a Habilitation or other equivalent scientific achievements according to  15 Hamburgisches Hochschulgesetz (Hamburg Higher Education Law) of 3rd July 2014 in the respective current version. Very good German language skills. We offer a work environment that provides equal opportunities, independent of age, gender, sexual identity, disability, origin or religion. This is underlined by our commitment to the Diversity Charta. We expressly aim to increase the number of women in leadership positions, in particular among scientific personnel in research and teaching. In the case of equal qualifications, women will be given preference. This also applies in the case of underrepresentation of a gender in the department advertising this appointment. Persons with disabilities will be given preference in the case of equal eligibility, competence and professional achievement. Contact. Prof. Christian Gerloff, Center Medical Director, Head and Neurocenter, phone: (040) 7410-52770 (or by email uke. de). We look forward to receiving your application accompanied by a CV in tabular form, a structured list of publications, research concept, teaching concept and equality concept, in relationship to the location of Hamburg, and with evidence of third-party funding, under the Ref. -No. Fk03-274\/3en, by the 1st November 2021 by email to: uke. de (as a PDF file): Please send the original application (in paper form) to the Dean of the Medical Faculty of the University of Hamburg, Faculty Service, Martinistrae 52, 20246 Hamburg.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613fbc9b5295a24eaa7fdb1a::xing_de\", \"source\": \"xing_de\", \"country\": \"DE\", \"company\": \"University Medical Center Hamburg-Eppendorf (UKE), UHH\", \"position\": \"University Professor of Neurosurgery (W3)\", \"notes\": \"\", \"original\": \"<main><div><div><div><div><article><p>Working on the pulse of time<br><br>University Professor of Neurosurgery (W3)<br><br>University Medical Center Hamburg-Eppendorf, Head and Neurocenter, Clinic and Polyclinic for Neurosurgery<br>This position, Ref.-No. Fk03-274\/3_en, is vacant as of the 01.10.2022, initially for a period of 5 years. A positive evaluation may lead to a permanent appointment.<br><br>We are the University Medical Center Hamburg-Eppendorf ( UKE ), a vibrant healthcare community right at the heart of Hamburg. There is a real buzz of energy here, as progress sets the pace and every day offers fresh experiences. Around 13.600 members of staff with a myriad of roles are united in pursuit of a single aim: human well-being. With more than 140 different professions, we are the ideal place for anyone who loves to work in a flexible environment and is ambitious to advance their own personal development and that of healthcare as a whole.<br><br>Responsibilities<br>The University Medical Center Hamburg-Eppendorf ( UKE ), a hospital offering maximum medical service to the Free and Hanseatic City of Hamburg, has great expertise in supplying health care to the population of the city, as well as in medical research. This professorial appointment is planned to help underline the prestigious profile of research in neuroscience and oncology, which form an integral part of the Hamburg Center of Neuroscience ( HCNS ) and the University Cancer Center ( UCCH ).<br><br>Representation of the discipline neurosurgery in research, education and medical care<br>Medical Director (f\/m\/d) of the Clinic and Polyclinic for Neurosurgery<br>Close clinical cooperation within the Head and Neurocenter, with the Clinic for Intensive Medicine, the UCCH , the UKE Children\\u2019s Clinic and the Clinic for Trauma Surgery, as well as with the interdisciplinary Spine Center<br>Close scientific cooperation within the HCNS and the UCCH , with participation in existing and in the development of new joint research projects<br><br>Teaching responsibilities: <br>9 teaching hours per week\/semester, according to \\u00a7 10 LVVO (teaching requirements directive). A reduction in the number of teaching hours is regulated according to \\u00a7\\u00a7 15 ff. LVVO . <br><br>Appointment requirements and qualifications:<br>Recognition as a specialist (f\/m\/d) in neurosurgery<br>Excellent clinical and surgical abilities<br>Internationally recognized research achievements in the field of neuro-oncology or other research fields associated with neurosurgery, and in particular, success in raising third-party public funding (e.g. DFG , BMBF , EU)<br>Special abilities and accomplishments in teaching, in particular the teaching of modern intraoperative methods<br>Experience in a clinical management role and extensive experience as head of a scientific work group<br>Cooperation and leadership skills, as well as the willingness to play an active part in academic self-governance<br>Proof of a Habilitation or other equivalent scientific achievements according to \\u00a7 15 Hamburgisches Hochschulgesetz (Hamburg Higher Education Law) of 3rd July 2014 in the respective current version<br>Very good German language skills<br>We offer a work environment that provides equal opportunities, independent of age, gender, sexual identity, disability, origin or religion. This is underlined by our commitment to the Diversity Charta. We expressly aim to increase the number of women in leadership positions, in particular among scientific personnel in research and teaching. In the case of equal qualifications, women will be given preference. This also applies in the case of underrepresentation of a gender in the department advertising this appointment. Persons with disabilities will be given preference in the case of equal eligibility, competence and professional achievement.<br><br>Contact<br>Prof. Christian Gerloff, Center Medical Director, Head and Neurocenter, phone: (040) 7410-52770 (or by email gerloff@uke.de)<br><br>We look forward to receiving your application accompanied by a CV in tabular form, a structured list of publications, research concept, teaching concept and equality concept, in relationship to the location of Hamburg, and with evidence of third-party funding, under the Ref.-No. Fk03-274\/3_en, by the 1st November 2021 by email to: berufungen@uke.de (as a PDF file): Please send the original application (in paper form) to the Dean of the Medical Faculty of the University of Hamburg, Faculty Service, Martinistra\\u00dfe 52, 20246 Hamburg.<\/p><\/article><\/div><\/div><\/div><\/div><\/main>\\n<span data-version=\\\"1.2.0-x106\\\"><\/span>\"}"
}