{
    "id":"Kaggle::techmap::612f448041083c5b6da08cb7::linkedin_cn::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Ability to evaluate, prioritize and problem solve a variety of tasks to ensure their timely and accurate completion. Ability to effectively communicate, both verbally and in writing, with a wide variety of internal and external customers. Thorough understanding of accounting principals. Can apply Corporate Accounting policy and procedures manual. Ability to manage specific general ledger accounts including reconciliations and understanding of accounting processes related to these accounts. Ability to calculate and do basic interpretation of all key business metrics. Provide interpretation of reports\/results to users. Generates reports with job-related software. Understanding of the capabilities of the tools can identify problems and trouble shoot input errors. Understands inter-relationships between departments. Physical Demands: Duties of this position are performed in a normal office environment. Duties may require extended periods of sitting and sustained visual concentration on a computer monitor or on numbers and other detailed data. Repetitive manual movement Celestica is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on any protected status (including race, religion, national origin, gender, sexual orientation, age, marital status, veteran or disability status or other characteristics protected by law). At Celestica we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. Special arrangements can be made for candidates who need it throughout the hiring process. Please indicate your needs and we will work with you to meet them. Company Overview. Celestica (NYSE, TSX: CLS) enables the worlds best brands. Through our recognized customer-centric approach, we partner with leading companies in Aerospace and Defense, Communications, Enterprise, Health. Tech, Industrial, Capital Equipment and Energy to deliver solutions for their most complex challenges. As a leader in design, manufacturing, hardware platform and supply chain solutions, Celestica brings global expertise and insight at every stage of product development  from drawing board to full-scale production and after-market services for products from advanced medical devices, to highly engineered aviation systems, to next-generation hardware platform solutions for the Cloud. Headquartered in Toronto, with talented teams spanning 40. locations in 13 countries across the Americas, Europe and Asia, we imagine, develop and deliver a better future with our customers. Celestica would like to thank all applicants, however, only qualified applicants will be contacted. Celestica does not accept unsolicited resumes from recruitment agencies or fee based recruitment services.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::612f448041083c5b6da08cb7::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"\\u5929\\u5f18\", \"position\": \"Accounts Receivable Associate\", \"notes\": \"\", \"original\": \"Req ID: 80377<br><br>Region: Asia<br><br>Country: China<br><br>State\/Province: Jiangsu<br><br>City: Suzhou<br><br><strong><u>Detailed Description<br><br><\/u><\/strong>Entry level during which an employee receives both functional and organizational training under moderate supervision. Incumbents carry out assignments within well-defined practices, procedures and policies. Works independently on details of assignments, and has limited decision-making authority; most decisions are made or guided by the immediate supervisor. Decisions\/actions may have an impact on the department's\/division\\u2019s goals. Works under moderate supervision and requires direction on how assignments are to be executed; begins to put forward ideas on how work assignments are completed. Establishes cooperative relationships to work effectively with colleagues; supports others and participates as a team member. Responsibility for own work commitments. Interacts directly with immediate supervisor, co-workers and team members; engages in routine exchanges of information; interactions with external contacts, if applicable, would be monitored.<br><br>Performs tasks such as, but not limited to, the following:<br><br>Ensures timely receipt of Accounts Receivables. Maintains individual A\/R account control through co-ordination with internal and external customers. Reports collection results and issues to management in a timely manner. This includes but is not limited to account follow-up, providing backup to customer to pay, detailed record keeping to assist in decision making, communications with customers and participation in team sessions to resolve process issues affecting timely collections which requires a methodical and repeatable approach. Monitors status of accounts relative to predefined credit parameters. Manages setup of new customers as required. Works under direction \/guidance of a team leader or manager. Takes independent action to gather ideas and gain consensus with cross-functional teams on process improvement recommendations. Communicates to ensure ideas are understood and accepts perspective of others. Writes effectively and makes internal presentations. Actively participates in team discussions. Shares ideas, knowledge and skills. Treats all team members fairly. Evaluates alternatives based on pros\/cons. Provides input on how to manage required changes. Leads by example and is accountable for own actions.<br><br><strong>Knowledge\/Skills\/Competencies: <br><\/strong><ul><li>Strong system skills, including common office platforms such as MS Office and Access, along with strong analytical skills <\/li><li>Good communication, negotiation and presentation skills <\/li><li>Ability to manage multiple tasks while maintaining attention to detail and accuracy and working under tight time deadlines. ~Can distinguish between urgent and important issues and prioritize their work accordingly. <\/li><li>Ability to evaluate, prioritize and problem solve a variety of tasks to ensure their timely and accurate completion <\/li><li>Ability to effectively communicate, both verbally and in writing, with a wide variety of internal and external customers <\/li><li>Thorough understanding of accounting principals. <\/li><li>Can apply Corporate Accounting policy and procedures manual. <\/li><li>Ability to manage specific general ledger accounts including reconciliations and understanding of accounting processes related to these accounts. <\/li><li>Ability to calculate and do basic interpretation of all key business metrics. <\/li><li>Provide interpretation of reports\/results to users. <\/li><li>Generates reports with job-related software. <\/li><li>Understanding of the capabilities of the tools can identify problems and trouble shoot input errors. <\/li><li>Understands inter-relationships between departments<br><\/li><\/ul><strong>Physical Demands: <\/strong> <ul><li>Duties of this position are performed in a normal office environment <\/li><li>Duties may require extended periods of sitting and sustained visual concentration on a computer monitor or on numbers and other detailed data <\/li><li>Repetitive manual movement Celestica is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on any protected status (including race, religion, national origin, gender, sexual orientation, age, marital status, veteran or disability status or other characteristics protected by law).<br><\/li><\/ul>At Celestica we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. Special arrangements can be made for candidates who need it throughout the hiring process. Please indicate your needs and we will work with you to meet them.<br><br><strong><u>Company Overview<br><br><\/u><\/strong>Celestica (NYSE, TSX: CLS) enables the world\\u2019s best brands. Through our recognized customer-centric approach, we partner with leading companies in Aerospace and Defense, Communications, Enterprise, HealthTech, Industrial, Capital Equipment and Energy to deliver solutions for their most complex challenges. As a leader in design, manufacturing, hardware platform and supply chain solutions, Celestica brings global expertise and insight at every stage of product development \\u2013 from drawing board to full-scale production and after-market services for products from advanced medical devices, to highly engineered aviation systems, to next-generation hardware platform solutions for the Cloud.<br><br>Headquartered in Toronto, with talented teams spanning 40+ locations in 13 countries across the Americas, Europe and Asia, we imagine, develop and deliver a better future with our customers.<br><br>Celestica would like to thank all applicants, however, only qualified applicants will be contacted.<br><br>Celestica does not accept unsolicited resumes from recruitment agencies or fee based recruitment services.\"}"
}