{
    "id":"Kaggle::techmap::61484e0e3c4ecb1e8a8d58fc::itjobslist_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The requirements for manual dexterity skills and the ability to lift 25 pounds, along with the lack of reasonable accommodations, may disadvantage individuals with certain physical disabilities who could perform the job with accommodations.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" -Manual\/finger dexterity skills. -Ability to perform repetitive work requiring high levels of concentration. -Ability to lift 25 pounds. -Displays a positive attitude and a strong desire to learn and grow. REM-03 WS-03 Schedule Shift start: 5:00AM or 3:30PM Shift length: 8.10 hours Mon-Fri & Weekend Shifts Available Benefits Health, dental, vision insurance. available after 30 days Paid time off 401(k) plan Qualifications Must pass drug screen Must pass background check Can lift 25 lbs Must be at least 18. years old $3000 new hire incentive$750 at 3 months, $750 at 6 months and $1500 at one year About Quanex Building Products Quanex Building Products Corporation, together with its subsidiaries, provides components for the fenestration industry worldwide. It operates through three segments: North American Engineered Components, European Engineered Components, and North American Cabinet Components. The company offers flexible insulating glass spacers. Extruded vinyl profiles. Window and door screens. Cabinet doors and other components for original equipment manufacturers (OEMs) in the kitchen and bathroom cabinet industry. And precision-formed metal and wood products, as well as solar panel sealants, trim moldings, vinyl decking and fencing products, water retention barriers, and conservatory roof components.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61484e0e3c4ecb1e8a8d58fc::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"Quanex Building Products\", \"position\": \"Production Worker\", \"notes\": \"\", \"original\": \"Production Worker FULL-TIME $15\/hr, plus $3000 new hire bonus, see details below This position pays up to $18.00 per hour depending on experience with the opportunity to grow! Primary Objective of Position: Performing assigned production functions in a manner which will consistently meet production standards and quality requirements. The level for each Production Worker is determined by management based on how proficiently you perform each function of your job and the number of areas in which you can work while meeting production standards and quality requirements. Responsibilities: This description represents the most significant job duties but does not exclude other work duties that may be assigned as needed. -Receives direction from the supervisor\/team lead and notifies the supervisor\/team lead when more work is needed. -Maintains the work area in a near and orderly condition in compliance with 5S standards. -Follows all safety procedures, rules, and guidelines; and notifies the supervisor\/team lead of any existing or potential safety issues. -Follows all standard operating procedures and notifies the supervisor\/team lead of potential procedural improvements. -Assists in other work areas when the workload permits or requires. -Promotes teamwork by cooperating and supporting co-workers. -Accurately, thoroughly, and legibly completes all documentation related to this position; i.e., production reports, accurate time keeping, etc. -Observes closely the operation of tools and machinery and notifies the supervisor\/team lead immediately of malfunctions or maintenance that may be needed. -Monitors product constantly to ensure that quality standards are being met and rejects product that does not meet quality standards. -Examples of work include: a.Feeding the Finish Sander; takes panels from a pallet and places them under the sander.b.Tailing the gang saw; after boards have been cut lengthwise by gang saw, boards are pulled from conveyor and stacked on appropriate cart based on size. Boards are 8-16 feet long and up to 7 inches wide.c.Feeding blanks into Moulder or Tenoner based on customer specifications; assists Skilled Machine Operator in machine set-up and operation.d.Laying up panels on the gluer; lay staves together by matching color and grain pattern. Place these staves on conveyor to be places in gluer clamps.e.Assembling various components based on customer specifications; meets quality and quantity standards. Qualifications: -High school education or equivalent preferred.-At least 6 months (for entry level I) of production, assembly or related work experience.-Manual\/finger dexterity skills.-Ability to perform repetitive work requiring high levels of concentration.-Ability to lift 25 pounds. -Displays a positive attitude and a strong desire to learn and grow. REM-03 WS-03 Schedule Shift start: 5:00AM or 3:30PM Shift length: 8 - 10 hours Mon-Fri & Weekend Shifts Available Benefits Health, dental, vision insurance - available after 30 days Paid time off 401(k) plan Qualifications Must pass drug screen Must pass background check Can lift 25 lbs Must be at least 18+ years old $3000 new hire incentive$750 at 3 months, $750 at 6 months and $1500 at one year About Quanex Building Products Quanex Building Products Corporation, together with its subsidiaries, provides components for the fenestration industry worldwide. It operates through three segments: North American Engineered Components, European Engineered Components, and North American Cabinet Components. The company offers flexible insulating glass spacers; extruded vinyl profiles; window and door screens; cabinet doors and other components for original equipment manufacturers (OEMs) in the kitchen and bathroom cabinet industry; and precision-formed metal and wood products, as well as solar panel sealants, trim moldings, vinyl decking and fencing products, water retention barriers, and conservatory roof components.\"}"
}