{
    "id":"Kaggle::techmap::614f2ff3c7a97071e5dfef9c::linkedin_hk::14",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Sizable organisation. Leadership position. About Our Client. Our client is an educational organisation with a rich heritage. To adapt and facilitate new business developments, they require an experienced editorial-background Head of Publishing, to lead the business arm with industry insights and mature leadership. Job Description. Report to Managing Director of the organisation, and work closely with other C-level stakeholders. Manage the business arm with an analytical mindset, quality planning, and timely approach. Oversee the operation of editorial and content developments of the publishing house. Act as the leader of the product development team, with main duties to overlook strategic publishing plans and to ensure profit objectives of the company. Review materials frequently and refurbish contents when appropriate. Lead effectively with strong mentor-ship and resourceful network to maintain good relationships with industry liaisons. Execute quality management with in-depth knowledge of editorial policies, publication guidelines, and business creativity. The Successful Applicant. The successful candidate should come from an editorial background with sound knowledge of publishing operations. He\/she would acquire skills and analytical track records to lead team(s), shows strength in striking balance between achieving commercial goals and education visions, and proactive in planning for business growth. An excellent level of proficiency in Chinese and English will be crucial, and the right candidate should be passionate about the education business. What's On Offer. Stable working environment. Leadership position with frequent connection with C-level management. Attractive remuneration package. Contact: Euprasia Lee. Quote job ref: 4155592",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f2ff3c7a97071e5dfef9c::linkedin_hk\", \"source\": \"linkedin_hk\", \"country\": \"HK\", \"company\": \"Michael Page\", \"position\": \"Head of Publishing (Editorial Lead)\", \"notes\": \"\", \"original\": \"<ul><li>Sizable organisation <\/li><li>Leadership position <br><br><\/li><\/ul><strong>About Our Client<br><br><\/strong>Our client is an educational organisation with a rich heritage. To adapt and facilitate new business developments, they require an experienced editorial-background Head of Publishing, to lead the business arm with industry insights and mature leadership.<br><br><strong>Job Description<br><br><\/strong><ul><li>Report to Managing Director of the organisation, and work closely with other C-level stakeholders<\/li><li>Manage the business arm with an analytical mindset, quality planning, and timely approach<\/li><li>Oversee the operation of editorial and content developments of the publishing house<\/li><li>Act as the leader of the product development team, with main duties to overlook strategic publishing plans and to ensure profit objectives of the company<\/li><li>Review materials frequently and refurbish contents when appropriate<\/li><li>Lead effectively with strong mentor-ship and resourceful network to maintain good relationships with industry liaisons<\/li><li>Execute quality management with in-depth knowledge of editorial policies, publication guidelines, and business creativity<br><br><\/li><\/ul><strong>The Successful Applicant<br><br><\/strong>The successful candidate should come from an editorial background with sound knowledge of publishing operations.<br><br>He\/she would acquire skills and analytical track records to lead team(s), shows strength in striking balance between achieving commercial goals and education visions, and proactive in planning for business growth.<br><br>An excellent level of proficiency in Chinese and English will be crucial, and the right candidate should be passionate about the education business.<br><br><strong>What's On Offer<br><br><\/strong><ul><li>Stable working environment<\/li><li>Leadership position with frequent connection with C-level management<\/li><li>Attractive remuneration package<br><br><\/li><\/ul><strong>Contact: Euprasia Lee<br><br><\/strong><strong>Quote job ref: 4155592<\/strong>\"}"
}