{
    "id":"Kaggle::techmap::6153c6ec4c81f16eb3f8709f::rabota_ua::0",
    "label_age":true,
    "analysis_age":"Explicitly states a maximum age",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"Explicitly states that only females may apply.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Explicitly states a height range.",
    "verified":true,
    "synthetic":false,
    "text":" Waitress\/Butler (female) for VVIP Properties in Abu Dhabi - 1600$. tips (50-70% of monthly salary). Villa team 95 Staff, service is 25 Waitress\/Butlers providing 7 stars service for Royal Family of Abu Dhabi. 3 shifts: morning, day and night (night shift usually until 2:00-4:00 am max). Service team traveling with Owner (Spain, France, Morocco and ext. ) and getting extra paid 70$ daily. travel allowance. Contract for 2 years with first 6 months of probation period. 5 working days weekly, 30 days vacations and flights home annually. 9 h working day with 1h for lunch break, sometimes  1, 2, 3 hours, but will be return as a free time or paid. Salary 6000 AED\/ 1600$ plus tips (50-70% of monthly salary). Company providing: Medical insurance. Working Visa for 2 years (in case of quitting visa will be canceled). Accommodation staff villa for Service team only, 2-4 girls per room, big salon and kitchen, 15 min away from the center of Abu Dhabi. Working uniform: day (white polo and shorts) and night (navy blue blouse and skirt) ballerinas shoes. Gym, hairdresser and manicure are provided for team of service. We are looking for female candidates only due to accommodation, age limit 30 y. o. max, height 162-177cm. Well presented, willing to learn and live in UAE 11 months a year. Hospitality experience is a big plus. Fluent English is a must! Send your CV: gmail. com.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6153c6ec4c81f16eb3f8709f::rabota_ua\", \"source\": \"rabota_ua\", \"country\": \"UA\", \"company\": \"Interidan Company LTD\", \"position\": \"\\u041e\\u0444\\u0438\\u0446\\u0438\\u0430\\u043d\\u0442 (Waitress\/Butler)\", \"notes\": \"\", \"original\": \"<p><strong>Waitress\/Butler (female) for VVIP Properties in Abu Dhabi - 1600$ + tips (50-70% of monthly salary)<\/strong><\/p><ul id=\\\"isPasted\\\"><li>Villa team 95 Staff, service is 25 Waitress\/Butlers providing 7 stars service for&nbsp;Royal&nbsp;Family&nbsp;of&nbsp;Abu&nbsp;Dhabi<\/li><\/ul><ul><li>3&nbsp;shifts:&nbsp;morning,&nbsp;day&nbsp;and&nbsp;night (night&nbsp;shift&nbsp;usually&nbsp;until&nbsp;2:00-4:00&nbsp;am&nbsp;max)<\/li><li>Service team traveling with Owner (Spain, France, Morocco and ext.) and&nbsp;getting&nbsp;extra paid&nbsp;70$&nbsp;daily -&nbsp;travel&nbsp;allowance.<\/li><li>Contract&nbsp;for&nbsp;2&nbsp;years&nbsp;with&nbsp;first&nbsp;6&nbsp;months&nbsp;of probation&nbsp;period<\/li><li>5&nbsp;working days&nbsp;weekly,&nbsp;30&nbsp;days&nbsp;vacations&nbsp;and&nbsp;flights&nbsp;home&nbsp;annually.<\/li><li>9 h working day with 1h for lunch break, sometimes + 1,2,3 hours, but will be&nbsp;return&nbsp;as&nbsp;a free&nbsp;time&nbsp;or&nbsp;paid.<\/li><li>Salary 6000 AED\/ 1600$ plus tips (50-70% of monthly salary)<\/li><\/ul><p>Company&nbsp;providing:<\/p><ul><li>Medical&nbsp;insurance<\/li><li>Working Visa&nbsp;for 2&nbsp;years&nbsp;(in&nbsp;case&nbsp;of&nbsp;quitting&nbsp;visa&nbsp;will&nbsp;be&nbsp;canceled)<\/li><li>Accommodation&nbsp;staff&nbsp;villa&nbsp;for&nbsp;Service&nbsp;team&nbsp;only,&nbsp;2-4&nbsp;girls&nbsp;per&nbsp;room,&nbsp;big salon&nbsp;and&nbsp;kitchen, 15&nbsp;min&nbsp;away&nbsp;from the center&nbsp;of&nbsp;Abu&nbsp;Dhabi.<\/li><li>Working uniform: day (white polo and shorts) and night (navy blue blouse and&nbsp;skirt)&nbsp;ballerinas&nbsp;shoes.<\/li><li>Gym, hairdresser and manicure are provided for team of service<\/li><\/ul><p>We are looking for female candidates only due to accommodation, age limit 30 y.o. max, height 162-177cm. Well presented, willing to learn and live in UAE 11 months a year. Hospitality experience is a big plus. <strong>Fluent English is a must!<\/strong><\/p><p>Send your CV: <span data-vacancyemail>interidanltd@gmail.com<\/span>&nbsp;<\/p>\"}"
}