{
    "id":"Kaggle::techmap::61524f9cfce5444a0fb1b8ad::linkedin_bg::13",
    "label_age":true,
    "analysis_age":"The wording \"Dreaming of an early career job\" and \"Is a young graduate or is finishing his\/her faculty\" tends to exclude older candidates, potentially suggesting age bias.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"The phrase \"Fixed-term contract as a replacement for maternity leave\" may implicitly exclude fathers, including those in same-sex partnerships, who might also be eligible for parental leave.",
    "label_racial":true,
    "analysis_racial":"The requirement for candidates to be \"native Bulgarian speakers\" could inadvertently exclude those who are fluent in Bulgarian but did not grow up speaking the language natively, thus limiting diversity among applicants.",
    "label_sexuality":true,
    "analysis_sexuality":"The use of \"his\/her\" implies a binary understanding of gender, potentially excluding non-binary individuals. A more inclusive alternative would be \"is a recent graduate or is completing their degree,\" which avoids assumptions about age and accommodates all gender identities.",
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"In L’Oréal, there are no two days alike and that's what gets us excited every morning. We like to think that being present in 150 countries and working with over 86, 000 employees worldwide from 158 nationalities injects a lot of personality to who we are! And despite our global presence and regardless of in which our subsidiary you are working, the L’Oréal international & diverse spirit can be felt everywhere, through our strong belief in inclusive, generous and sustainable approach for people and for our planet! Freedom to go beyond, that's the beauty of L'Oreal. Apply For The Role Of a. Dreaming of an early career job in a world business leader company. You are passionate about marketing. CUSTOMER CARE TRAINEE (m\/f). Based in our office in Sofia. (Fixed-term contract as a replacement for maternity leave). Your Job Mission. With us, you’ll strive and drive. You’ll try, might fail, try better to succeed. You will never do it alone, but with our inspiring teams. We want to spread your wings by constantly exploring and upgrading yourself in various areas. Responsibilities. This role would enable you to challenge yourself in various administrative and coordination-oriented tasks in Customer Care department, with the following responsibilities. Managing order processing, invoicing and claims according to defined procedures. for overdue payments and performing reconciliation of payments. of delivery process with external logistic partner. Working in close collaboration with Customers and Sales team. with clients. Document reconciliation and archiving. ARE YOU THE ONE? We’re looking for an enthusiastic, reliable, and responsible person to join our team! Our ideal candidate: Is a young graduate or is finishing his\/her faculty, able to work full-time. Is passionate, pragmatic, business driven & analytical researcher. Is able to clearly convey the message in communication with various internal & external stakeholders, is client-oriented. Has great planning and follow up skills, as well as is well organized and is paying attention to details, oriented towards figures. Is computer literate, while experience in SAP is a plus. Is a person which will work with transparency, with integrity and with respect for others. And which is motivated for professional development and has desire to learn. Speaks English fluently and is native Bulgarian speaker. WONDERING WHO YOU WOULD WORK WITH?.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61524f9cfce5444a0fb1b8ad::linkedin_bg\", \"source\": \"linkedin_bg\", \"country\": \"BG\", \"company\": \"L'Or\\u00e9al\", \"position\": \"Customer Care Trainee\", \"notes\": \"\", \"original\": \"In L\\u2019Or\\u00e9al, there are no two days alike and that's what gets us excited every morning. We like to think that being present in 150 countries and working with over 86,000 employees worldwide from 158 nationalities injects a lot of personality to who we are! And despite our global presence and regardless of in which our subsidiary you are working, the L\\u2019Or\\u00e9al international &amp; diverse spirit can be felt everywhere, through our strong belief in inclusive, generous and sustainable approach for people and for our planet!<br><br><strong> Freedom to go beyond, that's the beauty of L'Oreal <\/strong> .<br><br><strong><u>Apply For The Role Of a<br><br><\/u><\/strong>Dreaming of an early career job in a world business leader company. You are passionate about marketing.<br><br><strong> CUSTOMER CARE TRAINEE (m\/f) <br><br><\/strong><strong> Based in our office in Sofia <br><br><\/strong>(Fixed-term contract as a replacement for maternity leave)<br><br><strong><u>Your Job Mission<br><br><\/u><\/strong>With us, you\\u2019ll strive and drive. You\\u2019ll try, might fail, try better to succeed. You will never do it alone, but with our inspiring teams. We want to spread your wings by constantly exploring and upgrading yourself in various areas.<br><br><strong><u>Responsibilities<br><br><\/u><\/strong>This role would enable you to challenge yourself in various administrative and coordination-oriented tasks in Customer Care department, with the following responsibilities<br><ul><li> Managing order processing, invoicing and claims according to defined procedures <\/li><li> for overdue payments and performing reconciliation of payments <\/li><li> of delivery process with external logistic partner <\/li><li> Working in close collaboration with Customers and Sales team <\/li><li> with clients <\/li><li> Document reconciliation and archiving <br><\/li><\/ul><strong> ARE YOU THE ONE? <br><br><\/strong>We\\u2019re looking for an <strong>enthusiastic, reliable<\/strong>, and <strong>responsible<\/strong> person to join our team! Our ideal candidate:<br><ul><li> Is a young graduate or is finishing his\/her faculty, able to work full-time <\/li><li> Is preferably pursuing \/ has preferably obtained a degree in business administration \/ economics <\/li><li> Is passionate, pragmatic, business driven &amp; analytical researcher <\/li><li> Is able to clearly convey the message in communication with various internal &amp; external stakeholders, is client-oriented <\/li><li> Has great planning and follow up skills, as well as is well organized and is paying attention to details, oriented towards figures <\/li><li> Is computer literate, while experience in SAP is a plus <\/li><li> Is a person which will work with transparency, with integrity and with respect for others; and which is motivated for professional development and has desire to learn <\/li><li> Speaks English fluently and is native Bulgarian speaker <br><\/li><\/ul><strong> WONDERING WHO YOU WOULD WORK WITH? <br><br><\/strong>Our L'Or\\u00e9al Adria Balkan dream team is based throughout several countries (Bosnia&amp;Herzegovina, Bulgaria, Croatia, Serbia and Slovenia), speaking more than 7 languages, and united towards one ambition \\u2013 creating L\\u2019Or\\u00e9al, for the future!<br><br>On this position, you would be based in Sofia as a part of our Customer Care team, but you would closely collaborate with passionate and engaged colleagues throughout all our countries, that are experts in their respective fields and that are driving excellent market performance results in a highly ethical, friendly, and inspiring environment!<br><br><strong> AND FINALLY, WHAT'S IN IT FOR YOU? <br><br><\/strong>You might be cosmetics junkie \\u2014 or you might not. You can be an introvert or an extrovert. The point is, whoever we are, we are all a team and we\\u2019re always here to help, celebrate and cheer one another! That\\u2019s what makes the glue of L\\u2019Or\\u00e9al: the people. But apart from that, we also appreciate and share our love for:<br><ul><li> Numerous opportunities for constant learning, with many online&amp;offline educations!<\/li><li> Our colleagues. They will be like your second family. P.S. we enjoy our team buildings and informal gatherings as well!<\/li><li> Love for food. Fresh fruit for the breakfast? Many coffee machines (or space to cook your own turkish coffee!) and our cozy lunch spaces? Yes, we have it!<\/li><li>Our Share&amp;Care program. It serves to offer numerous benefits to protect us and our health, to give us balance in personal life and workplace as well !<\/li><li> Flexibility. As simple as that \\u2013 from flexible working hours, to possibility of remote working, to Sunny Fridays during the summer where we enjoy shorter Fridays!<\/li><li> We don't have to mention working with top international brands in the business, and the most passionate professionals in the industry?<\/li><li> The fact that there's (usually) no such thing as standard career path. Each of us has the opportunity to be empowered and to lead the change we want to see within the biggest beauty company in the world<br><\/li><\/ul>Find more about our projects &amp; brands that we\\u2019re so proud on, and our Adria Balkan region on this LINK !<br><br><strong> WHY NOT FINDING YOUR NEXT ADVENTURE WITH US AT L\\u2019OR\\u00c9AL? <br><br><\/strong>Apply with a <strong>cover letter and CV in English, latest until 19th of October! <br><br><\/strong>Only short listed candidates will be contacted. All applications will be treated in the strictest confidentiality.<br><br>LI_BALKAN\"}"
}