{
    "id":"Kaggle::techmap::61415d393a9e401394da8d44::itjobslist_us::1",
    "label_age":true,
    "analysis_age":"The phrase \"Recent college graduates with no experience or graduates with few years of experience preferred\" will discourage older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Company DescriptionI. T. EXCEL is an E-VERIFIED Company. I. T. Excel is a new breed of service firm. an industry-focused consulting and integration firm offering a broad range of solution offerings to clients from a broad range of Industries. ITE is an end-to-end global consulting & solutions company with over 250 employee. We help companies bring improved focus to IT and how it aligns with the business, executes on its priorities and balances between innovation and efficiency. We have successfully shared with many of our clients the strategies, approaches and techniques necessary to transform IT capability and enable the implementation of business strategy. We specialize in the following technologies- QA\/Software Testing, Business Analysis and Computer System Validation. Job DescriptionDescription: WE ARE LOOKING FOR FRESH GRADUATES FOR QA and Validation POSITIONS. Training Location: Reston, VAMinimum Experience: Recent college graduates with no experience or graduates with few years of experience preferred. Computer literate and familiar with the use of word processing, spreadsheet, and basic database applications preferred. Skills\/Abilities\/Competencies Required: Must be ambitious, have strong work ethic, and a willingness to learn Be a fast learner with strong problem solving skills Demonstrated strength in verbal and written communication Positive & winning attitude Candidate must be willing to relocate Excellent communication and interpersonal skills Ability to understand and effectively communicate at all management levels, technical dependencies, timeline impact and risks Employment Benefits: Competitive Base Salary: Base Pay of $55, 000 - $58, 000 \/ Yr with periodic reviews (usually every 6 months) and increments. QualificationsQualifications: BS in Biomedical Engineering\/ BS in Chemical Engineering\/ Computer Science\/ MS Computer Science\/ BBA\/ MBA\/ Engineering degree required from an accredited university or college. Additional InformationAll your information will be kept confidential according to EEO guidelines.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61415d393a9e401394da8d44::itjobslist_us\", \"source\": \"itjobslist_us\", \"country\": \"US\", \"company\": \"IT Excel LLC\", \"position\": \"Jr. Validation Engineer\/QA Analyst\/ Jr. QA Tester\", \"notes\": \"\", \"original\": \"Company DescriptionI.T. EXCEL is an E-VERIFIED Company.I.T. Excel is a new breed of service firm - an industry-focused consulting and integration firm offering a broad range of solution offerings to clients from a broad range of Industries. ITE is an end-to-end global consulting & solutions company with over 250 employee .We help companies bring improved focus to IT and how it aligns with the business, executes on its priorities and balances between innovation and efficiency. We have successfully shared with many of our clients the strategies, approaches and techniques necessary to transform IT capability and enable the implementation of business strategy. We specialize in the following technologies- QA\/Software Testing, Business Analysis and Computer System Validation.Job DescriptionDescription: WE ARE LOOKING FOR FRESH GRADUATES FOR QA and Validation POSITIONS. Training Location: Reston, VAMinimum Experience: Recent college graduates with no experience or graduates with few years of experience preferred. Computer literate and familiar with the use of word processing, spreadsheet, and basic database applications preferred.Skills\/Abilities\/Competencies Required: Must be ambitious, have strong work ethic, and a willingness to learn Be a fast learner with strong problem solving skills Demonstrated strength in verbal and written communication Positive & winning attitude Candidate must be willing to relocate Excellent communication and interpersonal skills Ability to understand and effectively communicate at all management levels, technical dependencies, timeline impact and risks Employment Benefits: Competitive Base Salary: Base Pay of $55,000 - $58,000 \/ Yr with periodic reviews (usually every 6 months) and increments.QualificationsQualifications: BS in Biomedical Engineering\/ BS in Chemical Engineering\/ Computer Science\/ MS Computer Science\/ BBA\/ MBA\/ Engineering degree required from an accredited university or college.Additional InformationAll your information will be kept confidential according to EEO guidelines.\"}"
}