{
    "id":"Kaggle::techmap::614c2d4cbfb8e7511d3a566b::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"lift a minimum of 45lbs\" lacks clarity whether it is aided\/unaided. This may discourage many who are physically capable of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Ability to take prompt and appropriate response to operating conditions. CONTACTS: Internal: Plant Manager, Plant employees, Regional VP, VP Engineering. External: Vendors, Contractors. SUPERVISORY RESPONSIBILITY: NONE. Although this position may be asked to assist with directing production workflow, it is an individual contributor position and does not have any direct reports. Must maintain a professional demeanor when dealing with vendors, suppliers and contractors. Demonstrate a commitment to Reddy Ices values and priorities. EDUCATION AND EXPERIENCE: Required: 2-4 years of work experience in an industrial maintenance operation. Preferred: 1.4. years of work experience in an industrial maintenance operation. High school diploma or GED. Completion of ONE of the following Certifications: Programmable Logic Controller Certification-Electronics Technicians Association International. Journeyman Certification\/License in Electrical, Plumbing, Mechanical Disciplines-State Certifying Authority. Certified Assistant Refrigeration Operator-Refrigerating Engineers and Technicians Association. Certified Maintenance Technician Level III-International Maintenance Institute. Certified Maintenance and Reliability Technician-Society for Maintenance and Reliability Professionals. WORKING CONDITIONS\/PHYSICAL REQUIREMENTS: Conditions vary from normal office conditions to all areas inside and outside of plant. Exposure to extreme temperature fluctuations, electrical hazards, ammonia and heavy moving equipment. The job requires working nights and weekends with occasional travel. Overtime may be required. Work is conducted in a fast-paced, rapidly changing environment. The ability to manage stress, build professional and collaborative relationships, and reason through complex business situations is essential. Requires an eye for detail and ability to organize. Must be able to work with both hand and heavy electric tools and lift a minimum of 45lbs. Location. City: Plant City\/Tampa State: Florida.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c2d4cbfb8e7511d3a566b::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Reddy Ice\", \"position\": \"Maintenance Tech\", \"notes\": \"\", \"original\": \"<p><u><b>Job Requisition<\/b><\/u><\/p>JR13220<p><u><b>Worker Time Type<\/b><\/u><\/p>Full time<p><u><b>Worker Sub-Type<\/b><\/u><\/p>Regular<p><b><u>Shift<\/u><\/b><\/p><p><b><u>Job Description<\/u><\/b><\/p><p><b><u>POSITION PURPOSE:<\/u><\/b><\/p><p>The Maintenance Technician I is an apprentice level maintenance person with advanced maintenance responsibilities for the reliable operation and maintenance of the plant\\u2019s manufacturing systems and physical property. Included activities are preventive maintenance, equipment trouble shooting, tool identification and usage, and small physical property repairs.<\/p>\\r\\n<p><b><u>DUTIES AND RESPONSIBILITIES:<\/u><\/b><\/p><p>Conduct preventive maintenance on production equipment; troubleshoot and repair malfunctioning equipment. Basic understanding and application of blueprints, schematics, and technical documentation for the proper maintenance of manufacturing and facility equipment. Ensures that manufacturing equipment is functional and supplies are ready.\\u00a0 Tests production quality by visually inspecting ice for clarity, cube size, and hole space. Basic understanding of Root Cause Analysis and countermeasure implementation. Minor facility and building grounds maintenance including changing lightbulbs, painting, and minor plant structural repairs.\\u00a0 Identification and proper usage of tools and equipment to conduct general facility maintenance. This position may be required to assist with bagging product and occasionally directs production workflow based on production equipment output. Can facilitate basic data analysis for Root Cause Identification Identify and bring opportunities for continuous process improvement to Operation Manager\\u2019s attention. Complete safety checklists as required by the Safety\/Risk Management Department. Able to identify, monitor and correct issues regarding industrial health and safety Make and assume other duties and responsibilities required or assigned by management. Adhering to the Code of Business Ethics is essential.\\u00a0 We value honesty and integrity above all else and we expect our employees to be committed to the highest ethical standards.<\/p>\\r\\n<p><b><u>ESSENTIAL MENTAL FUNCTIONS AND SKILLS<\/u><\/b><\/p><ul><li>Ability to read and interpret documents in English, such as safety rules, operating and maintenance instructions, and procedure manuals.<\/li><li>Ability to work in a constant state of alertness and safe manner<\/li><li>Ability to work in an unfatigued state<\/li><li>Ability to accurately gauge lengths of time and distance<\/li><li>Ability to quickly store and recall instructions in one\\u2019s short term memory<\/li><li>Ability to concentrate and perform tasks involving high levels of cognitive function and judgment<\/li><li>Ability to cope with sudden changes in surrounding and\/or emergency situations and\/or alarms<\/li><li>Demonstrate a caring, committed and concerned attitude about safety<\/li><li>Possess fast reflexes and unimpaired coordination and ability to rapidly respond to stimuli<\/li><li>Not mentally or physically impaired from any cause that can adversely affect ability to safely and competently perform required functions<\/li><li>Ability to take prompt and appropriate response to operating conditions<\/li><\/ul>\\r\\n<p><b><u>CONTACTS:<\/u><\/b><\/p><p>Internal:\\u00a0\\u00a0\\u00a0\\u00a0 Plant Manager, Plant employees, Regional VP, VP Engineering\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0<\/p><p>External:\\u00a0\\u00a0\\u00a0 Vendors, Contractors<\/p>\\r\\n<p><b><u>SUPERVISORY RESPONSIBILITY: NONE<\/u><\/b><\/p><p>Although this position may be asked to assist with directing production workflow, it is an individual contributor position and does not have any direct reports. Must maintain a professional demeanor when dealing with vendors, suppliers and contractors.\\u00a0 Demonstrate a commitment to Reddy Ice\\u2019s values and priorities.<\/p>\\r\\n<p><b><u>EDUCATION AND EXPERIENCE:<\/u><\/b><\/p><p><b>Required:<\/b><\/p><ul><li>2-4 years of work experience in an industrial maintenance operation<\/li><\/ul>\\r\\n<p><b>Preferred:<\/b><\/p><p>1. 4+ years of work experience in an industrial maintenance operation<\/p><p>2. High school diploma or GED<\/p><p>3. Completion of ONE of the following Certifications:<\/p><ul><li>Programmable Logic Controller Certification- <i>Electronics Technicians Association International<\/i><\/li><li>Journeyman Certification\/License in Electrical, Plumbing, Mechanical Disciplines- <i>State Certifying Authority<\/i><\/li><li>Certified Assistant Refrigeration Operator- <i>Refrigerating Engineers and Technicians Association<\/i><\/li><li>Certified Maintenance Technician Level III- <i>International Maintenance Institute<\/i><\/li><li>Certified Maintenance and Reliability Technician- <i>Society for Maintenance and Reliability Professionals<\/i><\/li><\/ul>\\r\\n<p><b><u>WORKING CONDITIONS\/PHYSICAL REQUIREMENTS:<\/u><\/b><\/p><p>Conditions vary from normal office conditions to all areas inside and outside of plant. Exposure to extreme temperature fluctuations, electrical hazards, ammonia and heavy moving equipment. The job requires working nights and weekends with occasional travel. Overtime may be required. Work is conducted in a fast-paced, rapidly changing environment.\\u00a0 The ability to manage stress, build professional and collaborative relationships, and reason through complex business situations is essential. Requires an eye for detail and ability to organize.\\u00a0 Must be able to work with both hand and heavy electric tools and lift a minimum of 45lbs.<\/p>\\r\\n<p>#ZR<\/p><p><u><b>Location<\/b><\/u><\/p><p>City:<\/p>Plant City\/Tampa<p>State:<\/p>Florida&nbsp;\"}"
}