{
    "id":"Kaggle::techmap::6142bf6da973d70733cfcc12::britishjobs_uk::7",
    "label_age":true,
    "analysis_age":"\"Tech savvy\" is an age-stereotypical term.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Title: Receptionist. Luxury Salon. Location: West London. Salary: £22, 000 - £24, 000. Term: Permanent. This is an amazing opportunity to work for a luxury hair salon where clients and visitors include celebrities, well connected individuals and representatives from fashion magazines and beauty companies. This is a young, fast and growing brand with a down to earth, but fashion-conscious vibe who offer a great working environment and fantastic regular team socials. The Role of Receptionist. Joining a dynamic, happy and highly creative team, you must be a confident communicator who is able to multi-task and cope well under pressure, helping to run a busy salon. We need someone who is great with people, able to remember faces, recognise voices and ideally remembering their favourite drink! Reporting to the Salon Manager and head receptionist, you must be willing to help run the salon and work in their other Salon on occasion. Your duties will include: Welcoming clients in a friendly and professional manner. Answering the telephones in a professional and friendly manner. Managing the booking system, stylists' columns and staff communications. Providing customers with exceptional customer service. Entering details on to the system and sending emails. Retail product promotions. Helping to maintain a well presented and organised reception area and salon. Being a pro-active, flexible member of the team with a can-do attitude towards both clients and staff. To be considered for the role of Receptionist you must have: Ideally experience is a similar role and field. Super reliable. Responsible. Excellent telephone manner. Friendly and engaging personality. Confident. Tech savvy. Helpful attitude. Well presented. Enthusiastic with a can-do approach. Team player. A passion for the beauty industry is essential. The Package for the Receptionist role. Salary: £22, 000 to £24, 000. Hours: 45 Hours per week Tuesday to Saturday. Dress Code: Fashion conscious and presentable. Term: Permanent. To apply, follow the onscreen instructions or call Lucy Fowler for more information quoting RA12932. This vacancy is being advertised by Recruit. Ability Ltd. The services advertised by Recruit. Ability Ltd are those of an Employment Agency.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6142bf6da973d70733cfcc12::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"RecruitAbility Ltd\", \"position\": \"Receptionist - Luxury Salon\", \"notes\": \"\", \"original\": \"Job Title: Receptionist - Luxury Salon<br> <br> Location: West London<br> <br> Salary: &pound;22,000 - &pound;24,000<br> <br> Term: Permanent<br> <br> This is an amazing opportunity to work for a luxury hair salon where clients and visitors include celebrities, well connected individuals and representatives from fashion magazines and beauty companies. This is a young, fast and growing brand with a down to earth, but fashion-conscious vibe who offer a great working environment and fantastic regular team socials.<br> <br> The Role of Receptionist<br> <br> Joining a dynamic, happy and highly creative team, you must be a confident communicator who is able to multi-task and cope well under pressure, helping to run a busy salon.<br><br>We need someone who is great with people, able to remember faces, recognise voices and ideally remembering their favourite drink!<br><br>Reporting to the Salon Manager and head receptionist, you must be willing to help run the salon and work in their other Salon on occasion.<br><br>Your duties will include:<br><br>Welcoming clients in a friendly and professional manner<br>Answering the telephones in a professional and friendly manner<br>Managing the booking system, stylists&#39; columns and staff communications<br>Providing customers with exceptional customer service<br>Entering details on to the system and sending emails<br>Retail product promotions<br>Helping to maintain a well presented and organised reception area and salon<br>Being a pro-active, flexible member of the team with a can-do attitude towards both clients and staff <br><br>To be considered for the role of Receptionist you must have:<br><br>Ideally experience is a similar role and field<br>Super reliable<br>Responsible<br>Excellent telephone manner<br>Friendly and engaging personality<br>Confident<br>Tech savvy<br>Helpful attitude<br>Well presented<br>Enthusiastic with a can-do approach<br>Team player<br>A passion for the beauty industry is essential <br><br>The Package for the Receptionist role<br> <br> Salary: &pound;22,000 to &pound;24,000 <br> <br> Hours: 45 Hours per week Tuesday to Saturday<br><br>Dress Code: Fashion conscious and presentable<br><br>Term: Permanent<br><br>To apply, follow the onscreen instructions or call Lucy Fowler for more information quoting RA12932<br><br>This vacancy is being advertised by RecruitAbility Ltd. The services advertised by RecruitAbility Ltd are those of an Employment Agency.<br><br>\"}"
}