{
    "id":"Kaggle::techmap::6144b8e6c368be4701bcb530::monsterasia_sg::0",
    "label_age":true,
    "analysis_age":"Emphasis on \"recent graduates\" and \"mid-career individuals\" could be regarded as biased against older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 8xpand Technologies Pte. Ltd is an innovative digital consultancy headquartered in Singapore. Since 2008 we have been helping companies grow, established brands and reimaging their businesses by building innovative digital solutions empowered by the latest technologies. Role Description: This position report to the business development manager and the applicant will be part of our Sales and Marketing team. 8xpand is SME software company, building innovative digital solutions empowered by the latest technologies. Specific Responsibilities: 1. Collaborating with sales and leadership to secure, retain, and grow accounts. Building business relationships with current and potential clients. Understanding client needs and offering solutions and support. Answering potential client questions. Meeting all quotas for cold, active, inactive calls, appointments, and interviews. Meeting or exceeding annual sales goals. Competencies: 1. Business intelligence skills. 2- ROI and data analysis skills. Marketing skills. Project Management. Duration of Traineeship\/Attachment Offered: 6 months. Approved Training Allowance: Fresh Graduates  $2500. Non Mature Mid Career Individuals  $3000. Mature Mid Career Individuals  $3800. Education and Qualifications Required for the Traineeship Role under SGUnited Traineeship. 1- Degree\/ Polyethnic Diploma \/ ITE Certification. Good knowledge in CRM system. Effective oral and communication skills. This position is open for both recent graduates and mid-career individuals (mature and non mature). Graduates interested in this position should possess a Poly Diploma Qualification. Mid-career individuals from any qualification level can apply.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6144b8e6c368be4701bcb530::monsterasia_sg\", \"source\": \"monsterasia_sg\", \"country\": \"SG\", \"company\": \"8xpand Technologies Pte. Ltd.\", \"position\": \"Business Development Executive #SGUnitedTraineeships #SGUP\", \"notes\": \"\", \"original\": \"<div><p><strong>8xpand Technologies Pte<\/strong><strong>Ltd<\/strong> is an innovative digital consultancy headquartered in Singapore. Since 2008 we have been helping companies grow, established brands and reimaging their businesses by building innovative digital solutions empowered by the latest technologies.<\/p><p><br><\/p><p><strong>Role Description:<\/strong><\/p><p>This position report to the business development manager and the applicant will be part of our Sales and Marketing team. 8xpand is SME software company, building innovative digital solutions empowered by the latest technologies.<\/p><p><br><\/p><p><strong>Specific Responsibilities:<\/strong><\/p><p>1- Collaborating with sales and leadership to secure, retain, and grow accounts<\/p><p>2- Building business relationships with current and potential clients<\/p><p>3- Understanding client needs and offering solutions and support; answering potential client questions<\/p><p>4- Meeting all quotas for cold, active, inactive calls, appointments, and interviews; meeting or exceeding annual sales goals<\/p><p><br><\/p><p><strong>Competencies:<\/strong><\/p><p>1- Business intelligence skills<\/p><p>2- ROI and data analysis skills<\/p><p>3- Marketing skills<\/p><p>4- Project Management<\/p><p><br><\/p><p><strong>Duration of Traineeship\/Attachment Offered<\/strong>: 6 months<\/p><p><br><\/p><p><strong>Approved Training Allowance:<\/strong><\/p><p>Fresh Graduates -- $2500<\/p><p>Non Mature Mid Career Individuals -- $3000<\/p><p>Mature Mid Career Individuals -- $3800<\/p><p><br><\/p><p><strong>Education and Qualifications Required for the Traineeship Role under SGUnited Traineeship<\/strong><\/p><p>1- Degree\/ Polyethnic Diploma \/ ITE Certification<\/p><p>2- Good knowledge in CRM system<\/p><p>3- Effective oral and communication skills<\/p><p><br><\/p><p>This position is open for both recent graduates and mid-career individuals (mature and non mature). Graduates interested in this position should possess a Poly Diploma Qualification. Mid-career individuals from any qualification level can apply.<\/p><\/div>\"}"
}