{
    "id":"Kaggle::techmap::614d3022463aa27e3dae31ed::seek_au::6",
    "label_age":true,
    "analysis_age":"The phrase \"Have an energetic attitude and desire for achieving results\" could implicitly favour younger candidates.",
    "label_disability":true,
    "analysis_disability":"The phrase \"Physically fit as position requires manual handling\" might deter qualified individuals who may have disabilities, but can perform the job effectively with reasonable accommodations. Perhaps quantifying the physical work that needs to be done, regardless of how it's done, could make the job description more inclusive.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement for \"your own transport\" could exclude potential candidates who rely on public transportation or other means due to various reasons, including economic factors.",
    "verified":true,
    "synthetic":false,
    "text":"About Us. At APS Industrial, we’re the gateway that connects the world’s leading industrial manufacturers to the local industry. We’re committed to offering our customers an experience that is consistent and reliable as we together create solutions that power Australia. We were formed in 2018 and are in an exciting growth phase focused on serving our customers, our employees and our global manufacturing partners. As the master distributor of the Siemens range in Australia, we also have key national distribution partnerships with a number of other leading global manufacturers led by Weidmuller, Rittal and EPCOS (a TDK Group company). Bringing together this extensive technology portfolio, APS Industrial is able to serve the local market as a connected technology partner intent on delivering quality products and the ultimate in customer service. About the role. We have been experiencing steady growth, which is why we are looking to expand our warehouse team at our Warehouse Distribution Centre in Rowville. Duties would include, but are not limited to: Picking, packing and dispatching customer orders. Receiving and inspecting all incoming goods. Basic Data entry. Loading and unloading of trucks and customer vehicles. Accurate distribution of inventory. Replenishing racks with inventory. Safe and efficient operation of forklift. Forklift and reach truck work. Maintaining a clean and safe workplace. To be successful in this role you should: Have an energetic attitude and desire for achieving results. Ability to work in a team. Physically fit as position requires manual handling. Hold a current Forklift license (Reach Truck Experience) – Desirable. Be self-motivated, punctual, and reliable with your own transport. You would be working closely with the team and Warehouse Manager with training provided. We offer long term stable employment. If you can see yourself joining our team and think that you would be a good fit then apply now by attaching your resume and cover letter. Benefits. Our committed team is central to the APS Industrial vision and as part of our commitment to your satisfaction and development, you will be rewarded with an opportunity to make a mark for yourself in this business going through transformation and growth. If you'd like to know more about APS Industrial, please visit apsindustrial. com. au..",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d3022463aa27e3dae31ed::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"APS Industrial Pty Ltd\", \"position\": \"Storeperson\", \"notes\": \"\", \"original\": \"<p><strong>About Us<\/strong><br \/><br \/>At APS Industrial, we\\u2019re the gateway that connects the world\\u2019s leading industrial manufacturers to the local industry. We\\u2019re committed to offering our customers an experience that is consistent and reliable as we together create solutions that power Australia.<br \/><br \/>We were formed in 2018 \\u00a0and are in an exciting growth phase focused on serving our customers, our employees and our global manufacturing partners.<br \/><br \/>As the\\u00a0master distributor of the Siemens range in Australia, we also have key national distribution partnerships with a number of other leading global manufacturers led by Weidmuller, Rittal and EPCOS (a TDK Group company).<br \/><br \/>Bringing together this extensive technology portfolio, APS Industrial is able to serve the local market as a connected technology partner intent on delivering quality products and the ultimate in customer service.<br \/><br \/><strong>About the role<\/strong><br \/><br \/>We have been experiencing steady growth, which is why we are looking to expand our warehouse team at our Warehouse Distribution Centre in\\u00a0Rowville.<\/p><p><strong>Duties would include, but are not limited to:<\/strong><\/p><ul><li>Picking, packing and dispatching customer orders<\/li><li>Receiving and inspecting all incoming goods<\/li><li>Basic Data entry\\u00a0<\/li><li>Loading and unloading of trucks and customer vehicles<\/li><li>Accurate distribution of inventory<\/li><li>Replenishing racks with inventory\\u00a0<\/li><li>Safe and efficient operation of forklift<\/li><li>Forklift and reach truck work<\/li><li>Maintaining a clean and safe workplace<\/li><\/ul><p><strong>To be successful in this role you should:<\/strong><\/p><ul><li>Have an energetic attitude and desire for achieving results<\/li><li>Ability to work in a team<\/li><li>High level of communication skills, both written and verbal<\/li><li>Physically fit as position requires manual handling<\/li><li>Hold a current Forklift license (Reach Truck Experience) \\u2013 Desirable<\/li><li>Be self-motivated, punctual, and reliable with your own transport<\/li><\/ul><p>You would be working closely with the team and Warehouse Manager with training provided. We offer long term stable employment. \\u00a0<\/p><p>If you can see yourself joining our team and think that you would be a good fit then apply now by attaching your resume and cover letter.<\/p><p><strong>Benefits<\/strong><\/p><p>Our committed team is central to the APS Industrial vision and as part of our commitment to your satisfaction and development, you will be rewarded with an opportunity to make a mark for yourself in this business going through transformation and growth.<br \/><br \/>If you'd like to know more about APS Industrial, please visit apsindustrial.com.au \\u00a0<\/p><p><br \/>\\u00a0<\/p>\"}"
}