{
    "id":"Kaggle::techmap::615ca146a58bed21ab5f35c3::monster_ie::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description. Labourer, Skilled Labourer, General labourer, General operative. Your new company. Hays recruitment have partnered up with a number of contractors across Dublin who are looking to add skilled and unskilled labourers to their team coming into the winter months. Your new role. Your new role will see you working alongside qualified tradesmen and assisting in their day to day duties. You will liase with the foreman each morning and work to schedules assigned to you. What you'll need to succeed. To be successful you will need a can do attitude and be able to take direction, while working on your on initiative also. Physically and mentally fit (ability to lift up to 40kg). Safe Pass, Manual Handling and CIF Induction. Additional certs and own transport is advantageous. What you'll get in return. A chance to work for leading contractors across Dublin and develop your skills as a valued team member. Competitive hourly rate. Occasional overtime. Paid Weekly. What you need to do now. If you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now. If this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career. Hays Ireland is a trading division of Hays Specialist Recruitment (Ireland) Limited and acts as an employment agency for permanent recruitment and employment business for the supply of temporary workers. By applying for this job you accept the T&C's, Privacy Policy and Disclaimers which can be found at hays. co. uk.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615ca146a58bed21ab5f35c3::monster_ie\", \"source\": \"monster_ie\", \"country\": \"IE\", \"company\": \"Hays Ireland\", \"position\": \"Labourer\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <img height=\\\"1\\\" src=\\\"https:\/\/counter.adcourier.com\/RC5NdXJwaHkuNjE4NDguNDc5QGhheXNpcmVsYW5kLmFwbGl0cmFrLmNvbQ.gif\\\" width=\\\"1\\\"> <br>Labourer, Skilled Labourer, General labourer, General operative <br> <br><strong>Your new company<\/strong> <br>Hays recruitment have partnered up with a number of contractors across Dublin who are looking to add skilled and unskilled labourers to their team coming into the winter months. <br> <br><strong>Your new role<\/strong> <br>Your new role will see you working alongside qualified tradesmen and assisting in their day to day duties. <br>You will liase with the foreman each morning and work to schedules assigned to you. <br> <br><strong>What you'll need to succeed<\/strong> <br>To be successful you will need a can do attitude and be able to take direction, while working on your on initiative also. <br>Physically and mentally fit (ability to lift up to 40kg). <br>Safe Pass, Manual Handling and CIF Induction. <br>Additional certs and own transport is advantageous. <br> <br><strong>What you'll get in return<\/strong> <br>A chance to work for leading contractors across Dublin and develop your skills as a valued team member. <br>Competitive hourly rate. <br>Occasional overtime. <br>Paid Weekly <br> <br><strong>What you need to do now<\/strong> <br>If you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now. <br>If this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career. <br> <br>Hays Ireland is a trading division of Hays Specialist Recruitment (Ireland) Limited and acts as an employment agency for permanent recruitment and employment business for the supply of temporary workers. By applying for this job you accept the T&amp;C's, Privacy Policy and Disclaimers which can be found at hays.co.uk <br> <\/div>\"}"
}