{
    "id":"Kaggle::techmap::6136c63f18e520633201b7cb::reed_uk::6",
    "label_age":true,
    "analysis_age":"The emphasis on 'recent graduates' is biased against older people.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"\"sporty culture\" and \"golf club membership\" is leaning towards a bias towards male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Internal Recruiter. Based in Fareham near Southampton. About Blueprint Recruitment. Blueprint Recruitment Solutions is a professional recruitment agency based in Fareham near Southampton. We are one of the UK's top 250 recruitment companies and a leading business in the Solent region. We are a successful and forward-thinking recruitment company with a strong team-based culture and a friendly and enthusiastic working atmosphere. The position. We are looking for a recent graduate or a Recruitment Consultant to be responsible for the sourcing and hiring of new Recruiters for our business. The work involves sourcing candidates, telephone screening and interviewing suitable graduates and experienced Recruitment Consultant candidates. You will be fully trained to identify and interview candidates and will be building a rapport with succesful applicants who progress to working in our team. You will also work on some marketing aspects icluding advertising our Recruiter vacancies on social media, websites and with universities so if you have some creative design flair, that could be beneficial. About you. Ideally you will have a good academic record and will have had some previous experience in Recruitment, Customer Service, Sales, Events or similar, although experience is not mandatory. Your personality will be the important factor. you should be a friendly, confident person who is determined to find the right people for the business. You will also have an excellent telephone manner and will be looking for a job that gives you the opportunity to progress through your own hard work. The benefits. You will be paid a good basic salary and will also be able to earn bonuses based on your achievements. We provide excellent training and graduate career development, as well as team and individual incentive schemes, company events (such as Goodwood races and boat trips) and a wide range of additional benefits. The benefits we offer are: - A generous basic salary as well as bonus and commission. - A first year total package of around £24K OTE. - A clearly defined career path, including a car allowance scheme after a qualifying period. Comprehensive graduate training, mentoring and development. - A private Healthcare scheme and a sporty culture. An environment that rewards individual achievements. Charity Dress down days, Early finishes on Fridays, Golf club membership, Company events, such as Goodwood Races, Go-karting, Bowling, Christmas & Summer parties, regular team lunches and nights out. To apply for this job, you must be eligible to live and work in the UK.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6136c63f18e520633201b7cb::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Blueprint Recruitment Solutions\", \"position\": \"Internal Recruiter\", \"notes\": \"\", \"original\": \"<p>Internal Recruiter<\/p> <p>Based in Fareham near Southampton <\/p> <p><strong>About Blueprint Recruitment<\/strong><\/p> <p>Blueprint Recruitment Solutions is a professional recruitment agency based in Fareham near Southampton. We are one of the UK's top 250 recruitment companies and a leading business in the Solent region. We are a successful and forward-thinking recruitment company with a strong team-based culture and a friendly and enthusiastic working atmosphere. <\/p> <p><strong>The position<\/strong><\/p> <p>We are looking for a recent graduate or a Recruitment Consultant to be responsible for the sourcing and hiring of new Recruiters for our business. The work involves sourcing candidates, telephone screening and interviewing suitable graduates and experienced Recruitment Consultant candidates. You will be fully trained to identify and interview candidates and will be building a rapport with succesful applicants who progress to working in our team. <\/p> <p>You will also work on some marketing aspects icluding advertising our Recruiter vacancies on social media, websites and with universities so if you have some creative design flair, that could be beneficial. <br><br><strong>About you<\/strong><br><br>Ideally you will have a good academic record and will have had some previous experience in Recruitment, Customer Service, Sales, Events or similar, although experience is not mandatory. Your personality will be the important factor - you should be a friendly, confident person who is determined to find the right people for the business. You will also have an excellent telephone manner and will be looking for a job that gives you the opportunity to progress through your own hard work. <br><br><strong>The benefits<\/strong><\/p> <p>You will be paid a good basic salary and will also be able to earn bonuses based on your achievements. We provide excellent training and graduate career development, as well as team and individual incentive schemes, company events (such as Goodwood races and boat trips) and a wide range of additional benefits. <\/p> <p>The benefits we offer are:<\/p> <p>- A generous basic salary as well as bonus and commission.<\/p> <p>- A first year total package of around \\u00a324K OTE<\/p> <p>- A clearly defined career path, including a car allowance scheme after a qualifying period.<\/p> <p>- Comprehensive graduate training, mentoring and development.<\/p> <p>- A private Healthcare scheme and a sporty culture<\/p> <p>- An environment that rewards individual achievements<\/p> <p>- Charity Dress down days, Early finishes on Fridays, Golf club membership, Company events, such as Goodwood Races, Go-karting, Bowling, Christmas &amp; Summer parties, regular team lunches and nights out.<\/p> <p>To apply for this job, you<strong> must be eligible to live and work in the UK.<\/strong><\/p>\"}"
}