{
    "id":"Kaggle::techmap::614d8945a2b40b64d3121dbd::linkedin_ng::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"\"She will support...\" explicit bias for female applicants.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" About TechHerNG. Tech. Her is a training, coaching, mentoring and research social enterprise for women and girls. We aim to bridge the knowledge gap between gender and technology to empower women for personal and social transformation. At Tech. Her, we believe that if women are exposed to the ways technology enables their daily activities, they will be more productive and empowered to have a voice in their community. We are looking to hire a highly motivated candidate to join our programme team as a full-time Programs Officer. She will support the team in the implementation of multiple projects especially our digital literacy project across secondary schools. Applicants must have fair experience working on development projects and possess strong communication, research, project & training support and report writing skills. Any experience with young people, especially in vulnerable settings is a big plus! Key Responsibilities\/Tasks. The Programs Officer will work with TechHers project team under the supervision of the Senior Programmes Officer. Key responsibilities include:. Own the vision and implementation for the digital literacy project. Manage trainers, volunteers, and upskill them for continuity. Support the programme team to deliver project objectives. Plan and execute program activities in a timely and accurate manner. Provide support to the training team and volunteer networks during training events. Assist in budget preparation and expense management activities for programs. Manage, monitor grants and prepare funding reports. Skill\/Requirements:. At least one year of professional experience supporting local\/ international projects is strongly desirable. Experience in conducting research. Experience in supporting training and meetings. Excellent planning and multitasking, communication skills, and ability to work independently. Fast learner and ability to creatively initiate new ideas. Strong organisational skills and attention to detail. Proficiency with Microsoft, Excel, Power. Point and Google workspace applications is required. Required Qualification. University degree in computer science, communication, or other social sciences. Evidence of continued personal development is welcome. How to Apply. Interested candidates should send a one-page cover letter and a detailed resume as one PDF document to techherng. com on or before September 20th, 2021. Only applications sent in the required format will be considered, and shortlisted candidates will be contacted. Tech. Her is an equal opportunity employer and does not discriminate on the basis of disability, sex, tribe, religion, etc. Qualified women are strongly encouraged to apply.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d8945a2b40b64d3121dbd::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"TechHerNG\", \"position\": \"Program Officer\", \"notes\": \"\", \"original\": \"<p>About TechHerNG<\/p><p>TechHer is a training, coaching, mentoring and research social enterprise for women and girls. We aim to bridge the knowledge gap between gender and technology to empower women for personal and social transformation. At TechHer, we believe that if women are exposed to the ways technology enables their daily activities, they will be more productive and empowered to have a voice in their community.<\/p><p><br><\/p><p>We are looking to hire a highly motivated candidate to join our programme team as a full-time Programs Officer. She will support the team in the implementation of multiple projects especially our digital literacy project across secondary schools. <\/p><p><br><\/p><p>Applicants must have fair experience working on development projects and possess strong communication, research, project &amp; training support and report writing skills. Any experience with young people, especially in vulnerable settings is a big plus!<\/p><p><br><\/p><p>Key Responsibilities\/Tasks<\/p><p><br><\/p><p>The Programs Officer will work with TechHer\\u2019s project team under the supervision of the Senior Programmes Officer. Key responsibilities include:<\/p><p><br><\/p><p>- Own the vision and implementation for the digital literacy project <\/p><p>- Manage trainers, volunteers, and upskill them for continuity <\/p><p>- Support the programme team to deliver project objectives <\/p><p>- Plan and execute program activities in a timely and accurate manner.<\/p><p>- Provide support to the training team and volunteer networks during training events<\/p><p>- Assist in budget preparation and expense management activities for programs.<\/p><p>- Manage, monitor grants and prepare funding reports.<\/p><p><br><\/p><p>Skill\/Requirements:<\/p><p><br><\/p><p>- At least one year of professional experience supporting local\/ international projects is strongly desirable.<\/p><p>- Experience in conducting research<\/p><p>- Experience in supporting training and meetings <\/p><p>- Excellent planning and multitasking, communication skills, and ability to work independently<\/p><p>- Fast learner and ability to creatively initiate new ideas.<\/p><p>- Strong organisational skills and attention to detail.<\/p><p>- Proficiency with Microsoft, Excel, PowerPoint and Google workspace applications is required.<\/p><p><br><\/p><p>Required Qualification<\/p><p><br><\/p><p>- University degree in computer science, communication, or other social sciences. Evidence of continued personal development is welcome. <\/p><p><br><\/p><p>How to Apply<\/p><p><br><\/p><p>Interested candidates should send a one-page cover letter and a detailed resume as one PDF document to achenyo@techherng.com on or before September 20th, 2021. Only applications sent in the required format will be considered, and shortlisted candidates will be contacted. <\/p><p><br><\/p><p>TechHer is an equal opportunity employer and does not discriminate on the basis of disability, sex, tribe, religion, etc. Qualified women are strongly encouraged to apply.<\/p>\"}"
}