{
    "id":"Kaggle::techmap::61599f424f7e275ed8e59c3f::seek_au::4",
    "label_age":true,
    "analysis_age":"\" a dynamic & energetic person\" might discourage an older person from applying.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"About the business. SEQ Ice Cream is a FMCG Distribution Company who distributes Streets & Ben & Jerry's Ice cream to the Route Trade throughout South East QLD. We are a highly motivated and passionate business delivering excellence in customer service. The team adopts a winning culture, whereby, both individual and team performance is encouraged and recognised. About the role. We are looking for a dynamic & energetic person who will enjoy servicing new & existing customers across South East QLD including the Gold Coast, Sunshine Coast & Brisbane. You will be required to deliver everyone's favorite ice creams on set runs in our modern fleet of trucks. If you enjoy developing customer relationships, merchandise stock to look its best and promoting brands loved by so many then this is for you. Applications close Sunday 17th October 2021. Benefits and perks. Work in a dynamic and energetic team with market leading brands like Ben & Jerry's, Paddle Pop, Magnum and more. Enjoy the outdoors and the interaction with an exciting variety of customers. The role is Monday-Friday with early starts that free up your afternoons. All while working in some of Southeast QLD's best locations from the Gold Coast to the Sunny Coast. Opportunities arise to progress within a growing business. Skills and experience. The successful candidate MUST hold a current MR truck drivers license OR greater with a minimum of 2 years driving experience. A solid experience in customer service is essential along with the ability to operate a hand held device and problem solve on the go.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61599f424f7e275ed8e59c3f::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"SEQ Ice Cream Pty Ltd\", \"position\": \"Delivery Driver\/Customer Service Representative\", \"notes\": \"\", \"original\": \"<p><strong>About the business<\/strong><\/p><p>SEQ Ice Cream is a FMCG Distribution Company who distributes Streets &amp; Ben &amp; Jerry's Ice cream to the Route Trade throughout South East QLD.<\/p><p>We are a highly motivated and passionate business delivering excellence in customer service.<\/p><p>The team adopts a winning culture, whereby, both individual and team performance is encouraged and recognised.<\/p><p>\\u00a0<\/p><p><strong>About the role<\/strong><\/p><p>We are looking for\\u00a0a dynamic &amp; energetic person who will enjoy servicing new &amp; existing customers across South\\u00a0East QLD including the Gold Coast, Sunshine Coast &amp; Brisbane. You\\u00a0will be required to deliver\\u00a0everyone's favorite ice creams on set runs\\u00a0in our modern fleet of trucks. If you enjoy developing\\u00a0customer relationships, merchandise stock to look its best and\\u00a0promoting brands loved by so many then this is for you.<\/p><p><strong>Applications close Sunday 17th October 2021<\/strong><\/p><p>\\u00a0<\/p><p><strong>Benefits and perks<\/strong><\/p><p>Work\\u00a0in\\u00a0a dynamic and energetic team with market leading brands like Ben &amp; Jerry's, Paddle Pop, Magnum and more.\\u00a0Enjoy\\u00a0the outdoors and the interaction with an\\u00a0exciting variety of customers. The role is Monday-Friday with\\u00a0early starts that free\\u00a0up your afternoons. All while working in some of Southeast QLD's best locations from the\\u00a0Gold Coast to the Sunny Coast.<\/p><p>Opportunities arise to progress within a growing business.\\u00a0<\/p><p>\\u00a0<\/p><p><strong>Skills and experience<\/strong><\/p><p>The successful candidate <strong>MUST\\u00a0hold a current\\u00a0MR truck drivers license OR greater with\\u00a0a\\u00a0minimum of 2 years driving experience<\/strong>. A solid experience in customer service\\u00a0is essential along with the ability to operate a hand held device and problem solve on the go. Hold\\u00a0a sound knowledge of Brisbane, Gold Coast or Sunny Coast suburbs and be able to plan\\u00a0and manager your day efficiently.<\/p><p>\\u00a0<\/p>\"}"
}