{
    "id":"Kaggle::techmap::614482a2ce85b02e20997a51::seek_au::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The term \"culture fit\" can be problematic as it is often undefined and subjective, potentially leading to discrimination against candidates who do not share similar backgrounds or characteristics with current employees, which can inhibit diversity within the team.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The emphasis on \"down to earth\" and \"driven people,\" while intended to describe desirable qualities, can be interpreted subjectively and might influence the recruitment process based on the personal biases of the selectors.",
    "verified":true,
    "synthetic":false,
    "text":"About Reece. We are Australia's most successful supplier of plumbing and bathroom products, with over 600 stores across Australia with over 4, 500 staff and thousands of products. Reece is different. We're a successful national company that doesn't like to make a fuss of our success. We're a big business that works hard to retain the great things from when we were a small business. Our Onsite business unit is focused on driving the success of our customers through end-to-end supply solutions. We cater for the unique volume requirements of Australia's largest Volume Home Builders. The Onsite team in Pemulwuy, like the broader Reece team, are committed, down to earth and driven people striving for greatness everyday. The Opportunity. In the role of Volume Builder BDM\/Account Specialist, you would be part of a tight knit, successful team focused on delivering the highest level of customer service and satisfaction in a fast-paced environment. This role offers the opportunity to take ownership of and drive significant sales growth with some of Australia's largest Volume Home Builders. You would focus on new business opportunities while also working closely with our key customers. The successful applicant will be able to form multi-level strategic relationships and be comfortable dealing with all stakeholders. Key responsibilities would include developing new business, establishing strong working relationships with current customers and their staff across all levels, supported by a high level of expertise. Your Learning & Development. Reece prioritises career development for internal staff, and demonstrated success in this role would set you up for further opportunities for development and growth within our large national organisation. Our Ideal Candidate. We are looking for strong relationship building skills, high customer service focus, attention to detail, accountability and an exceptional ability to communicate at all levels. Good negotiating skills, a collaborative approach and the ability to think strategically and identify opportunities would support success in this role. Previous BDM\/Account Manager experience particularly within the construction\/development industry, would be valued but we are also open to other relevant work experience. Need to be comfortable chasing new relationships. We value common sense and culture fit as highly as university degrees and grades. A valid driver's licence and relevant PC skills is required. Experience with CRM systems is preferred.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614482a2ce85b02e20997a51::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Reece\", \"position\": \"Volume Builder BDM\/Account Specialist - Sydney\", \"notes\": \"\", \"original\": \"<p><strong>About Reece<\/strong><br \/> <br \/> We are Australia's most successful supplier of plumbing and bathroom products, with over 600 stores across Australia with over 4,500 staff and thousands of products. Reece is different. We're a successful national company that doesn't like to make a fuss of our success. We're a big business that works hard to retain the great things from when we were a small business.<br \/> <br \/> Our Onsite business unit is focused on driving the success of our customers through end-to-end supply solutions; we cater for the unique volume requirements of Australia's largest Volume Home Builders. The Onsite team in Pemulwuy, like the broader Reece team, are committed, down to earth and driven people striving for greatness everyday.<br \/> <br \/> <strong>The Opportunity<\/strong><br \/> <br \/> In the role of Volume Builder BDM\/Account Specialist, you would be part of a tight knit, successful team focused on delivering the highest level of customer service and satisfaction in a fast-paced environment. This role offers the opportunity to take ownership of and drive significant sales growth with some of Australia's largest Volume Home Builders. You would focus on new business opportunities while also working closely with our key customers. The successful applicant will be able to form multi-level strategic relationships and be comfortable dealing with all stakeholders.<br \/> <br \/> Key responsibilities would include developing new business, establishing strong working relationships with current customers and their staff across all levels, supported by a high level of expertise. The right person will be one who embraces teamwork and be willing to form strong internal and external relationships.<br \/> <br \/> <strong>Your Learning &amp; Development<\/strong><br \/> <br \/> Reece prioritises career development for internal staff, and demonstrated success in this role would set you up for further opportunities for development and growth within our large national organisation.<br \/> <br \/> <strong>Our Ideal Candidate<\/strong><br \/> <br \/> We are looking for strong relationship building skills, high customer service focus, attention to detail, accountability and an exceptional ability to communicate at all levels. Good negotiating skills, a collaborative approach and the ability to think strategically and identify opportunities would support success in this role.<br \/> <br \/> Previous BDM\/Account Manager experience particularly within the construction\/development industry, would be valued but we are also open to other relevant work experience.<br \/> <br \/> Need to be comfortable chasing new relationships. We value common sense and culture fit as highly as university degrees and grades<br \/> <br \/> A valid driver's licence and relevant PC skills is required; experience with CRM systems is preferred. If you enjoy having opportunities to grow the business and be rewarded for it, and you have a passion for customers, you will thrive in our dynamic and fun environment.<br \/> <br \/> <strong>A Career and More<\/strong><br \/> <br \/> You will receive a competitive remuneration package in this role, including all necessary tools of the trade. The Pemulwuy office facilities are new, state-of-the-art facilities and staff parking is available onsite. Per<br \/> <br \/> If this sounds like the opportunity you've been looking for and you are driven business growth and customer service, we would love to hear from you - apply today!<\/p>\"}"
}