{
    "id":"Kaggle::techmap::6157540394a53f7ddb82f755::linkedin_co::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"The phrase \"We want results, not a 9 to 5 machine\" implies a preference for a high-intensity, results-driven work culture, which can resonate more with masculine-coded traits such as competitiveness and assertiveness.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":true,
    "analysis_sexuality":"The term \"Nice guys and girls\" reinforces a binary view of gender, which may exclude non-binary individuals.",
    "label_general":true,
    "analysis_general":"The phrase \"When we go to the Amsterdam conferences, we take care of the weed\" uses informal and inappropriate language, which may exclude candidates who view such statements as unprofessional. ",
    "verified":true,
    "synthetic":false,
    "text":" We want results, not a 9 to 5 machine. Nice guys and girls, part of a small but enthusiastic team, with plenty of crazy ideas. Plenty about fintech and crypto. 0 ordinary days (When we go to the Amsterdam conferences, we take care of the. weed). A great medium to grow and share ideas. Ownership of your work. Here's why you would work for a stable & profitable startup: Tons of events in places like Lisbon, Bucharest, Los Angeles, Las Vegas, Amsterdam, Colombia, Prague, etc. Work remotely from anywhere on earth. Time for continuous learning, access to audible, paper books of your choice and attend any conference (Yes, we strongly believe in your better professional self! ) A great context to grow and share ideas. Very competitive compensation package. What's in it for you: Learning policy 8020%. we cover 80% of your learning costs related to your job activity, you cover the remainder 20% for commitment. Annual paid leave of 20 working days. Paid days off for medical leave and COVID-positive cases. Medical subscription. Reimbursement for COVID tests related costs. Birthday bonus. Year-end bonus based on the seniority in the Company. Team activities. Need\/want something else and didnt identify above? Tell us more! We are looking for noisy people :).",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6157540394a53f7ddb82f755::linkedin_co\", \"source\": \"linkedin_co\", \"country\": \"CO\", \"company\": \"Minutizer\", \"position\": \"LATAM Account Manager\", \"notes\": \"\", \"original\": \"<p><strong>\\ud83d\\ude80Your mission:<\/strong>&nbsp;<\/p><p>As an Account Manager you will be the first point of contact and maintain day-to-day relationships for a varied portfolio of our clients. You will be responsible for all administrative and operational tasks along with delivering best practice advice with your clients through face-to-face meetings, industry events and parties, seminars, webinars, and social media. You will work closely with Studios and Performers from the Live Cam industry across the LATAM region and other Spanish speaking countries.<\/p><p>It\\u2019s a really exciting time for us and particularly within the Account Management team which supports a significant base of emerging and established studios and performers. We do things differently and are well placed to make the most of the changing face of the industry. Your role managing some of the hottest \\ud83d\\udd25 talent and studios, in a cutting-edge team will be an exciting challenge!<\/p><p>&nbsp;<\/p><p><strong>\\ud83c\\udf0eLocation:&nbsp;<\/strong>You can work fully remote from anywhere you want!<\/p><p>&nbsp;<\/p><p><strong>\\ud83e\\uddeaMain responsibilities:<\/strong><\/p><ul><li>Interact and communicate directly with clients, internal and external<\/li><li>Offer support on forums &amp; niched communities<\/li><li>\\u2708\\ufe0fTravel throughout the&nbsp;<strong>\\ud83c\\udf0e<\/strong>&nbsp;and participate in industry trade shows and parties<\/li><li>Participate in seminars, offering our insight to the industry<\/li><li>Prepare and execute a monthly strategy designed to improve your portfolio\\u2019s total performance<\/li><li>Improve and create patterns and processes to streamline the interaction and communication<\/li><li>Help develop the product with valuable input gathered<\/li><li>Work smart: find new ways to spend less time on various repetitive tasks, hack your way to making clients and you smile with confidence<\/li><\/ul><p><br><\/p><p><strong>\\ud83e\\uddf0&nbsp;Tools of the trade:<\/strong><\/p><ul><li>Skype<\/li><li>Discord<\/li><li>HubSpot<\/li><li>TeamViewer<\/li><li>Gmail<\/li><li>Asana<\/li><li>Google Docs<\/li><\/ul><p><br><\/p><p><strong>\\ud83d\\ude97Requirements:<\/strong><\/p><ul><li>A minimum of one year experience in Account Management and Service Orientation or Community Management<\/li><li>Experience in Sales of at least three years&nbsp;<\/li><li>Excellent at prioritizing, time management and serious follow-through skills<\/li><li>Strong team player and decent networking skills<\/li><li>Self-starter with a positive \\u201cyes, can do\\u201d attitude&nbsp;<\/li><li>Making good timely decisions in relatively complex cases and in situations with uncertainty or pressure<\/li><li>Strong Spanish and&nbsp;English communication skills, both written &amp; verbal<\/li><\/ul><p><br><\/p><p><strong>\\u2728Nice to have, but not mandatory:<\/strong><\/p><ul><li>Additional languages are most welcomed, preferably Russian and\/or Ukrainian<\/li><li>Project or Product Management experience<\/li><\/ul><p><br><\/p><p><strong>\\ud83c\\udf81What we would like to share with you is:<\/strong><\/p><ul><li>You can work remotely from anywhere on earth (or our offices in co-working places)<\/li><li>You can choose your own working hours and days, choose your own time zone. We want results, not a 9 to 5 machine.<\/li><li>Nice guys and girls, part of a small but enthusiastic team, with plenty of crazy ideas. Plenty about fintech and crypto.&nbsp;<\/li><li>0 ordinary days (When we go to the Amsterdam conferences, we take care of the...weed)<\/li><li>A great medium to grow and share ideas<\/li><li>Ownership of your work<\/li><\/ul><p><br><\/p><p><strong>\\ud83c\\udf93 Here's why you would work for a stable &amp; profitable startup:<\/strong><\/p><ul><li>Tons of events in places like Lisbon, Bucharest, Los Angeles, Las Vegas, Amsterdam, Colombia, Prague, etc.<\/li><li>Work remotely from anywhere on earth<\/li><li>Time for continuous learning, access to audible, paper books of your choice and *attend any conference (Yes, we strongly believe in your better professional self!)&nbsp;<\/li><li>A great context to grow and share ideas<\/li><li>Very competitive compensation package<\/li><\/ul><p><br><\/p><p><strong>\\ud83c\\udf81&nbsp;What's in it for you:<\/strong><\/p><ul><li>Learning policy 80%\/20% - we cover 80% of your learning costs related to your job activity, you cover the remainder 20% for commitment;<\/li><li>Annual paid leave of 20 working days;<\/li><li>Paid days off for medical leave and COVID-positive cases;<\/li><li>Medical subscription;<\/li><li>Reimbursement for COVID tests related costs;<\/li><li>Birthday bonus;<\/li><li>Year-end bonus based on the seniority in the Company;<\/li><li>Team activities.<\/li><li>Need\/want something else and didn\\u2019t identify above? Tell us more!<\/li><\/ul><p><br><\/p><p>We are looking for noisy people :)&nbsp;<\/p>\"}"
}