{
    "id":"Kaggle::techmap::613859199560e871dcb86a4e::monsterasia_hk::7",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"Preferring candidates from \"top CN local forwarders\" subtly implies a preference for candidates deeply embedded within a specific regional industry context, potentially excluding equally qualified candidates from other regions or international backgrounds who may bring valuable diverse perspectives to the team.",
    "verified":true,
    "synthetic":false,
    "text":"DE ION. Amazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. To serve the goal, Amazon has created one of the most advanced fulfillment and logistic networks in the world. Amazon Global Logistics in China is a team of highly experienced logistics professionals, product & program manager and carrier specialists actively participating in Amazon's international expansion goals. We are seeking some highly motivated individuals who are interested in providing best-in-class logistics service to customers as global logistics operation specialist. The main purpose and responsibilities is to act as control tower on end to end global logistics operation process by focusing on process, procedure and data relevant activities with the aim to standardize process, improve operation efficiency and service quality. Serve as dedicated contact window for the Amazon sellers for Air shipments arrangement from booking receiving to Amazon Fullfillment Center delivery. Deal with origin operations including booking with LSP, Picking-up, CFS handling, export customs clearance etc.,. Perform as escalation point for any abnormal cases and provide proper solution to internal \/ external customers. Follow up origin accessorial charge verification and confirmation. Provide proper transportation solution based on seller's commodity and documents available, like battery or DG shipments. BASIC QUALIFICATIONS. University graduation with 3-5 years working experiences in international forwarders\/or top CN local forwarders with Air Freight, better for similar job function of operations or customer service. Proficient written and oral communication skills in both English and Chinese. Strong sense of responsibility and ownership to meet deadlines, take preemptive measure to avoid freight delay. PREFERRED QUALIFICATIONS. Operation experiences on International E-commerce shipment process is preferable. Strong capability of data analyzing\/deep dive is preferable.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613859199560e871dcb86a4e::monsterasia_hk\", \"source\": \"monsterasia_hk\", \"country\": \"HK\", \"company\": \"Amazon\", \"position\": \"Import & Export Ops Specialist\", \"notes\": \"\", \"original\": \"<br>DE ION<br>Amazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. To serve the goal, Amazon has created one of the most advanced fulfillment and logistic networks in the world.<br>Amazon Global Logistics in China is a team of highly experienced logistics professionals, product & program manager and carrier specialists actively participating in Amazon's international expansion goals. We are seeking some highly motivated individuals who are interested in providing best-in-class logistics service to customers as global logistics operation specialist.<br>The main purpose and responsibilities is to act as control tower on end to end global logistics operation process by focusing on process, procedure and data relevant activities with the aim to standardize process, improve operation efficiency and service quality.<br>. Serve as dedicated contact window for the Amazon sellers for Air shipments arrangement from booking receiving to Amazon Fullfillment Center delivery<br>. Deal with origin operations including booking with LSP, Picking-up, CFS handling, export customs clearance etc.,<br>. Perform as escalation point for any abnormal cases and provide proper solution to internal \/ external customers<br>. Follow up origin accessorial charge verification and confirmation<br>. Provide proper transportation solution based on seller's commodity and documents available, like battery or DG shipments<br>BASIC QUALIFICATIONS<br>. University graduation with 3-5 years working experiences in international forwarders\/or top CN local forwarders with Air Freight, better for similar job function of operations or customer service<br>. Good understanding of International Air freight practice<br>. Proficient written and oral communication skills in both English and Chinese<br>. Strong sense of responsibility and ownership to meet deadlines, take preemptive measure to avoid freight delay<br>PREFERRED QUALIFICATIONS<br>. Operation experiences on International E-commerce shipment process is preferable<br>. Strong capability of data analyzing\/deep dive is preferable<br>\"}"
}