{
    "id":"Kaggle::techmap::6145d2e0e6c602312c32e4f9::linkedin_dk::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Working Conditions. Works in office areas as well as throughout the nursing service area (drug rooms, nurses station, resident rooms, etc. ). Moves intermittently during work hours. Is subject to frequent interruptions. Is involved with residents, personnel, visitors, government agencies\/personnel, under all conditions and circumstances. Is subject to hostile and emotionally upset residents, family members, personnel and visitors. Communicates with the medical staff, nursing personnel and other department supervisors. Works beyond normal working hours and in other positions temporarily, when necessary. Is subject to callback during emergency conditions. Attends and participates in continuing educational programs. Is subject to exposure to infectious waste, diseases, conditions, etc. including TB and the AIDS and Hepatitis B viruses. Is subject to injury from falls, burns from equipment, odors, etc., throughout the workday, as well as to reactions from dust, plastics, synthetics, disinfectants, tobacco smoke, and other potential contaminants. May be subject to the handling of and exposure to hazardous chemicals. Maintains a liaison with the resident, their families, support departments, etc. to adequately plan for the residents needs. JOB REQUIREMENTS: Education. Must possess a Nursing Degree from an accredited college or university, or be a graduate of an approved school of professional nursing. Experience. A minimum of one year nursing experience required. Supervisory experience with Nursing Assistants. Long Term Care and MDS\/RAI experience strongly desired. Specific Requirements. Must possess a current, unencumbered, active license to practice as an RN in this state. At least six (6) months as a staff nurse in a long-term care facility. Must be able to read, write, speak and understand the English language. Must display professionalism both in appearance and attitude. Must possess the ability to solve problems and make independent decisions when circumstances warrant such action. Must possess the ability to deal tactfully with personnel, residents, family members, visitors, government agency personnel and the general public. Must be knowledgeable of nursing and medical practices and procedures, as well as laws, regulations, and guidelines that pertain to long-term care. Must possess the ability and the willingness to work harmoniously with and to coach and supervise other personnel. Must be able to plan, organize, develop, implement and interpret the programs, goals, objectives, policies and procedures that are necessary for providing quality care. Must have patience, tact, a cheerful disposition and enthusiasm, as well as the willingness to handle difficult personnel.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145d2e0e6c602312c32e4f9::linkedin_dk\", \"source\": \"linkedin_dk\", \"country\": \"DK\", \"company\": \"Vanguard Healthcare Services, LLC\", \"position\": \"Registered Nurse (RN) - 1500 Sign-On Bonus\", \"notes\": \"\", \"original\": \"<strong><u>Job Summary<br><br><\/u><\/strong>The primary purpose of your job position is to provide direct nursing care to the residents, and to supervise the day-to-day nursing activities performed by licensed practical nurses and nursing assistants.<br><br><strong>JOB DUTIES and RESPONSIBILITIES: <\/strong> <strong>Administrative Functions<br><\/strong><ul><li>Organize and assign all jobs to be done on tour of duty so that workload is evenly distributed among nursing personnel on the basis of staff qualifications, size and physical layout of the facility.<\/li><li>Periodically review department policies, procedures and job descriptions and make recommendations for revisions.<\/li><li>Implement established policies and procedures. <\/li><li>Ensure that all nursing personnel assigned to you comply with the written policies and procedures established by this facility.<\/li><li>Meet with your assigned nursing staff and support personnel to plan appropriate services, programs and activities for your shift.<\/li><li>Cooperate with other resident services when coordinating nursing services to ensure that the resident\\u2019s individual care plans are being followed.<\/li><li>Participate in the development, maintenance, and implementation of the facility\\u2019s quality assurance program.<\/li><li>Request conferences with the Director of Nursing as needed to discuss resident, personnel and facility related business.<\/li><li>Participate in facility surveys made by authorized regulatory agencies as requested.<\/li><li>Periodically review the resident\\u2019s written discharge plan and participate in updating that plan as required.<\/li><li>Admit, transfer and discharge residents as required.<\/li><li>Place and receive, personally, all calls to and from physicians.<\/li><\/ul> <strong>Charting and Documentation<br><\/strong><ul><li>Assist in updating the resident care plans as instructed by the MDS\/Care Plan Coordinator and\/or Director of Nursing.<\/li><li>Chart nurses\\u2019 notes in an informative and descriptive manner that reflects the care provided to the resident, as well as the resident\\u2019s response to the care.<\/li><li>Document status of each resident on the chart at least weekly, more often if significant change occurs or as directed. Follow up with monthly and quarterly summaries as instructed.<\/li><li>Make rounds with physician, as directed, and record visits in resident\\u2019s chart.<\/li><li>Transcribe, accurately and promptly, all physician\\u2019s orders.<\/li><li>Direct documentation and make weekly detailed evaluation of all resident documentation so that chart reflects progress and condition of resident at all times.<\/li><li>Approve and sign charts when observations are made.<\/li><li>Insure that all medications and treatments are charted and signed following administration of the medication\/treatment, by the administering person.<\/li><li>Report all discrepancies noted concerning physician\\u2019s orders, diet change, charting error, etc. to the ADON or DON.<\/li><li>Complete accurate accident\/incident reports as necessary.<\/li><li>Fill out and complete transfer forms in accordance with established procedures.<\/li><\/ul> <strong>Drug Administration Functions<br><\/strong><ul><li>Prepare and administer medications as ordered by physician.<\/li><li>Verify the identity of the resident before administering the medication\/treatment.<\/li><li>Ensure that prescribed medication for one resident is not administered to another.<\/li><li>Ensure that an adequate supply of floor stock medications, supplies, and equipment are on hand to meet the nursing needs of the residents. <\/li><li>Order prescribed medications, supplies, and equipment as necessary and in accordance with established policies.<\/li><li>Ensure that narcotic records are accurate for your shift.<\/li><li>Notify the ADON or DON of all drug and narcotic discrepancies noted on your shift.<\/li><li>Prepare, administer and record all parenteral, intramuscular, sub-cutaneous injections.<\/li><li>Administer I.V. fluid therapy in accordance with policy and procedure.<\/li><li>Administer or supervise all treatments prescribed by physician.<\/li><li>Dispose of drugs and narcotics as required and in accordance with established procedures.<\/li><\/ul> <strong>Nursing Care Functions<br><\/strong><ul><li>Implement and maintain established nursing objectives and standards.<\/li><li>Make rounds at least every two (2) hours to ensure that certified nursing assistants are properly administering prescribed care assignments.<\/li><li>Make general observation and evaluation of the resident\\u2019s physical and emotional status. Make note of any significant changes and communicate those changes to the ADON\/DON according to facility policy and protocol.<\/li><li>Ensure that direct nursing care is provided by a licensed nurse, a certified nursing assistant, and\/or a nurse aide trainee qualified to perform the procedure.<\/li><li>Cooperate with and coordinate social and activity programs with nursing service schedules.<\/li><li>Notify the resident\\u2019s physician and\/or next of kin when the resident is involved in an accident\/incident or if there is a significant change in the resident\\u2019s condition.<\/li><li>Cooperate with restorative and rehabilitative programs as requested.<\/li><li>Inspect the treatment areas to ensure they are maintained in a clean and safe manner.<\/li><li>Administer professional services such as: catheterization, tube feedings, suction, applying and changing dressings, packs colostomy and drainage bags, taking blood, giving massages and range of motion exercises, care for the dead\/dying, etc. as required.<\/li><li>Administer restraints for residents in accordance with physician\\u2019s orders, established policies and procedures.<\/li><li>Obtain sputum, urine and other specimens for lab tests as ordered.<\/li><li>Take and record TPR\\u2019s, blood pressures, etc. as necessary.<\/li><li>Monitor seriously ill residents as necessary.<\/li><li>Check foods brought into the facility by the resident\\u2019s family\/visitors to ensure it is within the resident\\u2019s dietary allowances. Report problems to the ADON\/DON.<\/li><li>Ensure that personnel providing direct care to residents are providing such care in accordance with the resident\\u2019s care plan and wishes.<\/li><li>Ensure that residents who are unable to call for help are checked frequently.<\/li><li>Meet with residents, and\/or family members, as necessary. Report problems\/complaints promptly to the ADON\/DON.<\/li><li>Admit, transfer and discharge residents as necessary.<\/li><li>Ensure that discharged residents are escorted to the pick-up area.<\/li><li>Inform family members of the death of the resident.<\/li><li>Ensure that established postmortem procedures are followed.<\/li><li>Conduct week skin checks as assigned.<\/li><\/ul> <strong>Human Resource Functions<br><\/strong><ul><li>Assist the SDC in developing, planning, conducting and scheduling in-service training classes that meet the skill development and knowledge acquisition needs of your assigned staff.<\/li><li>Implement and maintain an effective \\u201cunit\/shift\/floor\\u201d orientation for new associates. <\/li><li>Assist in standardizing the methods in which work will be accomplished.<\/li><li>Respond to need for staffing shortages by arranging replacement staff, as directed.<\/li><li>Conduct performance evaluations for your assigned staff according to facility policy i.e., following orientation and annually.<\/li><li>Review and evaluate your department\\u2019s work force and make recommendations to the ADON\/DON.<\/li><li>Develop work assignments for nursing staff on your shift.<\/li><li>Provide leadership to nursing personnel assigned to your shift.<\/li><li>Make daily rounds of your unit to ensure that nursing service personnel are performing their work assignments in accordance with acceptable nursing standards.<\/li><li>Meet with your shift\\u2019s nursing personnel, on a regularly scheduled basis, to assist in identifying and correcting problem areas and\/or improve services.<\/li><li>Develop and maintain a good working rapport with inter-departmental personnel to ensure that nursing services can be adequately maintained to meet the needs of the residents.<\/li><li>Create and maintain an atmosphere of warmth, personal interest and positive emphasis, as well as a calm, quiet environment throughout the unit and shift.<\/li><li>Review complaints made by your assigned personnel.<\/li><li>Ensure that disciplinary action is administered fairly and in accordance with established facility disciplinary procedures.<\/li><li>Receive\/give the nursing reports during shift change.<\/li><li>Report occupational exposures to blood, body fluids, infectious materials, and hazardous chemicals in accordance with the facility\\u2019s policies and procedures.<\/li><li>Attend monthly in-service education programs in order to stay current in your profession and meet facility educational requirements.<\/li><\/ul> <strong>Safety and Sanitation Functions<br><\/strong><ul><li>Monitor your assigned personnel to ensure that they are following established safety regulations.<\/li><li>Assist the Infection Control Coordinator in identifying, evaluating and classifying routine and job-related functions to ensure that tasks in which there are potential exposure to blood\/body fluids are properly identified and recorded.<\/li><li>Ensure that all personnel participate in appropriate in-service training programs prior to performing any tasks that involve exposure to blood\/body fluids.<\/li><li>Ensure that your assigned work areas are maintained in a clean and sanitary manner.<\/li><li>Ensure that your assigned personnel follow established Universal Precautions and infection control procedures.<\/li><li>Ensure that your assigned personnel participate in and conduct all fire safety and disaster preparedness drills in a safe and professional manner.<\/li><li>Ensure that an MSDS Manual is properly labeled and readily available at the nurses\\u2019 station and that all your assigned personnel are oriented to the location and use of the manual.<\/li><li>Ensure that all personnel operate nursing service equipment in a safe manner.<\/li><\/ul> <strong>Care Plan and Assessment Functions<br><\/strong><ul><li>Review care plans daily to ensure appropriate care is being given.<\/li><li>Ensure that your nurses\\u2019 notes reflect that the care plan is being followed as written.<\/li><li>Review resident care plans for appropriate resident goals, problems, approaches, and revisions based on nursing needs.<\/li><li>Ensure that your assigned CNAs are aware of the resident care plans and refer to the plan prior to administering daily care to the residents.<\/li><li>Assist the Resident Assessment\/Care Plan Coordinator in planning, scheduling, and revising the MDS, including the implementation of RAPs and Triggers.<\/li><\/ul> <strong>Miscellaneous<br><\/strong><ul><li>Provide data to the Quality Assurance and Assessment Committee as requested.<\/li><\/ul> <strong>Resident Rights Responsibilities<br><\/strong><ul><li>Maintain the confidentiality of all resident care information.<\/li><li>Monitor nursing care to ensure that all residents are treated fairly, and with dignity, kindness and respect.<\/li><li>Ensure that all nursing care is provided in privacy and that nursing service personnel knock before entering the resident\\u2019s room.<\/li><li>Ensure that all nursing service personnel are knowledgeable of and honor the residents\\u2019 responsibilities and rights including the right to refuse treatment.<\/li><li>Review complaints and grievances made by the resident and make a written\/oral report to the Charge Nurse indicating what action(s) were taken to resolve the complaint or grievance. Follow the facility\\u2019s established procedures.<\/li><li>Maintain a written record of the resident\\u2019s complaints and\/or grievances that indicates the action taken to resolve the complaint and the current status of the complaint.<\/li><li>Report and investigate all allegations of resident abuse and\/or misappropriation of resident property.<\/li><\/ul> <strong>Working Conditions<br><\/strong><ul><li>Works in office areas as well as throughout the nursing service area (drug rooms, nurses\\u2019 station, resident rooms, etc.)<\/li><li>Moves intermittently during work hours.<\/li><li>Is subject to frequent interruptions.<\/li><li>Is involved with residents, personnel, visitors, government agencies\/personnel, under all conditions and circumstances.<\/li><li>Is subject to hostile and emotionally upset residents, family members, personnel and visitors.<\/li><li>Communicates with the medical staff, nursing personnel and other department supervisors.<\/li><li>Works beyond normal working hours and in other positions temporarily, when necessary.<\/li><li>Is subject to callback during emergency conditions.<\/li><li>Attends and participates in continuing educational programs.<\/li><li>Is subject to exposure to infectious waste, diseases, conditions, etc. including TB and the AIDS and Hepatitis B viruses.<\/li><li>Is subject to injury from falls, burns from equipment, odors, etc., throughout the workday, as well as to reactions from dust, plastics, synthetics, disinfectants, tobacco smoke, and other potential contaminants.<\/li><li>May be subject to the handling of and exposure to hazardous chemicals.<\/li><li>Maintains a liaison with the resident, their families, support departments, etc. to adequately plan for the residents\\u2019 needs.<\/li><\/ul> <strong>JOB REQUIREMENTS: <\/strong> <strong>Education<br><\/strong><ul><li>Must possess a Nursing Degree from an accredited college or university, or be a graduate of an approved school of professional nursing. <\/li><\/ul> <strong>Experience<br><\/strong><ul><li>A minimum of one year nursing experience required.<\/li><li>Supervisory experience with Nursing Assistants.<\/li><li>Long Term Care and MDS\/RAI experience strongly desired.<\/li><\/ul> <strong>Specific Requirements<br><\/strong><ul><li>Must possess a current, unencumbered, active license to practice as an RN in this state.<\/li><li>At least six (6) months as a staff nurse in a long-term care facility.<\/li><li>Must be able to read, write, speak and understand the English language.<\/li><li>Must display professionalism both in appearance and attitude.<\/li><li>Must possess the ability to solve problems and make independent decisions when circumstances warrant such action.<\/li><li>Must possess the ability to deal tactfully with personnel, residents, family members, visitors, government agency personnel and the general public.<\/li><li>Must be knowledgeable of nursing and medical practices and procedures, as well as laws, regulations, and guidelines that pertain to long-term care.<\/li><li>Must possess the ability and the willingness to work harmoniously with and to coach and supervise other personnel.<\/li><li>Must be able to plan, organize, develop, implement and interpret the programs, goals, objectives, policies and procedures that are necessary for providing quality care.<\/li><li>Must have patience, tact, a cheerful disposition and enthusiasm, as well as the willingness to handle difficult personnel.<\/li><li>Must be willing to seek out new methods and principles and be willing to incorporate them into existing nursing practices.<\/li><li>Must be able to relate information concerning a resident\\u2019s condition.<\/li><li>Must not pose a direct threat to the health or safety of other individuals in the workplace.<br><\/li><\/ul>We are an Equal Opportunity Employer\"}"
}