{
    "id":"Kaggle::techmap::614c4823bfb8e7511d3b291a::careerbuilder_us::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Responsibilities. To learn more about our maintenance technician job click here: [Link available when viewing the job] \/>. Related Man agement is currently seeking an experienced Maintenance Technician to join us at a 489 unit affordable community in Springfield, MA. Responsibilities include : Completion of resident work orders (general repairs, plumbing, appliance repairs). Prepare vacant units for future renters. Upkeep of the grounds, amenities (pools, etc. ), and BBQ grills (indoor\/outdoor). Ensure all equipment is in working condition and follow preventative maintenance schedule. Communicate with the Service Supervisor about unsafe or hazardous environments on the property. Benefits: Co mprehensive Medical, Dental, Vision, Life, Disability & Flexible Spending Accounts. Paid Time Off & holidays. 401(K). Tuition reimbursement. Robust modern fertility program. Incentive bonus program. Commuter benefits. Employee Assistance Program & more! Qualifications. 2 years of exp erience in general maintenance. Affordable housing experience preferred. HVAC : repairs, cleans, replaces, etc. Plumbing : repair s, replace parts, installation. Carpentry : repairs and installs doors, shelves, countertops, locks, etc. Painting : drywall\/plaster repairs, painting. Electrical\/Appliance : lighting, wiring, power circu its, replacing switches, etc. Must able to lift 50LBS and stand for 8 hours. *E mergency on-call rotation is required. Please note that Related has adopted a COVID-19 vaccination policy to safeguard the health and well-being of our employees. #AE1. Overview. Related Management Company (RMC) is the owner and operator of a premier portfolio of assets valued at over $60 billion. Our operating portfolio consists of a diversified mix of properties including luxury rental buildings, retail and commercial space, luxury condominium residences, affordable and workforce housing located throughout the United States. As the owner and developer for the majority of the RMC portfolio, we have ensured that our buildings are the best assets in their respective submarkets. We provide a diligently maintained property management platform with dedicated professionals who consistently exceeds our residents' and commercial tenants' expectations. Our dedication to providing the highest and most personalized level of service is one of the hallmarks of the company and a key differentiator in the market.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c4823bfb8e7511d3b291a::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Related Companies\", \"position\": \"Maintenance Technician\", \"notes\": \"\", \"original\": \"<b>Responsibilities<\/b><br \/><br \/>To learn more about our maintenance technician job click here: [Link available when viewing the job] \/><br \/>Related Man agement is currently seeking an experienced Maintenance Technician to join us at a 489 unit affordable community in Springfield, MA. Responsibilities include :<br \/><br \/><ul><li> Completion of resident work orders (general repairs, plumbing, appliance repairs) <\/li><li> Prepare vacant units for future renters <\/li><\/ul><ul><li> Upkeep of the grounds, amenities (pools, etc.), and BBQ grills (indoor\/outdoor) <\/li><li> Ensure all equipment is in working condition and follow preventative maintenance schedule <\/li><li> Communicate with the Service Supervisor about unsafe or hazardous environments on the property <\/li><\/ul><br \/><br \/><strong> Benefits: <\/strong> <br \/><ul><li> Co mprehensive Medical, Dental, Vision, Life, Disability & Flexible Spending Accounts <\/li><\/ul><ul><li> Paid Time Off & holidays <\/li><li> 401(K) <\/li><li> Tuition reimbursement <\/li><li> Robust modern fertility program <\/li><li> Incentive bonus program <\/li><\/ul><ul><li> Commuter benefits <\/li><li> Employee Assistance Program & more! <\/li><\/ul> <br \/> <b>Qualifications<\/b><br \/> <br \/> <ul><li> 2 years of exp erience in general maintenance <\/li><li> Affordable housing experience preferred <\/li><\/ul><ul><li> <strong> HVAC <\/strong> : repairs, cleans, replaces, etc. <\/li><li> <strong> Plumbing <\/strong> : repair s, replace parts, installation <\/li><li> <strong> Carpentry <\/strong> : repairs and installs doors, shelves, countertops, locks, etc. <\/li><li> <strong> Painting <\/strong> : drywall\/plaster repairs, painting <\/li><li> <strong> Electrical\/Appliance <\/strong> : lighting, wiring, power circu its, replacing switches, etc. <\/li><\/ul><ul><li> Must able to lift 50LBS and stand for 8 hours <\/li><\/ul><br \/><br \/><strong> *E <\/strong><strong> mergency on-call rotation is required <\/strong><br \/><br \/><strong> Please note that Related has adopted a COVID-19 vaccination policy to safeguard the health and well-being of our employees. As a condition of employment, Related employees working on-site are required to be fully vaccinated for COVID-19, unless a reasonable accommodation is approved or as otherwise required by law. <\/strong> <br \/><br \/> #AE1 <br \/> <br \/> <b>Overview<\/b><br \/><br \/>Related Management Company (RMC) is the owner and operator of a premier portfolio of assets valued at over $60 billion. Our operating portfolio consists of a diversified mix of properties including luxury rental buildings, retail and commercial space, luxury condominium residences, affordable and workforce housing located throughout the United States. <br \/><br \/> As the owner and developer for the majority of the RMC portfolio, we have ensured that our buildings are the best assets in their respective submarkets. We provide a diligently maintained property management platform with dedicated professionals who consistently exceeds our residents' and commercial tenants' expectations. Our dedication to providing the highest and most personalized level of service is one of the hallmarks of the company and a key differentiator in the market. For more please visit www.Related.com . <br \/><br \/> <strong> Related is an Equal Opportunity Employer <\/strong> <br \/><br \/> <strong> For information about how we use your personal information, including information submitted for career opportunities, please review our Privacy Policy at <\/strong> <strong> [Link available when viewing the job] <\/strong> <strong> . <\/strong>&nbsp;\"}"
}