{
    "id":"Kaggle::techmap::6142bc4aa6477d0d25321311::monsterasia_hk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The physical requirements such as \"lifting up to 50lbs\" and \"work involves climbing\" are directly relevant to the duties of managing site facilities and maintaining operations during crisis situations, which may necessitate such physical capabilities.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Lead Site Facilities crisis management during weather events and other anticipated\/unanticipated crisis situations. Includes ability to run site facilities locally as needed to keep operations running. Must Have: Minimum Requirements. Bachelors degree required. Minimum of 5 years of relevant experience, or advanced degree with a minimum of 3 years of relevant experience. Nice to Have Proven ability to manage direct labor staff for successful maintenance of facilities assets. Strong Project Management Skills. Strong communication skills. Ability to prioritize competing demands. Availability after normal working hours. 7 years minimum experience in Mechanical Facilities system engineering. years of supervisory & Leadership experience. Building systems, HVAC, Electrical, structural and building envelope. Software applications including Microsoft Office, CMMS. Experience working in regulated environments. Ability to read and understand blueprints. Building Automation Systems (BAS) Data center management experience. PHYSICAL JOB REQUISITION: Work involves physical exertion in the transporting of various materials or equipment, lifting, moving. Ability to lift up to 50lbs. Work involves climbing. Duties involved frequent exposure to noise, dirt, odors, or similarly unpleasant surroundings. Work may be performed in confined or restricted position or with exposure to temperature\/weather extremes.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6142bc4aa6477d0d25321311::monsterasia_hk\", \"source\": \"monsterasia_hk\", \"country\": \"HK\", \"company\": \"Medtronic Cardiac and Vascular\", \"position\": \"Facilities Manager\", \"notes\": \"\", \"original\": \"<br><strong>Careers that Change Lives<\/strong><br>What does it take to be a leader at Medtronic? We look for inspiring and inclusive leaders who partner with others, knowing that diverse talent, skills, and perspectives lead to better outcomes.<br>As the Facilities Maintenance & Planning Manager you will plan, coordinate, and direct the preventive, predictive, and corrective maintenance programs for all facility infrastructure and related mechanical systems facilities assets at the North Haven Campus. The campus has 4 buildings(~1.8M) and a parking garage for employees. Impact patient outcomes. Come for a job, stay for a career.<br>Surgical Innovations advances minimally invasive surgery to improve outcomes for patients and providers around the globe. From concept to commercialization, we bring meaningful innovation to our robust and growing portfolio of surgical devices and technologies. Through wise investments, thoughtful planning, and world-class partnerships, we help patients get the care they need - from diagnosis to treatment - when they need it.<br><strong>A Day in the Life<\/strong><br>Reporting to the Site Engineering Director you will lead and manage Facilities related mechanical, electrical, plumbing, Building Automation Systems (BAS), LABS, Controlled Environmental Areas (CEA), critical environmental manufacturing and R&D requirements, and other regulated spaces. You will also provide direct and indirect management of site facilities technicians as well as capital and expense budgets associated to Site facilities maintenance and infrastructure support up to $10,000,000.<br>You will:<br>. Direct and supervise maintenance teams for multiple facilities, to include hiring, training, scheduling, communication, facilitating teams, developmental coaching, objective setting, performance management, salary administration, and annual reviews.<br>. Maintain accountability for outside services contracts and execution supporting the facility in areas such as Security and Housekeeping.<br>. Manage facilities budget planning and execution in support of Capital Investment, Energy Management, and Maintenance expenses.<br>. Site wide asset management system ownership, driving Maintenance Excellence (Mex) Principals through operations equipment and support teams to drive to be world class in asset management for our Operation<br>. Track, analyze, identify and improve key maintenance parameters such as asset utilization and maintenance costs.<br>. Demonstrate full accountability of the facility maintenance function through the timely and effective use and management of programs such as CMMS, BAS, safety, corrective, preventive and predictive maintenance.<br>. Develop and implement a series of measurements to monitor departmental performance and develop and implement plans for improvement.<br>. Create statement of work for required supplier services.<br>. Evaluate vendor performance for quality, performance, efficiency and service levels.<br>. Lead Site Facilities crisis management during weather events and other anticipated\/unanticipated crisis situations. Includes ability to run site facilities locally as needed to keep operations running.<br><strong>Must Have: Minimum Requirements<\/strong><br><ul><li>Bachelors degree required<\/li><li>Minimum of 5 years of relevant experience, or advanced degree with a minimum of 3 years of relevant experience<\/li><\/ul><br><strong>Nice to Have<\/strong><ul><li>Proven ability to manage direct labor staff for successful maintenance of facilities assets<\/li><li>Strong Project Management Skills<\/li><li>Strong communication skills.<\/li><li>Ability to prioritize competing demands.<\/li><li>Availability after normal working hours<\/li><li>7 years minimum experience in Mechanical Facilities system engineering<\/li><li>3+ years of supervisory & Leadership experience <\/li><li>Building systems, HVAC, Electrical, structural and building envelope.<\/li><li>Software applications including Microsoft Office, CMMS<\/li><li>Experience working in regulated environments.<\/li><li>Ability to read and understand blueprints<\/li><li>Building Automation Systems (BAS) Data center management experience.<\/li><\/ul><br>PHYSICAL JOB REQUISITION: <ul><li>Work involves physical exertion in the transporting of various materials or equipment, lifting, moving. <\/li><li>Ability to lift up to 50lbs.<\/li><li>Work involves climbing<\/li><li>Duties involved frequent exposure to noise, dirt, odors, or similarly unpleasant surroundings.<\/li><li>Work may be performed in confined or restricted position or with exposure to temperature\/weather extremes.<br><\/li><\/ul>\"}"
}