{
    "id":"Kaggle::techmap::6165ef666bceb03ff53fb261::linkedin_jp::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"\"High level of energy and drive\" and \"a natural motivator\" are subjective and indicate masculine-coded traits because they align with traditionally male-associated assertive leadership qualities.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"\"Native level communication in oral and written Japanese\" may exclude non-native speakers who are proficient but not at a \"native\" level. It might be more inclusive to specify the required level of proficiency without using the term \"native.\"",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1 year or more experience in Financial services. Native level communication in oral and written Japanese. Business level communication in oral and written English. 3 years or more in project management in online\/web content development\/troubleshooting via CMS. 2 years or more in HTML, CSS. Experience in design utilizing Photoshop. Experience in Java. Script, jQuery, Adobe Premier, After Effects a plus. Web writing experience a plus. Able to manage adhoc issues in timely and careful manner. A strategic and logical thinker. Ability to understand and leverage global platform. High level of energy and drive. A natural motivator. Science, Technology, Engineering, Arts, Mathematics (STEAM) related academic degree a plus. About Goldman Sachs. The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world. The Goldman Sachs Group, Inc., 2021. All rights reserved Goldman Sachs is an equal employment\/affirmative action employer Female\/Minority\/Disability\/Vet. Division Asset Management.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6165ef666bceb03ff53fb261::linkedin_jp\", \"source\": \"linkedin_jp\", \"country\": \"JP\", \"company\": \"Goldman Sachs\", \"position\": \"Asset Management Division, Goldman Sachs Asset Management (GSAM) Japan Marketing, Analyst\/Associate, Tokyo\", \"notes\": \"\", \"original\": \"Asset Management Division (AMD)<br>Asset Management Division (AMD) is one of the world\\u2019s leading investment managers. AMD provides institutional and individual investors with investment and advisory solutions, with strategies spanning asset classes, industries, and geographies. We help our clients navigate today\\u2019s dynamic markets, and identify the opportunities that shape their portfolios and long-term investment goals. We extend these global capabilities to the world\\u2019s leading pension plans, sovereign wealth funds, central banks, insurance companies, financial institutions, endowments, foundations, individuals and family offices.<br><br>Goldman Sachs Asset Management Japan Marketing<br><br>Goldman Sachs Asset Management Japan seeks a marketing professional, whose primary responsibility will be to help with our marketing strategy through digital content design and implementation to support our distribution and sales team. The individual will liaison with our Sales, Engineering, Compliance and Operations team to develop effective marketing focused on education of our products, investment strategies market intelligence through, analytics, targeted email, and web content.<br><br><strong><u>Responsibilities And Qualifications<br><br><\/u><\/strong>Asset Management Division, Goldman Sachs Asset Management Japan Marketing, Analyst\/Associate, Tokyo<br><br>Asset Management Division (AMD)<br>Asset Management Division (AMD) is one of the world\\u2019s leading investment managers. AMD provides institutional and individual investors with investment and advisory solutions, with strategies spanning asset classes, industries, and geographies. We help our clients navigate today\\u2019s dynamic markets, and identify the opportunities that shape their portfolios and long-term investment goals. We extend these global capabilities to the world\\u2019s leading pension plans, sovereign wealth funds, central banks, insurance companies, financial institutions, endowments, foundations, individuals and family offices.<br><br>Goldman Sachs Asset Management Japan Marketing<br><br>Goldman Sachs Asset Management Japan seeks a marketing professional, whose primary responsibility will be to help with our marketing strategy through digital content design and implementation to support our distribution and sales team. The individual will liaison with our Sales, Engineering, Compliance and Operations team to develop effective marketing focused on education of our products, investment strategies market intelligence through, analytics, targeted email, and web content.<br><br><strong><u>Responsibilities And Qualifications<br><br><\/u><\/strong>Goldman Sachs Asset Management Japan Marketing<br><br><strong><u>Responsibilities<br><br><\/u><\/strong>+Lead digital marketing, promoting GSAM products and investment strategies<br>+Manage internal relationships across various teams and divisions across Operations, Compliance, Engineering, and Sales<br>+Obtain feedback on client demands for new approaches and products<br>+Conduct analytics to determine target audience and content<br>+Update and manage our digital contents including online web page, emailers etc.<br>+Partner with Engineering teams to assist in troubleshooting and development<br>+Manage vendor relationships<br><br><strong><u>Qualifications<br><br><\/u><\/strong>+1 year or more experience in Financial services<br>+Native level communication in oral and written Japanese<br>+Business level communication in oral and written English<br>+3 years or more in project management in online\/web content development\/troubleshooting via CMS<br>+2 years or more in HTML, CSS<br>+Experience in design utilizing Photoshop<br>+Experience in JavaScript, jQuery, Adobe Premier, After Effects a plus<br>+Web writing experience a plus<br>+Able to manage adhoc issues in timely and careful manner<br>+A strategic and logical thinker<br>+Ability to understand and leverage global platform<br>+High level of energy and drive; a natural motivator<br><br>+Science, Technology, Engineering, Arts, Mathematics (STEAM) related academic degree a plus<br><br><strong><u>About Goldman Sachs<br><br><\/u><\/strong>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.<br><br>\\u00a9 The Goldman Sachs Group, Inc., 2021. All rights reserved Goldman Sachs is an equal employment\/affirmative action employer Female\/Minority\/Disability\/Vet.<br><br>Division Asset Management\"}"
}