{
    "id":"Kaggle::techmap::61508ed4588a926c6ffbc8a7::britishjobs_uk::7",
    "label_age":true,
    "analysis_age":"\"this role offers a recent graduate the opportunity to gain real life experience from very early on\". It implies a preference for younger people.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job title: Graduate Sales Manager. Location: Rotherham. Salary: £22k (. bonus and incentives). REF: J11621:LEE. Sector: Manufacturing. Starting in 1983 from a small garage in Rotherham, our client has grown exponentially from its humble beginnings to become one of the largest stockists of bearings, power transmission products, couplings & drives, linear systems and maintenance equipment in Europe. With over six million stocked items and branches throughout the UK, our client strive to offer prompt and reliable delivery, technical support and solutions via their dedicated product specialists. They are looking for a passionate individuals ready to start a career in sales and business development. The ideal candidate will have excellent communication and interpersonal skills and be very target driven. Key responsibilities:. Achieve targets by presenting the range of products to clients and progressing projects through the supply chain. Working with different departments to ensure to maximize sales. Lead generation. Building and maintaining relationships with new and exisiting clients. Carrying out site surveys. Management and administration through company CRM. With near immediate client interaction, this role offers a recent graduate the opportunity to gain real life experience from very early on, all with the support of a nurturing office environment. Benefits: £22, 000 basic salary. Bonus and incentives. Childcare vouchers. Pension contributions. Team nights out\/social events. On-going training and support. Candidate requirements: Educated to degree level. Excellent communication skills. Written, verbal and IT literate. Passion for customer service. Comfortable working in a target driven environment. Pareto Law values diversity and promotes equality. No terminology in this advert is intended to discriminate against any of the protected characteristics that fall under the Equality Act 2010. If you require this job specification or to apply in an alternate format, please visit the Pareto website.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61508ed4588a926c6ffbc8a7::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Pareto\", \"position\": \"Graduate Sales Manager\", \"notes\": \"\", \"original\": \"Job title: Graduate Sales Manager<br>Location: Rotherham<br>Salary: &pound;22k (+ bonus and incentives)<br>REF: J11621:LEE<br>Sector: Manufacturing<br><br>Starting in 1983 from a small garage in Rotherham, our client has grown exponentially from its humble beginnings to become one of the largest stockists of bearings, power transmission products, couplings &amp; drives, linear systems and maintenance equipment in Europe. With over six million stocked items and branches throughout the UK, our client strive to offer prompt and reliable delivery, technical support and solutions via their dedicated product specialists. <br><br>They are looking for a passionate individuals ready to start a career in sales and business development. The ideal candidate will have excellent communication and interpersonal skills and be very target driven.<br><br>Key responsibilities:<br><br>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Achieve targets by presenting the range of products to clients and progressing projects through the supply chain.<br>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Working with different departments to ensure to maximize sales<br>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Lead generation<br>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Building and maintaining relationships with new and exisiting clients&nbsp;<br>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Carrying out site surveys<br>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Management and administration through company CRM<br><br>With near immediate client interaction, this role offers a recent graduate the opportunity to gain real life experience from very early on, all with the support of a nurturing office environment.<br><br>Benefits:<br><br>&pound;22,000 basic salary<br>Bonus and incentives<br>Childcare vouchers<br>Pension contributions<br>Team nights out\/social events<br>On-going training and support<br>Candidate requirements:<br><br>Educated to degree level<br>Excellent communication skills; written, verbal and IT literate<br>Passion for customer service<br>Comfortable working in a target driven environment<br>Pareto Law values diversity and promotes equality. No terminology in this advert is intended to discriminate against any of the protected characteristics that fall under the Equality Act 2010. We encourage and welcome applications from all sections of society and are more than happy to discuss reasonable adjustments and\/or additional arrangements as required to support your application.<br><br> If you require this job specification or to apply in an alternate format, please visit the Pareto website.\"}"
}