{
    "id":"Kaggle::techmap::615b1895288c4a3f2e531593::simplyhired_ie::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"The IFDS Europe Information Security Office is built on 5 pillars: Governance & Oversight. Client Engagement. Training & Awareness. Incident Management. ISO by Design. The ISO has responsibility for the overall framework, policy adherence and day to day tasks across each of the 5 pillars. IFDS Technology is provided by a combination of Group\/JV technology functions and other 3rd party software providers and a key element of the role is developing a detailed understanding of the Information Security model, principles and controls adopted by each of these providers and to act as the primary Oversight partner for these services. THE KEY RESPONSBILITIES OF THE IFDS EUROPE INFORMATION SECURITY OFFICER ARE: Own and maintain Information Security Policy and overall framework, ensuring both organisational compliance and alignment with regulatory bodies such as the Central Bank of Ireland, CSSF and EBA. Perform ongoing oversight of Group\/JV Information Security functions and services – acting as primary liaison for all related MI\/Reporting\/Incident Management. Partner with Group\/JV Security, Governance and Technology functions to align with strategic vision and goals – supporting significant projects as required. Support annual or periodic Due Diligence requests from clients or prospects (i. e. presentations, questionnaires, RFP responses etc. ) and present at client board meetings as required. Prepare quarterly Board reports and monthly Business Risk Committee reports on the current Information Security Posture for both Ireland and Luxembourg. Communicate inherent security risks, awareness and training to technical and non-technical business users. Partner with the IT Vendor function and Risk & Compliance team on Information Security risk management activities including information security risk assessment, vendor reviews. lead the remediation of identified gaps and issues. Perform application ISRMP (Information Security Risk Management Profile) exercises and own overall programme of ISRMPs for IFDS applications. Act as Senior Information Security escalation point for all significant incidents, issues or adhoc support requirements. Day to day oversight and management of Information Security analyst. THE KEY COMPETENCIES \/ SKILLS \/ BEHAVIORS OF THE IFDS EUROPE INFORMATION SECURITY OFFICER ARE: Ability to prioritise effectively and multitask efficiently. SME knowledge and experience to provide technical input to strategic and operational initiatives within a large organization. Strong technical experience in infrastructure, software and hardware products and services. Business-minded: ability to understand business challenges and opportunities. Outstanding leadership, teamwork and people management skills. Demonstrated ability to work collaboratively and partner with employees, leaders, clients, and vendors, building trusted and sustainable relationships. Demonstrated ability to work in a virtual organization.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615b1895288c4a3f2e531593::simplyhired_ie\", \"source\": \"simplyhired_ie\", \"country\": \"IE\", \"company\": \"State Street Corporation\", \"position\": \"Information Security Officer\", \"notes\": \"\", \"original\": \"The IFDS Europe Information Security Office is built on 5 pillars:\\n<br \/>Governance &amp; Oversight\\n<br \/>Client Engagement\\n<br \/>Training &amp; Awareness\\n<br \/>Incident Management\\n<br \/>ISO by Design\\n<br \/><br \/>\\nThe ISO has responsibility for the overall framework, policy adherence and day to day tasks across each of the 5 pillars. IFDS Technology is provided by a combination of Group\/JV technology functions and other 3rd party software providers and a key element of the role is developing a detailed understanding of the Information Security model, principles and controls adopted by each of these providers and to act as the primary Oversight partner for these services.\\n<br \/><br \/>\\nTHE KEY RESPONSBILITIES OF THE IFDS EUROPE INFORMATION SECURITY OFFICER ARE:\\n<br \/>Own and maintain Information Security Policy and overall framework, ensuring both organisational compliance and alignment with regulatory bodies such as the Central Bank of Ireland, CSSF and EBA\\n<br \/>Perform ongoing oversight of Group\/JV Information Security functions and services \\u2013 acting as primary liaison for all related MI\/Reporting\/Incident Management\\n<br \/>Partner with Group\/JV Security, Governance and Technology functions to align with strategic vision and goals \\u2013 supporting significant projects as required\\n<br \/>Support annual or periodic Due Diligence requests from clients or prospects (i.e. presentations, questionnaires, RFP responses etc.) and present at client board meetings as required\\n<br \/>Prepare quarterly Board reports and monthly Business Risk Committee reports on the current Information Security Posture for both Ireland and Luxembourg\\n<br \/>Communicate inherent security risks, awareness and training to technical and non-technical business users\\n<br \/>Partner with the IT Vendor function and Risk &amp; Compliance team on Information Security risk management activities including information security risk assessment, vendor reviews - lead the remediation of identified gaps and issues.\\n<br \/>Perform application ISRMP (Information Security Risk Management Profile) exercises and own overall programme of ISRMPs for IFDS applications\\n<br \/>Act as Senior Information Security escalation point for all significant incidents, issues or adhoc support requirements\\n<br \/>Oversee UAM (User Access Management) function and control framework \\u2013 including responsibility for quarterly user access recertification programme\\n<br \/>Day to day oversight and management of Information Security analyst\\n<br \/><br \/>\\nTHE KEY COMPETENCIES \/ SKILLS \/ BEHAVIORS OF THE IFDS EUROPE INFORMATION SECURITY OFFICER ARE:\\n<br \/>Ability to prioritise effectively and multitask efficiently\\n<br \/>SME knowledge and experience to provide technical input to strategic and operational initiatives within a large organization\\n<br \/>Strong technical experience in infrastructure, software and hardware products and services\\n<br \/><b>Business-minded:<\/b> ability to understand business challenges and opportunities\\n<br \/>Outstanding leadership, teamwork and people management skills\\n<br \/>Demonstrated ability to work collaboratively and partner with employees, leaders, clients, and vendors, building trusted and sustainable relationships\\n<br \/>Demonstrated ability to work in a virtual organization\\n<br \/>Excellent communication, presentation, and documentation skills \\u2013 including ability to translate technical information into business terms\\n<br \/><b>Influencing:<\/b> ability to accomplish goals through influence across the enterprise\\n<br \/>Strong risk analysis and problem-solving skills\\n<br \/><br \/>\\n<b>DESIRABLE:<\/b><br \/>\\n10&#43; years Senior IT experience (Funds \/ Investment services an advantage)\\n<br \/>Experience working with sophisticated, high transaction, high availability environments\\n<br \/>Knowledge of Security fundamentals including access control, cryptography, vulnerability management, secure configurations, secret management, logging and alerting, and system and network Security\\n<br \/>Understanding of Secure Software Development Life Cycle (SSDLC) practices\\n<br \/>Understanding of infrastructure and platform technologies (Windows, Linux, virtualisation, public cloud, firewalls etc.) and related secure design patterns\\n<br \/>Formal Information Security qualifications - e.g. CISSP, Security&#43; etc\/\\n<br \/>Solid understanding of relevant cross border regulations and guidelines (CBI, CSSF)\\n<br \/><br \/>\\nTravel\\n<br \/>Some travel will be required as part of the role (~10%)\"}"
}