{
    "id":"Kaggle::techmap::6155f293ce541c23aa022604::careerbuilder_us::11",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants. Summary. Our client is looking for a civils Construction Manager who will also prepare cost and labor estimates for civil, asphalt and paving construction projects throughout Wisconsin, by way of analyzing project drawings, specifications, and RFP's. We want someone who can manage multiple projects at once and ensures a clear understanding of all aspects of assigned projects. Client Details. This Contractor has been around for several decades and still is one of the faster growing companies in Wisconsin. They specialize in civil, asphalt and paving construction and will work with commercial companies across all of Education, Health care, Light Industrial, Retail and Multi-family. This company offers an excellent benefits package with amazing bonus potential and focuses very heavily on their employees' career development and work flexibility. Description. Coordinate and direct the Design, Estimating, Purchasing, Engineering, Accounting, Cost, and Construction functions as they relate to the completion of the project. Take the lead in seeing that the master progress schedule is established and maintained, incorporating dates and times for owner decisions, availability of design information, procurement of materials and subcontracts, and lead times for fabrication and field installation. Submit timely questions for clarification during the bid process. Attend pre-bid meetings. Prepare qualified subcontractor lists. Solicit bids from a comprehensive set of subcontractors and suppliers. Create, use and manage all cost control tools including logs and budget reports. To execute projects in conformance with the contract documents and achieve expected financial results. Profile. 1-10 years of related construction experience. A bachelor degree preferably in construction management, engineering, architecture or related field but not required. Effective communication skills to motivate your team. The fortitude to juggle competing priorities in a fast-paced environment. Multi-tasking with a sense of urgency while maintaining strong attention to detail and accuracy is crucial. Good organizational skills and the ability to time-manage effectively. Communicate regularly with GCs and Owners. Job Offer. Up to $100, 000 base salary. Individual & company performance bonuses. Health insurance benefits. Dental insurance benefits. Vision benefits. Life Insurance. Short and Long term disability coverage options. Company Cell Phone.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155f293ce541c23aa022604::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Michael Page\", \"position\": \"Construction Manager - Asphalt & Paving - Madison\", \"notes\": \"\", \"original\": \"<p><em>MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants.<\/em><\/p><p><strong>Summary<\/strong><\/p><p>Our client is looking for a civils Construction Manager who will also prepare cost and labor estimates for civil, asphalt and paving construction projects throughout Wisconsin, by way of analyzing project drawings, specifications, and RFP's. We want someone who can manage multiple projects at once and ensures a clear understanding of all aspects of assigned projects.<\/p><p><strong>Client Details<\/strong><\/p><p>This Contractor has been around for several decades and still is one of the faster growing companies in Wisconsin. They specialize in civil, asphalt and paving construction and will work with commercial companies across all of Education, Health care, Light Industrial, Retail and Multi-family. This company offers an excellent benefits package with amazing bonus potential and focuses very heavily on their employees' career development and work flexibility.<\/p><p><strong>Description<\/strong><\/p><ul><li>Coordinate and direct the Design, Estimating, Purchasing, Engineering, Accounting, Cost, and Construction functions as they relate to the completion of the project.<\/li><li>Take the lead in seeing that the master progress schedule is established and maintained, incorporating dates and times for owner decisions, availability of design information, procurement of materials and subcontracts, and lead times for fabrication and field installation.<\/li><li>Prepare cost and labor estimates for construction projects by way of analyzing project drawings, specifications, and RFP's.<\/li><li>Submit timely questions for clarification during the bid process.<\/li><li>Attend pre-bid meetings.<\/li><li>Prepare qualified subcontractor lists.<\/li><li>Solicit bids from a comprehensive set of subcontractors and suppliers.<\/li><li>Create, use and manage all cost control tools including logs and budget reports.<\/li><li>To execute projects in conformance with the contract documents and achieve expected financial results.<\/li><\/ul><p><strong>Profile<\/strong><\/p><ul><li>1-10 years of related construction experience.<\/li><li>A bachelor degree preferably in construction management, engineering, architecture or related field but not required.<\/li><li>Effective communication skills to motivate your team.<\/li><li>The fortitude to juggle competing priorities in a fast-paced environment.<\/li><li>Multi-tasking with a sense of urgency while maintaining strong attention to detail and accuracy is crucial.<\/li><li>Good organizational skills and the ability to time-manage effectively.<\/li><li>Communicate regularly with GCs and Owners.<\/li><\/ul><p><strong>Job Offer<\/strong><\/p><ul><li>Up to $100,000 base salary<\/li><li>Individual & company performance bonuses<\/li><li>Health insurance benefits<\/li><li>Dental insurance benefits<\/li><li>Vision benefits<\/li><li>Life Insurance<\/li><li>Short and Long term disability coverage options<\/li><li>Company Cell Phone<\/li><li>Company iPad or Computer<\/li><li>401k company match<\/li><li>3 weeks PTO<\/li><li>Maternal & Paternal leave<\/li><li>Travel re-imbursement, lodging and per diem on jobs that require it<\/li><\/ul>&nbsp;\"}"
}