{
    "id":"Kaggle::techmap::61435678b834d90c024a6400::linkedin_at::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The extensive list of physical requirements, such as carrying objects weighing up to fifty pounds and occasionally lifting\/moving up to 100 pounds with assistance, without mention of reasonable accommodations, can disadvantage candidates with physical disabilities who might be capable of performing the job with appropriate adjustments or assistance",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Provides active coaching, training, and mentoring to achieve these results. May represent Garda. World and Cash Vault site on internal and external customer interactions. May act as CVS Manager in their short term absence. Recruits and trains new employees. Ensures CVS Branch meets quality and production standards. Travel required (varies by location)  20%. Performs other duties as required. Supervisory Responsibility. Daily coaching, mentoring, and supervision of Production Supervisors. Skills\/Qualifications. 3  5 years experience leading and supervising a group of production employees. 3  years active experience in a money room or cash operation preferred. Experience working in a fast paced, repetitive process and secure production environment. High school diploma or general equivalency diploma required or equivalent work experience. Bachelors degree preferred. Familiarity with Microsoft Office products such as Word, Excel, Outlook, and PowerPoint. Excellent written, verbal, mathematic and comprehension skills. Ability to give clear oral and written instructions and have the ability to train and lead employees. Must be able to clearly communicate effectively, both orally and in written documents, with customers, colleagues, and supervisors in person and by radio or telephone, before groups and in interpersonal situations. Work Schedule. Requires a flexible work schedule based on operational needs. Variable working days and hours based on location, staffing levels and work activities. Overtime, weekend and holiday work may be required. Working Conditions. May work in all types of lighting and weather conditions, including but not limited to heat, sun, rain, snow and ice. Noise level in the work environment may range from moderate to loud. Wearing of company provided uniform (including a CVS coat) is required in secure areas. Essential Physical Requirements. Have a full range of motion and ability to stand, walk, sit, stoop, bend, twist, climb, balance, kneel, crouch, crawl, ascend\/descend steps, etc., including while carrying objects weighing up to fifty pounds and occasionally lift and\/or move up to 100 pounds with assistance. Have normal day and nighttime vision, corrected or uncorrected. Have normal hearing, with or without device. Ability to sit and stand for extended periods of time, up to 6-8 hours a day. Must have the ability to use hand to finger, handle, or feel: The ability to type, pick pinch or otherwise work primarily with fingers. Use fingers to key an adding machine, computer keyboard or other data entry device.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61435678b834d90c024a6400::linkedin_at\", \"source\": \"linkedin_at\", \"country\": \"AT\", \"company\": \"GardaWorld\", \"position\": \"Cash Vault Services Operations Manager\", \"notes\": \"\", \"original\": \"GardaWorld is the world\\u2019s largest privately owned security services company offering a wide range of highly focused business solutions including leading-edge security services and cash solutions. In over two decades, our work has taken us from our home base in Montreal to the oil fields of Iraq, and embassies across Africa. We\\u2019re also present in financial institutions in the US and airports in Canada. We operate across a broad range of sectors, including financial services, infrastructure, natural resources and retail. Our clients include Fortune 500 companies and governments with people and assets deployed around the world. Headquartered in Montreal, Canada, our 100,000 highly trained, dedicated professionals serve clients in North America, Africa and the Middle East. In today\\u2019s complex world, security has become a vital concern for everyone and is the foundation of our present and future success.<br><br>Provides daily supervision, leadership, coaching and feedback to a department of employees within Cash Vault Services. Ensures unit produces accurate work efficiently and within established time frames.<br><br><strong><u>Responsibilities<br><\/u><\/strong><ul><li> Leads and supervises the department\\u2019s accurate, timely, and efficient processing of cash, coin, check, mixed deposit, ATM, coin and change-order processing. <\/li><li> Responsible for employees processing deposits on any currency counting equipment including mid-level and high speed sorters. <\/li><li> Attains unit\\u2019s assigned financial goals as well as provides support and feedback for attainment of entire site\\u2019s financial goals. <\/li><li> Ensures all work within unit is processed within established timeframes. Reports any deficiencies and corrective action plan to CVS Manager. <\/li><li> Monitors adherence to established error correction response times. Independently researches complex out-of-balance transactions and provides necessary approvals or notifications. <\/li><li> Ensures compliance with and training on all company policies including state and federal regulations. Adheres to audit controls to consistently achieve satisfactory audit ratings. <\/li><li> Ensures compliance with and training on customer specific processing requirements and meets all audit expectations. <\/li><li> Provides input to CVS Management team for assigned team members on decisions including salary planning, performance management, hiring and termination recommendations. Delivers supporting documentation to team members. <\/li><li> Identifies, documents, shares, and implements process improvement opportunities with site management. <\/li><li> Plans weekly schedules for team members, monitors tardiness and attendance, and delivers any HR supported constructive action. <\/li><li> Monitors daily, weekly and monthly productivity standards, holds team members accountable for meeting or exceeding goals, and recognizes success. <\/li><li> Ensures all safety and security procedures are followed by the employees, and reviews film for support. Provides active coaching, training, and mentoring to achieve these results. <\/li><li> May represent GardaWorld and Cash Vault site on internal and external customer interactions. <\/li><li> May act as CVS Manager in their short term absence. <\/li><li> Recruits and trains new employees. <\/li><li> Ensures CVS Branch meets quality and production standards. <\/li><li> Travel required (varies by location) \\u2013 20%. <\/li><li> Performs other duties as required. <br><\/li><\/ul><strong><u>Supervisory Responsibility<br><\/u><\/strong><ul><li> Daily coaching, mentoring, and supervision of Production Supervisors. <br><\/li><\/ul><strong><u>Skills\/Qualifications<br><\/u><\/strong><ul><li> 3 \\u2013 5 years\\u2019 experience leading and supervising a group of production employees. <\/li><li> 3 + years\\u2019 active experience in a money room or cash operation preferred. <\/li><li> Experience working in a fast paced, repetitive process and secure production environment. <\/li><li> High school diploma or general equivalency diploma required or equivalent work experience. Bachelor\\u2019s degree preferred. <\/li><li> Familiarity with Microsoft Office products such as Word, Excel, Outlook, and PowerPoint. <\/li><li> Excellent written, verbal, mathematic and comprehension skills. <\/li><li> Ability to give clear oral and written instructions and have the ability to train and lead employees. <\/li><li> Must be able to clearly communicate effectively, both orally and in written documents, with customers, colleagues, and supervisors in person and by radio or telephone, before groups and in interpersonal situations. <br><\/li><\/ul><strong><u>Work Schedule<br><\/u><\/strong><ul><li> Requires a flexible work schedule based on operational needs. Variable working days and hours based on location, staffing levels and work activities. Overtime, weekend and holiday work may be required. <br><\/li><\/ul><strong><u>Working Conditions<br><\/u><\/strong><ul><li> May work in all types of lighting and weather conditions, including but not limited to heat, sun, rain, snow and ice. <\/li><li> Noise level in the work environment may range from moderate to loud. <\/li><li> Wearing of company provided uniform (including a CVS coat) is required in secure areas. <br><\/li><\/ul><strong><u>Essential Physical Requirements<br><\/u><\/strong><ul><li> Have a full range of motion and ability to stand, walk, sit, stoop, bend, twist, climb, balance, kneel, crouch, crawl, ascend\/descend steps, etc., including while carrying objects weighing up to fifty pounds and occasionally lift and\/or move up to 100 pounds with assistance. <\/li><li> Have normal day and nighttime vision, corrected or uncorrected. <\/li><li> Have normal hearing, with or without device. <\/li><li> Ability to sit and stand for extended periods of time, up to 6-8 hours a day. <\/li><li> Must have the ability to use hand to finger, handle, or feel: <\/li><ul><li> The ability to type, pick pinch or otherwise work primarily with fingers. Use fingers to key an adding machine, computer keyboard or other data entry device. <\/li><li> The ability to seize, hold, grasp, turn or otherwise work with hand or hands. <\/li><li> The ability to perceive attributes of objects and materials such as size, shape, temperature, or texture, by touching. <br><\/li><\/ul><\/ul>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>GardaWorld offers competitive wages and a great benefits package for full time employees: medical, dental, vision, holiday pay, paid vacation, 401K plan and much more!<br><br>Candidates must meet the company's hiring criteria. Physical exam and other testing may be required.<br><br>We are an Equal Opportunity Employer and drug free workplace.<br><br>Apply Now\"}"
}