{
    "id":"Kaggle::techmap::6136e7a24c683662c07a0721::cvlibrary_uk::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Site Secretary. The Company. This Site Secretary’s role is with one of the UK’s leading main contractors. Primarily operating in the residential and hotel sectors they are known for building and refurbishing some of the capitals most high-profile projects. The Role. We are looking for a Site Secretary who has previous of experience of working on £multi-million construction projects in a site based\/site office based role. You will be working alongside the senior management team providing both secretarial and PA services on this 3 year £130m project. Ideally you will have some experience of document control systems (4P), be reliable and a team player. The Plus Points. This is a great opportunity to join a leading contractor that is experiencing a boom in workload who can offer long terms careers with good prospects for progression. A competitive salary is also on offer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6136e7a24c683662c07a0721::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Velocity Recruitment\", \"position\": \"Site Secretary\", \"notes\": \"\", \"original\": \"Site Secretary<br><br>The Company<br><br>This Site Secretary&rsquo;s role is with one of the UK&rsquo;s leading main contractors. Primarily operating in the residential and hotel sectors they are known for building and refurbishing some of the capitals most high-profile projects.<br><br>The Role<br><br>We are looking for a Site Secretary who has previous of experience of working on &pound;multi-million construction projects in a site based\/site office based role. You will be working alongside the senior management team providing both secretarial and PA services on this 3 year &pound;130m project. Ideally you will have some experience of document control systems (4P), be reliable and a team player.<br><br>The Plus Points<br><br>This is a great opportunity to join a leading contractor that is experiencing a boom in workload who can offer long terms careers with good prospects for progression. A competitive salary is also on offer.<br>\"}"
}