{
    "id":"Kaggle::techmap::614ccb6eb788922af24dd283::seek_nz::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Supermarket Assistant. We currently have a Full-Time position available in our Grocery Department. Full training will be given to the successful applicant. Hours\/days will be discussed at the interview stage. However we do require someone who is flexible to do some day\/evening shifts, as well as one weekend day. Key Responsibilities Include …. Merchandising promotional displays to highest standards. Product quality and storage rotation. Identifying items requiring replenishment. Applicants will need to meet the following criteria’s: Be customer service driven. Be able to work well in a team. An ability to communicate at all levels. Must be reliable and have a high attendance rating. To be successful in this position you must be physically fit as heavy lifting is required. Are you are looking for an opportunity to join a team that focuses on providing great service, fun working environment, advancing your skills and a brighter future, then look no further, Regent New World is the place for you. We are looking to fill this position as quickly as possible and will be reviewing applications as they come through. Applications close 10 October 2021 or when a suitable applicant has been employed. Applicants for this position should have NZ residency, or a valid working visa.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614ccb6eb788922af24dd283::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"New World\", \"position\": \"Supermarket Assistant\", \"notes\": \"\", \"original\": \"<p><strong>Supermarket Assistant<\/strong><\/p><p>We currently have a Full-Time position available in our Grocery Department. Full training will be given to the successful applicant. Hours\/days will be discussed at the interview stage; however we do require someone who is flexible to do some day\/evening shifts, as well as one weekend day.<\/p><p><strong>Key Responsibilities Include \\u2026<\/strong><\/p><ul><li>Merchandising promotional displays to highest standards<\/li><li>Product quality and storage rotation<\/li><li>Identifying items requiring replenishment<\/li><\/ul><p>\\u00a0<\/p><p><strong>Applicants will need to meet the following criteria\\u2019s:<\/strong><\/p><ul><li>Be customer service driven<\/li><li>Be able to work well in a team<\/li><li>An ability to communicate at all levels<\/li><li>Must be reliable and have a high attendance rating.<\/li><\/ul>\\u00a0To be successful in this position you must be physically fit as heavy lifting is required.<p>\\u00a0<\/p><p>Are you are looking for an opportunity to join a team that focuses on providing great service, fun working environment, advancing your skills and a brighter future, then look no further, Regent New World is the place for you.<\/p><p>We are looking to fill this position as quickly as possible and will be reviewing applications as they come through. Applications close 10 October 2021 or when a suitable applicant has been employed.<\/p><p>Applicants for this position should have NZ residency, or a valid working visa.<\/p>\"}"
}