{
    "id":"Kaggle::techmap::613ac95dee58e5261c4cb26f::linkedin_pt::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Communication and reporting to the local data protection authority (if existing) and other relevant regulators, attendance at data protection authority inspections, handling audit submissions and other information submission requirements. Build on a strong working relationship with the management of the compliance & governance function, guaranteeing the global needs of the organization. Build on the relation with the AXA Services local governance bodies, Axa OpCos. Coordination with the local Risk, Security, Legal, HR, Physical Security, IT Operations, Finance and Internal Audit function on Data Privacy matters. Communication and reporting to the local data protection authority (if existing) and other relevant regulators, attendance at data protection authority inspections, handling audit submissions and other information submission requirements. Keeping Senior and Business Management informed about their responsibilities regarding Data Privacy. Profile. A previous Data Privacy \/ Compliance experience (at least Master graduate or equivalent  Legal or IT Security). 2 to 8 years of professional experience (preferable including contract negotiation). Ability to draft complex legal documentation in English. Language skills: Required: English  high level (written, spoken, negotiation). Nice to have (not required but appreciated): German, French, Spanish, Italian. Skills & Competencies. A. Results Orientation. Ability of tasks prioritization with a clear action plan defined. Develop an internal sense of urgency to complete tasks. Holds self and others accountable for delivering high-quality results on time and within budget. Challenge of ineffective work processes and promote constructive alternatives. Use of the appropriate criteria to regularly evaluate work processes, services and deliverables. Solicits and\/or provides information that could affect the planning, programs and decision-making for the organization. B. Change Leadership \/ Collaboration and Influencing. Ability to build strong working relationships across a broad and varied mix of people and skills in IT and across business organizations. Ability to win the trust of internal customers and other parts of the organization while challenging and fostering change. C. Team Spirit. Positive mindset. Excellent communication skills at all levels. A collaborative work style and team-building mindset. Intercultural sensitivity. Flexibility.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613ac95dee58e5261c4cb26f::linkedin_pt\", \"source\": \"linkedin_pt\", \"country\": \"PT\", \"company\": \"AXA Group Operations\", \"position\": \"Compliance & Data Privacy Expert\", \"notes\": \"\", \"original\": \"<p><strong>POSITION MISSION &amp; MAIN ACTIVITIES<\/strong><\/p><p>&nbsp;<\/p><p><strong>A. Compliance<\/strong><\/p><ul><li>Regulatory watch of the legislations under the perimeter<\/li><li>Guarantee the compliancy with local applicable regulations under surveillance<\/li><li>Implement and maintain the different processes assigned to compliance: Ethics, Anti-bribery, Sanctions, Conflicts of interest, Criminal laws.<\/li><li>Review and follow up the compliance risks (evaluate the impact on the operational risks model of the entity)<\/li><li>Raise awareness to all employees regarding the risk associated of non-compliance<\/li><li>Report and escalate any relevant change in regulations subject to generate additional risks or needs inside AXA Services perimeter<\/li><\/ul><p>&nbsp;<\/p><p><strong>B. Data Privacy policies and governance<\/strong><\/p><ul><li>Develop and adapt AXA Services policies on data privacy in accordance with security local laws.<\/li><li>Develop and create appropriate privacy confidentiality consent forms, authorization forms, and information notices and materials reflecting current organization and legal practices and requirements.<\/li><li>Adopting and implementing detailed requirements or guidelines to assure a compliant handling of specific matters as deemed necessary such as:<\/li><li>IT Project Management when personal data is involved<\/li><li>Third party management: risk assessment and contract management<\/li><li>Sensitive Personal Data:&nbsp;Greater emphasis on whether and how to process this type of data<\/li><li>Design complaints procedure. Detailed guidance as to how employees and non-employees<\/li><\/ul><p>&nbsp;<\/p><p><strong>C. Data Privacy management and governance<\/strong><\/p><ul><li>Training and providing juridical consultative advice to all the areas and departments of the entity in question with regards to Data Privacy matters<\/li><li>Supporting and controlling a general data protection register (both as Data Controller and Processor) containing all data processing in use and current information about purpose).<\/li><li>Support to the different projects providing Data Privacy assessment and sign-off when satisfied on compliancy with local applicable laws<\/li><li>Collaborates with the teams in charge to respond to requests for access to and correction of personal information and general issues concerning personal information (i.e. rights of access, rectification, cancellation and similar requests).<\/li><li>Support on drafting internal or external data privacy agreements<\/li><li>Reviewing and monitoring business activities and vendor contracting and negotiations<\/li><li>Attendance at Data Privacy, Security or similar Committees<\/li><li>Coordination and management of responses to incidents involving Personal Data (e.g. Unauthorized access or disclosure)<\/li><li>Permanent Control: Ensuring on a regular basis that data processing applications and processes are still compliant.<\/li><\/ul><p>&nbsp;<\/p><p><strong>D. Control of Data Privacy Regulations<\/strong><\/p><ul><li>Monitors both local and other relevant Data Privacy related regulations impacting the ATS (GDPR + local regulations).<\/li><li>Creates an environment that promotes compliance with Data Privacy related regulations.<\/li><\/ul><p>&nbsp;<\/p><p><strong>E. Interface with corporate governance bodies<\/strong><\/p><ul><li>Communication and reporting to the local data protection authority (if existing) and other relevant regulators, attendance at data protection authority inspections, handling audit submissions and other information submission requirements<\/li><li>Build on a strong working relationship with the management of the compliance &amp; governance function, guaranteeing the global needs of the organization.<\/li><li>Build on the relation with the AXA Services local governance bodies, Axa OpCos<\/li><li>Coordination with the local Risk, Security, Legal, HR, Physical Security, IT Operations, Finance and Internal Audit function on Data Privacy matters<\/li><li>Communication and reporting to the local data protection authority (if existing) and other relevant regulators, attendance at data protection authority inspections, handling audit submissions and other information submission requirements.<\/li><li>Keeping Senior and Business Management informed about their responsibilities regarding Data Privacy<\/li><\/ul><p><br><\/p><p><strong>Profile<\/strong><\/p><ul><li>A previous Data Privacy \/ Compliance experience (at least Master graduate or equivalent \\u2013 Legal or IT Security)<\/li><li>2 to 8 years of professional experience (preferable including contract negotiation)<\/li><li>Ability to draft complex legal documentation in English<\/li><li>Language skills:<\/li><li>Required: English \\u2013 high level (written, spoken, negotiation)<\/li><li>Nice to have (not required but appreciated): German, French, Spanish, Italian<\/li><\/ul><p>&nbsp;<\/p><p><strong>Skills &amp; Competencies<\/strong><\/p><p>&nbsp;<\/p><p><strong>A. Results Orientation<\/strong><\/p><ul><li>Ability of tasks prioritization with a clear action plan defined<\/li><li>Develop an internal sense of urgency to complete tasks<\/li><li>Holds self and others accountable for delivering high-quality results on time and within budget<\/li><li>Challenge of ineffective work processes and promote constructive alternatives<\/li><li>Use of the appropriate criteria to regularly evaluate work processes, services and deliverables<\/li><li>Solicits and\/or provides information that could affect the planning, programs and decision-making for the organization<\/li><\/ul><p><br><\/p><p><strong>B. Change Leadership \/ Collaboration and Influencing<\/strong><\/p><ul><li>Ability to build strong working relationships across a broad and varied mix of people and skills in IT and across business organizations<\/li><li>Ability to win the trust of internal customers and other parts of the organization while challenging and fostering change<\/li><\/ul><p><br><\/p><p><strong>C. Team Spirit<\/strong><\/p><ul><li>Positive mindset<\/li><li>Excellent communication skills at all levels<\/li><li>A collaborative work style and team-building mindset<\/li><li>Intercultural sensitivity<\/li><li>Flexibility<\/li><\/ul>\"}"
}