{
    "id":"Kaggle::techmap::612f57d03c5ce31f6c5dbf7f::cvlibrary_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"HGV Technician. Job Title: HGV Technician. Location: Newark. Hourly rate: £14. 50-16. 10. Overtime paid at an increased rate. Hours: 6am-3pm week 1 & 11am-8pm week 2 Monday to Friday. My client is seeking a qualified HGV Technician to join their dealership in Newark and assist in providing a high quality and efficient heavy vehicle service offering to their customers. Our hugely successful client is expanding after a number of new contract wins. HGV Technician Job role: As an HGV Technician you will be based in a busy workshop environment you will be required to undertake all levels of maintenance, repairs and major overhauls as well as completing standard servicing and diagnostics. You must be capable of following the repair process from fault analysis to completion. Diagnosing vehicle defects. Maintenance and repair of all types of HGVs and trailers. Conducting routine inspections and Pre-MOT inspections, as necessary. Comprehensive completion of all documentation including worksheets. The successful HGV Technician must have the following attributes: Recent experience working in an HGV Dealership or Fleet workshop. Be apprentice trained and qualified to City & Guilds \/ NVQ level 3 in Heavy Vehicle Mechanics, Maintenance & Repair or equivalent. Excellent problem-solving skills and strong attention to detail. Outstanding organisation and time management skills with the ability to work to deadlines. If you would like to apply for this HGV Technician role, please call Jamie at Kemp Recruitment on (phone number removed) or submit your up to date CV through this advert.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::612f57d03c5ce31f6c5dbf7f::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Kemp Recruitment Ltd\", \"position\": \"HGV Technician\", \"notes\": \"\", \"original\": \"HGV Technician <br><br>Job Title: HGV Technician <br>Location: Newark<br>Hourly rate: &pound;14.50-16.10 + Overtime paid at an increased rate <br>Hours: 6am-3pm week 1 &amp; 11am-8pm week 2 Monday to Friday <br><br>My client is seeking a qualified HGV Technician to join their dealership in Newark and assist in providing a high quality and efficient heavy vehicle service offering to their customers. Our hugely successful client is expanding after a number of new contract wins.<br><br>HGV Technician Job role:<br>As an HGV Technician you will be based in a busy workshop environment you will be required to undertake all levels of maintenance, repairs and major overhauls as well as completing standard servicing and diagnostics.<br>You must be capable of following the repair process from fault analysis to completion.<br>Diagnosing vehicle defects.<br>Maintenance and repair of all types of HGVs and trailers.<br>Conducting routine inspections and Pre-MOT inspections, as necessary.<br>Comprehensive completion of all documentation including worksheets.<br><br>The successful HGV Technician must have the following attributes:<br>Recent experience working in an HGV Dealership or Fleet workshop. <br>Be apprentice trained and qualified to City &amp; Guilds \/ NVQ level 3 in Heavy Vehicle Mechanics, Maintenance &amp; Repair or equivalent.<br>Excellent problem-solving skills and strong attention to detail.<br>Outstanding organisation and time management skills with the ability to work to deadlines.<br><br>If you would like to apply for this HGV Technician role, please call Jamie at Kemp Recruitment on (phone number removed) or submit your up to date CV through this advert.\"}"
}