{
    "id":"Kaggle::techmap::612ef01a214d4e19f8d3b560::reed_uk::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":"Asking explicitly for a female is understandable given that the role is as caregiver to a vulnerable female child.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Full-Time Support Worker. Location: Lowestoft, Suffolk NR32. Wage: Up to £14. 54 Gross per hour. Driver Essential? Yes. Essential: Experience supporting a young client with cerebral palsy and manual handling, hoists. Days & Hours: Full-time (37. 5 plus hours per week), includes working days, nights, weekends. Recruiter: About this client\/child: Our client Becky is 11 years old and enjoys spending time with her family, watching her favourite TV shows, and listening to music and arts and crafts. Becky has cerebral palsy, is a wheelchair user, and receives her liquids, nutrition, and medication via a PEG. She uses sounds and facial expressions to communicate. Becky is reliant on others to meet all her care needs and has a team of Support Workers providing round-the-clock care. Overview of role: Becky requires support with personal and self-care, assistance with manual handling, hoisting and transfers, support to implement her therapy programmes, and to access activities both at home and in the community. Person-centered training is provided in all aspects of Becky’s care plan and routine. To be part of Becky’s support team you must be able to work a mixture of shifts, including waking nights. We are looking for full-time availability. The rota is provided 4 weeks in advance and the shift times are: Term time, Monday to Friday: 6. 00am to 8. 00am, and 3. 00pm to 8. 00pm. Waking Nights: 8. 00pm to 8. 00am. Rates of pay, day shifts: £12. 60 weekdays, £13. 65 weekends, and £18. 72 bank holidays. Nights: £13. 50 weeknights, £14. 54 weekends, and £21. 81 bank holidays. All rates are quoted in gross per hour. Who this job would suit: Previous experience supporting a client with a physical disability is essential as well as being a confident driver. Becky’s car is a manual, adapted vehicle. An experienced Female. Support Worker who is professional, dedicated, and passionate about enabling and supporting their client to reach their full potential. It is essential that you are a non-smoker \/ vaper. What’s great about this job: Excellent training is provided to ensure you have all the skills required to support Becky with ongoing support from the Team Leader and Case Manager.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::612ef01a214d4e19f8d3b560::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Snap Care\", \"position\": \"NR32 Support Worker\", \"notes\": \"\", \"original\": \"<p><b>Full-Time Support Worker&nbsp;<\/b><br><strong>Location:<\/strong> Lowestoft, Suffolk&nbsp;NR32<br><strong>Wage:<\/strong> Up to \\u00a314.54 Gross per hour<br><strong>Driver Essential?<\/strong> Yes<br><strong>Essential: <\/strong>Experience supporting a young client with cerebral palsy and manual handling, hoists<br><strong>Days &amp; Hours:<\/strong>&nbsp;Full-time (37.5 plus hours per week), includes working days, nights, weekends <br><strong>Recruiter:<\/strong><\/p> <p><strong>About this client\/child:<\/strong><br><br>Our client Becky is 11 years old and enjoys spending time with her family, watching her favourite TV shows, and listening to music and arts and crafts. Becky has cerebral palsy, is a wheelchair user, and receives her liquids, nutrition, and medication via a PEG. She uses sounds and facial expressions to communicate. Becky is reliant on others to meet all her care needs and has a team of Support Workers providing round-the-clock care. <\/p> <p><strong>Overview of role:<\/strong><br><br>Becky requires support with personal and self-care, assistance with manual handling, hoisting and transfers, support to implement her therapy programmes, and to access activities both at home and in the community. Person-centered training is provided in all aspects of Becky\\u2019s care plan and routine.&nbsp; To be part of Becky\\u2019s support team you must be able to work a mixture of shifts, including waking nights. We are looking for full-time availability.<br><br>The rota is provided 4 weeks in advance and the shift times are:<br><br>Term time, Monday to Friday: 6.00am to 8.00am, and 3.00pm to 8.00pm. School Holidays and Weekends: 8.00am to 8.00pm. Waking Nights: 8.00pm to 8.00am. Rates of pay, day shifts: \\u00a312.60 weekdays, \\u00a313.65 weekends, and \\u00a318.72 bank holidays. Nights: \\u00a313.50 weeknights, \\u00a314.54 weekends, and \\u00a321.81 bank holidays. All rates are quoted in gross per hour. <\/p> <p><strong>Who this job would suit:<\/strong><br><br>Previous experience supporting a client with a physical disability is essential as well as being a confident driver; Becky\\u2019s car is a manual, adapted vehicle. An experienced Female* Support Worker who is professional, dedicated, and passionate about enabling and supporting their client to reach their full potential. It is essential that you are a non-smoker \/ vaper. <\/p> <p><strong>What\\u2019s great about this job:<\/strong><br><br>Excellent training is provided to ensure you have all the skills required to support Becky with ongoing support from the Team Leader and Case Manager. Becky is a joy to support; a loving, cheerful, and caring young lady.<br><br><strong>Who is working with this client? <\/strong><br><br>We are working in association with a case manager on this vacancy; they will be carrying out all recruitment, including shortlisting and interviewing. By applying for this vacancy, you agree to Snap Care sending your CV and contact details directly to our client for their consideration. <\/p> <p>Snap Care is committed to safeguarding children, young people, and vulnerable adults. We are committed to equality of opportunity and recruitment\/selection&nbsp;decisions are&nbsp;based only on&nbsp;individuals' ability to best do the job.&nbsp;*Where a specific gender is stated as essential, gender is considered to be a genuine occupational requirement in accordance with paragraph 1, schedule 9 of the Equality Act 2010. <\/p>\"}"
}