{
    "id":"Kaggle::techmap::61561ad1a6740c534abc8204::monster_ca::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Become a Delivery Associate \/ Driver with [Fastplus Delivery LTD]. No previous work experience required. Compensation: $17. 00\/hr! [Fastplus Delivery Ltd] is an Amazon Delivery Service Partner that is owned and operated by [Salem R Kassem. We are looking for dedicated individuals who are inspired and motivated to work smart and work hard in a team environment. As a delivery driver, you will be the face of our company. It will be your job to consistently exceed customer expectations by making sure all orders are delivered with a smile, on time, safely, and to the right location. Currently, we are looking to fill full-time driving positions in [Edmonton and Surroundings]. Delivery Driver Associate Responsibilities: Load vans and deliver packages by driving, climbing in and out of the vehicle, and walking upstairs and through driveways in all weather conditions, and deliver packages safely and punctually. You can expect to work about 4-5 days per week and up to 10 hours per day. Follow strict safety standards on and off the road. Operate an electronic device for GPS and daily records. Have a positive can-do attitude. Delivery Driver Requirements: We provide on-the-job training so that all of our employees feel confident on the road and the doorsteps of customers. In partnership with one another, Amazon and the DSPs continue to consult with medical and health experts, and take all recommended precautions to keep everyone healthy. Be 21 years or older with the ability to read and speak English for safety. Have a valid driver's license within the state of employment (a commercial driver’s license (CDL) is not required). Be able to operate and navigate a delivery van, weighing 10, 000 lbs. or less (you do not need to provide your own vehicle). Must be able to move boxes up to 50 lbs., with or without reasonable accommodation. What is an Amazon delivery service partner? Amazon has partnered with local Delivery Service Partners (DSPs), independent delivery organizations that help Amazon deliver thousands of packages to customers every day. As an employee of an Amazon delivery service partner (DSP), you will work directly for the DSP that operates out of a local Amazon delivery station.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61561ad1a6740c534abc8204::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Fastplus Delivery Ltd\", \"position\": \"Delivery Associate - Fastplus Delivery Ltd (DYB2 - FPLS)\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Become a Delivery Associate \/ Driver with [Fastplus Delivery LTD]<\/p> <p><strong>No previous work experience required.<\/strong><\/p> <p>Compensation: $17.00\/hr!<\/p> <p>[Fastplus Delivery Ltd]&nbsp;is an Amazon Delivery Service Partner&nbsp;that is owned and operated by [Salem R Kassem. We are looking for dedicated individuals who are inspired and motivated to work smart and work hard in a team environment. As a delivery driver, you will be the face of our company. It will be your job to consistently exceed customer expectations by making sure all orders are delivered with a smile, on time, safely, and to the right location. <strong>Currently, we are looking to fill&nbsp;full-time&nbsp;driving positions in [Edmonton and Surroundings].<\/strong><\/p> <p><strong>Delivery Driver Associate Responsibilities:<\/strong><\/p> <ul> <li>Load vans and deliver packages by driving, climbing in and out of the vehicle, and walking upstairs and through driveways in all weather conditions,&nbsp;and deliver packages safely and punctually<\/li> <li>You can expect to work about 4-5 days per week and up to 10 hours per day.<\/li> <li>Follow strict safety standards on and off the road<\/li> <li>Operate an electronic device for GPS and daily records<\/li> <li>Have a positive can-do attitude&nbsp;<\/li> <\/ul> <p><strong>Delivery Driver Requirements:<\/strong><\/p> <p>We provide on-the-job training so that all of our employees feel confident on the road and the doorsteps of customers. Health and safety are always a top priority for Amazon and the Delivery Service Partners Amazon contracts with. In partnership with one another,&nbsp;Amazon and the DSPs continue to consult with medical and health experts, and take all recommended precautions to keep everyone healthy.<\/p> <ul> <li>Be 21 years or older with the ability to read and speak English for safety<\/li> <li>Have a valid driver's license within the state of employment (a commercial driver\\u2019s license (CDL) is not required)<\/li> <li>Be able to operate and navigate a delivery van, weighing 10,000 lbs. or less (you do not need to provide your own vehicle)<\/li> <li>Must be able to move boxes up to 50 lbs., with or without reasonable accommodation<\/li> <\/ul> <p><strong>What is an Amazon delivery service partner?<\/strong><\/p> <p>Amazon has partnered with local Delivery Service Partners (DSPs), independent delivery organizations that help Amazon deliver thousands of packages to customers every day. As an employee of an Amazon delivery service partner (DSP), you will work directly for the DSP that operates out of a local Amazon delivery station.<\/p> <\/div>\"}"
}