{
    "id":"Kaggle::techmap::614d2938463aa27e3dae2f3f::seek_au::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"APG is a national employer of choice supplying a flexible workforce to industries who promote safety and wellbeing as priorities. Our client is currently seeking a Forklift Operator\/ Production worker for their busy manufacturing operations based in Tully. This position is on a casual basis in an ongoing role with an early morning start at 6AM. The ideal candidate will be available for immediate start. Duties will include but not limited to:. Forklift Operation. Machine Operating. Manual Handling and Stacking of Finished Products. Stock replenishment. Stock counting. Loading and unloading of Trucks. Stock and pallet movement throughout Manufacturing Area. To be successful. Your own reliable transport. A willingness to work safely. Live in the local area. Reliable work history with 2 current references. Be fit and healthy for manual work. Please click APPLY NOW to apply online or call APG WORKFORCE on (07) 4092 1334.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d2938463aa27e3dae2f3f::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"APG Workforce\", \"position\": \"Forklift Operator - Tully\", \"notes\": \"\", \"original\": \"<p><strong>APG is a national employer of choice supplying a flexible workforce to industries who promote safety and wellbeing as priorities.<br \/><br \/> <\/strong><\/p> <p><strong>Our client is currently seeking a Forklift Operator\/ Production worker for their busy manufacturing operations based in Tully.<br \/><br \/> <\/strong><\/p> <p><strong>This position is on a casual basis in an ongoing role with an early morning start at 6AM. The ideal candidate will be available for immediate start.<\/strong><\/p> \\u00a0\\u00a0<br \/> <strong>Duties will include but not limited to<\/strong>:<br \/> <ul> <li>- Forklift Operation<\/li> <li>- Machine Operating<\/li> <li>- Manual Handling and Stacking of Finished Products<\/li> <li>- Stock replenishment<\/li> <li>- Stock counting<\/li> <li>- Loading and unloading of Trucks<\/li> <li>- Stock and pallet movement throughout Manufacturing Area<\/li> <\/ul> <strong>To be successful <\/strong><br \/> <ul> <li>Your own reliable transport<\/li> <li>A willingness to work safely<\/li> <li>Live in the local area<\/li> <li>Reliable work history with 2 current references<\/li> <li>Be fit and healthy for manual work<strong>\\u00a0<\/strong>\\u00a0<\/li> <\/ul> <p><strong>Please click APPLY NOW to apply online or call APG WORKFORCE on (07) 4092 1334. <\/strong><\/p>\"}"
}