{
    "id":"Kaggle::techmap::61504c800509ba6529ec08fe::linkedin_za::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Able to communicate effectively with all areas of the business. Think out-of-the box and being creative is an integral part of your working and living. Organized and able to manage and coordinate various projects with various stakeholders. Managing a team motivates you and what you do, you do with passion. Whilst keeping an eye on all the relevant details of the job on hand, you never forget the bigger picture. Advanced level in MS Office package  with a specific focus on Excel and Microsoft PowerBI. Able to find solutions and be a good decision maker. Has a strategic \/ planning view. Ability to live the Zando values: Delivers customer satisfaction. Leads Completely. Embraces and Drives Change. Goes the extra mile. Is adventurous, open-minded and creative. Creates fun and a positive team Spirit. This appointment will be made in accordance with the Companys Employment Equity Plan and preference will be given to people from Designated Groups and people with a disability, provided such job applicants meet the inherent criteria of the vacancy. Please note only shortlisted candidates will be contacted.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61504c800509ba6529ec08fe::linkedin_za\", \"source\": \"linkedin_za\", \"country\": \"ZA\", \"company\": \"Zando\", \"position\": \"Planning Manager\", \"notes\": \"\", \"original\": \"<strong><u>Our Company<br><br><\/u><\/strong>Zando was founded in 2012 and since then has grown exponentially to become South Africa\\u2019s biggest online fashion store. Zando forms part of the Jumia Group, the leading e-commerce platform in Africa. With over 1 billion people and 500 million internet users in Africa, Jumia believes that e-commerce is making people's lives easier by helping them shop and pay for millions of products at the best prices wherever they live. E-commerce is also creating new opportunities for SMEs to grow, and job opportunities for a new generation to thrive. With over 5,000 employees in more than 10 countries in Africa, Jumia is led by top talented leaders offering a great mix of local and international talents and is backed by very high-profile shareholders. Jumia is committed to creating sustainable impact in Africa and offers unique opportunities in a vibrant and booming environment, creating new jobs, new skills, and empowering a new generation.<br><br>Zando.co.za and Jumia.co.za are South Africa\\u2019s top online shopping destinations for fashion, homeware, accessories, and so much more! We are looking for top talent to join our team of passionate and dedicated individuals in changing the digital landscape and building the best eCom business in Africa!<br><br>We are looking for a Planning Manager to join our dynamic and forward-thinking Purchasing Team. This is the ideal opportunity for a commercially minded, results-driven individual with a strong track record in managing a Planning Team within a retail environment.<br><br><strong><u>Key Performance Areas<br><\/u><\/strong><ul><li> Development and management of the Planning and Inbound Team.<\/li><li> Provide overall business merchandise plans and guidelines.<\/li><li> Provide monthly warehouse intake capacity plans.<\/li><li> Plan seasonal and monthly sales by department.<\/li><li> Business OTB Management: Pre-season planning &amp; finalise all budgets with teams.<\/li><li> Review and guide teams on departmental and category plans.<\/li><li> Monitor and react to sales information.<\/li><li> Ensure in stock of Replenishment lines.<\/li><li> Actively drive performance of Key accounts.<\/li><li> Work with planning &amp; marketing teams on weekly commercial plan.<\/li><li> Provide documented analysis of sales and promotional results.<\/li><li> Markdown management.<\/li><li> General management of reporting.<\/li><li> Liaising with Buyers; Operations, Finance and BI Team.<\/li><li> Management of projects. <br><\/li><\/ul><strong><u>Education, Skills, Behaviour And Knowledge Required<\/u><\/strong><ul><li> Degree\/ diploma in Business Management, B-Com or similar.<\/li><li> Proven experience in managing a Planning Team within a retail environment.<\/li><li> Knowledge of the SA fashion industry \/ e-commerce industry is an advantage. <\/li><li> Highly analytical and numbers driven.<\/li><li> Able to communicate effectively with all areas of the business.<\/li><li> Think out-of-the box and being creative is an integral part of your working and living.<\/li><li> Organized and able to manage and coordinate various projects with various stakeholders.<\/li><li> Managing a team motivates you and what you do, you do with passion.<\/li><li> Whilst keeping an eye on all the relevant details of the job on hand, you never forget the bigger picture.<\/li><li> Advanced level in MS Office package \\u2013 with a specific focus on Excel and Microsoft PowerBI.<\/li><li> Able to find solutions and be a good decision maker.<\/li><li> Has a strategic \/ planning view.<\/li><li> Ability to live the Zando values:<\/li><ul><li> Delivers customer satisfaction;<\/li><li> Leads Completely;<\/li><li> Embraces and Drives Change;<\/li><li> Goes the extra mile;<\/li><li> Is adventurous, open-minded and creative;<\/li><li> Creates fun and a positive team Spirit.<\/li><li>This appointment will be made in accordance with the Company\\u2019s Employment Equity Plan and preference will be given to people from Designated Groups and people with a disability, provided such job applicants meet the inherent criteria of the vacancy.<\/li><li> Please note only shortlisted candidates will be contacted.<\/li><\/ul><\/ul>\"}"
}