{
    "id":"Kaggle::techmap::6156167aa6740c534abc6931::monster_ca::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Qualifications: Experience and Education: A degree in Chemical Engineering from an accredited university. 10 years of experience in the oil industry as a process engineer in Operations, Process Safety or in an EPC organization. Professional Engineer or eligible for registration as a Professional Engineer in the province of Alberta. CSO Common Safety Orientation (or equivalent) (or must obtain prior to start). If this position is classified as safety risk sensitive, you must also be able to pass pre-access drug & alcohol testing. Successfully pass a criminal background check. Authorized to legally work in Canada (eligible to work in the country for the duration of the assignment. Skills and Abilities: Excellent communication and interpersonal skills to lead and interact with diverse teams. Excellent analytical problem solving skills. Ability to effectively facilitate collaborative meetings with process, maintenance and technical personnel. Ability to work independently with little need for direction and supervision. Ability to provide guidance and mentorship to junior process engineers, review their work. Apply engineering theory and skills in mass balance, fluid flow, thermodynamics and distillation. Effectively manage priorities and responsibilities to keep commitments. Kindly submit your resume in Word format and ensure your work history includes the Month\/Year for every employer. We thank all applicants for applying, however only those considered for an interview will be contacted directly. Looking for more opportunities? Check out our website at www. spiritomega. org. Don't see a posting that suits you? Apply to our \"General Application\" and our recruiters will get in touch when they have a job that fits you! Follow us \"Spirit Omega\" on Linked. In, Facebook, and Twitter for all our new postings. Powered by JazzHR.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156167aa6740c534abc6931::monster_ca\", \"source\": \"monster_ca\", \"country\": \"CA\", \"company\": \"Spirit Omega Inc.\", \"position\": \"Chemical Engineer\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p><strong><em>Job Reference #:&nbsp;<\/em>CHEMI02021<\/strong><\/p> <p><strong>Company Overview<\/strong><\/p> <p>Do you want to work with one of Canada\\u00e2\\u20ac\\u2122s top oil and gas companies represented by an award-winning staffing agency? Look no further and join the Spirit circle today!<\/p> <p><strong>Our well established Oil and Gas client is seeking an experienced and driven <em><u>Chemical Engineer<\/u><\/em> to provide support to their Project Development Services Division in Calgary, AB.<\/strong><\/p> <p><strong>What's in it for you?<\/strong><\/p> <ul> <li>Work with one of Canada's \\\"Top 100 Employers,\\\" with possibility of extension or permanent placement.<\/li> <li>Full time shifts; Monday to Friday (subjected to change)<\/li> <li>This position is looking to start ASAP with contract review date of December 31, 2021.<\/li> <li>Competitive Compensation and Benefits.<\/li> <li>Representation by an award-winning staffing agency that takes pride in our personalized approach to staffing, ensuring you are a valued member of the team - not just a number.<\/li> <\/ul> <p><strong>Please note that this position is located in Calgary, AB&nbsp;and local candidates are preferred. Non-local candidates will be&nbsp;considered but must be willing to secure their own accommodations, as there is no camp, LOA, or accommodation allowance provided.<\/strong><\/p> <p><strong>Key Accountabilities:&nbsp;<\/strong><\/p> <ul> <li>Provide engineering oversight of internal and external resources for scope development.<\/li> <li>Review of multidiscipline technical engineering drawings\/studies\/calculations provided by an engineering contractor<\/li> <li>Define Operating parameters such as operating envelopes, Heat and Mass Balance, hydraulic analysis, PFD\\u00e2\\u20ac\\u2122s, Initial control philosophies etc.<\/li> <li>Complete chemical engineering calculations using Aspen HYSYS or PipeFlow, perform technical documents searches, collect field data to assist interdisciplinary technical teams in developing and progressing short and long term projects<\/li> <li>Learn and utilize engineering systems (i.e. PI Data, PI ProcessBook, TDocS, Intools) to collect process, instrumentation and utility data in order to address operability, reliability, availability and maintainability issues<\/li> <li>Collect and analyze plant data, formulate alternative solutions to problems\/opportunities and make cost effective recommendations consistent with overall project and plant objectives<\/li> <li>Work with broad team of professionals and field specialists (engineers, maintenance personnel, instrument technicians, network analysts, and plant operators) to resolve process safety and plant reliability issues<\/li> <li>Help investigate equipment and process malfunctions, work as part of a team to carry out design work for safety or efficiency improvements and conduct field studies to determine accuracy of existing records<\/li> <li>Travel to site to verify collected data and field check equipment and technical information with assistance of operations and technical teams.<\/li> <li>Other duties as required.<\/li> <\/ul> <p><strong>Qualifications:<\/strong><\/p> <p><strong>Experience and Education:<\/strong><\/p> <ul> <li>A degree in Chemical Engineering from an accredited university<\/li> <li>10 years of experience in the oil industry as a process engineer in Operations, Process Safety or in an EPC organization<\/li> <li>Professional Engineer or eligible for registration as a Professional Engineer in the province of Alberta<\/li> <li>CSO Common Safety Orientation (or equivalent) (or must obtain prior to start)<\/li> <li>If this position is classified as safety risk sensitive, you must also be able to pass pre-access drug &amp; alcohol testing.<\/li> <li>Successfully pass a criminal background check.<\/li> <li>Authorized to legally work in Canada (eligible to work in the country for the duration of the assignment.<\/li> <\/ul> <p><strong>Skills and Abilities:<\/strong><\/p> <ul> <li>Excellent communication and interpersonal skills to lead and interact with diverse teams; excellent analytical problem solving skills<\/li> <li>Ability to effectively facilitate collaborative meetings with process, maintenance and technical personnel<\/li> <li>Ability to work independently with little need for direction and supervision<\/li> <li>Ability to provide guidance and mentorship to junior process engineers, review their work<\/li> <li>Apply engineering theory and skills in mass balance, fluid flow, thermodynamics and distillation<\/li> <li>Effectively manage priorities and responsibilities to keep commitments<\/li> <\/ul> <p><b>Kindly&nbsp;submit your resume in&nbsp;<u>Word format&nbsp;<\/u>and ensure your work history&nbsp;includes the&nbsp;<u>Month\/Year<\/u>&nbsp;for every employer.&nbsp;&nbsp;<\/b><\/p> <p>**We thank all applicants for applying, however only those considered for an interview will be contacted directly**<\/p> <p><em>Looking for more opportunities? Check out our website at www.spiritomega.org<\/em><\/p> <p><em>Don't see a posting that suits you? Apply to our \\\"General Application\\\" and our recruiters will get in touch when they have a job that fits you!<\/em><\/p> <p><em>Follow us \\\"Spirit Omega\\\" on LinkedIn, Facebook, and Twitter for all our new postings.<\/em><\/p> <p style=\\\"margin-bottom:11px\\\">&nbsp;<\/p> <p>Powered by JazzHR<\/p> <\/div>\"}"
}