{
    "id":"Kaggle::techmap::614b9c2e0617597446c781a5::monster2_nl::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Proven operation and merchandising excellence. Passion for Makeup, preferably with artistry experience and ability to develop unique looks and make-up styles, flexing to suit relevant client \/ customer. Cosmetic industry and artistry experience preferred. Demonstrated ability to independently solve moderate to complex problems. Demonstrates flexibility and takes initiative with minimal direction. Proficiency in Microsoft Suite, including Word, Excel and Outlook. Must have open flexibility to work during peak traffic times, including evenings, weekends and holidays. Must be able to perform essential functions (with or without an accommodation) without posing a \"direct threat\" to the health and safety to self or others. The Company reserves the right to alter, change, abolish and even combine jobs depending upon changing conditions. No recruitment agencies, please.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b9c2e0617597446c781a5::monster2_nl\", \"source\": \"monster2_nl\", \"country\": \"NL\", \"company\": \"Morphe\", \"position\": \"Store Manager - 38 hours\", \"notes\": \"\", \"original\": \"Morphe was born in 2008 among the artists and influencers in Los Angeles. &nbsp;Finally. &nbsp;A beauty brand created for the creators. &nbsp;For the dreamers. &nbsp;For those looking for killer makeup without killing their wallet. &nbsp;A place where our #MorpheBabe can let their passion and creativity for beauty fly high. &nbsp;We're more than just a brand; we're a ride-or-die fam. &nbsp;&nbsp;The Store Manager is responsible for the success and leadership of the Morphe Retail store through management of exceptional customer service, sales and operations, high performance people, and driving profitable growth &amp; achievement of financial goals and KPI\\u2019s such as brand expression, engagement, retention, conversion, payroll, and inventory. The Store Manager is an integral part of the selling floor, spending their time coaching, leading, and developing the team to deliver on their sales and service goals. &nbsp;The Store Manager manages the P&amp;L, including payroll, to ensure store\\u2019s contributions are meeting or exceeding target and that store operations are running smoothly and efficiently. The Store Manager is responsible for delivering the Morphe in-store experience by creating a unique, inviting, entertaining, and educational multi-brand shopping destination for the Morphe babe.Sales\/FinancialResponsible for driving sales to meet or exceed targets and financial goals.Management of store P&amp;L, budget, and performance.Successfully execute and drive traffic for company driven promotions and launches to meet and exceed sales targets and deliver the best experience possible for customers.Responsible for driving local events and experiences for customers, in partnership with district or regional management. Where applicable, oversee the in-house makeup studio management.ServicePrioritize time and energies in store to join the staff on the selling floor; coaching and developing the team; and leading by example.Positive representative of the Morphe brand.Deliver the full Morphe customer service experience, catering to the customers\\u2019 needs in store and optimizing makeup stations and makeup studios, where applicable.Consistently elevate their own artistry skills and the artistry skills of the team.Develops knowledge of trends in industry to provide best service possible and share with the squad.LeadershipEntrepreneurial inspirational leader who is comfortable taking responsibility for the store as their own business while also following the company standards.Responsible for all people management in store, recruiting, training, coaching and developing top talent to grow within the organization. &nbsp;Must fill open positions with urgency.Support education and artistry, working closely with the Morphe Education team to schedule trainings and consistent skills development. Act as advocate and student. Ensure all trainings are delivered on brand and the desired artistry and service knowledge\/skills are built with every employee in store. Facilitate trainings for store team as assigned.Responsible for building a productive and dynamic Morphe squad by connecting with employees, customers, and influencers. These must be strong relationships and connections founded on the common passion for makeup.Confident and skillful coach and manager to the team. Comfortable navigating difficult conversations with professionalism, poise and kindness; actively provide coaching and feedback to develop employees in their position and help them grow.Creates an environment where clear and fair expectations are set and all employees are treated with respect.Provide feedback to district or regional management, as applicable, to inform improvements that are needed. &nbsp;Identify opportunities and share trends in the market\/industry.OperationsEnsures the store operations are run smoothly, safely and efficiently and the environment is always appealing and engaging for the customer to explore.Responsible for the store\\u2019s daily visual presentation.Responsible for knowing, following and administering all company policies and procedures.Ensures corporate communications are filtered to the team.Acts to reduce LP and product returns\/damages.Manages effective oversight of budget expenditures.Responsible for staff payroll hours and scheduling. Create and\/or approve schedules which drive sales opportunities and maximizes customer experience, ensures staffing is prioritized to provide optimal schedules and ensure the best customer service is provided.Reviews and approves Timekeeping records for the staff, ensuring accurate hours are submitted. Ensures record keeping standards.Oversees effective merchandising updates and management of in-store inventory levels.&nbsp;Oversees the planning and execution of all Visual displays. Customize the visual direction to fit the store dimensions, communicate timelines and execute the floor set with precision and on time.Ensure consistent standards of cleanliness, maintenance and organization.PROFESSIONAL REQUIREMENTSMinimum of 3 years\\u2019 experience in supervisory or managerial role.Outstanding verbal and written communication skills with an ability to influence others.Excellent planning, prioritization and organizational skills.Demonstrated strategic thinking and business acumen, proven ability to analyze sales data and create effective action plans.Proven ability to provide leadership that motivates teams to exceed sales goals while maintaining payroll budgets.Ability to identify top talent, network, recruit, create and maintain high performing teams.Proven operation and merchandising excellence.Passion for Makeup, preferably with artistry experience and ability to develop unique looks and make-up styles, flexing to suit relevant client \/ customerCosmetic industry and artistry experience preferred.Demonstrated ability to independently solve moderate to complex problems.Demonstrates flexibility and takes initiative with minimal direction.Proficiency in Microsoft Suite, including Word, Excel and OutlookMust have open flexibility to work during peak traffic times, including evenings, weekends and holidays.Must be able to perform essential functions (with or without an accommodation) without posing a \\\"direct threat\\\" to the health and safety to self or others.The Company reserves the right to alter, change, abolish and even combine jobs depending upon changing conditions.<em>No recruitment agencies, please.<\/em>\"}"
}