{
    "id":"Kaggle::techmap::61560681aadbe91938edf661::monster_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Support the team to champion NHS Identity branding guidelines and apply it to all digital and wider communication materials. Represent the communications team on project groups and other forums to ensure that communication needs are met. Contribute content for internal and external newsletters. Support other members of the Communications and Engagement team at events. Liaise with printers, designers and other external suppliers. Undertake work outside normal hours, including occasional event or weekend and carry out any other appropriate duties as may be required for the effective functioning of the Communications and Engagement team. Person Specification Experience Essential Experience of working in communications. Qualifications Essential Degree-level education or equivalent level of experience working in a professional communications\/public relations\/journalism role. Tier 2 Certificate of Sponsorship Applications from job seekers who require current Tier 2\/skilled worker sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information visit the UK Visas and Immigration website. From 6 April 2017, Tier 2\/skilled worker applicants, applying for entry clearance into the UK, have had to present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) are also subject to this requirement. Guidance can be found here Criminal records checks for overseas applicants. Employer details Employer name Mid and South Essex NHS Foundation Trust. Address Remote Working. Essex. SS16 5NL. Employer's website httpswww. mse. nhs.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61560681aadbe91938edf661::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"National Health Service\", \"position\": \"Communications Officer\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <div class=\\\"nhsuk-grid-row\\\"> <div class=\\\"nhsuk-grid-column-two-thirds\\\"> <h1 class=\\\"nhsuk-heading-xl nhsuk-u-margin-bottom-2 word-wrap\\\" id=\\\"heading\\\">Communications Officer<\/h1> <h2 class=\\\"nhsuk-heading-m\\\" id=\\\"employer_name\\\">Mid and South Essex NHS Foundation Trust<\/h2> <h2 class=\\\"nhsuk-heading-m\\\" id=\\\"closing_date\\\">The closing date is 04 October 2021<\/h2> <\/div> <div class=\\\"nhsuk-grid-column-one-third nhsuk-u-padding-top-2\\\"> <div class=\\\"nhsuk-action-link\\\"> <a class=\\\"nhsuk-action-link__link\\\" href=\\\"\/candidate\/jobadvert\/C9390-21-5260\/ats-direct-apply\\\" id=\\\"apply-ats-direct\\\" rel=\\\"nofollow nofollow\\\">Apply for this job<\/a> <\/div> <\/div> <div class=\\\"nhsuk-grid-column-two-thirds\\\"> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Job summary<\/h3> <p id=\\\"job_overview\\\"><\/p> <p>Mid &amp; South Essex's Health and Care Partnership (MSE HCP) communication's team has recently expanded, and we have an exciting opportunity for an enthusiastic Band 5 Communications Officer.<\/p> <p>As a Communications Officer, you will support the team to advise and deliver communications support to key strategic programmes. This includes (but is not limited to) supporting internal communications to staff as part of the Mid and South Essex Integrated Care System (ICS) transition programme.<\/p> <p>The post holder will support the development of communications plans, toolkits and compelling copy for internal and external channels. You will also identify innovative and creative ways of engaging with our staff and external audiences.<\/p> <p>In addition, you will also support the monitoring, reporting and evaluation of communications strategies and other communications channels - using this insight to inform improvements.<\/p> <p><\/p> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2 \\\">Main duties of the job<\/h3> <p id=\\\"job_description\\\"><\/p> <p>Duties of the role can be found above, full responsibilities can be found in the attached Job Description &amp; Person Specification.<\/p> <p><\/p> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">About us<\/h3> <p id=\\\"about_organisation\\\"><\/p> <p>Working for Mid &amp; South Essex Health and Care Partnership (ICS) is a challenging and rewarding opportunity. The Communications &amp; Engagement team provide a comprehensive and detailed service across our population of 1.2 million. We work across multiple organisations in the region; including NHS Trusts, CCGs, Local Providers, Voluntary Sector &amp; Local Authorities\/District Councils.<\/p> <p>The team leads, and supports on, key initiatives across our diverse population, ensuring we make a difference to our residents. Working for the team will ensure you will have the opportunity to grow and develop, while having a supportive and enthusiastic team with you.<\/p> <p>Please note, although this role works across the partnership, it is hosted by Mid &amp; South Essex NHS Foundation Trust.<\/p> <p>For more details, please visit - Mid and South Essex Health &amp; Care Partnership (msehealthandcarepartnership.co.uk)<\/p> <p><\/p> <h2 class=\\\"nhsuk-heading-l nhsuk-u-margin-bottom-2\\\">Job description<\/h2> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Job responsibilities<\/h3> <p id=\\\"job_description_large\\\" style=\\\"white-space:pre-line\\\"><\/p> <p><strong>Strategic programme communications support <\/strong><\/p> <ul> <li>Support the development and delivery of communications plans to support strategic programmes<\/li> <li>Plan for and deliver high quality content (text, images, blogs, vlogs etc) which is tailored to target audiences<\/li> <li>Create and manage editorial calendars and dashboards to schedule content to maximise opportunities to engage staff and external stakeholders<\/li> <li>Collaborate with other members of the CCG\/ICS and external stakeholders to support the design, development and implementation of communications<\/li> <\/ul> <p><\/p> <p><strong>Other duties<\/strong><\/p> <ul> <li>Support the team to champion NHS Identity branding guidelines and apply it to all digital and wider communication materials<\/li> <li>Represent the communications team on project groups and other forums to ensure that communication needs are met<\/li> <li>Contribute content for internal and external newsletters<\/li> <li>Support other members of the Communications and Engagement team at events<\/li> <li>Liaise with printers, designers and other external suppliers<\/li> <li>Undertake work outside normal hours, including occasional event or weekend and carry out any other appropriate duties as may be required for the effective functioning of the Communications and Engagement team<\/li> <\/ul> <p><\/p> <h2 class=\\\"nhsuk-heading-l nhsuk-u-margin-bottom-2\\\">Person Specification<\/h2> <h3 class=\\\"nhsuk-heading-s nhsuk-u-margin-bottom-2\\\" id=\\\"skill_category_1\\\"> Experience <\/h3> <h4 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Essential<\/h4> <ul class=\\\"nhsuk-list nhsuk-list--bullet nhsuk-u-margin-bottom-2\\\"> <li id=\\\"essential_skill_1_criteria_1\\\">Experience of working in communications<\/li> <\/ul> <h3 class=\\\"nhsuk-heading-s nhsuk-u-margin-bottom-2\\\" id=\\\"skill_category_2\\\"> Qualifications <\/h3> <h4 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Essential<\/h4> <ul class=\\\"nhsuk-list nhsuk-list--bullet nhsuk-u-margin-bottom-2\\\"> <li id=\\\"essential_skill_2_criteria_1\\\">Degree-level education or equivalent level of experience working in a professional communications\/public relations\/journalism role<\/li> <\/ul> <div id=\\\"dbs-container\\\"> <h3 class=\\\"nhsuk-heading-m nhsuk-u-margin-bottom-2\\\" id=\\\"tier-two-sponsorship\\\">Tier 2 Certificate of Sponsorship<\/h3> <p>Applications from job seekers who require current Tier 2\/skilled worker sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information visit the <a href=\\\"https:\/\/www.gov.uk\/government\/organisations\/uk-visas-and-immigration\\\" rel=\\\"noopener noreferrer nofollow noopener noreferrer\\\" target=\\\"_blank\\\"> UK Visas and Immigration website<\/a>.<\/p> <p>From 6 April 2017, Tier 2\/skilled worker applicants, applying for entry clearance into the UK, have had to present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) are also subject to this requirement. <a href=\\\"https:\/\/www.gov.uk\/government\/publications\/criminal-records-checks-for-overseas-applicants\\\" rel=\\\"noopener noreferrer nofollow noopener noreferrer\\\" target=\\\"_blank\\\"> Guidance can be found here Criminal records checks for overseas applicants<\/a>.<\/p> <\/div> <h2 class=\\\"nhsuk-heading-l nhsuk-u-margin-bottom-2\\\">Employer details<\/h2> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Employer name<\/h3> <p id=\\\"employer_name_details\\\">Mid and South Essex NHS Foundation Trust<\/p> <h3 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\">Address<\/h3> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_address_line_1_a\\\">Remote Working<\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_address_line_2_b\\\"><\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_town_c\\\">Essex<\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_county_d\\\"><\/p> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_postcode_e\\\">SS16 5NL<\/p> <br> <h4 class=\\\"nhsuk-heading-xs nhsuk-u-margin-bottom-2\\\" id=\\\"employer_website_heading\\\">Employer's website<\/h4> <p class=\\\"nhsuk-u-margin-bottom-2\\\" id=\\\"employer_website_url\\\"><a href=\\\"https:\/\/www.mse.nhs.uk\\\" id=\\\"employer_website_url_link\\\" rel=\\\"nofollow noopener noreferrer\\\" target=\\\"_blank\\\">https:\/\/www.mse.nhs.uk<\/a><\/p> <\/div> <\/div> <\/div>\"}"
}