{
    "id":"Kaggle::techmap::615d768db5f972720d8e95a4::seek_au::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Exciting opportunity to join the Natural Areas team at a fast growing Council. Permanent. Full time. Salary from $53, 282 to $59, 161 per annum, plus superannuation. About the City of Wanneroo. The City of Wanneroo is a diverse and flexible environment that offers a range of career opportunities where you will have the opportunity to make a real difference to the local community and our people. Our vibrant and inclusive team is what makes the City an enjoyable and rewarding place to be. We celebrate all diversity and strongly encourage Aboriginal and Torres Strait Islander people to consider working for a Local Government organisation that values who you are. Bring your skills, knowledge and commitment to a team that is welcoming and enthusiastic about you joining us! Aboriginal and Torres Strait Islander peoples are encouraged to apply. As a measure to achieve equality, Section 51 of the Equal Employment Opportunity Act 1984 applies to this position as the City of Wanneroo is committed to growing representation of the Aboriginal and Torres Strait Islander peoples in our workforce. We are seeking to increase the diversity of our workforce to better meet the differing needs of our customers and to improve equal opportunity outcomes for our employees. About the position. The City is seeking an experienced and enthusiastic person with local natural area knowledge and maintenance practices expertise. The successful appointee will be responsible for: Undertaking manual tasks, including various methods of weed control, fence repairs, pruning, litter removal and planting among other general natural area maintenance activities. Safety compliance. Following instructions as well as providing ideas and feedback and working in collaboration with the Trees and Conservation team. Use of technology for various tasks including, work order completion, safety compliance, emailing and timesheets. About you. As a collaborative member of the Trees and Conservation Maintenance team, the position is accountable for general conservation maintenance duties as directed by the Leading Hands and Supervisor. The successful appointee must be an adaptable, experienced person with a demonstrated interest in Conservation. They must also thrive working in a very busy and change driven organisation. As such, applicants must be able to demonstrate through their resume and covering letter that they meet the following capabilities: Physically fit and able to undertake manual labour and safely operate plant, equipment and machinery in an effective and efficient manner. Able to identify both locally native and invasive plant species and possess knowledge of best practice in Conservation Maintenance for the Swan Coastal Plain. Basic literacy and numeracy skills. Proven communication skills. Ability to work as part of a team.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615d768db5f972720d8e95a4::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"City of Wanneroo\", \"position\": \"General Hand - Natural Areas\", \"notes\": \"\", \"original\": \"<ul>\\n<li><strong>Exciting opportunity to join the Natural Areas team at a fast growing Council<\/strong><\/li>\\n<li><strong>Permanent - Full time <\/strong><\/li>\\n<li><strong>Salary from <\/strong><strong>$53,282 to $59,161 <\/strong><strong>per annum, plus superannuation<\/strong><\/li>\\n<\/ul>\\n<p><strong>About the City\\u00a0of Wanneroo<\/strong><\/p>\\n<p>The City of Wanneroo is a diverse and flexible environment that offers a range of career opportunities where you will have the opportunity to make a real difference to the local community and our people. Our vibrant and inclusive team is what makes the City an enjoyable and rewarding place to be.<\/p>\\n<p>We celebrate all diversity and strongly encourage Aboriginal and Torres Strait Islander people to consider working for a Local Government organisation that values who you are. Bring your skills, knowledge and commitment to a team that is welcoming and enthusiastic about you joining us!<\/p>\\n<p>Aboriginal and Torres Strait Islander peoples are encouraged to apply.<\/p>\\n<p>As a measure to achieve equality, Section 51 of the Equal Employment Opportunity Act 1984 applies to this position as the City of Wanneroo is committed to growing representation of the Aboriginal and Torres Strait Islander peoples in our workforce. We are seeking to increase the diversity of our workforce to better meet the differing needs of our customers and to improve equal opportunity outcomes for our employees.\\u00a0<\/p>\\n<p><strong>About the position<\/strong><\/p>\\n<p>The City is seeking an experienced\\u00a0and enthusiastic person with\\u00a0local natural area knowledge and maintenance practices\\u00a0expertise.\\u00a0 The successful appointee will be responsible for:<\/p>\\n<ul>\\n<li>Undertaking manual tasks, including various methods of weed control, fence repairs, pruning, litter removal and planting among other general natural area maintenance activities<\/li>\\n<li>Safety compliance<\/li>\\n<li>Following instructions as well as providing ideas and feedback and working in collaboration with the Trees and Conservation team<\/li>\\n<li>Use of technology for various tasks including, work order completion, safety compliance, emailing and timesheets.<\/li>\\n<\/ul>\\n<p><strong>About you<\/strong><\/p>\\n<p>As a collaborative member of the Trees and Conservation Maintenance team, the position is accountable for general conservation maintenance duties as directed by the Leading Hands and Supervisor. The successful appointee must be an adaptable, experienced person with a demonstrated interest in Conservation. They must also thrive working in a very busy and change driven organisation.\\u00a0\\u00a0 As such, applicants must be able to demonstrate through their resume and covering letter that they meet the following capabilities:<\/p>\\n<ol>\\n<li>Physically fit and able to undertake manual labour and safely operate plant, equipment and machinery in an effective and efficient manner.<\/li>\\n<li>Able to identify both locally native and invasive plant species and possess knowledge of best practice in Conservation Maintenance for the Swan Coastal Plain.<\/li>\\n<li>Basic literacy and numeracy skills<\/li>\\n<li>Proven communication skills<\/li>\\n<li>Ability to work as part of a team<\/li>\\n<li>Prioritise safety across all tasks, including, following instructions, correct operation of equipment, identifying hazards, mitigating risk and communicating effectively.<\/li>\\n<li>Effectively operate technological devices and complete associated tasks and do so in a timely manner.<\/li>\\n<li>Be willing and able to act in higher duties and other similar roles if required.<\/li>\\n<\/ol>\\n<p><strong>Why work for the City of Wanneroo<\/strong><\/p>\\n<p>The City offers a range of employment benefits including<\/p>\\n<ul>\\n<li>generous matching of superannuation contributions up to a combined total of 15%;<\/li>\\n<li>free on-site parking;<\/li>\\n<li>9-day fortnight;<\/li>\\n<li>purchase leave (subject to operational requirements); and<\/li>\\n<li>an opportunity to reduce your commute and work in a goal-driven professional team closer to home.<\/li>\\n<\/ul>\\n<p>To find out more about our benefits, click <a target=\\\"_blank\\\">here<\/a>!<\/p>\\n<p><strong>Interested?<\/strong><\/p>\\n<p>If this position sounds like your next career step - then apply now. We look forward to receiving your application.\\u00a0<\/p>\\n<p>Reference Number: 17945<\/p>\\n<p>\\u00a0<\/p>\\n<p>Close date: 10 October 2021 (10:00pm AWST)<br \/><br \/><\/p>\\n<p>For further information regarding\\u00a0the position visit the City of Wanneroo\\u00a0website or contact Jeremy Walker, Coordinator Trees &amp; Conservation on 9405 5531<\/p>\\n<p><strong><em>Applicants may be required to undergo a medical assessment to determine their fitness to carry out the duties of this position.<\/em><\/strong><\/p>\\n<p><strong><em>All employees and prospective employees of the City of Wanneroo are required to declare any secondary employment and private activities to ensure that any conflict of interests may be appropriately managed.<\/em><\/strong><\/p>\\n<p><strong><em>To apply for this position, you must have the right to work in Australia and be willing to provide a National Police Clearance no older than 6 month. <\/em><\/strong><\/p>\"}"
}