{
    "id":"Kaggle::techmap::6148705b634e904204126cfe::careerbuilder_us::1",
    "label_age":true,
    "analysis_age":"The phrase \"Must possess ability to work at a rapid pace\" could be interpreted as bias towards younger people.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". ABOUT SHERIDAN: Sheridan is a family of innovators and doers who are a part of something far greater than themselves. We value the craft and art of printing and the processes used to create and distribute the world’s content. We care about each other, support each other, and provide every opportunity for training, growth,. and developments. We work hard, we have fun, and we are proud of what we do. YOUR CAREER AWAITS. JOIN US! STATEMENT OF PURPOSE: The Saddle Stitch Operator performs manual and machine operation tasks related to the inserter machine. Check logbook for any pertinent information. Set-up inserter machine based upon job ticket information. Set-up mailer section based upon the instructions received from the shipping ticket and label. Technician’s instruction sheet. Confirm that bound matter matches job ticket. Provide guidance and leadership to the crew. Monitor quality of product throughout job according to established procedures. Maintain an acceptable level of production based upon job requirements. Complete all applicable paperwork. Maintain equipment and repair\/service as needed. Able to lift a maximum of 70 lbs. Requires regularly standing, walking, carrying, climbing, lifting, and reaching, as well as manual dexterity. Exposure to noise. Exposure to arm and wrist fatigue. Must wear hearing protection and safety shoes. • A minimum of a High School diploma or GED required. 3 to 5 years previous experience in Printing, specifically Finishing operations required. Proven organizational, interpersonal, and leadership skills required. Proven mechanical ability required. Basic verbal and written communication skills. Must possess ability to work at a rapid pace. Ability to learn the job and perform work productively and safely. • Reliable. Good attendance is expected. May be required to work mandatory overtime as needed. BENEFITS:. Medical, Dental, & Vision. • 401(k) plus Company Match. Life, AD&D, Disability. Paid Holiday & Vacation Time. Tuition Reimbursement. Paid Lunch Breaks. Employee Assistance Program. APPLICATION PROCESS: To apply, please email your resume to [Email available when viewing the job] or. visit [Link available when viewing the job] \/> CJK Group is an Equal Opportunity\/Affirmative Action employer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148705b634e904204126cfe::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Sheridan Group Inc. company\", \"position\": \"Saddle Stitch Operator - 3rd Shift\", \"notes\": \"\", \"original\": \"<div><\/div><br \/><div><\/div><div><br \/><br \/><\/div><div><b>ABOUT SHERIDAN:<\/b>\\u00a0<\/div><div><br \/><\/div><div>Sheridan is a family of innovators and doers who are a part of something far greater than themselves.<\/div><div><br \/><\/div><div>We value the craft and art of printing and the processes used to create and distribute the world\\u2019s content.<\/div><div><br \/><\/div><div>We care about each other, support each other, and provide every opportunity for training, growth,\\u00a0<\/div><div><br \/><\/div><div>and developments. We work hard, we have fun, and we are proud of what we do.\\u00a0<\/div><div><br \/><\/div><div><b>YOUR CAREER AWAITS... JOIN US!<\/b><\/div><br \/><br \/><div><b>STATEMENT OF PURPOSE:<\/b><\/div><br \/><div>The Saddle Stitch Operator performs manual and machine operation tasks related to the inserter machine.<\/div><div><br \/><\/div> <div><div>\\u2022\\tCheck logbook for any pertinent information.<\/div><br \/><div>\\u2022\\tSet-up inserter machine based upon job ticket information.<\/div><br \/><div>\\u2022\\tSet-up mailer section based upon the instructions received from the shipping ticket and label\\u00a0<\/div><br \/><div>\\tTechnician\\u2019s\\u00a0instruction sheet.<\/div><br \/><div>\\u2022\\tConfirm that bound matter matches job ticket.<\/div><br \/><div>\\u2022\\tProvide guidance and leadership to the crew.<\/div><br \/><div>\\u2022\\tMonitor quality of product throughout job according to established procedures.<\/div><br \/><div>\\u2022\\tMaintain an acceptable level of production based upon job requirements.<\/div><br \/><div>\\u2022\\tComplete all applicable paperwork.<\/div><br \/><div>\\u2022\\tMaintain equipment and repair\/service as needed.<\/div><div><br \/><\/div><\/div><div><br \/><\/div> \\u200b\\u2022\\tAble to lift a maximum of 70 lbs.<br \/><br \/><div><div>\\u2022\\tRequires regularly standing, walking, carrying, climbing, lifting, and reaching, as well as manual dexterity.<\/div><br \/><div>\\u2022\\tExposure to noise; exposure to arm and wrist fatigue; must wear hearing protection and safety shoes.<\/div><div><br \/><\/div><\/div> <div>\\u2022\\tA minimum of a High School diploma or GED required.<\/div><br \/><div>\\u2022\\t3 to 5 years previous experience in Printing, specifically Finishing operations required.<\/div><br \/><div>\\u2022\\tProven organizational, interpersonal, and leadership skills required.<\/div><br \/><div>\\u2022\\tProven mechanical ability required.<\/div><div><br \/><\/div><div>\\u2022\\tBasic verbal and written communication skills.<\/div><br \/><div>\\u2022\\tMust possess ability to work at a rapid pace.<\/div><br \/><div>\\u2022\\tAbility to learn the job and perform work productively and safely.<\/div><br \/><div>\\u2022\\tReliable; good attendance is expected.<\/div><br \/><div>\\u2022\\tMay be required to work mandatory overtime as needed.<\/div><div><br \/><\/div><br \/><div><br \/><div><b>BENEFITS:<\/b><\/div><div><br \/><\/div><div>\\u2022\\tMedical, Dental, & Vision\\u00a0<\/div><br \/><div>\\u2022\\t401(k) plus Company Match\\u00a0<\/div><br \/><div>\\u2022\\tLife, AD&D, Disability<\/div><br \/><div>\\u2022\\tPaid Holiday & Vacation Time\\u00a0<\/div><br \/><div>\\u2022\\tTuition Reimbursement\\u00a0<\/div><br \/><div>\\u2022\\tPaid Lunch Breaks<\/div><br \/><div>\\u2022\\tEmployee Assistance Program<\/div><br \/><br \/><div><b>APPLICATION PROCESS:<\/b><\/div><br \/><div>To apply, please email your resume to [Email available when viewing the job] or<\/div><br \/><div>\\u00a0visit\\u00a0[Link available when viewing the job] \/><p>CJK Group is an Equal Opportunity\/Affirmative Action employer.\\u00a0 All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.<\/p><div><br \/><br \/><\/div><br \/><\/div>&nbsp;\"}"
}