{
    "id":"Kaggle::techmap::61489831e339e75fa39b0e99::seek_nz::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"repeated references to \"fitness\" without further clarification of what exactly is entailed in the role might discourage those that are physically capable of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Claymark Group is New Zealand’s largest manufacturer and exporter of premium pine products made from sustainably managed radiata pine plantations in New Zealand’s central North Island. Employing over 600 employees across six sites, Claymark is experiencing growth and expansion under new ownership. We are looking for a Timber Filleter. Our ideal candidate will be fit, enjoy working with others in a team environment in the outdoors, have a strong work ethic and maintain a clean work station. You will be highly organised with a strong attention to detail, and have a positive attitude. Key Functions and duties: To ensure that all timber to be kiln dried is correctly filleted prior to be entered into the kilns. To safely and efficiently de-fillet kiln dried timber in order for it to be remanufactured. To ensure that all timber to be filleted or de-filleted is achieved to a consistently high standard of workmanship. To complete (fillet or de-fillet) a specified minimum of frames of timber per day. To ensure that the work area is keep in a clean and tidy condition at all times. To ensure that all health and safety policies and practices are maintained and followed at all times. To ensure accurate time and work records are keep and approved by the Kiln Drying Leader. Undertaking any other duties as may be assigned by the Kiln Drying Leader or Site Leader, from time to time, in order to ensure the continuous operation of the business. Person Specifications: Be naturally driven to improve quality and increase output. Must be physically fit. Must be reliable and punctual. Excellent organisational skills and attention to detail. Ability to work to deadlines. Strong ability to communicate clearly and concisely. Must maintain a clean work area at all times. If you are looking for a dynamic, physically active role, we would love to hear from you! Applicants for this position should have NZ residency or a valid NZ work permit. To apply, please send your Covering Letter and CV to ***@claymark. co. nzor apply in person at our office at 10-24 Vaughan Rd, Rotorua. Applications close Monday 18 October 2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61489831e339e75fa39b0e99::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"CLAYMARK GROUP LIMITED PARTNERSHIP\", \"position\": \"Timber Filleter - Claymark: Rotorua Vaughan Rd\", \"notes\": \"\", \"original\": \"<p>Claymark Group is New Zealand\\u2019s largest manufacturer and exporter of premium pine products made from sustainably managed radiata pine plantations in New Zealand\\u2019s central North Island. Employing over 600 employees across six sites, Claymark is experiencing growth and expansion under new ownership.<\/p><p>We are looking for a Timber Filleter.\\u00a0 Our ideal candidate will be fit, enjoy working with others in a team environment in the outdoors, have a strong work ethic and maintain a clean work station. You will be highly organised with a strong attention to detail, and have a positive attitude.<em>\\u00a0<\/em><\/p><p><strong>Key Functions and duties:<\/strong><\/p><ul><li>To ensure that all timber to be kiln dried is correctly filleted prior to be entered into the kilns.<\/li><li>To safely and efficiently de-fillet kiln dried timber in order for it to be remanufactured .<\/li><li>To ensure that all timber to be filleted or de-filleted is achieved to a consistently high standard of workmanship.<\/li><li>To complete (fillet or de-fillet) a specified minimum of frames of timber per day.<\/li><li>To ensure that the work area is keep in a clean and tidy condition at all times.<\/li><li>To ensure that all health and safety policies and practices are maintained and followed at all times.<\/li><li>To ensure accurate time and work records are keep and approved by the Kiln Drying Leader\\u00a0<\/li><li>Undertaking any other duties as may be assigned by the Kiln Drying Leader or Site Leader, from time to time, in order to ensure the continuous operation of the business.<\/li><\/ul><p><strong>Person Specifications:<\/strong><\/p><ul><li>Be naturally driven to improve quality and increase output.\\u00a0<\/li><li>Must be physically fit.\\u00a0<\/li><li>Must be reliable and punctual.\\u00a0<\/li><li>Ability to work unsupervised, be self-motivated and use initiative.<\/li><li>Excellent organisational skills and attention to detail.<\/li><li>Ability to work to deadlines.<\/li><li>Strong ability to communicate clearly and concisely.\\u00a0<\/li><li>Must maintain a clean work area at all times.\\u00a0<\/li><\/ul><p>If you are looking for a dynamic, physically active role, we would love to hear from you!<\/p><p>Applicants for this position should have NZ residency or a valid NZ work permit.\\u00a0<\/p><p><strong>To apply, please send your Covering Letter and CV to\\u00a0recruitment@claymark.co.nzor apply in person at\\u00a0<\/strong><strong>our<\/strong><strong> office at 10-24 Vaughan Rd, Rotorua.\\u00a0<\/strong><\/p><p><strong>Applications close Monday 18 October 2021.\\u00a0<\/strong><\/p>\"}"
}