{
    "id":"Kaggle::techmap::6142cb49a973d70733cfd07a::britishjobs_uk::3",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Pinnacle Group provides people-first, integrated services across a range of community-facing assets and infrastructure – including multi-tenure housing, schools, open spaces, public buildings, utilities and broadband networks – as well as a range of complementary employment and wellbeing outcomes. Across the UK, Pinnacle supports over 300, 000 homes, 200 schools and 80 public buildings creating value, providing stewardship and generating positive outcomes for our customers, our partners and our clients. Our FM business delivers Facilities Management to homes, public and private sector bodies including Registered Providers, schools, universities and blue light statutory authorities. We pride ourselves on placing people at the centre of what we do, while maintaining our values of high quality and excellent customer care. The Role – Bulk Operative. You will be responsible for overseeing the collection, sorting and safe disposal of waste and recycling materials on site. Segregating waste, identifying and storage of recyclables, empty and refresh recycling\/waste bins, regular checks on the condition of equipment. Duties\/Key Responsibilities. Keeping areas as clean as possible when sorting through waste bins. Ensuring the correct materials go in the correct bins. General gardening and grounds maintenance duties when required. Always taking health & safety precautions when sorting through disposed materials. Skills Required. Relatable Transferrable skills. Health & Safety awareness. Driving Licence. Physically fit. We are Armed Forces friendly. We welcome applications from ex-Armed Forces personnel, reservists, armed forces veterans, cadet instructors and military spouses\/partners.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6142cb49a973d70733cfd07a::britishjobs_uk\", \"source\": \"britishjobs_uk\", \"country\": \"UK\", \"company\": \"Pinnacle Group\", \"position\": \"Bulk Driver\", \"notes\": \"\", \"original\": \"Pinnacle Group provides people-first, integrated services across a range of community-facing assets and infrastructure &ndash; including multi-tenure housing, schools, open spaces, public buildings, utilities and broadband networks &ndash; as well as a range of complementary employment and wellbeing outcomes. Across the UK, Pinnacle supports over 300,000 homes, 200 schools and 80 public buildings creating value, providing stewardship and generating positive outcomes for our customers, our partners and our clients.<br><br>Our FM business delivers Facilities Management to homes, public and private sector bodies including Registered Providers, schools, universities and blue light statutory authorities. We pride ourselves on placing people at the centre of what we do, while maintaining our values of high quality and excellent customer care.<br><br>The Role &ndash; Bulk Operative<br><br>You will be responsible for overseeing the collection, sorting and safe disposal of waste and recycling materials on site. Segregating waste, identifying and storage of recyclables, empty and refresh recycling\/waste bins, regular checks on the condition of equipment.<br><br>Duties\/Key Responsibilities<br><br>  * Keeping areas as clean as possible when sorting through waste bins<br><br>  * Ensuring the correct materials go in the correct bins<br><br>  * General gardening and grounds maintenance duties when required<br><br>  * Always taking health &amp; safety precautions when sorting through disposed materials<br><br>Skills Required<br><br>  * Relatable Transferrable skills<br><br>  * Health &amp; Safety awareness<br><br>  * Driving Licence<br><br>  * Physically fit<br><br>Pinnacle Recruitment (Services) strives to be an equal opportunities employer and welcomes applications from anyone regardless of ethnic origin, gender, disability, age, trade union activity, marital status, religious belief or sexual orientation.<br><br>We are Armed Forces friendly. We welcome applications from ex-Armed Forces personnel, reservists, armed forces veterans, cadet instructors and military spouses\/partners.<br>\"}"
}