{
    "id":"Kaggle::techmap::614473afeda6e46b16446470::linkedin_hn::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"\" is a womens led organization\" is a phrase that might introduce subtle feminine bias.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description: Optio is looking for a full-time Digital Communications Associate who is passionate about womens rights and is based in Latin America. This is a hands-on, fast-paced role that will support and contribute to the growth of all aspects of our communications endeavors. Optio, is a womens led organization based in Berkeley, California. Our mission is to partner with grassroots organizations in Central America to advance the reproductive rights of women and girls. We are a team-based organization that makes most of its decisions in a collaborative fashion that allows for significant staff input. The Communications Associate will improve our digital capacity to publish and promote organizational content, lead a communications campaigns for safe abortion, and promote the work of our partners in the fight for womens rights. This position is designed for a self-starter who thrives in a collaborative environment and can also work independently. This position will play an essential part in implementing Optios communications strategy, which will advance our mission. Primary goal: Develop and execute a communications strategy for the organization and its programs. Key responsibilities: Support the development and implementation of a multi-faceted digital communications plan, which includes amplifying message development, web presence, advocacy, and social media to educate, motivate, and influence target audiences. Manage Optios website, posting news stories when relevant and adding\/changing content when needed. Provide day-to-day management and content development for Optios social media channels and campaigns, including editorial and graphic posts (Facebook, Twitter, Instagram, Linked In). Attend organizational meetings and events to identify digital communications needs and opportunities. Help with communications & design projects as needed. Experience & qualifications: Bachelors or Master's degree in English, communications, journalism, media studies, public policy, or a field closely related to Optios work preferred. 3 to 5 years of experience in digital communications in an advocacy, public relations, communications, or a communications-adjacent role. A professional office environment (nonprofit, advocacy, or agency) experience is preferred. Experience with digital communications, social media (Facebook, Twitter, Instagram), graphic design, and Word. Press web management. Graphic design, photography, video editing skills are a plus. Fluent in English and Spanish writing, speaking, and listening is required. Based in any Central American country or previous experience in the subregion is a strong plus. Core competencies: Motivated self-starter with demonstrated good judgment, critical thinking, flexibility, resourcefulness, and problem-solving abilities.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614473afeda6e46b16446470::linkedin_hn\", \"source\": \"linkedin_hn\", \"country\": \"HN\", \"company\": \"Optio - Choice, Freedom, Justice\", \"position\": \"Communications Associate\", \"notes\": \"\", \"original\": \"<p><strong>Description: <\/strong>Optio is looking for a full-time Digital Communications Associate who is passionate about women\\u2019s rights and is based in Latin America. This is a hands-on, fast-paced role that will support and contribute to the growth of all aspects of our communications endeavors. Optio, is a women\\u2019s led organization based in Berkeley, California. Our mission is to partner with grassroots organizations in Central America to advance the reproductive rights of women and girls. We are a team-based organization that makes most of its decisions in a collaborative fashion that allows for significant staff input. The Communications Associate will improve our digital capacity to publish and promote organizational content, lead a communications campaigns for safe abortion, and promote the work of our partners in the fight for women\\u2019s rights. This position is designed for a self-starter who thrives in a collaborative environment and can also work independently. This position will play an essential part in implementing Optio\\u2019s communications strategy, which will advance our mission.<\/p><p><br><\/p><p><strong>Primary goal:&nbsp;<\/strong>Develop and execute a communications strategy for the organization and its programs.&nbsp;<\/p><p><br><\/p><p><strong>Key responsibilities:&nbsp;<\/strong><\/p><ol><li>Support the development and implementation of a multi-faceted digital communications plan, which includes amplifying message development, web presence, advocacy, and social media to educate, motivate, and influence target audiences.&nbsp;<\/li><li>Manage Optio\\u2019s website, posting news stories when relevant and adding\/changing content when needed.&nbsp;<\/li><li>Provide day-to-day management and content development for Optio\\u2019s social media channels and campaigns, including editorial and graphic posts (Facebook, Twitter, Instagram, Linked In).&nbsp;<\/li><li>Attend organizational meetings and events to identify digital communications needs and opportunities.&nbsp;<\/li><li>Help with communications &amp; design projects as needed.&nbsp;<\/li><\/ol><p><br><\/p><p><strong>Experience &amp; qualifications:<\/strong><\/p><ol><li>Bachelor\\u2019s or Master's degree in English, communications, journalism, media studies, public policy, or a field closely related to Optio\\u2019s work preferred.&nbsp;<\/li><li>3 to 5 years of experience in digital communications in an advocacy, public relations, communications, or a communications-adjacent role; a professional office environment (nonprofit, advocacy, or agency) experience is preferred.&nbsp;<\/li><li>Experience with digital communications, social media (Facebook, Twitter, Instagram), graphic design, and WordPress web management.&nbsp;<\/li><li>Graphic design, photography, video editing skills are a plus.&nbsp;<\/li><li>Fluent in English and Spanish writing, speaking, and listening is required.<\/li><li>Based in any Central American country or previous experience in the subregion is a strong plus.&nbsp;<\/li><\/ol><p><br><\/p><p><strong>Core competencies:&nbsp;<\/strong><\/p><ol><li>Motivated self-starter with demonstrated good judgment, critical thinking, flexibility, resourcefulness, and problem-solving abilities.&nbsp;<\/li><li>Excellent written and verbal communication skills are required, along with a demonstrated ability to compose and edit effective, thoughtful, and strategic communications across a variety of platforms.&nbsp;<\/li><li>Strong interpersonal skills and an ability to work collaboratively with others in a team environment.&nbsp;<\/li><li>Ability to manage multiple projects simultaneously, while maintaining a firm grasp on individual project details and deadlines.&nbsp;<\/li><li>Experience implementing a communications strategy via social media, earned media, digital media, and other channels.&nbsp;<\/li><li>Experience in communicating complex issues to a variety of audiences.&nbsp;<\/li><li>Strong, detail-oriented organizational skills are required, as well as the ability to follow projects through to completion.&nbsp;<\/li><\/ol><p><br><\/p><p><strong>Conditions of employment:&nbsp;<\/strong>Optio is offering a full-time salary, including health benefits and technology stipend depending on a series of factors such as country where the person is based, experience, qualifications and availability of funds. Work schedule is flexible if 40 weekly hours are completed, and quality products are delivered on time. The contract will be for a duration of twelve (12) months, starting with a 3-month trial period. The contract will likely be extended depending on the funding available and the needs of the organization.&nbsp;<\/p><p><br><\/p><p><strong>Applications:&nbsp;<\/strong>Send your CV together with 2 professional references and an application letter to&nbsp;grecia@optio.org&nbsp;before October 15, 2021, at 17:00 PST. Recommendation letters from local feminist organizations based in Central America are a plus.&nbsp;<\/p><p>&nbsp;<\/p>\"}"
}