{
    "id":"Kaggle::techmap::6143a1cae9268c3dfe2f7a44::linkedin_uy::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The use of gendered terms like \"maternity shifts\" and the distinction between \"fathers\" and \"mothers\" in the parental leave policy may be seen as exclusionary towards non-binary individuals or same-sex couples who do not identify with these traditional gender roles.",
    "verified":true,
    "synthetic":false,
    "text":" 3 month paid parental leave (12 weeks for fathers\/ 18 weeks for mothers) plus up to 1 year maternity shifts. Daily meal allowance. Life Insurance. Corporate Social Responsibility opportunities. Recognition and acknowledgement programs. Fun employee engagement and development events. We will give careful consideration to your application and review your details against the position criteria. You will receive separate notification as we progress your application. Please note that only candidates who meet the minimum requirements will proceed in the selection process. To learn more about the people and culture at Sabre, follow us on Facebook and LinkedIn. Stay connected with Sabre Careers.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6143a1cae9268c3dfe2f7a44::linkedin_uy\", \"source\": \"linkedin_uy\", \"country\": \"UY\", \"company\": \"Sabre Uruguay\", \"position\": \"Senior Support Systems Engineering\", \"notes\": \"\", \"original\": \"<strong>Req ID :<\/strong> 55380<br><br><strong>Job Family :<\/strong> Information Technology\/Software Development<br><br>Sabre Corporation is a leading technology provider to the global travel and tourism industry. Headquartered in Southlake, Texas, USA, Sabre operates offices in approximately 60 countries around the world. At Sabre, we make travel happen. Positioned at the center of the business of travel, our platform connects people with experiences that matter in their lives. Today, Sabre is creating a new marketplace for personalized travel. It is our people who develop and deliver powerful solutions that meet the current and future needs or our airline, hotel and travel agency customers. Join our journey!<br><br><strong><u>Job Description<br><br><\/u><\/strong>We offer you an opportunity to join Sabre Software Systems Engineering team.<br><br>Our team supports several Java applications. One of our core applications are gateways that stand on the edge of Sabre systems and process 40% of Sabre's traffic. We make sure our systems are : Reliable, Scalable, Visible and Secure. We focus on applications migration to the cloud and on automation.<br><br>If you enjoy automating the world and working on real product, join us!<br><br><strong>Main Responsibilities :<br><\/strong><ul><li>Responsible for the overall stability, reliability, recoverability, operability<\/li><li>Implement legacy app migration to cloud (GCP), develop CI\/CD pipeline and monitoring in the cloud<\/li><li>Automate routine tasks<\/li><li>Analyze and troubleshoot technical problems<\/li><li>Responsible for applications deployment and configuration changes <\/li><li>Oncall Support<br><br><\/li><\/ul><strong><u>Job Requirements<br><br><\/u><\/strong><strong>Must have skills :<br><\/strong><ul><li>Good Linux \/Unix knowledge<\/li><li>Linux\/Applications monitoring and troubleshooting<\/li><li>Experience in cloud technologies (AWS, GCP) <\/li><li>Ability to handle multiple projects simultaneously, in a very fast paced environment<\/li><li>Networking knowledge (DHCP, DNS, TCP\/IP, HTTP, Load-balancing)<\/li><li>Good written and verbal English communication skills<\/li><li>Ability to quickly learn new technologies and keep abreast of the latest technological advances<\/li><li>Familiar with Git<br><\/li><\/ul><strong>Nice to have :<br><\/strong><ul><li>Knowledge of tools like Maven, Ansible, Jenkins<\/li><li>CI\/CD and terraform scripts<\/li><li>Java (JVM) \\u2013 general understanding<\/li><li>Familiar with Rally, Jira, Snow tools<\/li><li>Experience with : Migration of legacy apps to the cloud, Complex, high-availability systems, Capacity Planning, Change Management, Configuration Management, Site Reliability Engineering (Google SRE), ITSM\/ITIL <br><br><\/li><\/ul><strong><u>Benefits<br><\/u><\/strong><ul><li>Work in modern Zonamerica campus alongside all the amenities it has to offer!<\/li><li>Annual Performance bonus plan<\/li><li>Development opportunities in country or globally<\/li><li>We offer a competitive private health insurance for employees and eligible children <\/li><li>Extra Paid Time Off (5 extra days each year) <\/li><li>3 month paid parental leave (12 weeks for fathers\/ 18 weeks for mothers) plus up to 1 year maternity shifts <\/li><li>Daily meal allowance<\/li><li>Life Insurance <\/li><li>Corporate Social Responsibility opportunities<\/li><li>Recognition and acknowledgement programs<\/li><li>Fun employee engagement and development events<br><\/li><\/ul>We will give careful consideration to your application and review your details against the position criteria. You will receive separate notification as we progress your application. Please note that only candidates who meet the minimum requirements will proceed in the selection process. To learn more about the people and culture at Sabre, follow us on Facebook and LinkedIn.<br><br><strong>Stay connected with Sabre Careers<\/strong>\"}"
}