{
    "id":"Kaggle::techmap::616e33d633fccd39deb97ecd::careerbuilder_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Ability to work required hours which may include weekend shifts and work hours after 6:00 p. m. Some travel may be required. ORGANIZATIONAL CONTACTS & RELATIONSHIPS: INTERNAL: Management group and all levels of staff. EXTERNAL: Members and external originators. QUALIFICATIONS: EDUCATION: Successful completion of High School curriculum is required. Associates degree is preferred. EXPERIENCE:4-7 years in consumer lending, in a judgmental lending environment where LOS is used as a guide to make decisions or 5. years in loan processing. KNOWLEDGE\/SKILLS: Strong analytical, organizational skills and attention to detail. Ability to calculate figures and amounts. Ability to use logical reasoning when interpreting facts and make objective observations, examinations, evaluations and recommendations. Remain knowledgeable on key trends in the financial services industry that impact loan quality and underwriting. Solid interpersonal, oral and written communication skills. Knowledge of credit analysis and reporting. Possess a high degree of integrity to use judgment to make appropriate and fair lending decisions on behalf of the credit union. Comprehensive understanding of both branch and indirect credit union lending policies. Ability to sell and promote product lines, and back up lending decisions in a way that enhance originator relationships. Understand the use of the automated loan origination system. Operate on standard Microsoft programs and other computer operations. Stay up to date on changes within the department, organization, industry and current market conditions. Strong understanding of assigned territory lending market conditions and collateral values. Must work well in a fast-paced and flexible production oriented department. Analytical skills to include reviewing and understanding complex paystub and tax return documents. PHYSICAL REQUIREMENTS: Prolonged sitting throughout the workday with occasional mobility required. Corrected vision within the normal range. Hearing within normal range. A device to enhance hearing will be provided if needed. Occasional movements throughout the department daily to interact with staff, accomplish tasks, etc. Must be flexible with scheduling, including evenings, weekends, and holidays. LICENSES\/CERTIFICATIONS: None.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::616e33d633fccd39deb97ecd::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Golden1 Credit Union\", \"position\": \"Dealer Services Ops - UW - Consumer Credit Analyst II\", \"notes\": \"\", \"original\": \"<div><p>JOB TITLE: Consumer Credit Analyst II<br \/>DEPARTMENT: Dealer Services Ops<br \/>STATUS: Non-Exempt<br \/>JOB CODE: 1812<br \/><br \/>GENERAL DESCRIPTION:<\/p><p>Consumer Credit Analyst II - NLA is responsible for reviewing, analyzing and evaluating simple to complex secured and unsecured consumer loan applications and based on their judgment approve, modify or deny consistent with credit union guidelines. Consumer Credit Analyst II - NLA must clearly document and communicate the reasoning for the decision. Maintain and strengthen relationships with members, and internal and external originators. Maintain a thorough understanding of the credit union\\u2019s underwriting standards, risk philosophy, credit culture and market conditions.<\/p><p><br \/>TASKS, DUTIES, FUNCTIONS:<\/p><ol><li>Review, analyze, and evaluate loan applications based on established credit union policies and apply knowledge of underwriting procedures loan authority to approve counter or deny consumer loan applications by:<\/li><\/ol><ul><li>Evaluating and ensuring that the transaction is accurate, complete and compliant.<\/li><li>Reviewing required documentation for accuracy and truthfulness.<\/li><li>Applying fraud detection and prevention techniques.<\/li><li>Performing paystub and basic tax return analysis to determine ability to repay.<\/li><\/ul><li>Maintain a thorough understanding of state and federal laws and regulations related to credit union compliance- including bank secrecy, anti-money laundering, Fair Lending and Truth in lending laws appropriate to the position. <\/li><li>Review credit reports and intemperate the data along with the analysis of key lending ratios to determine capacity, credit utilization, and Loan to Value.<\/li><li>Responsible for receiving and initiating phone inquiries and must communicate and interact with originator and external business partners to provide information or reasoning regarding loan decision.<\/li><li>Effectively address and resolve all complaints or issues raised by members, internal staff and business partners.<\/li><li>Gather information and perform analysis as requested to help prepare reports as directed.<\/li><li>Assist with training originators regarding lending policies, process or procedures, and in administering lending promotional campaigns.<\/li><li>Make recommendations and assist with updating product, policy and procedure materials pertaining to consumer lending. <\/li><li>Train personnel on lending policies and procedures. <\/li><li>Perform upgrade validations pertaining to lending systems.<\/li><li>Assist with other Lending duties as assigned.<\/li><p>PHYSICAL SKILLS, ABILITIES, AND EXERTION UTILIZED IN THE PERFORMANCE OF THESE TASKS:<\/p><ol><li>Effective oral and written communication skills required to interact with staff, and members to perform constructive follow up on member loan requests, inquiries, and concerns.<\/li><li>Must possess sufficient manual dexterity to skillfully operate an on-line computer terminal and other standard office equipment, such as financial calculators, personal computer, facsimile machine and telephone. <\/li><li>Ability to work required hours which may include weekend shifts and work hours after 6:00 p.m.<\/li><li>Some travel may be required.<\/li><\/ol><p>ORGANIZATIONAL CONTACTS & RELATIONSHIPS:<\/p><ol><li>INTERNAL: Management group and all levels of staff.<\/li><li>EXTERNAL: Members and external originators.<\/li><\/ol><p>QUALIFICATIONS:<\/p><ol><li>EDUCATION: Successful completion of High School curriculum is required. Associates degree is preferred.<\/li><li>EXPERIENCE:4-7 years in consumer lending, in a judgmental lending environment where LOS is used as a guide to make decisions or 5+ years in loan processing.<\/li><li>KNOWLEDGE\/SKILLS:<\/li><\/ol><ul><li>Strong analytical, organizational skills and attention to detail. Ability to calculate figures and amounts. <\/li><li>Ability to use logical reasoning when interpreting facts and make objective observations, examinations, evaluations and recommendations. <\/li><li>Remain knowledgeable on key trends in the financial services industry that impact loan quality and underwriting.<\/li><li>Solid interpersonal, oral and written communication skills. <\/li><li>Knowledge of credit analysis and reporting.<\/li><li>Possess a high degree of integrity to use judgment to make appropriate and fair lending decisions on behalf of the credit union.<\/li><li>Comprehensive understanding of both branch and indirect credit union lending policies.<\/li><li>Ability to sell and promote product lines, and back up lending decisions in a way that enhance originator relationships.<\/li><li>Understand the use of the automated loan origination system. Operate on standard Microsoft programs and other computer operations.<\/li><li>Stay up to date on changes within the department, organization, industry and current market conditions.<\/li><li>Strong understanding of assigned territory lending market conditions and collateral values.<\/li><li>Must work well in a fast-paced and flexible production oriented department.<\/li><li>Analytical skills to include reviewing and understanding complex paystub and tax return documents.<\/li><\/ul><p>PHYSICAL REQUIREMENTS:<br \/><\/p><ol><li>Prolonged sitting throughout the workday with occasional mobility required.<\/li><li>Corrected vision within the normal range.<\/li><li>Hearing within normal range. A device to enhance hearing will be provided if needed.<\/li><li>Occasional movements throughout the department daily to interact with staff, accomplish tasks, etc.<\/li><li>Must be flexible with scheduling, including evenings, weekends, and holidays.<\/li><\/ol><p><\/p><p>LICENSES\/CERTIFICATIONS:<br \/>None<br \/><\/p><p><br \/><br \/><\/p><\/div>&nbsp;\"}"
}