{
    "id":"Kaggle::techmap::61429b13488f5c5371264611::cvlibrary_uk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"This Computer Studies and ICT Teacher position is required to start ASAP, full time until Christmas, this role will extend for the right candidate. I am working with a mixed secondary school and sixth form. Rated 'Good' by Ofsted and based in a leafy part of Hillingdon this school boast a family and friendly approach with a vibrant and diverse community. You will have: A QTS or Newly Qualified Teacher Status (NQT) or QTLS (Further Education). Experience teaching across Key Stage 3-5. Recent experience teaching Computer Studies And ICT. An engaging and dynamic style if teaching. Can plan and prepare lessons to a high standard. You must hold a DBS which is o the update service as this is an ASAP start. If you have the skill set and the confidence to help our schools this September, please send an up to date CV to (url removed). Tej from the Secondary team will be waiting to hear from you.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61429b13488f5c5371264611::cvlibrary_uk\", \"source\": \"cvlibrary_uk\", \"country\": \"UK\", \"company\": \"Academics Ltd\", \"position\": \"Computer Studies and IT Teacher required ASAP\", \"notes\": \"\", \"original\": \"This Computer Studies and ICT Teacher position is required to start ASAP, full time until Christmas, this role will extend for the right candidate. <br><br>I am working with a mixed secondary school and sixth form. Rated &#39;Good&#39; by Ofsted and based in a leafy part of Hillingdon this school boast a family and friendly approach with a vibrant and diverse community.<br><br>You will have:<br><br>A QTS or Newly Qualified Teacher Status (NQT) or QTLS (Further Education)<br>Experience teaching across Key Stage 3-5<br>Recent experience teaching Computer Studies And ICT<br>An engaging and dynamic style if teaching<br>Can plan and prepare lessons to a high standardYou must hold a DBS which is o the update service as this is an ASAP start.<br><br>If you have the skill set and the confidence to help our schools this September, please send an up to date CV to (url removed). Tej from the Secondary team will be waiting to hear from you.<br><br>\"}"
}