{
    "id":"Kaggle::techmap::614f43e3fa135328a22fccf5::linkedin_kr::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 5-7 years HW\/SW applications Engineering of wireless communication device, robot systems, camera system or related work experience. 4 years of customer interfacing \/ management experience. Familiar with key players in the IoT industry like IoT, wireless device manufactures, etc. Experience with embedded software development, integration & debugging. Education Requirements. Bachelor's degree in Engineering, Information Systems, Computer Science, or related field. Physical Requirements. Frequently transports between offices, buildings, and campuses up to  mile. Frequently transports and installs equipment up to 5 lbs. Performs required tasks at various heights (e. g., standing or sitting). Monitors and utilizes computers and test equipment for more than 6 hours a day. Continuous communication which includes the comprehension of information with colleagues, customers, and vendors both in person and remotely. Education. Minimum Qualifications. Bachelors. Computer Science, Bachelors. Engineering, Bachelors. Information Systems. Work Experiences. years experience with debugging techniques., 2. years experience with Programming Language such as C, C, Java, Python, etc., 2. years Software Applications Engineering, Software Development experience, or related work experience. Skills. Certifications: Education. Preferred Qualifications. Work Experiences. years of work experience in a role requiring interaction with leadership., 1. years experience in a customer-facing role., 4. years Software Applications Engineering, Software Development experience, or related work experience. Skills. Android, Computer Software Programs, Embedded Device Drivers, Embedded Linux, Software Applications. Applicants: If you need an accommodation, during the application\/hiring process, you may request an accommodation by sending email to accommodationsupport. To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes\/applications. If you would like more information about this role, please contact Qualcomm Careers.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614f43e3fa135328a22fccf5::linkedin_kr\", \"source\": \"linkedin_kr\", \"country\": \"KR\", \"company\": \"Qualcomm\", \"position\": \"Technical Account Manager\", \"notes\": \"\", \"original\": \"<strong><strong>Company:<\/strong><\/strong>Qualcomm CDMA Technologies (Korea) YH<br><br><strong><strong>Job Area:<\/strong><\/strong>Engineering Group, Engineering Group &gt; Software Applications Engineering<br><br><strong><u>General Summary<br><br><\/u><\/strong>Provides technical expertise of software systems through sales presentations, product demonstrations, installation, and maintenance of company products. Assists the sales staff in assessing potential application of company products to meet customer needs and preparing detailed product specifications for the development and implementation of customer applications\/solutions. Ensures that the application\/solution is functioning according to specifications. May provide software development and consultation to prospective users and\/or product capability assessment and validation. Assists customers with any questions, issues, debugging, or troubleshooting regarding software systems and applications.<br><br><strong><u>The Responsibilities Of This Role Include<br><\/u><\/strong><ul><li> Working under some supervision.<\/li><li> Making decisions that are moderate in impact; errors may have relatively minor financial impact or effect on projects, operations, or customer relationships; errors may require involvement beyond immediate work group to correct.<\/li><li> Using verbal and written communication skills to convey information that may be somewhat complex to others who may have limited knowledge of the subject in question. May require basic negotiation and influence, cooperation, tact, and diplomacy, etc.<\/li><li> Having a moderate amount of influence over key organizational decisions (e.g., is consulted by senior leadership to provide input on key decisions).<\/li><li> Completing tasks with multiple steps that can be performed in various orders; some planning and prioritization must occur to complete the tasks effectively; mistakes may result in some rework.<\/li><li> Exercising creativity to draft original documents, imagery, or work products within established guidelines.<\/li><li> Using deductive and inductive problem solving; multiple approaches may be taken\/necessary to solve the problem; often information is missing or incomplete; intermediate data analysis\/interpretation skills may be required.<\/li><li> May be solicited during strategic planning period.<br><br><\/li><\/ul><strong><u>The Responsibilities Of This Role Do Not Include<br><\/u><\/strong><ul><li> Financial accountability (e.g., does not involve budgeting responsibility).<br><br><\/li><\/ul>Principal Duties &amp; Responsibilities<br><ul><li> Provides timely and accurate answers to common customer inquiries.<\/li><li> Identifies customer problems and works with manager and\/or project leads to recommend solutions.<\/li><li> Provides customer input to design engineering team regarding modifications to Qualcomm solutions.<\/li><li> Performs root cause analyses on basic customer problems to identify underlying issue.<\/li><li> Participates in integrating Qualcomm software to customer requirements.<\/li><li> Assists the development team with customizing Qualcomm software to meet customer requirements.<\/li><li> Debugs issues in customer software systems.<\/li><li> Communicates essential technical information to be leveraged by sales and marketing teams.<\/li><li> Participates in and represents customer perspectives in internal project meetings.<\/li><li> Demonstrates advanced knowledge of debugging techniques for a specific work area (e.g., Wi-Fi, Bluetooth).<\/li><li> Owns a piece of a software module and tests and recommends appropriate modifications and enhancements in light of customer needs to appropriate party.<\/li><li> Publishes (e.g., writes, reviews, and edits) product technical documentation.<\/li><li> Demonstrates Qualcomm products and offerings to customers as instructed by tech leads.<br><br><\/li><\/ul>Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.<br><br><strong>Job function<br><\/strong><ul><li> The Technical Account Manager (TAM) is an engineering role coordinating all aspects of technical support assigned to the program and is the primary communication person with customers for technical topics.<\/li><li> The TAM closely tracks and understands customers\\u2019 technical requirements\/issues along with priorities\/schedules and translates them into actions for internal teams.<\/li><li> TAM will need to mobilize the required expertise calling on HW\/SW application engineers, testing and development teams.<\/li><li> The prime measure of success is the quality and responsiveness of the technical support delivered to the assigned project.<br><br><\/li><\/ul><strong>These Customer Engineers are expected to<br><\/strong><ul><li> To understand every aspect of customers' system requirements and designs and collaborate with product market team for new feature requests.<\/li><li> To communicate with the customer as well as internal CEs with strong IoT device technical background and project management experience.<\/li><li> To work on cutting edge IoT technologies from leading device manufacturers to commercialization.<br><br><\/li><\/ul><strong><u>Responsibilities<br><\/u><\/strong><ul><li> Solid technical knowledge of Qualcomm\\u2019s chipsets, technologies, and roadmap.<\/li><li> Negotiating, establishing, and managing effective technical support activities &amp; plans towards customers<\/li><li> Tracking customer program schedules, priorities &amp; risk management.<\/li><li> Assessing complex technical issues arising from customer product developments<\/li><li> Leading and coordinating engineering resources in resolving complex technical issues<\/li><li> Building, maintaining, and leveraging a network of engineering specialists within Qualcomm<\/li><li> Organizing technical training, design reviews and engineering workshops on behalf of customers<\/li><li> Hosting conference calls and web meetings<\/li><li> Providing Technical support to business development<\/li><li> Building trusted relationship with customers and Qualcomm internal team<br><br><\/li><\/ul><strong><u>Skills\/Experience<br><\/u><\/strong><ul><li> Bachelor's degree in Engineering, Information Systems, Computer Science, or related field.<\/li><li> 5-7 years HW\/SW applications Engineering of wireless communication device, robot systems, camera system or related work experience.<\/li><li> 4 years of customer interfacing \/ management experience.<\/li><li> Familiar with key players in the IoT industry like IoT, wireless device manufactures, etc.<\/li><li> Experience with embedded software development, integration &amp; debugging.<br><br><\/li><\/ul><strong><u>Education Requirements<br><br><\/u><\/strong>Bachelor's degree in Engineering, Information Systems, Computer Science, or related field.<br><br><strong><u>Physical Requirements<br><\/u><\/strong><ul><li> Frequently transports between offices, buildings, and campuses up to \\u00bd mile.<\/li><li> Frequently transports and installs equipment up to 5 lbs.<\/li><li> Performs required tasks at various heights (e.g., standing or sitting).<\/li><li> Monitors and utilizes computers and test equipment for more than 6 hours a day.<\/li><li> Continuous communication which includes the comprehension of information with colleagues, customers, and vendors both in person and remotely.<br><br><\/li><\/ul><strong><u>Education<br><br><\/u><\/strong><strong>Minimum Qualifications<br><br><\/strong>Bachelors - Computer Science, Bachelors - Engineering, Bachelors - Information Systems<br><br><strong><u>Work Experiences<br><br><\/u><\/strong>2+ years experience with debugging techniques., 2+ years experience with Programming Language such as C, C++, Java, Python, etc., 2+ years Software Applications Engineering, Software Development experience, or related work experience.<br><br><strong><u>Skills<br><br><\/u><\/strong><u>Certifications:<br><br><\/u><strong><u>Education<br><br><\/u><\/strong><strong>Preferred Qualifications<br><br><\/strong><strong><u>Work Experiences<br><br><\/u><\/strong>1+ years of work experience in a role requiring interaction with leadership. ,1+ years experience in a customer-facing role. ,4+ years Software Applications Engineering, Software Development experience, or related work experience.<br><br><strong><u>Skills<br><br><\/u><\/strong>Android, Computer Software Programs, Embedded Device Drivers, Embedded Linux, Software Applications<br><br><strong>Applicants<\/strong>: If you need an accommodation, during the application\/hiring process, you may request an accommodation by sending email to <u> accommodationsupport <br><br><\/u><strong>To all Staffing and Recruiting Agencies<\/strong>:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes\/applications.<br><br>If you would like more information about this role, please contact Qualcomm Careers .\"}"
}