{
    "id":"Kaggle::techmap::6137b36f7d4ffc16c87fcf4b::careerbuilder_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The requirement to \"lift and carry items weighing up to 50 pounds\" does not seem relevant to the primary duties of providing speech pathology services, potentially excluding individuals with physical disabilities unnecessarily.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" General Summary of Duties: The provision of speech pathology to patients in their homes under written orders from qualified physicians according to established Agency policies and procedures. Supervision Received: Reports directly to Rehabilitation Manager. Supervision Exercised: None. Typical Physical Demands: Requires full range of body motion. Requires balance skills. Requires ability to ascend\/descend stairs. Requires ability to kneel and sit for extended periods. Requires ability to lift and carry items weighing up to 50 pounds. Requires corrected vision and hearing to normal range. Requires working under stressful conditions. Requires limited exposure to communicable diseases. Typical Work Conditions: Work is performed in patients homes and in an office environment. Essential Duties: (This list may not include all of the duties assigned. ) C4, F4 Provides speech pathology to patients and their families in their homes in compliance with state and Medicare regulations, incorporating the following: a) A speech and language assessment with other physical evaluation, as appropriate. b) Establishment of an appropriate plan of care and therapeutic goals with the patient\/family. c) Interim patient evaluation and revision of treatment plan as indicated. d) Identification of patient and family needs for other home and\/or community services. e) Instruction of patient\/family in appropriate techniques. f) Appropriate discharge planning\/referrals to patient\/family. g) Arranging for provision of assistive equipment. h) Appropriate implementation and utilization of OASIS. C4, F3 Documents all services provided according to state and federal regulations, and Agency policy: a) Admission assessments are completed in a timely fashion (24 hours from first speech pathologist visit). b) All subsequent visits are documented within 48 hours. c) Time sheets are completed daily and submitted weekly. d) Maintains current physician orders and complies with all reporting requirements and third party payors. e) Prepares interim and discharge summaries as requested. C4, F3 Manages caseload in assigned area: a) Upon receipt of referral, makes phone contact with client within 24 hours and makes first home visit within two working days. b) Remains flexible in daily planning. c) Reports any cases to supervisor where goals can not be met or unsafe home situation exists. d) Maintains required productivity expectation as established by the Agency. e) Utilizes interdisciplinary approach attending rehabilitation meetings and informing primary nurse of clients progress\/status with therapy. f) Delegates appropriate tasks to home care aide.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137b36f7d4ffc16c87fcf4b::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"ECHN\", \"position\": \"Speech Language Pathologist, Homecare - Hiring Now\", \"notes\": \"\", \"original\": \"General Summary of Duties: The provision of speech pathology to patients in their homes under written orders from qualified physicians according to established Agency policies and procedures. # Supervision Received: Reports directly to Rehabilitation Manager. # Supervision Exercised: None. # Typical Physical Demands: Requires full range of body motion.# Requires balance skills.# Requires ability to ascend\/descend stairs.# Requires ability to kneel and sit for extended periods.# Requires ability to lift and carry items weighing up to 50 pounds.# Requires corrected vision and hearing to normal range.# Requires working under stressful conditions.# Requires limited exposure to communicable diseases. # Typical Work Conditions: Work is performed in patients# homes and in an office environment. # Essential Duties: (This list may not include all of the duties assigned.) # 1.## C4, F4### Provides speech pathology to patients and their families in their homes in compliance with state and Medicare regulations, incorporating the following: a)## A speech and language assessment with other physical evaluation, as appropriate. b)## Establishment of an appropriate plan of care and therapeutic goals with the patient\/family. c)## Interim patient evaluation and revision of treatment plan as indicated. d)## Identification of patient and family needs for other home and\/or community services. e)## Instruction of patient\/family in appropriate techniques. f)### Appropriate discharge planning\/referrals to patient\/family. g)## Arranging for provision of assistive equipment. h)##### Appropriate implementation and utilization of OASIS. # 2.## C4, F3### Documents all services provided according to state and federal regulations, and Agency policy: a)## Admission assessments are completed in a timely fashion (24 hours from first speech pathologist visit). b)## All subsequent visits are documented within 48 hours. c)## Time sheets are completed daily and submitted weekly. d)## Maintains current physician orders and complies with all reporting requirements and third party payors. e)## Prepares interim and discharge summaries as requested. # # 3.## C4, F3#### Manages caseload in assigned area: a)## Upon receipt of referral, makes phone contact with client within 24 hours and makes first home visit within two working days. b)## Remains flexible in daily planning. c)## Reports any cases to supervisor where goals can not be met or unsafe home situation exists. d)## Maintains required productivity expectation as established by the Agency. e)## Utilizes interdisciplinary approach attending rehabilitation meetings and informing primary nurse of client#s progress\/status with therapy. f)### Delegates appropriate tasks to home care aide.# Orients and supervises home care aide in accordance with state and federal regulations and agency policy. g)## Participates in the development of the interdisciplinary team plan of care on hospice patients. # 4.## C3, F1### Develops and maintains sufficient professional skills to meet the needs of patient care: a)## Attends a minimum of 12 hours of inservice per year. b)## Participates in self-appraisal and the formation of a plan of self-development. c)## Projects professional image through attitude and compliance with dress code. d)##### Adheres to agency Corporate Compliance Plan and HIPAA Privacy Plan. # Ancillary Duties: # 1.## C3, F1### Performs other duties as necessary as assigned by the Rehabilitation Manager and\/or Rehabilitation Team Leader. a)## Agency committees as requested. b)## Special Agency or community programs during and\/or after regular hours. c)## Student supervision as indicated. d)## Abides by agency weekend\/holiday schedule for therapists. # HIPAA and Privacy:# Properly direct any complaints and\/or grievances as indicated per VNHSC policy.# Comply with HIPAA regulations, specifically the Privacy and Security Rules.# Protect personal health information (PHI), electronic personal health information (EPHI) and financial information by limiting the use and disclosure of health information and financial information to the minimum amount necessary with only those who must know how to get the job done.# Follow the department#s specific policies and procedures to protect health information.# Help one another to ensure confidentiality at all times.# # Knowledge, Skills and Requirements: Knowledge of current ASHA guidelines and standards.# Knowledge of Agency policy, regulations, and procedures to administer patient care.# Knowledge of current modalities and medical equipment relevant to patient care.# Skill in identifying patient problems and recommending solutions.# Skill in documentation in clinical records.# Skill in establishing and maintaining effective working relationships with patients\/families, physicians, co-workers, and the community.# Ability to communicate clearly. Participates in quarterly peer consultation.## Possesses adequate transportation to carry out job requirements.# Must show proof of satisfactory automobile insurance with minimum coverage to be determined by Agency policy when using automobile for transportation.# Must perform and provide evidence of peer review on a quarterly basis.# Willingness to provide service in any part of agency geographic area, according to agency need. # Education: Masters level prepared in Speech Language Pathology.# Must have certificate from ASHA. # Experience: A minimum of three years full-time experience in Speech Language Pathology. # Certificate\/License: Possession of a current license to practice as a speech pathologist in the State of Connecticut.# Possession of an individual malpractice insurance policy. # Alternative to Minimum Qualifications: None.&nbsp;\"}"
}