{
    "id":"Kaggle::techmap::613a88e0fcdff64f14d63a65::monster_cz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Information about the position Job description, responsibilities and duties Mobility Network Engineer Brno, Czech Republic We are a multicultural diverse team of network engineers who are currently looking for new colleagues & friends. We would like to meet motivated candidates who want to become network professionals and further develop their mobility and IP networking skills. Are you a fresh graduate seeking experience or skilled veteran who demands new challenges? Are you a flexible team player? Are you willing to go an extra mile above your normal duties to resolve a problem? Are you able to learn quickly, follow procedures and come up with innovative ideas? Are you ready to work for the Worlds TOP 14 most valuable brand and get involved into building a network for over 180 million customers? YES? Then keep reading! What would you do. Performing various network configuration changes in the Mobile Network. Working with cutting edge technologies including 5G NR. Remote provisioning of new Cell Sites and Carriers to enhance the network capabilities. Decommissioning of old networks (3G) How would you do it. Completing our extensive training for newcomers and shadowing senior colleagues to the point of fully trained and independent network engineer. Executing network changes while following our internal processes and technical documentation. Performing pre-checks and post-checks to ensure network reliability. Suggesting improvements to the processes. Reporting errors in the procedures. Cooperating with your Brno and US based colleagues. Progressing your knowledge and skills via internal trainings to support new technologies and projects When would you do it. Disruptive network changes are performed in maintenance window, which is a 6-hour interval starting morning from 6:00, 7:00 and 9:00 Brno time, depending on the US time zone you remotely work in. There are some projects that require you to work during US Day hours (starting 14:00 Brno time) and some may also require a night shift work. This is a full-time job  40 hours per week Employee perks, benefits What should you know  IP experience  CCNA level knowledge. Mobile networks  understanding of architecture and basic functionality  Linux\/UNIX  practical experience preferred. Working in a team Ability to quickly learn from the senior team members Share and discuss ideas with the team Ability to work independently when needed Train new team members once you are fully trained and experienced.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613a88e0fcdff64f14d63a65::monster_cz\", \"source\": \"monster_cz\", \"country\": \"CZ\", \"company\": \"AT&T Global Network Services Czech Republic\", \"position\": \"Mobility Network Engineer\", \"notes\": \"\", \"original\": \"Information about the position Job description, responsibilities and duties Mobility Network Engineer Brno, Czech Republic We are a multicultural diverse team of network engineers who are currently looking for new colleagues & friends. We would like to meet motivated candidates who want to become network professionals and further develop their mobility and IP networking skills. \\u2022 Are you a fresh graduate seeking experience or skilled veteran who demands new challenges? \\u2022 Are you a flexible team player? \\u2022 Are you willing to go an extra mile above your normal duties to resolve a problem? \\u2022 Are you able to learn quickly, follow procedures and come up with innovative ideas? \\u2022 Are you ready to work for the World\\u2019s TOP #14 most valuable brand and get involved into building a network for over 180 million customers? YES? Then keep reading! What would you do \\u2022 Performing various network configuration changes in the Mobile Network \\u2022 Working with cutting edge technologies including 5G NR \\u2022 Remote provisioning of new Cell Sites and Carriers to enhance the network capabilities \\u2022 Decommissioning of old networks (3G) How would you do it \\u2022 Completing our extensive training for newcomers and shadowing senior colleagues to the point of fully trained and independent network engineer \\u2022 Executing network changes while following our internal processes and technical documentation \\u2022 Performing pre-checks and post-checks to ensure network reliability \\u2022 Suggesting improvements to the processes \\u2022 Reporting errors in the procedures \\u2022 Cooperating with your Brno and US based colleagues \\u2022 Progressing your knowledge and skills via internal trainings to support new technologies and projects When would you do it \\u2022 Disruptive network changes are performed in maintenance window, which is a 6-hour interval starting morning from 6:00, 7:00 and 9:00 Brno time, depending on the US time zone you remotely work in \\u2022 There are some projects that require you to work during US Day hours (starting 14:00 Brno time) and some may also require a night shift work \\u2022 This is a full-time job \\u2013 40 hours per week Employee perks, benefits What should you know \\u2022 IP experience \\u2013 CCNA level knowledge \\u2022 Mobile networks \\u2013 understanding of architecture and basic functionality \\u2022 Linux\/UNIX \\u2013 practical experience preferred \\u2022 Working in a team Ability to quickly learn from the senior team members Share and discuss ideas with the team Ability to work independently when needed Train new team members once you are fully trained and experienced \\u2022 Optionally scripting and programming skills Ability to read and understand scripts and code \\u2013 useful when working with internal tools Designing automation \\u2013 based on your experience and skills What will you get \\u2022 5 weeks of vacation \\u2022 Pension contributions calculated from percentage of annual income (after 1 year) \\u2022 Electronic meal vouchers (in value of 135 CZK) \\u2022 ActivePass card contribution \\u2022 Compensation for income loss due to sickness; advanced medical program \\u2022 Company risk life insurance \\u2022 Teambuilding events and a lot of other discounts and benefits Requirements for the employee Candidates with education suit the position Secondary with school-leaving examination Language skills English - Upper intermediate (B2)\"}"
}