{
    "id":"Kaggle::techmap::6156821a7aa49c40310e3a80::monster_uk::1",
    "label_age":true,
    "analysis_age":"The phrase \"young and developing company\" subtly favours younger candidates by associating youth with growth and success. This language may discourage older applicants from applying, as they might feel they do not fit the desired age profile.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 28 days of paid holidays, increasing with internal growth. Company stakeholder pension. Extensive training on product knowledge and customer service. Career progression and personal development. If you are looking for young and developing company, have a drive for success, and would like a career in Retailthen we would love to hear from you at CALZEDONIA GROUP!",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6156821a7aa49c40310e3a80::monster_uk\", \"source\": \"monster_uk\", \"country\": \"UK\", \"company\": \"Calzedonia Holding Spa\", \"position\": \"Key Holder\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <strong><u>WHY WORK FOR CALZEDONIA GROUP<\/u><\/strong> <br><em>Calzedonia Group is a fashion retail company specializing in the underwear, beachwear and hosiery market founded in Italy in 1986. In UK, we are operating from three brands: Calzedonia, Intimissimi and Tezenis. We have small, friendly teams with a positive and lively atmosphere. All our employees contribute to our strong company culture and international growth.&nbsp; We can offer great future opportunities to all hardworking and determined employees who wants to build their future with us. As a member of our team, you will receive in depth product training and will have a chance to improve your communication and customer service skills. <\/em> <br><em>We are now looking for enthusiastic Key Holder with passion for fashion and customer service. If you are interested in working for Calzedonia Group, please get in touch ASAP.<\/em> <br><strong><u>JOB DESCRIPTION<\/u><\/strong> <br>\\u2022 Delivering positive, friendly experience by engaging with customers through conversation and advice. <br>\\u2022 Assisting customers and maintaining a high level of customer service. <br>\\u2022 Providing personal shopping experience to all customers, measuring, styling and proposing additional suitable products. <br>\\u2022 Ensuring the quality of customer experience delivered by the entire team. <br>\\u2022 Following, achieving and exceeding daily and weekly sales targets and leading by example. <br>\\u2022 Engaging in the development of the store turnover. <br>\\u2022 Demonstrating in-depth knowledge of products, training &amp; coaching team on best practices. <br>\\u2022 Providing great customer service, handling customer complaints and returns. <br>\\u2022 Managing store replenishment. <br>\\u2022 Following up on all Company policies &amp; procedures. <br>\\u2022 Maintaining accurate accounting of sales and stock. <br>\\u2022 Checking weekly store income &amp; KPI`s (ATV, CCR, UPT). <br>\\u2022 Checking daily\/weekly statistics and store performance and applying the numbers in to practice.&nbsp; <br><strong><u>PROFILE<\/u><\/strong> <br>\\u2022 Demonstrates enthusiasm for CALZEDONIA GROUP brands, products and quality. <br>\\u2022 Previous experience in fast pace high street fashion retail is essential. <br>\\u2022 Ability to be approachable and comfortable talking to a range of customers. <br>\\u2022 Confident seller, willing to adapt and take on new challenges. <br>\\u2022 Always presents a professional image. <br>\\u2022 Able to communicate effectively, both verbally and in writing. <br>\\u2022 Self-motivated, with the ability to work under pressure. <br>\\u2022 Ability to multi-task and work in a fast-paced environment. <br>\\u2022 High attention to detail at all times. <br>\\u2022 Commercially aware. <br>\\u2022 Passion for fashion! <br><strong><u>WHAT DO WE OFFER<\/u><\/strong> <br>\\u2022 50% Staff Discount to all UK Calzedonia brands and 30% Staff Discount to all Calzedonia Group brands: Calzedonia, Intimissimi, Tezenis, Falconeri, Signorvino, Atelier Eme &amp; Outlets, which applies all around the world. <br>\\u2022 Generous Uniform allowance per brand. <br>\\u2022 28 days of paid holidays, increasing with internal growth. <br>\\u2022 Company stakeholder pension. <br>\\u2022 Extensive training on product knowledge and customer service. <br>\\u2022 Career progression and personal development. <br><strong><em>If you are looking for young and developing company, have a drive for success, and would like a career in Retail\\u2014then we would love to hear from you at CALZEDONIA GROUP!<\/em><\/strong> <br> <\/div>\"}"
}