{
    "id":"Kaggle::techmap::6155b627d198905e9e610ab0::monster_us::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"It does mention the \"Ability to repeatedly walk up and down steep and rough terrain carrying construction materials.\" Because it is specifically related to the role, this is not biased.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Description Fisher Industries is a family of businesses that encompass all aspects of the aggregate production and heavy civil construction industries. Our unique, vertically-integrated business model allows us to handle small projects, large scale operations, and every tough job in between. Our goal is to provide reliable products and sustainable solutions for innovative global infrastructure. For additional information about our company, visit our website at www. fisherind. com. POSITION SCOPE. The Driller is a safety sensitive position responsible for driving and operating drilling machines to bore holes. Accurately filling out daily drill logs as well as conducting pre. and post. trip inspections on the equipment. Travel is required as jobsite may vary between Nevada, Utah, Arizona and California. PRIMARY DUTIES. Ability and knowledge to operate drill rig and drilling equipment. Setup and breakdown of drill sites. Preparing equipment, setting up\/taking down barricades, moving aggregate materials (dirt, rock, sand, etc. ), changing out drill rods and casings, etc. Maintains daily drilling reports. Conducts pre. and post. trip checks on equipment daily and maintains equipment in safe operating condition. Reports any equipment malfunctions\/concerns to supervisor and prepares documentation. Performs any and all general labor duties required by Blasting Crew. Monitors work area for safety hazards and visual cues while operating equipment. Safety, Safety, Safety comply with all company policies, procedures, and standards of safety. Other duties as assigned. BACKGROUND. Applicant must be at least 18 years old. Valid Driver's License and reliable transportation to get to and from work is required. M. S. H. A. 5000-23 certificate part 48 or willingness to obtain certification. company will pay for certification. Must be able to successfully pass a pre-employment drug test and criminal background check. Ability to complete work tasks under various adverse weather conditions including heat in excess of 100 degrees, cold, rain, and snow. Ability to operate equipment in adverse weather conditions and on steep and rough terrains is required. Ability to repeatedly walk up and down steep and rough terrain carrying construction materials. Must be a team player who is willing and able to learn. Must be able to lift up to 50 lbs. Fisher Industries is an Equal Employment Opportunity Employer and an Equal Opportunity Employer of Individuals with Disabilities and Protected Veterans. Pre-employment physical and drug testing are required.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155b627d198905e9e610ab0::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Fisher Industries\", \"position\": \"Driller (Arizona Drilling and Blasting Division)\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Fisher Industries is a family of businesses that encompass all aspects of the aggregate production and heavy civil construction industries. Our unique, vertically-integrated business model allows us to handle small projects, large scale operations, and every tough job in between. Our goal is to provide reliable products and sustainable solutions for innovative global infrastructure. For additional information about our company, visit our website at www.fisherind.com.<\/p> <br> <p style=\\\"line-height:115%\\\"><strong>POSITION SCOPE<\/strong><\/p> <p style=\\\"line-height:115%\\\">The Driller is a safety sensitive position responsible for driving and operating drilling machines to bore holes. Accurately filling out daily drill logs as well as conducting pre- and post- trip inspections on the equipment.<\/p> <p style=\\\"line-height:115%\\\">Travel is required as jobsite may vary between Nevada, Utah, Arizona and California.<\/p> <p><br><br><\/p> <p style=\\\"line-height:115%\\\"><strong>PRIMARY DUTIES<\/strong><\/p> <ul> <li>Ability and knowledge to operate drill rig and drilling equipment<\/li> <li>Setup and breakdown of drill sites; preparing equipment, setting up\/taking down barricades, moving aggregate materials (dirt, rock, sand, etc.), changing out drill rods and casings, etc.<\/li> <li>Maintains daily drilling reports<\/li> <li>Conducts pre- and post- trip checks on equipment daily and maintains equipment in safe operating condition<\/li> <li>Reports any equipment malfunctions\/concerns to supervisor and prepares documentation<\/li> <li>Performs any and all general labor duties required by Blasting Crew<\/li> <li>Monitors work area for safety hazards and visual cues while operating equipment<\/li> <li>Safety, Safety, Safety comply with all company policies, procedures, and standards of safety<\/li> <li>Other duties as assigned<\/li> <\/ul> <p><br><br><\/p> <p style=\\\"line-height:115%\\\"><strong>BACKGROUND<\/strong><\/p> <ul> <li style=\\\"color:#000000;line-height:115%\\\">Applicant must be at least 18 years old<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Valid Driver's License and reliable transportation to get to and from work is required<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Acceptable MVR in accordance with Fisher's Company Vehicle Program policy is required <\/li> <li style=\\\"color:#000000;line-height:115%\\\">M.S.H.A. 5000-23 certificate part 48 <em><u>or<\/u><\/em> willingness to obtain certification - company will pay for certification<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Must be able to successfully pass a pre-employment drug test and criminal background check<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Ability to complete work tasks under various adverse weather conditions including heat in excess of 100 degrees, cold, rain, and snow<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Ability to operate equipment in adverse weather conditions and on steep and rough terrains is required<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Ability to repeatedly walk up and down steep and rough terrain carrying construction materials<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Must be a team player who is willing and able to learn<\/li> <li style=\\\"color:#000000;line-height:115%\\\">Must be able to lift up to 50 lbs<\/li> <\/ul> <p><br><br><\/p> <p style=\\\"line-height:115%\\\">Fisher Industries is an Equal Employment Opportunity Employer and an Equal Opportunity Employer of Individuals with Disabilities and Protected Veterans. <\/p> <p style=\\\"line-height:115%\\\">Pre-employment physical and drug testing are required. <\/p> <p>If you require an accommodation to submit an application, please email hrdept@fisherind.com to request an accommodation. This email is only to request an accommodation to the application process and is not an email to inquire about the status of your application.<\/p> <br> <br> <\/div>\"}"
}