{
    "id":"Kaggle::techmap::61564b59ff9d7f442ec22e2f::linkedin_ch::1",
    "label_age":true,
    "analysis_age":"The requirement for \"10 years of related experience\" and \"at least 5 years experience as a BD Director\" can introduce age bias by favouring older candidates who are more likely to have accumulated this level of experience, potentially disadvantaging younger but equally capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years of related experience in a CRO, pharmaceutical or biotechnology environment. At least 5 years experience as a BD Director in a CRO environment. Understanding of the clinical process (PH I  IV). Solid understanding of commercialization and the principles of drug discovery and development. Additional Requirements. Proven track record at developing mid-level and high-level contacts. Strategic business awareness and analytical skills. Adaptability and flexibility to changing priorities. Demonstrated ability to work creatively and effectively in a fast-paced environment. Attention to detail and ability to work simultaneously on multiple priorities. Ability to maintain demanding timelines. Ability to influence others both internally and externally. Ability to work independently and as a team player. Ability to establish and maintain effective working relationships with co-workers, managers and clients. Why Join? Those who join us become part of a recognized global leader still willing to challenge the status quo to improve patient care. At IQVIA, you will have access to the most cutting-edge technology, the largest data sets, the best analytics tools and, in our opinion, some of the finest minds in the Healthcare industry. You can drive your career at IQVIA and choose the path that best defines your development and success. With exposure across diverse geographies, capabilities, and vast therapeutic and information and technology areas, you can seek opportunities to change and grow without boundaries. We know that meaningful results require not only the right approach but also the right people. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward and ultimately improve human health outcomes. It's an exciting time to join and reimagine what's possible in healthcare. Moving healthcare forward. Together. IQVIA is a strong advocate of diversity and inclusion in the workplace. We believe that a work environment that embraces diversity will give us a competitive advantage in the global marketplace and enhance our success. We believe that an inclusive and respectful workplace culture fosters a sense of belonging among our employees, builds a stronger team, and allows individual employees the opportunity to maximize their personal potential. At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible  to help our customers create a healthier world.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61564b59ff9d7f442ec22e2f::linkedin_ch\", \"source\": \"linkedin_ch\", \"country\": \"CH\", \"company\": \"IQVIA\", \"position\": \"Director, Senior Director Business Development Europe - Clinical Solutions - US Headquarters\", \"notes\": \"\", \"original\": \"IQVIA\\u2122 is The Human Data Science Company\\u2122, focused on using data and science to help healthcare clients find better solutions for their patients. Formed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness advances in healthcare information, technology, analytics, and human ingenuity to drive healthcare forward.<br><br><strong>Director \/ Senior Director, Business Development \\u2013 Clinical Solutions<br><br><\/strong><strong>US Headquarters \\u2013 Europe <br><br><\/strong>IQVIA is looking for a key contributor with a strong track record of supporting major pharmaceutical companies, providing customized Phase I through IV services globally, and offering expertise across multiple therapeutic areas,<br><br><strong><u>Responsibilities<br><\/u><\/strong><ul><li>Achieve individual annual sales target based on selling to Pharmaceutical clients across the offering suite to attain TCV quotas as assigned.<\/li><li>Maintain in-depth knowledge of all IQVIA services for appropriate cross-sell opportunities.<\/li><li>Actively prospect and leverage potential new business opportunities within specified potential new and\/or existing Customers\/Accounts.<\/li><li>Establish and execute a comprehensive sales plan for each target account.<\/li><li>Cultivate strong, long-term relationships with key decision-makers within Account and develop deep knowledge of the customer organization.<\/li><li>Actively network in the industry to establish relationships and to identify potential opportunities.<\/li><li>Aggressively pursue awareness of competitive activities, positioning, and pricing, which includes specific reasons for awards and non-awards.<\/li><li>Continuously monitor status of leads and opportunities to ensure a pipeline of opportunities is maintained.<\/li><li>Analyze potential opportunities and develop sales strategies for each customer account. Ensure appropriate strategy\/solution is proposed to customer. Monitor actions and results against plans.<\/li><li>Establish brand recognition; communicate with internal Project Managers to assess overall level of customer satisfaction and progress of projects.<\/li><li>Work with operations and functional managers to identify sales team and prepares and leads the sales presentation. Educate team participants in customer culture, operational needs\/methods and sales techniques needed to close the sale.<\/li><li>Coordinate with contracts and proposals to develop proposal.<\/li><li>Handle follow-up related to the sale and drive completion of contractual documents.<\/li><li>Utilize CRM to establish reports and dashboards to analyze business development and sales activities and track progress.<\/li><li>Maintain high visibility within customer organization.<\/li><li>Plan and coordinate all customer sales activities.<\/li><li>Communicate all account activity to Senior Sales Leader and\/or appropriate individuals through the CRM system.<\/li><li>Lead\/participate in change management initiatives for the sales organization.<\/li><li>Provide overall support and serves as a mentor for junior sales staff members. <br><\/li><\/ul><strong><u>Requirements<br><\/u><\/strong><ul><li>10 years of related experience in a CRO, pharmaceutical or biotechnology environment.<\/li><li>At least 5 years\\u2019 experience as a BD Director in a CRO environment.<\/li><li>Understanding of the clinical process (PH I \\u2013 IV).<\/li><li>Solid understanding of commercialization and the principles of drug discovery and development<br><\/li><\/ul><strong><u>Additional Requirements<br><\/u><\/strong><ul><li>Proven track record at developing mid-level and high-level contacts<\/li><li>Strategic business awareness and analytical skills<\/li><li>Adaptability and flexibility to changing priorities<\/li><li>Demonstrated ability to work creatively and effectively in a fast-paced environment<\/li><li>Attention to detail and ability to work simultaneously on multiple priorities<\/li><li>Ability to maintain demanding timelines<\/li><li>Ability to influence others both internally and externally<\/li><li>Ability to work independently and as a team player<\/li><li>Ability to establish and maintain effective working relationships with co-workers, managers and clients<br><\/li><\/ul><strong>Why Join?<br><br><\/strong>Those who join us become part of a recognized global leader still willing to challenge the status quo to improve patient care. At IQVIA, you will have access to the most cutting-edge technology, the largest data sets, the best analytics tools and, in our opinion, some of the finest minds in the Healthcare industry.<br><br>You can drive your career at IQVIA and choose the path that best defines your development and success. With exposure across diverse geographies, capabilities, and vast therapeutic and information and technology areas, you can seek opportunities to change and grow without boundaries.<br><br>We know that meaningful results require not only the right approach but also <strong>the right people<\/strong>. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward and ultimately improve human health outcomes.<br><br>It's an exciting time to join and reimagine what's possible in healthcare.<br><br><strong>Moving healthcare forward. Together. <br><br><\/strong><em>IQVIA is a strong advocate of diversity and inclusion in the workplace. We believe that a work environment that embraces diversity will give us a competitive advantage in the global marketplace and enhance our success. We believe that an inclusive and respectful workplace culture fosters a sense of belonging among our employees, builds a stronger team, and allows individual employees the opportunity to maximize their personal potential.<br><br><\/em>At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible \\u2013 to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70,000+ employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs.iqvia.com.<br><br>\"}"
}