{
    "id":"Kaggle::techmap::6146595d0af2776dc57eae79::linkedin_mx::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Knowledge of the applicable areas of Celestica business in which the incumbent is located. Ability to communicate effectively, both verbally and in writing, with a wide variety of internal and external customers. Ability to evaluate multiple ongoing tasks and non-routine situations, determine priorities and organize work in a manner that allows for timely completion of projects. Ability to manage a wide variety of sensitive business and employee information in a confidential manner. Ability to present a positive, professional image of the company to a wide variety of contacts. Ability to efficiently organize, file and retrieve hard copy and electronic information relating to the business of the work unit. Must demostrate a high English level written and spoken. Physical Demands: Duties of this position are generally performed in a normal office environment. Duties may require extended periods of sitting and sustained visual concentration on a computer monitor or on numbers and other detailed data. Repetitive manual movements (e. g., data entry, using a c. Celestica is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on any protected status (including race, religion, national origin, gender, sexual orientation, age, marital status, veteran or disability status or other characteristics protected by law). At Celestica we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. Special arrangements can be made for candidates who need it throughout the hiring process. Please indicate your needs and we will work with you to meet them. Company Overview. Celestica (NYSE, TSX: CLS) enables the worlds best brands. Through our recognized customer-centric approach, we partner with leading companies in Aerospace and Defense, Communications, Enterprise, Health. Tech, Industrial, Capital Equipment and Energy to deliver solutions for their most complex challenges. As a leader in design, manufacturing, hardware platform and supply chain solutions, Celestica brings global expertise and insight at every stage of product development  from drawing board to full-scale production and after-market services for products from advanced medical devices, to highly engineered aviation systems, to next-generation hardware platform solutions for the Cloud. Headquartered in Toronto, with talented teams spanning 40. locations in 13 countries across the Americas, Europe and Asia, we imagine, develop and deliver a better future with our customers. Celestica would like to thank all applicants, however, only qualified applicants will be contacted.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6146595d0af2776dc57eae79::linkedin_mx\", \"source\": \"linkedin_mx\", \"country\": \"MX\", \"company\": \"Celestica\", \"position\": \"Executive Assistant\", \"notes\": \"\", \"original\": \"Req ID: 83609<br><br>Region: Americas<br><br>Country: Mexico<br><br>State\/Province: BC<br><br>City: Mexicali<br><br><strong><u>Summary<br><br><\/u><\/strong>Provides broad and complex administrative, project and office support to senior executives and departmental staff members.<br><br><strong><u>Detailed Description<br><br><\/u><\/strong>Incumbents have substantial latitude in determining the best methods and procedures to follow to complete assignments. Tasks are broad and complex in nature where considerable independent judgment and discretion are required. Strong initiative is required in resolving problems and making recommendations. Decisions\/actions may have an impact on the department's\/division\\u2019s goals. May also be the entry level for the exempt professional career path. Assignments are received in the form of results expected. Possesses broad knowledge of operations and policies. May provide functional guidance to others performing similar work and\/or provide project or task leadership. May be considered the expert in areas assigned. Builds strong internal and external relationships that require exchanging information and providing explanations in a problem solving capacity. Interfaces regularly with persons of higher positions.<br><br>Performs tasks such as, but not limited to, the following:<br><br>Coordinates a wide variety of larger scale meetings and events on and off site including: schedules facilities and negotiates for their use; handles logistics; develops and distributes agendas and schedules; schedules participants; acts as the main point of contact for meeting information. Coordinates national and international travel. Receives and reviews incoming mail and messages and prioritizes and forwards as appropriate. Prepares correspondence, agendas and presentation graphics; creates and maintains office files and databases; completes and submits expense reimbursement forms and reconciles credit card statements. Interacts with internal and external customers on a daily basis. Acts as an information resource in routine and unusual situations. Provides interpretation of department policies and guidelines. Coordinates and completes a wide variety of special projects. Gathers information for production of reports, org charts, administrative procedures and company guidelines. Creates forms, checklists and procedures to promote efficiency and consistent operations across the department or business unit. Leads administrative meetings and luncheons, teambuilding initiatives and communication efforts to share best practices and promote teamwork. Mentors new administrative assistants and provides training and work direction.<br><br><strong><u>Knowledge\/Skills\/Competencies<br><\/u><\/strong><ul><li>Strong knowledge of computer applications and the ability to accurately perform tasks in some or all of the following applications: Access, Excel, Word and PowerPoint. Knowledge of the applicable areas of Celestica business in which the incumbent is located.<\/li><li>Knowledge of the applicable areas of Celestica business in which the incumbent is located.<\/li><li>Ability to communicate effectively, both verbally and in writing, with a wide variety of internal and external customers.<\/li><li>Ability to evaluate multiple ongoing tasks and non-routine situations, determine priorities and organize work in a manner that allows for timely completion of projects.<\/li><li>Ability to manage a wide variety of sensitive business and employee information in a confidential manner.<\/li><li>Ability to present a positive, professional image of the company to a wide variety of contacts.<\/li><li>Ability to efficiently organize, file and retrieve hard copy and electronic information relating to the business of the work unit.<\/li><li>Must demostrate a high English level written and spoken. Physical Demands: <\/li><li>Duties of this position are generally performed in a normal office environment.<\/li><li>Duties may require extended periods of sitting and sustained visual concentration on a computer monitor or on numbers and other detailed data. Repetitive manual movements (e.g., data entry, using a c<br><\/li><\/ul>Celestica is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on any protected status (including race, religion, national origin, gender, sexual orientation, age, marital status, veteran or disability status or other characteristics protected by law).<br><br>At Celestica we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. Special arrangements can be made for candidates who need it throughout the hiring process. Please indicate your needs and we will work with you to meet them.<br><br><strong><u>Company Overview<br><br><\/u><\/strong>Celestica (NYSE, TSX: CLS) enables the world\\u2019s best brands. Through our recognized customer-centric approach, we partner with leading companies in Aerospace and Defense, Communications, Enterprise, HealthTech, Industrial, Capital Equipment and Energy to deliver solutions for their most complex challenges. As a leader in design, manufacturing, hardware platform and supply chain solutions, Celestica brings global expertise and insight at every stage of product development \\u2013 from drawing board to full-scale production and after-market services for products from advanced medical devices, to highly engineered aviation systems, to next-generation hardware platform solutions for the Cloud.<br><br>Headquartered in Toronto, with talented teams spanning 40+ locations in 13 countries across the Americas, Europe and Asia, we imagine, develop and deliver a better future with our customers.<br><br>Celestica would like to thank all applicants, however, only qualified applicants will be contacted.<br><br>Celestica does not accept unsolicited resumes from recruitment agencies or fee based recruitment services.\"}"
}