{
    "id":"Kaggle::techmap::614316e9a436a279ab321ea5::monsterasia_in::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The requirement to use a crowbar and wire brush is a description of specific job tasks and does not inherently introduce bias, as it pertains directly to the technical duties of the role.",
    "label_masculine":true,
    "analysis_masculine":"The term \"standby man\" uses gender-specific language that subtly favours male candidates.",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1.2. 1 Prepares used and relined ladles for use at the furnaces, maintaining hydraulically operated slide gates, and changing nozzles and plates according to type as necessary. Cleans, checks, pre-heats and presents ladles to the furnaces. 1.2. 2 Prepares used ladles for re-use, by physical check of all parts after positioning in the pre-heaters stand using 225T and 50T hoists of the overhead crane. Cleans metal slag from the bore of plates, inner nozzle, also porous plug using an oxygen lance. 1.2. 3 Changes slide gate plates as required using tools. Cleans exposed surfaces by wire brushing and scraping. Prepares slider plate and applying oil\/graphite coating. Mixes and applies mastic sealing compound over the boss of the stationary plate, fits prepared plate and ensures good seal, locks in position. Assembles slider plate, closes housing cover, tightens bolts using torque wrench at correct setting. Checks slider operation, re-tightens compensator nuts as necessary and checks housing cover hinge pin. 1.2. 4 Fits new collector nozzle into slider casing having applied the mastic sealing compound to the nozzle face. Locates in nozzle holder and check tightens with hammer. 1.2. 5 Changes the ladle inner nozzle as necessary. Removes old nozzle using required tool. Cleans inside nozzle ring and well block using crowbar and wire brush. Preheats well block taper and burns off oil\/graphite mixture. Set new nozzle in the nozzle jig. Seals new nozzle to nozzle ring allowing the sealing compounds to set while nozzle is held in position by the jig. Cleans and lubricates gate mechanism. 1.2. 6 Fixes bayonet lock to pre-assembled porous plug with required steel distance rings and tightens using a wrench and hammer. Connects gas pipe work, checks and repair leaks, or send ladle out to refractory to change porous plug. 1.2. 7 Checks ladle ready for furnace tapping by inspecting ladle interior, closes slide gate, removes hydraulic cylinder, stops pre-heating and moves the lid away from the ladle. Directs crane driver to position ladle at required sanding area. 1.2. 8 have capability and certification for the following:. Fire watch and standby man. Rigging. Gas test.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614316e9a436a279ab321ea5::monsterasia_in\", \"source\": \"monsterasia_in\", \"country\": \"IN\", \"company\": \"M Gheewala Global Hr Consultants\", \"position\": \"Ladle Technician for ksa\", \"notes\": \"\", \"original\": \"1.2.1\\tPrepares used and relined ladles for use at the furnaces, maintaining hydraulically operated slide gates, and changing nozzles and plates according to type as necessary. Cleans, checks, pre-heats and presents ladles to the furnaces.<br>1.2.2\\tPrepares used ladles for re-use, by physical check of all parts after positioning in the pre-heaters stand using 225T and 50T hoists of the overhead crane. Cleans metal slag from the bore of plates, inner nozzle, also porous plug using an oxygen lance.<br>1.2.3\\tChanges slide gate plates as required using tools; cleans exposed surfaces by wire brushing and scraping. Prepares slider plate and applying oil\/graphite coating. Mixes and applies mastic sealing compound over the boss of the stationary plate, fits prepared plate and ensures good seal, locks in position. Assembles slider plate, closes housing cover, tightens bolts using torque wrench at correct setting. Checks slider operation, re-tightens compensator nuts as necessary and checks housing cover hinge pin.<br>1.2.4\\tFits new collector nozzle into slider casing having applied the mastic sealing compound to the nozzle face. Locates in nozzle holder and check tightens with hammer.<br>1.2.5\\tChanges the ladle inner nozzle as necessary. Removes old nozzle using required tool. Cleans inside nozzle ring and well block using crowbar and wire brush. Preheats well block taper and burns off oil\/graphite mixture. Set new nozzle in the nozzle jig. Seals new nozzle to nozzle ring allowing the sealing compounds to set while nozzle is held in position by the jig. Cleans and lubricates gate mechanism.<br>1.2.6\\tFixes bayonet lock to pre-assembled porous plug with required steel distance rings and tightens using a wrench and hammer. Connects gas pipe work, checks and repair leaks, or send ladle out to refractory to change porous plug.<br>1.2.7\\tChecks ladle ready for furnace tapping by inspecting ladle interior, closes slide gate, removes hydraulic cylinder, stops pre-heating and moves the lid away from the ladle. Directs crane driver to position ladle at required sanding area.<br>1.2.8\\thave capability and certification for the following:<br>-\\tFire watch and standby man<br>-\\tRigging<br>-\\tGas test<br>\"}"
}