{
    "id":"Kaggle::techmap::6165d910da8d3d66982cb38e::linkedin_ng::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Unnecessarily requires a valid driver's licence, which can exclude qualified individuals with disabilities who are familiar with the transport system but cannot drive.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" - A good working level understanding for scientific measurements and terms (such as volumetric measurements & weights) would be advantageous. Ability to develop good relationships with colleagues & external service partners. Familiar with the Nigerian transport system and the road networks. Possess a valid drivers licence.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6165d910da8d3d66982cb38e::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"Armotale Express\", \"position\": \"Transport Logistics Project Manager\", \"notes\": \"\", \"original\": \"<p>Main Responsibilities: To aid the productive running of the transport and logistics running of the organisation in compliance with the set policy and regulations.<\/p><p><br><\/p><p><br><\/p><p>-Manage all transport booking requests.<\/p><p>-Line manage transport staff and prepare job rosters for drivers using improved electronic booking systems, new driver shift patterns and ensure daily maintenance checks on vehicles are properly documented in line with post regulations. Define, launch and drive mission-crucial strategic as well as operational initiatives in core non-technical projects.<\/p><p>- Reviewing client requests for information and developments of costed solutions for clients.<\/p><p>- Attendance of client meetings to present, understand, guide and develop client\\u2019s requirements.<\/p><p>-Prepare comprehensive project plans to assure deliverables are attained within budget, timeline and varied project objectives as defined by Project Directive.<\/p><p>- Work closely with a variety of courier contacts (express parcels, specialist couriers &amp; same day \/ ground transport specialists) to understand current capabilities and constraints.<\/p><p>- Awareness of packaging technology and validation.<\/p><p>- Design and develop bespoke logistics plans, Supervise and control project milestones, tasks, scope, timelines, expenses and risks impacting projects<\/p><p>- Single and accountable point of contact for clients.<\/p><p>- Generating supporting documentation and booking courier consignments<\/p><p>- Overseeing global time critical consignments through critical milestones to ensuring on-time delivery.<\/p><p>- Active intervention and redesign of transport plans in the event of issues and estimate logistics related resources and time and establish priorities within project team.<\/p><p>- Communications with clients, couriers and third-party organizations in logistic operations<\/p><p>- Managing, ordering and compiling packaging supplies<\/p><p>- Generation of KPI reports budget updates and customer invoices<\/p><p><br><\/p><p><br><\/p><p>Qualifications <\/p><p><br><\/p><p>Degree or degree level equivalent in a business-related or similar discipline or previous track record of at least 3 years as an administrator within a Logistics private company environment.<\/p><p>Must have experience in the Road Transport Industry. <\/p><p><br><\/p><p>Skills &amp; Requirements<\/p><p><br><\/p><p>- Demonstrated multi-tasking ability with strong attention to detail<\/p><p>- Project management skills (certified qualifications in the area an advantage)<\/p><p>- Excellent communication skills both written and oral and presenting skills<\/p><p>- A professional telephone manner and ability to communicate clearly and when needed in an authoritative manner and an ability to negotiate when faced with problems.<\/p><p>- Someone with the ability to gain client \/ supplier trust and confidence<\/p><p>- Ability to make decisions in pressured situations<\/p><p>- Ability to priorities activities<\/p><p>- A thorough practical understanding of Microsoft office software<\/p><p>- A good geographical knowledge is essential to think through complex logistical solutions<\/p><p>- A good working level understanding for scientific measurements and terms (such as volumetric measurements &amp; weights) would be advantageous.<\/p><p>- Ability to develop good relationships with colleagues &amp; external service partners<\/p><p>- Familiar with the Nigerian transport system and the road networks<\/p><p>Possess a valid driver\\u2019s licence<\/p>\"}"
}