{
    "id":"Kaggle::techmap::61370196def6c8278df944de::aarp_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"Requirement to lift\/move up to 50 lbs and perform physical tasks such as standing, walking, reaching, crouching, kneeling, stooping, and climbing ladders. These can exclude individuals with physical disabilities or limitations, even though they might be able to perform the job with reasonable accommodations or assistive devices.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":true,
    "analysis_feminine":"Job descriptions might appeal more to female candidates or reinforce certain female stereotypes.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" $500 Sign-On Bonus Opportunity  Day-1 Medical and Dental Benefits  Quarterly Bonus Potential  Generous Employee Discount  Flexible Schedule Options About Bloomingdales makes fashion personal and fun, aspirational yet approachable. Our mission is to guide and inspire our customers to make style a source of creative energy in their lives. We will always strive to make Bloomingdales like no other store in the world. Everyone plays a critical role to bring our mission to life. Regardless of position, we believe all colleagues have a voice and access to share their thoughts with every level of leadership. Our colleagues are passionate, driven, entrepreneurial and collaborative. We welcome and embrace diversity of background, thought and opinion while having a lot of fun along the way. Job Overview A Bloomingdales Merchandiser Professional is the backbone of our stores delivering seamless execution of responsibilities specific to creating a neat, clean, organized, and exciting shopping experience for our customers. They merchandise product on the floor, organize merchandise for events, execute markdowns, returns-to-vendors, re-ticketing projects, replenishment and processing of damages with, organized product presentation, and easy to navigate back of house stockrooms. To deliver our mission statement to be like no other store in the world, our Merchandiser Professionals possess speed, attention to detail, collaborative spirit and teamwork to drive an easy and fun shopping experience for our customers. Essential Functions. Greet and welcome all customers while on the selling floor. Handles all aspects of the merchandise journey Qualifications and Competencies. High School Diploma or equivalent required. Strong interpersonal skills with proven ability to communicate and share information with diverse groups of customers and peers. Resourceful and able to adapt quickly to changing priorities. Resourceful self-starter, works well independently as well as part of a team. Ability to work a flexible schedule with retail hours, including day, evening, weekends, and\/or holidays Physical Requirements. Position requires prolonged periods of standing\/walking around store or department. May involve reaching, crouching, kneeling, stooping, color vision and climbing ladders. Frequent use of computers and other technology necessary to perform job duties, including handheld electronic equipment. Frequently lift\/move up to 50lbs This job description is not all-inclusive, and Macys Inc. reserves the right to amend this job description at any time. Macys Inc. is an Equal Opportunity Employer and is committed to a diverse and inclusive work environment.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61370196def6c8278df944de::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Macy's\", \"position\": \"Retail Merchandiser\", \"notes\": \"\", \"original\": \"* *$500 Sign-On Bonus Opportunity*\\n \\n * *Day-1 Medical and Dental Benefits*\\n \\n * *Quarterly Bonus Potential*\\n \\n * *Generous Employee Discount*\\n \\n * *Flexible Schedule Options*\\n \\n \\n*About:*\\n \\nBloomingdale\\u2019s makes fashion personal and fun, aspirational yet approachable. Our mission is to guide and inspire our customers to make style a source of creative energy in their lives. We will always strive to make Bloomingdale\\u2019s like no other store in the world. Everyone plays a critical role to bring our mission to life. Regardless of position, we believe all colleagues have a voice and access to share their thoughts with every level of leadership. Our colleagues are passionate, driven, entrepreneurial and collaborative. We welcome and embrace diversity of background, thought and opinion while having a lot of fun along the way.\\u00a0\\n \\n*Job Overview:*\\n \\nA Bloomingdale\\u2019s Merchandiser Professional is the backbone of our stores delivering seamless execution of responsibilities specific to creating a neat, clean, organized, and exciting shopping experience for our customers. They merchandise product on the floor, organize merchandise for events, execute markdowns, returns-to-vendors, re-ticketing projects, replenishment and processing of damages with, organized product presentation, and easy to navigate back of house stockrooms. To deliver our mission statement to be like no other store in the world, our Merchandiser Professionals possess speed, attention to detail, collaborative spirit and teamwork to drive an easy and fun shopping experience for our customers.\\n \\n*Essential Functions:*\\n \\n\\n \\n * Greet and welcome all customers while on the selling floor\\n \\n * Handles all aspects of the merchandise journey\\n \\n \\n*Qualifications and Competencies:*\\n \\n\\n \\n * High School Diploma or equivalent required\\n \\n \\n\\u00a0\\n \\n\\n \\n * Strong interpersonal skills with proven ability to communicate and share information with diverse groups of customers and peers\\n \\n * Resourceful and able to adapt quickly to changing priorities\\u00a0\\n \\n * Resourceful self-starter, works well independently as well as part of a team\\n \\n * Ability to work a flexible schedule with retail hours, including day, evening, weekends, and\/or holidays\\n \\n \\n\\u00a0\\n \\n*Physical Requirements:*\\n \\n\\n \\n * Position requires prolonged periods of standing\/walking around store or department\\n \\n * May involve reaching, crouching, kneeling, stooping, color vision and climbing ladders\\n \\n * Frequent use of computers and\\u00a0other technology necessary to perform job duties, including handheld electronic equipment.\\n \\n * Frequently lift\/move up to 50lbs\\n \\n \\n*This job description is not all-inclusive, and Macy\\u2019s Inc. reserves the right to amend this job description at any time.\\u00a0 Macy\\u2019s Inc. is an Equal Opportunity Employer and is committed to a diverse and inclusive work environment.\\u00a0 Candidates for positions in San Francisco ONLY can review their rights and the Company\\u2019s obligations under *[SFPC Art. 49](https:\/\/www.macysjobs.com\/media\/1323\/sfpc-art49-notice.pdf)* here.\\u00a0 Candidates for positions in Los Angeles ONLY can review their rights and the Company\\u2019s obligations under *[LA MC Ch. XVIII Art. 9](https:\/\/www.macysjobs.com\/media\/7419\/la-fair-chance-notice.pdf)* here.\\u00a0 Candidates for positions in Philadelphia ONLY can review their rights and the Company\\u2019s obligations under *[PC Ch. 9-3500](https:\/\/www.macysjobs.com\/media\/1206\/btb-poster-final_3-9-16.pdf)* here.*\\n \\n*\\u00a0*\\n STORES00\"}"
}