{
    "id":"Kaggle::techmap::613bb68fc719525087907473::linkedin_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"lifting up to 25 pounds\", \"close visual acuity\" - no clarification if this is aided or unaided.",
    "label_masculine":true,
    "analysis_masculine":"\"strong leadership skills, negotiation skills, decision-making, foresight and planning ability\" - masculine coded language",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Ability to use tools such as Microsoft Office Suite, Smartsheets, ERP Systems and project planning. Ability to work independently with minimal supervision. Ability to travel both domestically and internationally as needed. Must possess these soft skills. Solid work ethic, excellent communication skills, strong leadership skills, negotiation skills, decision-making, foresight and planning ability, data analysis and modeling skills, time management, attention to detail, customer service oriented and teamwork. Preferred skills:. Advanced degree. Physical Requirements and working conditions: Work involves sitting, occasional walking, and lifting up to 25 pounds. Travel by air, car, bus, or train domestically and internationally. Requires close visual acuity. Ability to distinguish colors. Warehouse and normal office environment. Zinc. Five is committed to employing a diverse workforce. As an Equal Opportunity and Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status. We maintain a safe workplace and perform pre-employment testing. Zinc. Five is a participant in E-Verify and receives employment authorization of new hires through Social Security and the Department of Homeland Security databases.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613bb68fc719525087907473::linkedin_us\", \"source\": \"linkedin_us\", \"country\": \"US\", \"company\": \"ZincFive, Inc.\", \"position\": \"Manager, Materials, Supply Chain & Procurement\", \"notes\": \"\", \"original\": \"<p>The Manager of Materials, Supply Chain &amp; Procurement department is a strategic contributor to the success of the Operations\/Quality organization. The Manager will set the strategic direction of the department as well as oversee the sourcing and purchasing of materials\/services, cost, quality, availability, inventory control and supply chain functions of the company. Support production on all material supply requirements to meet customer orders and product shipment schedules. Lead supplier development, selection and performance management. Negotiate purchasing contracts, statements of work and pricing for goods and\/or services. Partner with a diverse stakeholder base to lead, drive and develop material procurement strategies based on business\/market intelligence, long-term analysis of commodities and the supply ecosystem. Drive cost-saving opportunities in partnership with suppliers and stakeholders. Provide oversight and manage personnel within the materials, supply chain and procurement department.<\/p><p>&nbsp;<\/p><p><strong>Manager, Materials, Supply Chain &amp; Procurement Job Duties: <\/strong><\/p><ul><li>Recruit and build a world class organization<\/li><li>Work with Production, Engineering and other departments on material supply planning, production orders, inventory control management and maintains min\/max inventories for critical parts, to meet production orders, project deadlines and on-time delivery requirements<\/li><li>Manage overall purchase requisitions, evaluates material pricing, supply, quality\/reliability and establishes guidelines on price quotes and bidding process<\/li><li>Own and manage strategic supplier relationships, generate contracts and purchasing agreements, price negotiations, create account\/credit terms, multi-sourcing strategy and drive execution of cost reduction roadmap<\/li><li>Develop the company\\u2019s procurement rules and regulations<\/li><li>Maintain an approved supplier\/vendor list<\/li><li>Ensure compliance to applicable environmental and safety regulations as well as guidelines on business ethics<\/li><li>Manage and set vision\/direction for the materials, supply chain and procurement team<\/li><li>Effectively plan and deploy resources to ensure goals are met<\/li><li>Travel both domestic and international if needed<\/li><\/ul><p><strong>&nbsp;<\/strong><\/p><p><strong>Job Requirements:<\/strong><\/p><ul><li>Bachelor\\u2019s degree in business, supply chain, materials science, manufacturing engineering, or related field of study.<\/li><li>Minimum of 15 years experience in materials management, purchasing, planning and supply chain.<\/li><li>Experience in Product Lifecycle Management (PLM), manufacturing process, inventory management systems, forecasting, budgeting, contracts generation\/negotiation, project planning, ERP Systems and DFX (Design for Manufacturability, Design for Cost, etc.)<\/li><li>Experience working with global organization and overseas contract manufacturers in the Asia Pacific region including shipping logistics<\/li><li>Ability to right-size the department to meet short and medium-term business goals<\/li><li>Business and financial acumen \\u2013 ability to quickly and clearly understand, cope and decide, with different business situations<\/li><li>Ability to use tools such as Microsoft Office Suite, Smartsheets, ERP Systems and project planning<\/li><li>Ability to work independently with minimal supervision<\/li><li>Ability to travel both domestically and internationally as needed<\/li><li>Must possess these soft skills; Solid work ethic, excellent communication skills, strong leadership skills, negotiation skills, decision-making, foresight and planning ability, data analysis and modeling skills, time management, attention to detail, customer service oriented and teamwork<\/li><\/ul><p>&nbsp;<\/p><p><strong>Preferred skills:<\/strong><\/p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Advanced degree<\/p><p><strong>&nbsp;<\/strong><\/p><p><strong>Physical Requirements and working conditions:<\/strong><\/p><p>&nbsp;<\/p><ul><li>Work involves sitting, occasional walking, and lifting up to 25 pounds<\/li><li>Travel by air, car, bus, or train domestically and internationally<\/li><li>Requires close visual acuity<\/li><li>Ability to distinguish colors<\/li><li>Warehouse and normal office environment<\/li><\/ul><p><em>&nbsp;<\/em><\/p><p><em>ZincFive is committed to employing a diverse workforce. As an Equal Opportunity and Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status. We maintain a safe workplace and perform pre-employment testing. ZincFive is a participant in E-Verify and receives employment authorization of new hires through Social Security and the Department of Homeland Security databases.<\/em><\/p>\"}"
}