{
    "id":"Kaggle::techmap::6455252f28d56f203fcfa0a6::monster2_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"DescriptionDescription. Daily Pay, tuition reimbursement for LPN and RN programs and more! The Resident Caregiver assist residents in all aspects of their daily life as indicated in the resident service plan, including: personal care, food service, housekeeping, laundry, behavior management, socialization, activities, orientation and information needs. This position requires tact, sensitivity, and professionalism due to the constant interaction with residents and families to guarantee their satisfaction. As a Resident Caregiver, you are a member of the Wellness Team, led by the Wellness Director. You and your team are responsible for supporting the organization Mission, values, and achieving its goals. In return for your expertise, you will enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare. 641. Arden Courts of Whippany, New Jersey. Location. 641. Arden Courts of Whippany, New Jersey. Educational Requirements. High School diploma. Must successfully complete the required training. Position Requirements. Knowledge and experience in working with elderly required, preferred dementia experience. STATE OF NJ HHA or CNA LICENSE REQUIRED. Job Specific Details: AMAZING benefits including Daily Pay, tuition reimbursement for LPN and RN programs, free uniforms, employee discounts with Verizon, Costco, Disney and more, medical plan options, dental, vision, 401(k) with employer match, paid time off programs, paid parental leave, pet insurance, employee appreciation events and more!.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6455252f28d56f203fcfa0a6::monster2_us\", \"source\": \"monster2_us\", \"country\": \"US\", \"company\": \"ProMedica Senior Care\", \"position\": \"Resident Caregiver- CNA License Required\", \"notes\": \"\", \"original\": \"<h2 name=\\\"label_description\\\" class=\\\"jobdescriptioncomponent__Description-sc-my61fv-1 hICAkg\\\">Description<\/h2><div class=\\\"jobdescriptioncomponent__SanitizedHtmlContainer-sc-my61fv-2 ipgMhv\\\"><div name=\\\"sanitizedHtml\\\" class=\\\"sanitizehtmlcomponent__SanitizedContent-sc-1s5wjr7-0 kXZvZn\\\"><b>Description<\/b><br><br><p><u><strong>Daily Pay, tuition reimbursement for LPN and RN programs and more!<\/strong><\/u><\/p><br><br><p>The Resident Caregiver assist residents in all aspects of their daily life as indicated in the resident service plan, including: personal care, food service, housekeeping, laundry, behavior management, socialization, activities, orientation and information needs. This position requires tact, sensitivity, and professionalism due to the constant interaction with residents and families to guarantee their satisfaction. As a Resident Caregiver, you are a member of the Wellness Team, led by the Wellness Director. You and your team are responsible for supporting the organization Mission, values, and achieving its goals.<\/p><br><br><p>In return for your expertise, you will enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare.<\/p><br> 641 - Arden Courts of Whippany, New Jersey <br><b>Location<\/b><br><br>641 - Arden Courts of Whippany, New Jersey<br><br><b>Educational Requirements<\/b><br><br>High School diploma.Must successfully complete the required training.<br><br><b>Position Requirements<\/b><br><br><p>Knowledge and experience in working with elderly required, preferred dementia experience.<\/p><br><br><p><u><strong>STATE OF NJ HHA or CNA LICENSE REQUIRED<\/strong><\/u><\/p><br><br><br>Job Specific Details:<br><br><p>AMAZING benefits including Daily Pay, tuition reimbursement for LPN and RN programs, free uniforms, employee discounts with Verizon, Costco, Disney and more, medical plan options, dental, vision, 401(k) with employer match, paid time off programs, paid parental leave, pet insurance, employee appreciation events and more!<\/p><br><br><\/div><\/div>\"}"
}