{
    "id":"Kaggle::techmap::614d225c463aa27e3dae2c69::seek_au::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"About The Role. Permanent Full Time. We are looking for an experienced, versatile and proactive addition to our warehouse team, with great organisational skills and attention to detail. You need to be physically fit, with the capacity to work efficiently in a fast paced warehouse environment where heavy lifting is required. You will need to be able to work autonomously to make sure the high number of orders are dispatched on time. Full time hours Monday to Friday. 7:30am - 4:00pm. Occasional over-time will be required. Central Rivervale location. Role Duties. Processing picking slips\/invoices using MYOB Exonet. Picking and packing orders using Linde order picking fork trucks. Inwards Goods Receipting of stock. Unloading containers. Heavy lifting (Up to 20L drums). Forklift and Reach truck operation. Various other warehouse duties. Completing jobs quickly and efficiently. Required Skills and Experience. Strong experience in a similar role (preferably 2+ years). Computer literacy skills are essential. Live within 20km of Rivervale area. Must have a reliable vehicle and C class manual drivers licence. Forklift licence. Reach truck experience preferred but not a necessity. Police clearance. Rights to live and work in Australia. Who we are. The Goods is a fast-growing supply business catering to some of the most important industries in Western Australia. We are proud to be emerging out of this time stronger than ever and with exciting plans and opportunities on the horizon. We are a passionate, diverse, and collaborative team who work hard together to deliver a high-level customer experience to our clients. We are all different but at the end of the day we make a great team because we respect each other, we have fun, and most importantly we support one another to give each day our best. To Apply. Send us your resume and a cover letter telling us who you are any why you are suitable for this role.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614d225c463aa27e3dae2c69::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"The Goods\", \"position\": \"Storeperson \/ Pick-Packer\", \"notes\": \"\", \"original\": \"<p><strong>About The Role<\/strong><\/p> <p>\\u00a0<\/p> <p>Permanent Full Time<\/p> <p>\\u00a0<\/p> <p>We are looking for an experienced, versatile and proactive addition to our warehouse team, with great organisational skills and attention to detail.<\/p> <p>You need to be physically fit, with the capacity to work efficiently in a fast paced warehouse environment where heavy lifting is required.\\u00a0<\/p> <p>You will need to be able to work autonomously to make sure the high number of orders are dispatched on time.<\/p> <p>\\u00a0<\/p> <ul><li>Full time hours Monday to Friday<\/li><li>7:30am - 4:00pm<\/li><li>Occasional over-time will be required<\/li><li>Central Rivervale location<\/li><\/ul> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p><strong>Role Duties<\/strong><\/p> <ul><li>\\u200b\\u200b\\u200bProcessing picking slips\/invoices using MYOB Exonet<\/li><li>Picking and packing orders using Linde order picking fork trucks<\/li><li>Inwards Goods Receipting of stock<\/li><li>Unloading containers<\/li><li>Heavy lifting (Up to 20L drums)<\/li><li>Forklift and Reach truck operation<\/li><li>Various other warehouse duties<\/li><li>Completing jobs quickly and efficiently<\/li><\/ul> <p>\\u00a0<\/p> <p><strong>Required Skills and Experience<\/strong><\/p> <ul><li>Strong experience in a similar role (preferably\\u00a02+ years)<\/li><li>Computer literacy skills are essential<\/li><li>Live within 20km of Rivervale area<\/li><li>Must have a reliable vehicle and C class manual drivers licence<\/li><li>Forklift licence<\/li><li>Reach truck experience preferred but not a necessity<\/li><li>Police clearance<\/li><li>Rights to live and work in Australia<\/li><\/ul> <p>\\u00a0<\/p> <p>\\u00a0<\/p> <p><strong>Who we are<\/strong><\/p> <p>The Goods is a fast-growing supply business catering to some of the most important industries in Western Australia. As one of the biggest suppliers to state schools, prisons and other government departments, our team have played a critical role in supplying cleaning, safety, and washroom products to the State (both government and private business) through what has been a turbulent year for many businesses. We are proud to be emerging out of this time stronger than ever and with exciting plans and opportunities on the horizon.<\/p> <p>\\u00a0<\/p> <p>We are a passionate, diverse, and collaborative team who work hard together to deliver a high-level customer experience to our clients. We are all different but at the end of the day we make a great team because we respect each other, we have fun, and most importantly we support one another to give each day our best.\\u00a0<\/p> <p>\\u00a0<\/p> <p><strong>To Apply<\/strong><\/p> <p>Send us your resume and a cover letter telling us who you are any why you are suitable for this role.<\/p>\"}"
}