{
    "id":"Kaggle::techmap::6164127d0035352beb344119::linkedin_sk::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Conducts emergency evaluations of high-risk clients to determine level of treatment indicated and arranges for hospitalization, as needed. As needed, assists supervisor or division director with development and coordination of clinical programs. The intent of this job description is to provide a representative summary of the major duties and responsibilities performed by incumbents of this job. Incumbents may be requested to perform job-related tasks other than those specifically presented in this description. EDUCATION. Master's degree in Social Work. CSW, with social work board-approved LCSW supervisor. Compliance with Kentucky social work boards statutes and regulations on clinical practice. Experience. Two to three years direct social work experience, including two years post-master's experience. Basic knowledge of mental and physical characteristics of applicable population (e. g., growth and development and range of treatment needed), psychotherapy, human behavior, and related issues and community resources and CKY services. Ability to handle case load with varying levels of client disability and need. Good communication and interpersonal skills. Physical Demands\/Requirements. Position has some unusual physical demands, including occasional exposure to threat of bodily harm from clients or their families. Normal work tasks may involve exposure to blood, body fluids or tissue. Position at times may require incumbent to remain on twenty-four hour call. Reliable transportation for frequent travel between work sites. Within the bounds of their respective job descriptions, all staff are expected to exercise principle-centered leadership, focused on customer service responsiveness, with a continuous quality improvement orientation. Additionally, all staff are expected to develop a working knowledge of and follow all policies and procedures related to safety management and other Joint Commission standards. Required Skills\/Competencies. Knowledge of normal growth and development and of culture\/ethnicity relevant to age groups\/populations served. Use results of assessments, reassessments, including client strengths and preferences, to construct a case conceptualization. Apply DSM 5 criteria to diagnose mental health, intellectual and developmental disabilities, and\/or substance use disorders. If substance use disorder is primary, assesses the readiness of client for treatment via stage of change. Utilize case conceptualization and problem areas to guide development and collaboration with clients to build individualized Treatment Plans. Utilize EBPs and clinical techniques in sessions. Measures client progress towards Treatment Plan goals and objectives throughout treatment course. Assess and manage client risk and additional adjunctive services with appropriate and congruent interventions and collaboration.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6164127d0035352beb344119::linkedin_sk\", \"source\": \"linkedin_sk\", \"country\": \"SK\", \"company\": \"Seven Counties Services\", \"position\": \"Sr. Social Worker - Kentucky Correctional Psychiatric Center\", \"notes\": \"\", \"original\": \"Seven Counties Services is a Community Mental Health Center with a 60 year history offering a full range of mental health services, substance abuse treatment and intellectual and developmental disabilities services in Jefferson, Oldham, Bullitt, Shelby, Spencer, Trimble and Henry counties. Since 1978, Seven Counties Services has delivered innovative individualized and compassionate community-based treatment, support and services for persons with behavioral health needs including people with mental illness, children with emotional and behavioral disorders, individuals with developmental or intellectual disabilities, and adults and adolescents with addiction and substance use disorders. We work tirelessly to find solutions to life\\u2019s most difficult and complex challenges. Seven Counties Services is full accredited by The Joint Commission and nationally recognized for effective services and treatments. With over 1,400 staff members and 250 volunteers serving more than 34,000 people annually, we continually help our community flourish\\u2026\\u2026\\u2026..one life at a time.<br><br><strong><u>Job Description<br><br><\/u><\/strong>Under moderate-to-general supervision, provides clinical services to assigned client populations, including administration of a variety of therapy techniques and programs and, as needed, assists in developing and coordinating clinical programs.<br><br>Under board approved LCSW supervision, the social worker will follow the Kentucky Board of Social Work mandates as it pertains to face-to-face clinical supervision.<br><br><strong><u>Essential Job Functions<br><br><\/u><\/strong>Performs clinical services including a variety of therapy programs and techniques such as group and individual therapy, family and marital therapy, expressive therapy, crisis intervention and management, psychodrama and problem solving. Formulates clinical diagnosis for both mental health and substance abuse. Formulates a clinical treatment plan to be followed for interventions. Maintains and completes service documentation such as psychosocial assessments, case notes, case reviews, court reports, letters, etc., according to prescribed standards. Conducts case reviews and determines current and future treatment and treatment planning, including after-care plans for clients completing treatment, based upon quantitative results and professional opinion of client progress. Consults and collaborates with external agents including CHR, school officials, family members, physicians, and other health agencies, regarding organization's programs and client needs and conditions. Attends and participates in staff meetings, treatment planning meetings, case conferences, and clinical seminars providing information relating to program administration and development. Writes correspondence on behalf of clients and their families such as court reports, letters of recommendation, etc. Conducts case presentations and consultations with other agencies regarding programs and services offered. Conducts emergency evaluations of high-risk clients to determine level of treatment indicated and arranges for hospitalization, as needed. As needed, assists supervisor or division director with development and coordination of clinical programs.<br><br>The intent of this job description is to provide a representative summary of the major duties and responsibilities performed by incumbents of this job. Incumbents may be requested to perform job-related tasks other than those specifically presented in this description.<br><br><strong><strong>EDUCATION<br><\/strong><\/strong><ul><li> Master's degree in Social Work. CSW, with social work board-approved LCSW supervisor. <\/li><li> Compliance with Kentucky social work board\\u2019s statutes and regulations on clinical practice. . <br><\/li><\/ul><strong><u>Experience<br><\/u><\/strong><ul><li> Two to three years direct social work experience, including two years post-master's experience. <\/li><li> Basic knowledge of mental and physical characteristics of applicable population (e.g., growth and development and range of treatment needed), psychotherapy, human behavior, and related issues and community resources and CKY services. <\/li><li> Ability to handle case load with varying levels of client disability and need. <\/li><li> Good communication and interpersonal skills. <br><\/li><\/ul><strong><u>Physical Demands\/Requirements<br><\/u><\/strong><ul><li> Position has some unusual physical demands, including occasional exposure to threat of bodily harm from clients or their families <\/li><li> Normal work tasks may involve exposure to blood, body fluids or tissue. <\/li><li> Position at times may require incumbent to remain on twenty-four hour call. <\/li><li> Reliable transportation for frequent travel between work sites <br><\/li><\/ul>Within the bounds of their respective job descriptions, all staff are expected to exercise principle-centered leadership, focused on customer service responsiveness, with a continuous quality improvement orientation. Additionally, all staff are expected to develop a working knowledge of and follow all policies and procedures related to safety management and other Joint Commission standards.<br><br><strong><u>Required Skills\/Competencies<br><\/u><\/strong><ul><li>Knowledge of normal growth and development and of culture\/ethnicity relevant to age groups\/populations served<\/li><li>Use results of assessments, reassessments, including client strengths and preferences, to construct a case conceptualization<\/li><li>Apply DSM 5 criteria to diagnose mental health, intellectual and developmental disabilities, and\/or substance use disorders<\/li><li>If substance use disorder is primary, assesses the readiness of client for treatment via stage of change<\/li><li>Utilize case conceptualization and problem areas to guide development and collaboration with clients to build individualized Treatment Plans<\/li><li>Utilize EBPs and clinical techniques in sessions<\/li><li>Measures client progress towards Treatment Plan goals and objectives throughout treatment course<\/li><li>Assess and manage client risk and additional adjunctive services with appropriate and congruent interventions and collaboration<\/li><li>Assess client\\u2019s measurable progress towards goals\/minimum discharge criteria and discharging client when they have met minimum discharge criteria<\/li><li>Utilize Treatment Team and supervision to address client case conference needs<\/li><li>Manages client caseload and services to maximize direct care client time and reach expected productivity targets<\/li><li>Understand role of OTRs to appropriately represent client need for services required for authorization<br><\/li><\/ul><strong><u>Time Type<br><br><\/u><\/strong>Full time<br><br>Delivering Care that Changes People's Lives starts with our employees. As a Seven Counties Services employee there are many perks to enjoy. Below are just some of the great benefits you might be eligible for with Seven Counties Services.<ul><li>Health &amp; Wellness<\/li><ul><li>Medical Coverage<\/li><li>Dental Coverage<\/li><li>Vision Coverage<\/li><li>Flexible Spending Account<\/li><li>Health Savings Account<\/li><li>Short Term Disability<\/li><li>Long Term Disability - Company Paid<\/li><li>Wellness Programs - Company Paid<\/li><\/ul><\/ul><ul><li>Financial Wellbeing<\/li><ul><li>Competitive Compensation Packages<\/li><li>Life Insurance - Company Paid<\/li><li>Accidental Death &amp; Dismemberment Insurance - Company Paid<\/li><li>403b Retirement Plan with Company Funded Matching<\/li><li>Retirement and Financial Planning Services<\/li><li>Employee Discounts including Dell Computers, Verizon Wireless, Liberty Mutual, Costco, and Enterprise Rent-a-Car<\/li><li>Loan Forgiveness options through federal programs (National Health Service Corps &amp; Public Service Loan Forgiveness)<\/li><\/ul><li>Career Development and Growth<\/li><ul><li>At Seven Counties Services training is one of our highest priorities. We provide company paid professional training for various skills, certifications, and continuing education<\/li><li>Opportunities for growth and movement - We encourage our employees to consider new growth opportunities with us and have a 5 state footprint for those looking to relocate geographically<\/li><li>Leadership Academy for our rising stars, supervisors, and leaders<\/li><li>Seven Counties Services and Center for Clinical Excellence teach provide staff with industry best practices and processes<\/li><\/ul><li>Work Life Balance<\/li><ul><li>Paid Time Off - Generous PTO for Vacations, Illness, Personal Days, Etc. (Paid Holidays)<\/li><li>Flexible Work Schedules to promote a Healthy Work Life Balance<\/li><li>Employee Assistance Program - assists employees with personal problems and\/or work-related problems that may impact their job performance, health, mental and emotional well-being<br><\/li><\/ul><\/ul>Seven Counties Services <em>is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, gender, disability, sexual orientation, marital status, or protected veteran status.<\/em>\"}"
}