{
    "id":"Kaggle::techmap::6138156361fb3d1710fae9ae::reed_uk::5",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"I get it. It's your first role in the industry or you're pretty new to the Dev scene. The local market is absolutely thriving and everyone is looking for the very best Dev's to help drive their solutions forward. There's clearly no shortage of roles (which is great for you! ) so your biggest problem is choosing the right one. I can guarantee now, these guys firmly stand out from the crowd and I'll tell you exactly why…. My client are a very well-known organisation with a flawless reputation within their industry. But what I really love about these guys is that their products help people change and shape their lives for the better, making this a great opportunity to be part of something that genuinely makes a difference and helps people! Alongside having an established range of successful products used by millions of people. they're only just scratching the surface of what they're capable of delivering and they strive to continually improve and evolve their offering by developing brand new-products and services for their valued customers. and this is where you come in! Technically you''ll have aspirations to become a fully-fledged. NET Core Developer with a Full-stack appraoch. You'll be working in a true Agile environment and bring knowledge of Source Control, TDD, BDD, Dependency Injection and Continuous Deplyoment. So, enough about the role. Well. It is simply a great place to work. This is reflected through their outstanding retention rates across the business and essentially due to the fact that they treat their people really, really well. The culture here is one of openness and honestly, with very little hierarchy. They work with a \"no blame\" ethos and whilst the guys are hard-working and getting the job done. you couldn't find a more fun, down-to-earth bunch of guys to work with. There are absolutely no egos here and they're big on working collaboratively and having a laugh whilst they do it! I can personally vouch for this. having recruited heavily for them over the last several years. they're all still with the business and loving it. In return you will receive up to £30, 000 plus an array of benefits including 26 days holiday (plus bank hols), pension scheme, onsite gym and restaurant and much more.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6138156361fb3d1710fae9ae::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Modis\", \"position\": \"Junior C#\/.NET Core Developer - North Derby\/ 30k\", \"notes\": \"\", \"original\": \"<p>I get it. It's your first role in the industry or you're pretty new to the Dev scene. The local market is absolutely thriving and everyone is looking for the very best Dev's to help drive their solutions forward. There's clearly no shortage of roles (which is great for you!) so your biggest problem is choosing <em>the right one<\/em>. I can guarantee now, these guys firmly stand out from the crowd and I'll tell you exactly why\\u2026.<\/p> <p>My client are a very well-known organisation with a flawless reputation within their industry - But what I really love about these guys is that their products help people change and shape their lives for the better, making this a great opportunity to be part of something that genuinely makes a difference and helps people!<\/p> <p>Alongside having an established range of successful products used by millions of people.. they're only just scratching the surface of what they're capable of delivering and they strive to continually improve and evolve their offering by developing brand new-products and services for their valued customers.. and this is where you come in!<\/p> <p>Technically you''ll have aspirations to become a fully-fledged .NET Core Developer with a Full-stack appraoch. You'll be working in a true Agile environment and bring knowledge of Source Control, TDD, BDD, Dependency Injection and Continuous Deplyoment.<\/p> <p>So, enough about the role.. What's is like to work here? Well. It is simply a great place to work. This is reflected through their outstanding retention rates across the business and essentially due to the fact that they treat their people really, really well. The culture here is one of openness and honestly, with very little hierarchy. They work with a \\\"no blame\\\" ethos and whilst the guys are hard-working and getting the job done.. you couldn't find a more fun, down-to-earth bunch of guys to work with. There are absolutely no egos here and they're big on working collaboratively and having a laugh whilst they do it! I can personally vouch for this - having recruited heavily for them over the last several years.. they're all still with the business and loving it.<\/p> <p>In return you will receive up to \\u00a330,000 plus an array of benefits including 26 days holiday (plus bank hols), pension scheme, onsite gym and restaurant and much more.<\/p> <p>They are also taking a flexible approach to working including 3 days working from home and 2 days from their state-of-the-art offices in North Derby.<\/p> <p>Call Laura at Modis today on for immediate consideration.<\/p> <p>Modis International Ltd acts as an employment agency for permanent recruitment and an employment business for the supply of temporary workers in the UK. Modis Europe Ltd provide a variety of international solutions that connect clients to the best talent in the world. For all positions based in Switzerland, Modis Europe Ltd works with its licensed Swiss partner Accurity GmbH to ensure that candidate applications are handled in accordance with Swiss law. <\/p> <p>Both Modis International Ltd and Modis Europe Ltd are Equal Opportunities Employers.<\/p> <p>By applying for this role your details will be submitted to Modis International Ltd and\/ or Modis Europe Ltd. Our Candidate Privacy Information Statement which explains how we will use your information is available on the Modis website.<\/p>\"}"
}