{
    "id":"Kaggle::techmap::614c204366b4875a95fd9ee2::linkedin_ni::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"\"Physical Demands: Sitting, standing, and\/or walking for up to 8 hours per day.\" the absence of any qualification to this statement for those with any disability might discourage many who are capable of the role.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" May assist higher-level specialists to effectively drive the case to conclusion. While the church retains ownership of these cases, be prepared to intervene directly if the church fails to take appropriate actions to ensure the safety of beneficiaries. Maintains the online reporting and case management system, including supporting church partners in using the online system and reviewing cases entered into the system by church partners. In partnership with training staff and partnership teams, assists in the delivery of training materials and curriculum on a broad spectrum of child protection topics, ensuring that stakeholders have ongoing, high-quality learning materials to for a holistic approach for effective interventions and prevention of child abuse. Supports capacity building in assigned areas. Helps develop child protection strategy within assigned office and provides for local adaptation and implementation of strategy and plans of action, including engagement with all relevant partnership teams and colleagues. Contributes towards continual improvement of strategy and plans of action. Helps build strong partnerships, engaging in active cooperation with government and non-government agencies, and developing strategic relationships to leverage Compassion resources to better protect children and respond to child maltreatment. Researches industry best practices, experiential learning, etc., and shares this expertise with others in the organization. May represents Compassion International by participating in inter-agency meetings. Implements organizational and industry policies for child protection. Supports training and educating staff and church partners on child protection policies. Coaches and provides expertise, and may oversee the work of other staff. Culture. Accountable for supporting, upholding, and engaging in Compassion's core \"Cultural Behaviors\" in all internal and external communication and relationships. Education. Bachelor's degree in Healthcare, Social Work, Sociology, Psychology, or related discipline. Experience. years of professional practical work in child protection, prevention, and response, or a closely related discipline. Experience in implementation and monitoring child development programs. Local child protection law knowledge. Languages. English proficiency. Working Environment: Office  Standard Office Environment. Physical Demands: Sitting, standing, and\/or walking for up to 8 hours per day. Travel Requirements: May be required to travel up to 30% of normal schedule.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614c204366b4875a95fd9ee2::linkedin_ni\", \"source\": \"linkedin_ni\", \"country\": \"NI\", \"company\": \"Compassion International\", \"position\": \"Child Protection Specialist II\", \"notes\": \"\", \"original\": \"<p><strong><u>**Please submit your CV in English**<\/u><\/strong><\/p><p><br><\/p><p>This intermediate specialist ensures appropriate child protection plans are clearly understood by the appropriate stakeholders. This incumbent facilitates appropriate response, reporting, and management of all child protection cases from initial discovery through completion. In addition, he or she provides consultation and support to all stakeholders regarding effective child protection practices. Work may have direct impact in more that one field office. At this career level, the incumbent performs independently on moderately complex issues. He or she may coach other specialists.<\/p><p><br><\/p><p><strong>Responsibilities<\/strong><\/p><p><br><\/p><ul><li>Acts as an advocate for children. Understands and advances Christ's mandate to protect children. Raises awareness of the needs of children and takes active steps to help protect against neglect, abuse, and exploitation of children. Promotes the dignity, respect, positive treatment, potential of children in all circumstances. Encourages the involvement of others in helping children in need. Reports and appropriately supports responses to incidents of harm of children if they occur.<\/li><li>Facilitates appropriate response and reporting of all child protection cases and provides support to all stakeholders regarding effective child protection practices.<\/li><li>Using personal knowledge of child protection practices, including prevention and response, continually develops this knowledge base; compounding it with practical experience of identification of abuse symptoms or circumstances warranting investigation, facilitating appropriate responses, reporting, and management of child protection cases, and helping support stakeholders with effective child protection practices. Develops deeper knowledge working with more experienced experts.<\/li><li>Applies basic consulting skills to share technical knowledge and expertise, providing advice that can be applied to specific prevention and response situations, and effectively support the party for whom they are providing consultation. Generally provides support to less experienced child protection staff, partnership facilitators, program implementation, and other stakeholders and leadership, and FCP members, including their volunteers, leaders, and board members. Includes direct visits to customer\/constituent groups for technical assistance, support, and guidance.<\/li><li>Assists staff and church partners investigating allegations of abuse when occurring in a community context. In Category 2 cases, supports the church to make appropriate investigations and interviews, providing the appropriate interventions for the victim, making contacts with local authorities as relevant, providing advice and counsel on dealing with involved parties. In Category 1 abuse cases, consults with leadership, legal and other staff as outlined in Red Alert processes, and assists in the investigation and response to allegations of child abuse. May assist higher-level specialists to effectively drive the case to conclusion. While the church retains ownership of these cases, be prepared to intervene directly if the church fails to take appropriate actions to ensure the safety of beneficiaries. Maintains the online reporting and case management system, including supporting church partners in using the online system and reviewing cases entered into the system by church partners.<\/li><li>In partnership with training staff and partnership teams, assists in the delivery of training materials and curriculum on a broad spectrum of child protection topics, ensuring that stakeholders have ongoing, high-quality learning materials to for a holistic approach for effective interventions and prevention of child abuse. Supports capacity building in assigned areas.<\/li><li>Helps develop child protection strategy within assigned office and provides for local adaptation and implementation of strategy and plans of action, including engagement with all relevant partnership teams and colleagues. Contributes towards continual improvement of strategy and plans of action.<\/li><li>Helps build strong partnerships, engaging in active cooperation with government and non-government agencies, and developing strategic relationships to leverage Compassion resources to better protect children and respond to child maltreatment. Researches industry best practices, experiential learning, etc., and shares this expertise with others in the organization. May represents Compassion International by participating in inter-agency meetings.<\/li><li>Implements organizational and industry policies for child protection. Supports training and educating staff and church partners on child protection policies. Coaches and provides expertise, and may oversee the work of other staff.<\/li><\/ul><p><br><\/p><p><strong>Culture<\/strong><\/p><p><br><\/p><ul><li>Accountable for supporting, upholding, and engaging in Compassion's core \\\"Cultural Behaviors\\\" in all internal and external communication and relationships.<\/li><\/ul><p>&nbsp;<\/p><p><strong>Education<\/strong><\/p><p><br><\/p><ul><li>Bachelor's degree in Healthcare, Social Work, Sociology, Psychology, or related discipline.<\/li><\/ul><p><strong>&nbsp;<\/strong><\/p><p><strong>Experience<\/strong><\/p><p><br><\/p><ul><li>3+ years of professional practical work in child protection, prevention, and response, or a closely related discipline.<\/li><li>Experience in implementation and monitoring child development programs.<\/li><li>Local child protection law knowledge.<\/li><\/ul><p><br><\/p><p><strong>Languages<\/strong><\/p><p><br><\/p><ul><li>English proficiency<\/li><\/ul><p><br><\/p><p><strong>Working Environment:<\/strong> Office \\u2013 Standard Office Environment<\/p><p><strong>Physical Demands:<\/strong> Sitting, standing, and\/or walking for up to 8 hours per day<\/p><p><strong>Travel Requirements: <\/strong>May be required to travel up to 30% of normal schedule<\/p>\"}"
}