{
    "id":"Kaggle::techmap::613f0e78dd099f6e402dd6ee::linkedin_be::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"The mention of involvement in \"exotic\" countries could inadvertently carry connotations of otherness or a colonial mindset. To ensure inclusivity and cultural sensitivity, it would be more appropriate to describe these locations with terms like \"international\" or \"overseas.\" These alternatives neutrally acknowledge the global aspect of the role without any unintended implications.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Driven since 1817 by the entrepreneurial spirit and passion for innovation of its founder, the John Cockerill Group’s primary mission is to meet the needs of its time by developing large-scale technological solutions. Its contribution to businesses, governments and communities consists of services and associated equipment for the sectors of energy, defense, industry, the environment, transport and infrastructures. Our mission is to facilitate access to renewable energy, fight against insecurity, produce sustainably, preserve natural resources and contribute to greener mobility. To accomplish this mission and to bring our group's entrepreneurial culture to life, five values guide our actions: innovation, commitment, responsibility, customer focus and humanity. All this, thanks to its 6, 000 employees, has enabled our group to achieve a turnover of 1. 26 billion euro in 22 countries on five continents in 2019. Nature & scope. The main purpose of the position is to provide support in decision-making to two Sector Pole Presidents: proposing and implementing performance indicators, drawing up relevant analyses enabling anticipated management. This, in order to achieve the best the deployment of our strategy. Main Responsibilities. Participation in project presentations to the engagement committee (new projects). Upstream involvement in the drafting of dossiers, especially on financial matters (budget, re-forecast operating result, cash projections hourly rate used, validation of the cash curve,. ). Supports project managers in the use of ‘ProMoCore’ (checking cost accounting, estimating the provisional cost price, the cash curve, drafting the project review reports,. ). Drafting and compilation of the budget, the results and cash flow and business plan reforecasts, in collaboration with management. Establishment of provisional load curves in order to verify the alignment between the provisional workload and the size of the workforce. Identification and analysis of deviations between real and budgeted figures (and \/ or taken from the last reforecast). Preparation \/ checking of operational monthly reports including financial and non-financial data. Defines, establishes and monitors relevant key indicators, in line with the needs of management and in conformity with the Group's standards. Regularly follows up balance sheet items (working capital, capex,. )and implements specific corrective actions in case of drifts. Support in specific operations requiring specific technical skills, particularly in the context of international projects (e. g. creation of subsidiaries or branches in 'exotic' countries. accounting, tax aspects,. ). Involvement in the strategy developed by Management, as a member of the Management Committee.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613f0e78dd099f6e402dd6ee::linkedin_be\", \"source\": \"linkedin_be\", \"country\": \"BE\", \"company\": \"John Cockerill\", \"position\": \"Financial Controller Industry & Environment\", \"notes\": \"\", \"original\": \"Driven since 1817 by the entrepreneurial spirit and passion for innovation of its founder, the John Cockerill Group\\u2019s primary mission is to meet the needs of its time by developing large-scale technological solutions.<br><br>Its contribution to businesses, governments and communities consists of services and associated equipment for the sectors of energy, defense, industry, the environment, transport and infrastructures.<br><br>Our mission is to facilitate access to renewable energy, fight against insecurity, produce sustainably, preserve natural resources and contribute to greener mobility.<br><br>To accomplish this mission and to bring our group's entrepreneurial culture to life, five values guide our actions: innovation, commitment, responsibility, customer focus and humanity.<br><br>All this, thanks to its 6,000 employees, has enabled our group to achieve a turnover of 1.26 billion euro in 22 countries on five continents in 2019.<br><br><strong>Nature &amp; scope<br><br><\/strong>The main purpose of the position is to provide support in decision-making to two Sector Pole Presidents: proposing and implementing performance indicators, drawing up relevant analyses enabling anticipated management. This, in order to achieve the best the deployment of our strategy.<br><br><strong><u>Main Responsibilities<br><\/u><\/strong><ul><li> Participation in project presentations to the engagement committee (new projects); upstream involvement in the drafting of dossiers, especially on financial matters (budget, re-forecast operating result, cash projections hourly rate used, validation of the cash curve, ...) <\/li><li> Supports project managers in the use of \\u2018ProMoCore\\u2019 (checking cost accounting, estimating the provisional cost price, the cash curve, drafting the project review reports, ...) <\/li><li> Drafting and compilation of the budget, the results and cash flow and business plan reforecasts, in collaboration with management <\/li><li> Establishment of provisional load curves in order to verify the alignment between the provisional workload and the size of the workforce <\/li><li> Identification and analysis of deviations between real and budgeted figures (and \/ or taken from the last reforecast) <\/li><li> Preparation \/ checking of operational monthly reports including financial and non-financial data; translation of these indicators into business terms <\/li><li> Defines, establishes and monitors relevant key indicators, in line with the needs of management and in conformity with the Group's standards. <\/li><li> Regularly follows up balance sheet items (working capital, capex, ...) and implements specific corrective actions in case of drifts <\/li><li> Support in specific operations requiring specific technical skills, particularly in the context of international projects (e.g. creation of subsidiaries or branches in 'exotic' countries - accounting, tax aspects, ...) <\/li><li> Involvement in the strategy developed by Management, as a member of the Management Committee <\/li><li> Checks the correct application of the Group rules and implements corrective actions if necessary <br><\/li><\/ul><strong>Profile<br><\/strong><ul><li> University level, ideally with a financial management orientation <\/li><li> Between 10 to 15 years experience in an equivalent position in the industrial sector or as an external auditor (preferably with an international \/ global office) <\/li><li> Sound knowledge \/ experience of English environment, knowledge of the language(s) of the BUs of the Sector\/Pole is an asset <\/li><li> Thorough knowledge of general and analytical accounting principles <\/li><li> Knowledge of direct and indirect taxation <\/li><li> Good knowledge of the MS Office suite; thorough knowledge of some specific functionalities is an advantage (macro, dynamic cross-tables,\\u2026) <br><\/li><\/ul>To perform the assignments of the job, and taking into account the double hierarchical and functional link, qualities such as rigorousness, independence and autonomy are critical. The financial controller should be both very close to the operational decision making center (and a Pole\/Sector Management Committee member) and be sufficiently independent to verify and, if needed, make sure that the BU practice is in line with Group policy<br><br>John Cockerill offers you career and development opportunities within its various sectors in a friendly working environment.<br><br>Do you want to work for an innovative company that will allow you to take up technical challenges on a daily basis?<br><br>We look forward to receiving your application and to meeting you!<br><br><strong>Discover our job opportunities in details on www.johncockerill.com<\/strong>\"}"
}