{
    "id":"Kaggle::techmap::6136efe287a4a677783d9144::monster2_fr::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":"The Tier 2 Certificate of Sponsorship and criminal record checks are standard immigration and employment requirements for overseas applicants, aligning with UK Home Office regulations.",
    "verified":true,
    "synthetic":false,
    "text":" -Ability to use pharmacy computer systems as well as Microsoft Office e. g. Word, Excel, Access, OutlookDesirable-Experience of the greater hospital environment-Familiarity with Chemocare-Evidence of leadership skills-Knowledge of GMP and current standards in dispensary and ward services Qualifications Essential-BTech\/NVQ 3 or equivalent-Registered with GPhC-Evidence of up to date and relevant CPDDesirable-A. C. T. or Medicines Management qualification. Disclosure and Barring Service Check. This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions. Tier 2 Certificate of Sponsorship. Applications from job seekers who require current Tier 2\/skilled worker sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information visit the UK Visas and Immigration website. From 6 April 2017, Tier 2\/skilled worker applicants, applying for entry clearance into the UK, have had to present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) are also subject to this requirement. Guidance can be found here Criminal records checks for overseas applicants. UK Registration Applicants must have current UK professional registration. For further information please see NHS Careers website (opens in a new window). Employer details. Employer nameStates of GuernseyAddressLe VauquiedorSt. MartinGuernseyGY4 6UUEmployer's websitehttpswww. gov. gg\/.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6136efe287a4a677783d9144::monster2_fr\", \"source\": \"monster2_fr\", \"country\": \"FR\", \"company\": \"National Health Service\", \"position\": \"Rotational Pharmacy Technician\", \"notes\": \"\", \"original\": \"Rotational Pharmacy TechnicianStates of GuernseyThe closing date is 06 September 2021Apply for this jobJob overviewThe States of Guernsey are looking for someone to join their Pharmacy Team.The post holder will work as part of the pharmacy team, undertaking the full range of duties within a rotational program to provide comprehensive services including dispensing (for in and out patients), manufacturing, aseptic preparation, radio-pharmacy, Procurement, Medicines Management and ward services to all hospitals in the Bailiwick of Guernsey.Main duties of the jobTo work as part of the pharmacy team, undertaking the full range of duties within a rotational program to provide comprehensive services including dispensing (for in and out patients), manufacturing, aseptic preparation, radio-pharmacy, Procurement, Medicines Management and ward services to all hospitals in the Bailiwick of Guernsey.About usThe Island of Guernsey is in the English Channel in the Bay of St Malo, 50km off the north-west coast of France and 120km from the English coast.Guernsey has a population of around 63,000 and in Alderney just under 2,000. Working in a relatively small Health and Social Care Service like ours means you can effectively work with colleagues across the services, health and social care professionals can collaborate not only with each other but also other agencies, the third sector and the community.We offer an attractive relocation policy and competitive salaries with great career opportunities, modern facilities, excellent training, revalidation and registration support and a healthy work-life balance. As a health or social care professional who chooses to join our team, you can look forward to working in an environment that gives you the time to care that you hoped for when choosing this career.Job descriptionJob responsibilitiesTo participate in general dispensary duties, ensuring services are provided in accordance with departmental procedures, and legal requirements for inpatients, outpatients and satellite units attached to the Princess Elizabeth Hospital.Receiving, storing and transporting prescriptionsChecking prescriptions for accuracy and suitability, contacting prescriber or ward to solve problems, after checking with the ward pharmacistChecking performing a final accuracy check on items dispensed by other members of staff (after completion of nationally approved Accuracy Checking Course)To take an active role in assessing the fitness for use of and processing previously dispensed items returned to the department and either returning them for re-use or disposing of them following the relevant SOPs.To receive and check incoming goods including controlled drugs.To assist the Pharmacist in taking accurate medication histories, assessing and reviewing medications bought into the hospital by patients, and reviewing suitability for useParticipate in and assist in developing Technician lead Drug Administration rounds.To answer queries about the medication supplied and side effects which have occurred (with assistance\/supervision from Pharmacists) and to also supply Medicines Information to Medical and Nursing staff or arrange for complex enquiries to be passed on to the Medicine Information Pharmacist for investigation.To take part in the storage, disposal and destruction of waste produced within the department , including cytotoxic products, radioactive waste and controlled drugs following the required SOPsUsing the pharmacy computer system, create and generate new orders from suppliers as required on the specific days and at the specific times required.Check weekly for goods not supplied, unresolved or old orders and act accordingly, notifying senior staff of any supply issues or goods not supplied.To assist in the induction, supervision, training and assessment of new staff, pharmacy students and colleagues working through their competency assessments, NVQ or other approved training programs.To take part in the departmental and organisational audit process when required.To have an active role in departmental and organisational meetings including staff and patient safety meetings.To comply with the principles contained in the Data Protection Law 2007.To undertake any other duties that may be required from time to time by the Head Technician or the Pharmacy Manager.Person Specification Experience Essential-General knowledge and understanding of Pharmaceutical Manufacture and GMP-Experience of stock control-Evidence of or a Willingness to provide training and support to pre-registration staff and Pharmacy assistants-Good organisational skills and time management-Ability to meet deadlines-Good written and verbal communication skills-Ability to use own initiative appropriately and work as an individual whilst contributing to the overall aims and objectives of the team.-Ability to work under pressure whilst maintaining attention to detail and accuracy-Ability to motivate self.-Ability to use pharmacy computer systems as well as Microsoft Office e.g. Word, Excel, Access, OutlookDesirable-Experience of the greater hospital environment-Familiarity with Chemocare-Evidence of leadership skills-Knowledge of GMP and current standards in dispensary and ward services Qualifications Essential-BTech\/NVQ 3 or equivalent-Registered with GPhC-Evidence of up to date and relevant CPDDesirable-A.C.T. or Medicines Management qualificationDisclosure and Barring Service CheckThis post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.Tier 2 Certificate of SponsorshipApplications from job seekers who require current Tier 2\/skilled worker sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information visit the  UK Visas and Immigration website.From 6 April 2017, Tier 2\/skilled worker applicants, applying for entry clearance into the UK, have had to present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) are also subject to this requirement.  Guidance can be found here Criminal records checks for overseas applicants.UK Registration Applicants must have current UK professional registration. For further information please see NHS Careers website (opens in a new window).Employer detailsEmployer nameStates of GuernseyAddressLe VauquiedorSt. MartinGuernseyGY4 6UUEmployer's websitehttps:\/\/www.gov.gg\/\"}"
}