{
    "id":"Kaggle::techmap::614144918be8df1fa24c1ebb::careerbuilder_us::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":". Ensures the safe and efficient operation of the resort’s common areas and related amenities, including but not limited to pools, Jacuzzi’s and water features! These assignments relate to a variety of trades that include but are not limited to carpentry, plumbing, painting and masonry. What will I be doing? Perform maintenance and repairs on pool surfaces, pool decks and furniture (furniture, fixtures and equipment). Exterior showers, assist in pump, valve or plumbing replacement, change out pool lights, perform pool cleaning in support of quality standards, remove scum, clean strainers, netting, vacuuming, backwashing, perform daily water tests and adjust chemicals as needed. Mechanical maintenance of all associated equipment: such as filters and plumbing. Able to respond to protein spills in the waterways. Communicate and execute preventative maintenance. Replaces faulty sections of pipe, valves, and fittings, using plumbing tools. Lubricates machines and equipment. Communicates to Contractors\/vendors. Maintain inventory of parts and lubricants. Conducts and records daily pool readings. Maintain a clean, neat pool pump rooms, sweeping and cleaning as necessary. Maintain accurate functioning of all equipment and tools. Establishes a clear line of communication with the engineering leadership. Trains other mechanics on pool procedures when asked. Assist other maintenance staff on special projects as directed by engineering leadership. Specific Job Knowledge, Skill and Ability: This requires the individual to possess considerable knowledge of a wide variety of maintenance trades in order to visually inspect and detect items needing repair. Skill in the use of related tools (including both hand and electric tools). Qualifications. What are we looking for? Basic mechanical aptitude. Basic English language communication in order to communicate with co-workers and fully comprehend job assignments. Ability to perform tasks requiring bending, stooping and kneeling. Ability to push and pull objects or materials weighing up to 100 lbs. Ability to wear fitted respirator. Ability to grasp, lift or carry items weighing up to 50 lbs., occasionally waist high. Regular attendance in conformance with the standards, which may be established and revised by HGVC form time to time, is essential to the successful performance of this position. Required Qualifications: Ability to follow basic written and verbal directions, climb stairs and work on ladders up to 40 feet, push\/pull up to 100 lbs., lift\/carry up to 50 lbs., grasp, stoop, reach overhead.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614144918be8df1fa24c1ebb::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"Hilton Grand Vacations\", \"position\": \"Maintenance Technician I - New Hire Bonus Up to\", \"notes\": \"\", \"original\": \"<div><p\/><p>Ensures the safe and efficient operation of the resort\\u2019s common areas and related amenities, including but not limited to pools, Jacuzzi\\u2019s and water features! These assignments relate to a variety of trades that include but are not limited to carpentry, plumbing, painting and masonry.<\/p><p><br \/><strong>What will I be doing?<\/strong><\/p><p>\\u00a0\\u00a0\\u00a0 Perform maintenance and repairs on pool surfaces, pool decks and furniture (furniture, fixtures and equipment). Exterior showers, assist in pump, valve or plumbing replacement, change out pool lights, perform pool cleaning in support of quality standards, remove scum, clean strainers, netting, vacuuming, backwashing, perform daily water tests and adjust chemicals as needed.<br \/>\\u00a0\\u00a0\\u00a0 Mechanical maintenance of all associated equipment: such as filters and plumbing.<br \/>\\u00a0\\u00a0\\u00a0 Able to respond to protein spills in the waterways.<br \/>\\u00a0\\u00a0\\u00a0 Communicate and execute preventative maintenance. Replaces faulty sections of pipe, valves, and fittings, using plumbing tools.<br \/>\\u00a0\\u00a0\\u00a0 Lubricates machines and equipment. Communicates to Contractors\/vendors.<br \/>\\u00a0\\u00a0\\u00a0 Maintain inventory of parts and lubricants.<br \/>\\u00a0\\u00a0\\u00a0 Conducts and records daily pool readings. Maintain a clean, neat pool pump rooms, sweeping and cleaning as necessary.<br \/>\\u00a0\\u00a0\\u00a0 Maintain accurate functioning of all equipment and tools. Establishes a clear line of communication with the engineering leadership.<br \/>\\u00a0\\u00a0\\u00a0 Trains other mechanics on pool procedures when asked.<br \/>\\u00a0\\u00a0\\u00a0 Assist other maintenance staff on special projects as directed by engineering leadership<\/p><p>Specific Job Knowledge, Skill and Ability:<\/p><p>\\u00a0\\u00a0\\u00a0 This requires the individual to possess considerable knowledge of a wide variety of maintenance trades in order to visually inspect and detect items needing repair.<br \/>\\u00a0\\u00a0\\u00a0 Skill in the use of related tools (including both hand and electric tools)<\/p><p><\/p><\/div><div><strong>Qualifications<\/strong><p\/><p><strong>What are we looking for?<\/strong><\/p><ul>\\t<li>\\u00a0\\u00a0\\u00a0 Basic mechanical aptitude<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 Basic English language communication in order to communicate with co-workers and fully comprehend job assignments.<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 Ability to perform tasks requiring bending, stooping and kneeling. Ability to push and pull objects or materials weighing up to 100 lbs.<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 Ability to climb stairs and ladders, working at heights up to approximately 40 feet, for extended periods of time, with the ability to reach often times overhead.<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 Ability to wear fitted respirator. Ability to grasp, lift or carry items weighing up to 50 lbs., occasionally waist high.<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 Regular attendance in conformance with the standards, which may be established and revised by HGVC form time to time, is essential to the successful performance of this position.<\/li><\/ul><p><strong>Required Qualifications:<\/strong><\/p><ul>\\t<li>\\u00a0\\u00a0\\u00a0 Ability to follow basic written and verbal directions, climb stairs and work on ladders up to 40 feet, push\/pull up to 100 lbs., lift\/carry up to 50 lbs., grasp, stoop, reach overhead<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 High School Diploma or GED equivalent.<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 Able to pass CPO certification with 180 days of hire<\/li>\\t<li>\\u00a0\\u00a0\\u00a0 0-3 years of related experience<\/li><\/ul><p><strong>Preferred Qualifications:<\/strong><\/p><p>\\u00a0\\u00a0\\u00a0 Currently possess CPO certification<br \/>\\u00a0\\u00a0\\u00a0 3+ years or more of related experience<\/p><p>Hilton Grand Vacations is a leader in the vacation ownership industry, operating with an unwavering commitment to innovation, quality, and continued growth. At the core of our company's success are our Team Members! We offer a fantastic benefit package to our full-time Team Members that include medical, dental and vision insurance, 401K plan, Paid Time Off (PTO) program and exciting travel benefits.<\/p><p><\/p><\/div>&nbsp;\"}"
}