{
    "id":"Kaggle::techmap::61515d5ed43e303ff8b15c1d::aarp_us::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Role: Insurance Sales Agent Employment Type: Full Time Pay: Commission Based We pay for performance! Successful first year agents average pay of nearly $38K in their first year with the second year pay growing to an average of nearly $47K. Top agents earn over $53K in their first year with that growing to over $68K in their second year. Benefits: Group Life Insurance, Major Medical, Dental, Short-term. Long-term disability, Retirement Plan, 401(k), Paid Vacation, Educational Reimbursement. Superior performance is recognized through numerous awards, prizes, and trips! Are you passionate about serving the under-served? This career could be for you! Kemper is a diversified insurance holding company located in Chicago, IL. We are firmly committed to servicing the insurance needs of modest-income families. As a home service family of companies, we are dedicated to frequent personal contact with our customers for premium collection and other service needs. Responsibilities: Agents are each assigned a territory (called an agency) with an established book of in-force business. Day to day activities include: Conducting interviews, recommending products, closing sales, and using our Family Security Selling System. Continuously prospecting for sales opportunities. Collecting premiums from policyholders, based on a pre-arranged schedule. Responding promptly to policyholder service requests such as beneficiary changes, claims, loans, etc. Keeping records, accounting for money collected, and processing paperwork Expectations: Our agents are each expected to: Increase the agency size. Build good working relationships with customers. Devote whatever time is necessary to fulfill the responsibilities of the position. Commit to ongoing development of knowledge and skills Preparation: Extensive on-the-job training allows new agents to earn a paycheck while learning their profession. Licensing Various state licenses are required to sell or service insurance products. Our companies provide assistance and guidance to those who are preparing to sit for licensing exams. Rewards: The opportunity to become a successful agent is an opportunity to build a better life. Among the rewards are: An established business New agents pay nothing for an established agency, which has a built-in clientele of loyal policyholders.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61515d5ed43e303ff8b15c1d::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Kemper\", \"position\": \"Insurance Sales Agent - Gainesville\", \"notes\": \"\", \"original\": \"Role: Insurance Sales Agent Employment Type: Full Time Pay: Commission Based We pay for performance! Successful first year agents average pay of nearly $38K in their first year with the second year pay growing to an average of nearly $47K. Top agents earn over $53K in their first year with that growing to over $68K in their second year. Benefits: Group Life Insurance, Major Medical, Dental, Short-term; Long-term disability, Retirement Plan, 401(k), Paid Vacation, Educational Reimbursement. Superior performance is recognized through numerous awards, prizes, and trips! Are you passionate about serving the under-served? This career could be for you! Kemper is a diversified insurance holding company located in Chicago, IL. We are firmly committed to servicing the insurance needs of modest-income families. As a home service family of companies, we are dedicated to frequent personal contact with our customers for premium collection and other service needs. Responsibilities: Agents are each assigned a territory (called an agency) with an established book of in-force business. Day to day activities include: Conducting interviews, recommending products, closing sales, and using our Family Security Selling SystemContinuously prospecting for sales opportunitiesCollecting premiums from policyholders, based on a pre-arranged scheduleResponding promptly to policyholder service requests such as beneficiary changes, claims, loans, etcKeeping records, accounting for money collected, and processing paperwork Expectations: Our agents are each expected to: Increase the agency sizeBuild good working relationships with customersDevote whatever time is necessary to fulfill the responsibilities of the positionCommit to ongoing development of knowledge and skills Preparation: Extensive on-the-job training allows new agents to earn a paycheck while learning their profession.Licensing Various state licenses are required to sell or service insurance products. Our companies provide assistance and guidance to those who are preparing to sit for licensing exams.Basic Training During the first 26 weeks, new agents complete a basic development program that includes self-study, classroom time, role-play, and extensive fieldwork. Rewards: The opportunity to become a successful agent is an opportunity to build a better life. Among the rewards are: An established business New agents pay nothing for an established agency, which has a built-in clientele of loyal policyholdersPay for performance A chance to write their own paycheck with increasing income opportunity as skills and knowledge growJob stability Employment in a field where there is an increasing need of qualified professionalsPrestige Recognition in the community as a respected professionalAdvancement The potential for future promotion to a management positionPersonal Satisfaction Knowing that they are doing meaningful work when they help others protect the people they love and the things they own Equal opportunity We are firmly committed to our policy of providing equal employment opportunity based on individual merit Opportunity is knocking. Dont let it pass you by! Need help? Contact our Success Center at 877-###-####. #acc PandoLogic. Category:Insurance, Keywords:Insurance Sales Agent, Location:Auburn, GA-30011<br \/>\"}"
}