{
    "id":"Kaggle::techmap::615364b5858366617e3d8991::seek_nz::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" You enjoy working in a fast-paced environment where change is normal. What We Offer: We provide a positive and progressive work environment, where we all support each other to achieve excellent outcomes for our clients. You will enjoy modern training and opportunities to develop your career and an orientation \/ training plan backed by loads of support. Hours of work. These are full-time, fixed term opportunities until 30 June 2022. You will be rostered for 37 hours and 55 minutes per week between the hours of. Monday-Friday 6:55am to 10:00pm and. Saturdays between 8:00am to 2:00pm. We work on a no surprises basis and will ensure that you will know your scheduled shifts well in advance. Key recruitment process information. If you are short listed the recruitment process will include a face to face interview (18\/10\/2021  22\/10\/2021), and reference checking. Salary starts from $53, 502.00 per annum. Candidates must hold NZ Citizenship or a Permanent Resident visa at time of application. You also must be available for the entire training period which covers 22\/11\/2021 to 25\/02\/2022 (excluding usual stat holidays). Our recruitment process moves quickly, please dont delay putting in your application. Position Description. httpswww. msd. govt. nz\/hr\/documents\/position-descriptions\/dce-service-delivery\/client-service-support\/customer-service-representative-march-2021. docx. How to apply. To apply, click the 'Apply Now' button to upload your CV and complete the online application form. All applications must be made online. If this is not possible or if you have any queries, please contact us at msd. govt. nz. Internal MSD Employees  please apply through your myHR portal at work. This will ensure that your myHR employee profile is visible as internal candidate. Closing date: Monday, 11 October 2021. Joining us. Joining MSD means being part of a whanau that celebrates the diversity each individual represents. We show manaaki, we care about the wellbeing and success of people and want everyone to thrive, and be who they are in a supportive and inclusive working environment. We work together to make a difference for communities while doing the right thing with integrity. We are a Treaty partner committed to strengthening relationships with Maori, Hapu, Iwi and communities to realise their own potential and aspirations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615364b5858366617e3d8991::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Ministry of Social Development\", \"position\": \"Customer Service Representatives - Work and Income\", \"notes\": \"\", \"original\": \"<p><strong>About us<\/strong><\/p> <p>The Ministry of Social Development is a people-centred organisation. We\\u2019re in communities across the motu, working with partners to help New Zealanders be safe, strong and independent.<\/p> <p>We provide social policy and advice to government and assistance, including income, employment and housing support to people of all ages, families, wh\\u0101nau and communities.<\/p> <p>As a Te Tiriti o Waitangi partner we are committed to supporting and enabling M\\u0101ori, wh\\u0101nau, hap\\u016b, Iwi and communities to realise their own potential and aspirations.<\/p> <p>Our people are as diverse as the communities we serve. We care about the wellbeing and success of our people and provide a supportive and inclusive working environment where people can thrive and be who they are.<\/p> <p><strong>Customer Service Representatives - Work and Income - Lower Hutt<\/strong><\/p> <ul> <li><strong>Contact Centre Services, Lower Hutt (Work and Income)<\/strong><\/li> <li><strong>Full Time, Fixed Term \\u2013 22 November 2021 to 30 June 2022\\u00a0<\/strong><\/li><\/ul> <p><strong>The Opportunity:<\/strong><\/p> <p>Join us to make a difference to the lives of New Zealanders. \\u00a0We have a great opportunity for you to be a part of our high energy, successful and supportive team.\\u00a0<br \/>We are calling for motivated and adaptable people who can hit the ground running and help deliver end to end phone services for our clients. Now, more than ever, you can make a meaningful difference to the lives of New Zealander\\u2019s in one of our modern and busy contact centre teams in Lower Hutt.<\/p> <p><strong>About the Role:<\/strong><\/p> <p>Working in a contact centre at the Ministry for Social Development puts you at the forefront of peoples\\u2019 lives. Our clients need highly empathetic people to help them navigate a range of issues, so you will be required to navigate multiple systems, be responsible for sourcing information, providing support, delivering a high standard of service and quality interactions over the phone. Our comprehensive training approach will equip you to confidently work with clients, primarily through inbound calls. What you do makes a difference.\\u00a0<\/p> <p><strong>About You:<\/strong><\/p> <p>The kind of people we are looking for offer the following attributes to make you successful in this role<\/p> <ul> <li>You enjoy quality conversations and can demonstrate a history of providing clients a positive experience over the phone.<\/li> <li>Adaptable, resilient, and empathetic to client\\u2019s complex situations.<\/li> <li>Demonstrated experience using technology to solve problems.<\/li> <li>An eagerness to learn and desire for self-improvement.\\u00a0<\/li> <li>You work efficiently, accurately and can make good, sound decisions.<\/li> <li>You enjoy working in a fast-paced environment where change is normal.<\/li><\/ul> <p><strong>What We Offer:<\/strong><\/p> <p>We provide a positive and progressive work environment, where we all support each other to achieve excellent outcomes for our clients. You will enjoy modern training and opportunities to develop your career and an orientation \/ training plan backed by loads of support.\\u00a0<\/p> <p><strong>Hours of work\\u00a0<\/strong><\/p> <p>These are full-time, fixed term opportunities until 30 June 2022.\\u00a0<\/p> <p>You will be rostered for 37 hours and 55 minutes per week between the hours of\\u00a0<\/p> <ul> <li>Monday-Friday 6:55am to 10:00pm and\\u00a0<\/li> <li>Saturdays between 8:00am to 2:00pm.<\/li><\/ul> <p>We work on a no surprises basis and will ensure that you will know your scheduled shifts well in advance.<\/p> <p><strong>Key recruitment process information<\/strong><\/p> <ul> <li>If you are short listed the recruitment process will include a face to face interview (18\/10\/2021 \\u2013 22\/10\/2021), and reference checking. \\u00a0\\u00a0<\/li> <li>Salary starts from $53,502.00 per annum\\u00a0<\/li> <li>Candidates must hold NZ Citizenship or a Permanent Resident visa at time of application<\/li><\/ul> <p>You also must be available for the entire training period which covers 22\/11\/2021 to 25\/02\/2022 (excluding usual stat holidays).<\/p> <p>Our recruitment process moves quickly, please don\\u2019t delay putting in your application.\\u00a0<\/p> <p><strong>Position Description<\/strong><\/p> <p><a href=\\\"https:\/\/www.msd.govt.nz\/hr\/documents\/position-descriptions\/dce-service-delivery\/client-service-support\/customer-service-representative-march-2021.docx\\\" target=\\\"_blank\\\">https:\/\/www.msd.govt.nz\/hr\/documents\/position-descriptions\/dce-service-delivery\/client-service-support\/customer-service-representative-march-2021.docx<\/a><\/p> <p><strong>How to apply<\/strong><\/p> <p>To apply, click the 'Apply Now' button to upload your CV and complete the online application form. \\u00a0<\/p> <p>All applications must be made online.\\u00a0If this is not possible or if you have any queries, please contact us at\\u00a0<a href=\\\"mailto:jobs@msd.govt.nz\\\" target=\\\"_blank\\\">jobs@msd.govt.nz<\/a><\/p> <p><strong>Internal MSD Employees\\u00a0<\/strong>\\u2013 please apply through your myHR portal at work.\\u00a0This will ensure that your myHR employee profile is visible as internal candidate.<\/p> <p><strong>Closing date: Monday, 11 October 2021.<\/strong><\/p> <p><strong>Joining us<\/strong><\/p> <p>Joining MSD means being part of a wh\\u0101nau that celebrates the diversity each individual represents. We show manaaki, we care about the wellbeing and success of people and want everyone to thrive, and be who they are in a supportive and inclusive working environment. We work together to make a difference for communities while doing the right thing with integrity. We are a Treaty partner committed to strengthening relationships with M\\u0101ori, Hap\\u016b, Iwi and communities to realise their own potential and aspirations.<\/p> <p>If you have any support or access requirements, we encourage you to tell us when you apply so we can assist you through the recruitment process.<\/p>\"}"
}