{
    "id":"Kaggle::techmap::6145cb1107fc65522a1d063a::linkedin_lu::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":true,
    "analysis_masculine":"Phrases like \"Strategic foresight and entrepreneurial mindset\" and \"Ability to drive change\" are masculine coded terms ",
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Keep current with evolving technology, marketplace dynamics and applicable regulatory requirements, including but not limited to the EU, and specifically local requirements in Luxembourg, Germany, France, Italy, and Spain. Continually seek and implement new opportunities for improvement, efficiency and enhancement. Advise senior management, the MFS Lux Boards, and the boards of directors\/trustees of other MFS entities and funds on a regular basis with respect to regulatory obligations, developments and\/or concerns and the adequacy of MFS Lux's compliance and anti-money laundering programs. Develop and maintain effective relationships with business partners, industry peers, trade associations, and, as appropriate, regulators to understand business needs and opportunities, to assess and articulate regulatory risks associated with existing and\/or new business activities, and to provide a framework to enable well informed business decisions relative to regulatory risks. Advise, direct, develop and deliver compliance education based on MFS Lux needs. Additional responsibilities as needed. Job Requirements: Bachelor's degree minimum or equivalent work experience. At least 10 years of related compliance experience. Prior experience working with a multinational, US-based corporation is also a plus. Proven track record managing and developing a team, as well as collaborating with colleagues across functions and geographies. Excellent interpersonal, organizational, communication, team-working and problem-solving skills. Strategic foresight and entrepreneurial mindset around innovation and evolution to build long-term, sustainable outcomes. Ability to drive change while collaborating and building bridges with cross-functional teams, including domestic and international team members. Excellent presentation skills. Must be able to present comfortably to groups of all levels and to educate and persuade the audience during these presentations. Must be fully fluent in English (speaking, reading and writing), and fluency in additional languages applicable to the region is preferred. Travel, both regional and global, is required, as is participation outside of normal local business hours in conference calls with other MFS locations, including headquarters. Prior to the conclusion of a signed contract, the candidate is obliged to submit an extract from bullet 3 of the criminal record, dated less than 2 months, in order to prove his\/ her honorability, integrity and conduct in order to occupy the vacant position. If any applicant is unable to complete an application or respond to a job opening because of a disability, please contact MFS at 617-954-5000 or email mfs. com for assistance.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6145cb1107fc65522a1d063a::linkedin_lu\", \"source\": \"linkedin_lu\", \"country\": \"LU\", \"company\": \"MFS Investment Management\", \"position\": \"Luxembourg Compliance Officer\", \"notes\": \"\", \"original\": \"Whether you're an investment professional, an expert in sales or a technology specialist, you'll find a culture at MFS that supports you in doing what you do best. Our employees work together to reach better outcomes, always favoring the strongest idea over the strongest individual. We put people first and show care and compassion for our community and each other. Because what we do matters \\u2013 to us as valued professionals and to the millions of people and institutions who rely on us to help them build more secure and prosperous futures.<br><br><strong><strong><u>Job Description<\/u><\/strong><\/strong><strong><u><strong>Purpose:<\/strong><\/u><\/strong><strong> The Compliance Officer is accountable for:<br><\/strong><ul><li>Providing strategic and operational compliance direction for MFS Investment Management Company (Lux) S.a.r.l. (MFS Lux), a subsidiary of MFS Investment Management and a UCITS-authorized management company, including its branches<\/li><li>Overseeing MFS Lux\\u2019s Compliance function consistent with CSSF Circulars 12\/546, 04\/155 and 18\/698<\/li><li>Maintaining and implementing the Luxembourg Anti-Money Laundering program<\/li><li>Serving as Conducting Person (CP) for Compliance and other areas of the business that the Board of Managers of MFS Lux may determine<\/li><\/ul><strong>In addition to reporting to MFS' Head of International Compliance, this position will provide regular reports and relevant data to the other MFS Lux Conducting Officers, and the Board of Directors or similar bodies of each of the Luxembourg Funds.<\/strong><strong><u><strong>Principle Responsibilities:<br><\/strong><\/u><\/strong><ul><li>As a Conducting Officer and member of MFS Lux's Executive Committee, work in close partnership with other CPs to manage and oversee the day-to-day activities of the Management Company and Funds and to take all actions falling within the scope of the assigned responsibilities.<\/li><li>Manage and develop the Luxembourg-based Compliance team.<\/li><li>Establish, maintain and implement compliance and anti-money laundering (AML) programs appropriate to MFS Lux and reflective of industry best practices, regulatory requirements\/expectations, and emerging regulatory risk.<\/li><li> Provide effective oversight of activities delegated to MFS and other delegates. Coordinate, collaborate and communicate effectively with the Compliance Department and business units outside of Luxembourg, particularly in London and Boston <\/li><li>Serve as primary compliance liaison between MFS Lux and the Luxembourg Commission de Surveillance du Secteur Financier (CSSF), including preparing required reports for, communicating with, and receiving documentation from the CSSF. <\/li><li>Develop strategy and set priorities for the MFS Lux compliance function and ensure that they are incorporated into MFS' global compliance programs and communicated appropriately.<\/li><li>Keep current with evolving technology, marketplace dynamics and applicable regulatory requirements, including but not limited to the EU, and specifically local requirements in Luxembourg, Germany, France, Italy, and Spain; . Continually seek and implement new opportunities for improvement, efficiency and enhancement.<\/li><li>Advise senior management, the MFS Lux Boards, and the boards of directors\/trustees of other MFS entities and funds on a regular basis with respect to regulatory obligations, developments and\/or concerns and the adequacy of MFS Lux's compliance and anti-money laundering programs. <\/li><li>Develop and maintain effective relationships with business partners, industry peers, trade associations, and, as appropriate, regulators to understand business needs and opportunities, to assess and articulate regulatory risks associated with existing and\/or new business activities, and to provide a framework to enable well informed business decisions relative to regulatory risks. <\/li><li>Advise, direct, develop and deliver compliance education based on MFS Lux needs.<\/li><li> Additional responsibilities as needed <\/li><\/ul><strong><u><strong>Job Requirements:<br><\/strong><\/u><\/strong><ul><li>Bachelor's degree minimum or equivalent work experience. <\/li><li>At least 10 years of related compliance experience. Prior experience working with a multinational, US-based corporation is also a plus.<\/li><li>Proven track record managing and developing a team, as well as collaborating with colleagues across functions and geographies.<\/li><li>Excellent interpersonal, organizational, communication, team-working and problem-solving skills.<\/li><li>Strategic foresight and entrepreneurial mindset around innovation and evolution to build long-term, sustainable outcomes.<\/li><li>Ability to drive change while collaborating and building bridges with cross-functional teams, including domestic and international team members.<\/li><li>Excellent presentation skills. Must be able to present comfortably to groups of all levels and to educate and persuade the audience during these presentations.<\/li><li>Must be fully fluent in English (speaking, reading and writing), and fluency in additional languages applicable to the region is preferred.<\/li><li>Travel, both regional and global, is required, as is participation outside of normal local business hours in conference calls with other MFS locations, including headquarters.<\/li><\/ul><strong>Prior to the conclusion of a signed contract, the candidate is obliged to submit an extract from bullet 3 of the criminal record, dated less than 2 months, in order to prove his\/ her honorability, integrity and conduct in order to occupy the vacant position<br><br><\/strong>If any applicant is unable to complete an application or respond to a job opening because of a disability, please contact MFS at 617-954-5000 or email talent_acquisition@mfs.com for assistance.<br><br><em><em><em>MFS is an Affirmative Action and Equal Opportunity Employer and it is our policy to not discriminate against any employee or applicant for employment because of race, color, religion, sex, national origin, age, marital status, sexual orientation, gender identity, genetic information, disability, veteran status, or any other status protected by federal, state or local laws. Employees and applicants of MFS will not be subject to harassment on the basis of their status. Additionally, retaliation, including intimidation, threats, or coercion, because an employee or applicant has objected to discrimination, engaged or may engage in filing a complaint, assisted in a review, investigation, or hearing or have otherwise sought to obtain their legal rights under any Federal, State, or local EEO law is prohibited. <\/em><\/em><\/em> <em>\\\"<\/em> Click here <em>to view the 'EEO is the Law' poster and <\/em> supplement <em>.\\\"<br><br><\/em>\"}"
}