{
    "id":"Kaggle::techmap::614b318e7163f24bf851258d::eures_es::0",
    "label_age":true,
    "analysis_age":"The phrase \"Young & hungry & salesy people\" suggests a preference for younger candidates, potentially excluding older applicants.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The term \"salesy people\" uses informal and potentially exclusionary language that may not be appropriate in a professional context.",
    "verified":true,
    "synthetic":false,
    "text":" Stellenangebotsbeschreibung: Start: ASAP. Tasks: Sales activities for well known IT companies. Candidates basically prospecting SMEs to identify business opportunities (evaluating which software companies currently use, evaluating interest for the above (SAP, HPE), booking an appointment for a demo call (colleague will take over). Mix of cold calling. leads that subscribed & participated in a webinar. Profile: Young & hungry & salesy people with German C2. no specific sales experience required (always a plus). Benefits: Contracts: preferably for a year, but would be fine with 8-9 months also. Salary: €25, 000 base  €5, 000 guaranteed retention bonus after every 12 months of employment. some projects have performance based commissions. 2 weeks of intensive training. Multiple opportunities for development. Working hours during normal office times. Administration support (help to apply for NIE if outside Spain). Ideally candidates should be already in Barcelona, but the company would be happy to consider candidates from across Spain who are keen to relocate to Barcelona. Candidates from outside of Spain also wellcome : whod want to relocate to Barcelona after up to 3 months of working remotely. (N Remote work would need to be done with their own notebook). Job Types: Full-time, Permanent.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614b318e7163f24bf851258d::eures_es\", \"source\": \"eures_es\", \"country\": \"ES\", \"company\": \"Personalb\\u00fcro U. Herrmann\", \"position\": \"Business Development Agent German (Callcenteragent )\", \"notes\": \"\", \"original\": \"Stellenangebotsbeschreibung: <br>Start: ASAP<br><br>Tasks:<br><br>Sales activities for well known IT companies.<br><br>Candidates basically prospecting SME\\u2019s to identify business opportunities (evaluating which software companies currently use, evaluating interest for the above (SAP, HPE\\u2026), booking an appointment for a demo call (colleague will take over)<br><br>Mix of cold calling + leads that subscribed &amp; participated in a webinar<br><br>Profile:<br>Young &amp; hungry &amp; salesy people with German C2<br><br>no specific sales experience required (always a plus)<br><br>Benefits:<br><br>Contracts: preferably for a year, but would be fine with 8-9 months also<br><br>Salary: \\u20ac25,000 base + \\u20ac5,000 guaranteed retention bonus after every 12 months of employment + some projects have performance based commissions<br><br>2 weeks of intensive training<br><br>Multiple opportunities for development<br><br>Working hours during normal office times<br><br>Administration support (help to apply for NIE if outside Spain)<br><br>Ideally candidates should be already in Barcelona, but the company would be happy to consider candidates from across Spain who are keen to relocate to Barcelona.<br><br>Candidates from outside of Spain also wellcome : who\\u2019d want to relocate to Barcelona after up to 3 months of working remotely. (N Remote work would need to be done with their own notebook)<br><br>Job Types: Full-time, Permanent<br>\"}"
}