{
    "id":"Kaggle::techmap::61462a27ecd2821bfb953e03::linkedin_bg::1",
    "label_age":true,
    "analysis_age":"The phrase \"Recent college graduate\" will discourage older candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Our global team: Siemens Healthineers is a leading global medical technology company. 53, 000 dedicated colleagues in over 70 countries are driven to shape the future of healthcare. An estimated 5 million patients across the globe benefit every day from our innovative technologies and services in the areas of diagnostic and therapeutic imaging, laboratory diagnostics and molecular medicine, as well as digital health and enterprise services. WHY SIEMENS HEALTHINEERS? Because Siemens Healthcare is full of innovations during last 2 centuries and full of patents – more than 18. 000 up to date. Every hour +240 000 people are in touch with our products. WHO ARE WE? We are team of 33 people. service engineers, sales, business administration, based mainly in Sofia (Siemens building). Responsibilities: Assists the project manager in creation of architectural\/ technical plans for medical facilities. Assists the project manager throughout the processes of project planning and implementation. Helps to organize and control medical sites for various projects. Supports the implementation of the project’s financial parameters. Contributes to keeping the project deadlines. Maintains correspondence with various institutions and all project stakeholders. Qualification and skills: A last year student or a recent graduate, preferably in the area of Architecture or Construction. Good command of English. Computer skills – AutoCAD, Microsoft Office applications. Clean driving license. Excellent communicative and organizational skills. Team player. A highly motivated individual with enthusiasm to work in a dynamic environment. We offer you: A 6-months paid traineeship in a multinational company with leading positions in the medical equipment market. Opportunity for future career development. An opportunity to gain experience and enhance your professional skills. A friendly team and a dynamic working environment. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We do thank you for your application and interest, and we are looking forward to meeting you! Organization: Siemens Healthineers. Company: Siemens Healthcare EOOD. Experience Level: Recent College Graduate. Job Type: Full-time",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61462a27ecd2821bfb953e03::linkedin_bg\", \"source\": \"linkedin_bg\", \"country\": \"BG\", \"company\": \"Siemens Healthineers\", \"position\": \"Project Assistant Trainee\", \"notes\": \"\", \"original\": \"Our global team: Siemens Healthineers is a leading global medical technology company. 53,000 dedicated colleagues in over 70 countries are driven to shape the future of healthcare. An estimated 5 million patients across the globe benefit every day from our innovative technologies and services in the areas of diagnostic and therapeutic imaging, laboratory diagnostics and molecular medicine, as well as digital health and enterprise services.<br><br>WHY SIEMENS HEALTHINEERS?<br><br>Because Siemens Healthcare is full of innovations during last 2 centuries and full of patents \\u2013 more than 18.000 up to date. Every hour +240 000 people are in touch with our products.<br><br>WHO ARE WE?<br><br>We are team of 33 people - service engineers, sales, business administration, based mainly in Sofia (Siemens building).<br><br><strong>Responsibilities:<br><br><\/strong><ul><li>Assists the project manager in creation of architectural\/ technical plans for medical facilities<\/li><li>Assists the project manager throughout the processes of project planning and implementation;<\/li><li>Helps to organize and control medical sites for various projects;<\/li><li>Supports the implementation of the project\\u2019s financial parameters;<\/li><li>Contributes to keeping the project deadlines;<\/li><li>Maintains correspondence with various institutions and all project stakeholders.<br><br><\/li><\/ul><strong>Qualification and skills:<br><br><\/strong><ul><li>A last year student or a recent graduate, preferably in the area of Architecture or Construction<\/li><li>Good command of English;<\/li><li>Computer skills \\u2013 AutoCAD, Microsoft Office applications;<\/li><li>Clean driving license;<\/li><li>Excellent communicative and organizational skills;<\/li><li>Team player;<\/li><li>A highly motivated individual with enthusiasm to work in a dynamic environment.<br><br><\/li><\/ul><strong>We offer you:<br><br><\/strong><ul><li>A 6-months paid traineeship in a multinational company with leading positions in the medical equipment market;<\/li><li>Opportunity for future career development <\/li><li>An opportunity to gain experience and enhance your professional skills;<\/li><li>A friendly team and a dynamic working environment.<br><br><\/li><\/ul>We are an <strong>equal opportunity employer<\/strong> and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status.<br><br><strong>We do thank you for your application and interest, and we are looking forward to meeting you! <br><br><\/strong><strong>Organization:<\/strong> Siemens Healthineers<br><br><strong>Company:<\/strong> Siemens Healthcare EOOD<br><br><strong>Experience Level:<\/strong> Recent College Graduate<br><br><strong>Job Type:<\/strong> Full-time\"}"
}