{
    "id":"Kaggle::techmap::615f6e3d5c24534e970adcbe::snagajob_us::6",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Overview. As an Assistant Store Leader, you will assist the Store Leader with store operation and implementation of our company's Servant Leadership – Integrity, Guest Focus, Accountability, Recognition, Excellent Execution, People and Teamwork. You'll learn about 7-Eleven's Retailer Initiative strategy, and be trained on our Retail Information System inventory management and ordering technology. You'll also assist with managing the store staff – coaching, training, feedback and scheduling – after completion of the required training and certifications. Getting There. We believe great training is the foundation for exceptional performance. The Assistant Store Leader training program teaches you the retail business using our state-of-the-art Retail Information System and Career Path training through hands-on and Computer Based Training. What's In It For You? 7-Eleven is committed to creating an environment that encourages and rewards excellence, and provides a range of benefits for eligible employees that includes:. Competitive rate of pay. Medical, dental, vision and insurance benefits. Short-term disability benefits. Employee assistance program. Paid Time Off. Profit Sharing\/401(k) Plan. And more… Are You Ready? Responsibilities. What Will You Do? Forecast, order, stock and merchandise product (upon completion of training). Aid in ensuring prompt reconciliation of store operations paperwork. Ensure prompt, efficient and courteous guest service. Aid in maintaining a clean, guest friendly environment in the store. Qualifications. The Assistant Store Leader position requires the following:. High School Diploma or equivalent required. Or an equivalent combination of education and experience. Strong mathematics ability. Strong written and oral communications skills. Desire to be part of a performance-driven team. Physical Requirements:. The Assistant Store Leader position requires frequent walking and standing with occasional reaching, climbing, stooping, and sitting, kneeling and crouching \/ squatting. Occasional lifting, carrying, pushing and pulling of approximately 20 – 40 pounds is required. #INDSJ711. Store Location. Store 02511. 1408 D Stephanie Way. Chesapeake, VA, 23320. United States.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615f6e3d5c24534e970adcbe::snagajob_us\", \"source\": \"snagajob_us\", \"country\": \"US\", \"company\": \"7-Eleven\", \"position\": \"Assistant Store Leader (Manager) (RIS)\", \"notes\": \"\", \"original\": \"<div _ngcontent-sc255=\\\"\\\" class=\\\"job-description\\\">\\n <div _ngcontent-sc255=\\\"\\\">\\n  <div _ngcontent-sc255=\\\"\\\" class=\\\"ng-star-inserted\\\">\\n   Overview \\n   <br>\\n   <br>As an Assistant Store Leader, you will assist the Store Leader with store operation and implementation of our company's Servant Leadership \\u2013 Integrity, Guest Focus, Accountability, Recognition, Excellent Execution, People and Teamwork. You'll learn about 7-Eleven's Retailer Initiative strategy, and be trained on our Retail Information System inventory management and ordering technology. You'll also assist with managing the store staff \\u2013 coaching, training, feedback and scheduling \\u2013 after completion of the required training and certifications. \\n   <br>\\n   <br>Getting There\\n   <br>We believe great training is the foundation for exceptional performance. The Assistant Store Leader training program teaches you the retail business using our state-of-the-art Retail Information System and Career Path training through hands-on and Computer Based Training.\\n   <br>\\n   <br>What's In It For You?\\n   <br>7-Eleven is committed to creating an environment that encourages and rewards excellence, and provides a range of benefits for eligible employees that includes:\\n   <br>\\u2022 Competitive rate of pay\\n   <br>\\u2022 Medical, dental, vision and insurance benefits\\n   <br>\\u2022 Short-term disability benefits\\n   <br>\\u2022 Employee assistance program\\n   <br>\\u2022 Paid Time Off\\n   <br>\\u2022 Profit Sharing\/401(k) Plan\\n   <br>\\u2022 And more\\u2026 Are You Ready? \\n   <br>\\n   <br>Responsibilities \\n   <br>\\n   <br>What Will You Do?\\n   <br>\\n   <br>\\u2022 Forecast, order, stock and merchandise product (upon completion of training) \\n   <br>\\u2022 Aid in ensuring prompt reconciliation of store operations paperwork \\n   <br>\\u2022 Ensure prompt, efficient and courteous guest service \\n   <br>\\u2022 Aid in maintaining a clean, guest friendly environment in the store \\n   <br>\\n   <br>Qualifications \\n   <br>\\n   <br>The Assistant Store Leader position requires the following:\\n   <br>\\n   <br>\\u2022 High School Diploma or equivalent required \\n   <br>\\u2022 Six to nine months experience as an Assistant Leader; or an equivalent combination of education and experience \\n   <br>\\u2022 Strong mathematics ability \\n   <br>\\u2022 Strong written and oral communications skills \\n   <br>\\u2022 Desire to be part of a performance-driven team\\n   <br>\\n   <br>Physical Requirements:\\n   <br>\\u2022 The Assistant Store Leader position requires frequent walking and standing with occasional reaching, climbing, stooping, and sitting, kneeling and crouching \/ squatting. Occasional lifting, carrying, pushing and pulling of approximately 20 \\u2013 40 pounds is required. \\n   <br>\\n   <br>#INDSJ711 \\n   <br>\\n   <br>Store Location \\n   <br>\\n   <br>Store 02511 \\n   <br>1408 D Stephanie Way \\n   <br>Chesapeake, VA, 23320 \\n   <br>United States \\n   <br>\\n   <br>\\n  <\/div>\\n <\/div>\\n<\/div>\"}"
}