{
    "id":"Kaggle::techmap::61377d32f2fd7421561f6664::seek_nz::0",
    "label_age":true,
    "analysis_age":"\" Are you a recent IT graduate?\" is biased against older graduates",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Have you worked at 2Degrees, Slingshot, Skinny etc? Are you a recent IT graduate? Are you a customer service person with excellent IT skills? My name is Mark from Randstad Recruitment and I have recently placed four people at the client I am advertising this role on behalf of. If you would like to be the fifth read on! I'm looking for someone with excellent communication skills, who's easy to understand, a pleasure to talk to and is passionate about IT. If you would like to help people with technology over the phone and enjoy your career seriously consider applying. My client is located on the North Shore of Auckland in Albany and they offer free parking as well as an excellent work environment. Due to rapid growth we're looking for talented and passionate IT Support agents. You will be responsible for providing technical support and customer service over the phone, solving technical issues and escalating problems when required. With offices in America, Australia and NZ. this market leading technology product requires a strong technical support team. Key responsibilities: Engaging directly and promptly with customers, installers and dealers either by telephone, electronically or face to face. Obtaining and evaluating all relevant information to handle inquiries and issues. Identifying and escalating situations requiring urgent attention with clear and concise notes. Managing requests and unresolved issues. Following up with cases to provide feedback to customers. Communicating and coordinating with internal stakeholders. Providing a professional service to customers. The team operates Monday. Friday normal NZ hours. Salary up to $55, 000 DOE. If this sounds like your next role please apply now. Please note as this is a permenant role we are only able to consider applicants who currently hold the right to work in NZ. At Randstad, we are passionate about providing equal employment opportunities and embracing diversity to the benefit of all. We actively encourage applications from any background.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61377d32f2fd7421561f6664::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Randstad - Business Support\", \"position\": \"Technical Support Agent\", \"notes\": \"\", \"original\": \"<p>Have you worked at 2Degrees, Slingshot, Skinny etc? Are you a recent IT graduate? Are you a customer service person with excellent IT skills? My name is Mark from Randstad Recruitment and I have recently placed four people at the client I am advertising this role on behalf of. If you would like to be the fifth read on! <\/p><p>I'm looking for someone with excellent communication skills, who's easy to understand, a pleasure to talk to and is passionate about IT. If you would like to help people with technology over the phone and enjoy your career seriously consider applying. <\/p><p>My client is located on the North Shore of Auckland in Albany and they offer free parking as well as an excellent work environment.<\/p><p>Due to rapid growth we're looking for talented and passionate IT Support agents. You will be responsible for providing technical support and customer service over the phone, solving technical issues and escalating problems when required. With offices in America, Australia and NZ- this market leading technology product requires a strong technical support team.<br \/> <br \/> <strong>Key responsibilities:<\/strong><br \/> <\/p><ul><li>Engaging directly and promptly with customers, installers and dealers either by telephone, electronically or face to face<\/li><li>Obtaining and evaluating all relevant information to handle inquiries and issues<\/li><li>Identifying and escalating situations requiring urgent attention with clear and concise notes<\/li><li>Managing requests and unresolved issues<\/li><li>Following up with cases to provide feedback to customers<\/li><li>Communicating and coordinating with internal stakeholders<\/li><li>Providing a professional service to customers<\/li><\/ul><p>The team operates Monday - Friday normal NZ hours. <br \/> <br \/> Salary up to $55,000 DOE.<br \/> <br \/> If this sounds like your next role please apply now.<br \/> <br \/> Please note as this is a permenant role we are only able to consider applicants who currently hold the right to work in NZ.<br \/> <\/p><p>At Randstad, we are passionate about providing equal employment opportunities and embracing diversity to the benefit of all. We actively encourage applications from any background.<\/p>\"}"
}