{
    "id":"Kaggle::techmap::6154d02f4d3b3b7ad46dbf47::linkedin_th::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":true,
    "analysis_racial":"\"Thai nationality only\" explicitly excludes non-Thai nationals.",
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Organization Overview. What Youll Do. QAD is seeking a Project Manager to join our professional service organization. You are required to be highly capable project manager to lead and supervise multi-disciplinary project teams comprising of Business Process Specialists, Functional Consultants, Software and System Engineers to implement our ERP and related solutions offering to multiple clients projects on time, on budget and to meet with clients expectation: Coordinates all aspects of a product or service offering project for a client, from inception to installation. Installations may involve acceptance of capitalized equipment or enterprise software systems, or system integration or consulting projects\/engagements. May work at client site from time to time. Typically involves extensive interaction with sales, systems engineering, product development, and other members of cross-functional teams. Project is typically focused on the delivery of new or enhanced products to improvement of customer satisfaction through the use of technology. Project management skills, rather than technical skills, are key, but a strong technical background is often required to manage competing interests. Typically oversees schedules and budgets to ensure goal attainment. What Youll Need. Thai nationality only. Bachelor Degree or Master Degree in Industrial Engineering, Business Administration, Computer Science or any related fields. Project Management experience including the scheduling and control of all resourcing requirements of medium-sized project essential. PMP certification is a plus. More than 8 years experience in consulting firm or leading ERP\/SCM venders. Minimum 4 years experience in ERP Project Implementation as Project Manager position. Strong project management practice, both the body of knowledge and hands-on experience, with proven track records in leading and managing large project implementations. Knowledge background in Automotive or Consumer Goods Industry is advantageous. Strong Leadership, High Innovation and Teamwork Spirit. Excellent in presentation and communication skills to be able to interact with internal project teams and clients project teams. Excellent in Management skills. Excellent command of English. What We Offer. Your health and well being are important to us at QAD. We provide programs that help you strike a healthy work life balance. Opportunity to join a growing business, launching into its next phase of expansion and transformation. Collaborative culture of smart and hard-working people who support one another to get the job done. An atmosphere of growth and opportunity, where idea-sharing is always prioritized over level or hierarchy. Competitive compensation packages based on experience and desired skill set.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6154d02f4d3b3b7ad46dbf47::linkedin_th\", \"source\": \"linkedin_th\", \"country\": \"TH\", \"company\": \"QAD\", \"position\": \"Project Manager\", \"notes\": \"\", \"original\": \"<strong><u>Organization Overview<\/u><\/strong><strong><u>What You\\u2019ll Do<br><br><\/u><\/strong>QAD is seeking a <strong>Project Manager<\/strong> to join our professional service organization. You are required to be highly capable project manager to lead and supervise multi-disciplinary project teams comprising of Business Process Specialists, Functional Consultants, Software and System Engineers to implement our ERP and related solutions offering to multiple client\\u2019s projects on time, on budget and to meet with clients\\u2019 expectation:<br><ul><li> Coordinates all aspects of a product or service offering project for a client, from inception to installation. <\/li><li> Installations may involve acceptance of capitalized equipment or enterprise software systems, or system integration or consulting projects\/engagements. <\/li><li> May work at client site from time to time. <\/li><li> Typically involves extensive interaction with sales, systems engineering, product development, and other members of cross-functional teams. <\/li><li> Project is typically focused on the delivery of new or enhanced products to improvement of customer satisfaction through the use of technology. <\/li><li> Project management skills, rather than technical skills, are key, but a strong technical background is often required to manage competing interests. <\/li><li> Typically oversees schedules and budgets to ensure goal attainment. <br><\/li><\/ul><strong><u>What You\\u2019ll Need<br><\/u><\/strong><ul><li> Thai nationality only <\/li><li> Bachelor Degree or Master Degree in Industrial Engineering, Business Administration, Computer Science or any related fields <\/li><li> Project Management experience including the scheduling and control of all resourcing requirements of medium-sized project essential. PMP certification is a plus <\/li><li> More than 8 years experience in consulting firm or leading ERP\/SCM venders <\/li><li> Minimum 4 years experience in ERP Project Implementation as Project Manager position <\/li><li> Strong project management practice, both the body of knowledge and hands-on experience, with proven track records in leading and managing large project implementations <\/li><li> Knowledge background in Automotive or Consumer Goods Industry is advantageous <\/li><li> Strong Leadership, High Innovation and Teamwork Spirit <\/li><li> Excellent in presentation and communication skills to be able to interact with internal project teams and clients\\u2019 project teams. <\/li><li> Excellent in Management skills <\/li><li> Excellent command of English <br><\/li><\/ul><strong><u>What We Offer<br><\/u><\/strong><ul><li> Your health and well being are important to us at QAD. We provide programs that help you strike a healthy work life balance. <\/li><li> Opportunity to join a growing business, launching into its next phase of expansion and transformation. <\/li><li> Collaborative culture of smart and hard-working people who support one another to get the job done. <\/li><li> An atmosphere of growth and opportunity, where idea-sharing is always prioritized over level or hierarchy. <\/li><li> Competitive compensation packages based on experience and desired skill set <br><\/li><\/ul><strong><u>Who We Are<br><br><\/u><\/strong>QAD, Inc. is a leading provider of adaptive, cloud-based enterprise software and services for global manufacturing companies. Global manufacturers face ever-increasing disruption caused by technology-driven innovation and changing consumer preferences. In order to survive and thrive, manufacturers must be able to innovate and change business models at unprecedented rates of speed. QAD calls these companies Adaptive Manufacturing Enterprises. QAD solutions help customers in the automotive, life sciences, packaging, consumer products, food and beverage, high tech and industrial manufacturing industries rapidly adapt to change and innovate for competitive advantage.<br><br>At QAD, we do more than sell manufacturing ERP software. We develop innovative products, foster growth and creativity, encourage collaboration and teamwork, and build strong communities across the world. The company was founded in 1979 on the foundation of helping people make their manufacturing business a success. To us, success is having happy customers, customers who love our product. And success is happy employees, who learn, grow and are connected to one another. This is what drives us. This is who we are. And we love what we do.\"}"
}