{
    "id":"Kaggle::techmap::6155bbedd198905e9e613d37::monster_us::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Description Are you a Mechanic looking for a change in pace? From major mill overhauls to conveying equipment of all kinds this position has it all. you will perform preventative maintenance, troubleshooting, repairs, perform new installations, and provide support for a multitude of other plant needs. The majority of work is completed as a part of a team. However, there are plenty of opportunities to work solo on certain projects. Each member of the team is expected to become proficient in every skill set required for our normal job duties. On the job training is provided for all duties. You will need a willingness to learn and a positive attitude is required. Responsibilities. Performs rebuilds, repairs, removal and install on the following but not limited to: gear boxes, pneumatic cylinders, air slides, valves, compressors, screw conveyers, hydraulic equipment, raw mill, finish mill, kiln, etc. Performs welding, fabrication, layout, pipe fitting and plumbing. Installation & alignment of critical equipment for reliable operation. Documentation and paperwork regarding repairs and follow up on equipment deficiencies to be entered into CMS. Employee will be required to follow all instructions of his\/her supervisor and to perform other work assignments related to plant operations as requested. The essential functions of this role include: wearing steel toe shoes. working in a non-temperature controlled environment. Skills. Electronic Maintenance. Mechanical Maintenance. Maintenance. Electrical. General Maintenance. mechanic (1 year of experience is preferred). Education No Degree Required. Qualifications. Years of experience: 5 years. Experience level:Experienced. Shift: Second. Working hours: 3 PM - 1:30 AM. Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad. EEO Employer: Race, Religion, Color, National Origin, Citizenship, Sex, Sexual Orientation, Gender Identity, Age, Disability, Ancestry, Veteran Status, Genetic Information, Service in the Uniformed Services or any other classification protected by law.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155bbedd198905e9e613d37::monster_us\", \"source\": \"monster_us\", \"country\": \"US\", \"company\": \"Randstad US\", \"position\": \"Maintenance Tech\", \"notes\": \"\", \"original\": \"<h2 class=\\\"descriptionstyles__DescriptionHeader-sc-13ve12b-1 lfBGjV\\\">Description<\/h2> <div class=\\\"descriptionstyles__DescriptionBody-sc-13ve12b-4 eCiZzS\\\"> <p>Are you a Mechanic looking for a change in pace? From major mill overhauls to conveying equipment of all kinds this position has it all. you will perform preventative maintenance, troubleshooting, repairs, perform new installations, and provide support for a multitude of other plant needs. The majority of work is completed as a part of a team. However, there are plenty of opportunities to work solo on certain projects. Each member of the team is expected to become proficient in every skill set required for our normal job duties. On the job training is provided for all duties. You will need a willingness to learn and a positive attitude is required.&nbsp;<\/p> <p>Responsibilities<\/p> <p><\/p> <p><\/p> <p>Performs rebuilds, repairs, removal and install on the following but not limited to: gear boxes, pneumatic cylinders, air slides, valves, compressors, screw conveyers, hydraulic equipment, raw mill, finish mill, kiln, etc. \\u2022 Performs welding, fabrication, layout, pipe fitting and plumbing. \\u2022 Installation &amp; alignment of critical equipment for reliable operation. \\u2022 Documentation and paperwork regarding repairs and follow up on equipment deficiencies to be entered into CMS.&nbsp; Employee will be required to follow all instructions of his\/her supervisor and to perform other work assignments related to plant operations as requested.<\/p> <p>The essential functions of this role include:<br><\/p> <ul> <li>wearing steel toe shoes<\/li> <li>working in a non-temperature controlled environment<\/li> <\/ul>Skills <br> <ul> <li>Electronic Maintenance<\/li> <li>Mechanical Maintenance<\/li> <li>Maintenance<\/li> <li>Electrical<\/li> <li>General Maintenance<\/li> <li>mechanic (1 year of experience is preferred)<\/li> <\/ul>Education <ul> <li>No Degree Required<\/li> <\/ul>Qualifications <br> <ul> <li>Years of experience: 5 years<\/li> <li>Experience level:Experienced<\/li> <\/ul> <p>Shift: Second<\/p> <p>Working hours: 3 PM - 1:30 AM<\/p>Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad. <br> <br>EEO Employer: Race, Religion, Color, National Origin, Citizenship, Sex, Sexual Orientation, Gender Identity, Age, Disability, Ancestry, Veteran Status, Genetic Information, Service in the Uniformed Services or any other classification protected by law. <br> <\/div>\"}"
}