{
    "id":"Kaggle::techmap::6142bb81a6477d0d25321154::monsterasia_hk::2",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The requirement for \"normal vision\" without mentioning reasonable accommodations can disadvantage candidates with visual impairments who might be capable of performing the job with appropriate adjustments or aids.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" An Associate's Degree with a minimum 6 years of clinical or medical sales experienceor. A Bachelor's Degree with a minimum of 4 years of clinical or medical sales experience. Nice to Have: RT and\/or MRI certification. Prior experience with Image Guided Systems. Prior experience with MRI. Operating room experience. Physical Job Requirements: While performing the duties of this job, the employee is regularly required to stand, sit, walk, talk, hear and reach with hands and arms. The employee frequently is required to use hands to finger, handle, or feel objects, tools, or controls. Specific vision abilities required by this job include normal vision. Must have a valid driver's license and active vehicle insurance policy. In addition, your driving record will be reviewed and will be considered as part of your application. The physical demands described within the Day in the Life section of this job de ion are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. DISCLAIMER: The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6142bb81a6477d0d25321154::monsterasia_hk\", \"source\": \"monsterasia_hk\", \"country\": \"HK\", \"company\": \"Medtronic Cardiac and Vascular\", \"position\": \"Clinical Consultant III, Surgical Synergy - Virginia Beach, VA\", \"notes\": \"\", \"original\": \"<br><strong>Careers that Change Lives<\/strong><br>Bring your talents to an industry leader in medical technology and healthcare solutions - we're a market leader and growing every day. You can be proud to sell medical technologies that are rooted in our long history of mission-driven innovation. Our expanding portfolio delivers measurable clinical and economic value - and opens doors. You will be empowered to shape your own career. We support your growth with the training, mentorship, and guidance you need to own your future success. Together, we can transform healthcare.<br>Join us for a career in sales that changes lives.<br><strong>Business De ion:<\/strong><br>Cranial and Spinal Technologies (CST) operating unit is redefining cranial and spinal procedures to reduce variability and improve outcomes with the goal of restoring long-term quality of life for more patients. We are the first company to offer an integrated solution that includes artificial intelligence-driven surgical planning, personalized spinal implants, and robotic-assisted surgical delivery to make patient care more customized.<br>CST is the market leader in spinal implants, robotics, and navigation. Our integrated operating unit is comprised 3 global businesses, Spine and Biologics, Enabling Technologies and China Cranial, Spinal Orthopedic Technologies.<br>This role will support our Enabling Technologiesplatforms, delivering an innovative portfolio that includes , , , customized implants, and pre-operative planning aided by artificial intelligence.<br><strong>A Day in the Life<\/strong><br>At Medtronic, the Clinical Consultant II, Surgical Synergy provides clinical, technical and product knowledge support to existing and potential customers. Builds and maintains solid customer relationships and provides customer training at all levels. Is responsible for key customer reports as required to support Medtronic NeuroSurgery\/Navigation\/Robotic Assisted Surgery products and services. Must perform all duties within the Quality System and BCS requirements.<br>This is a <b>field based<\/b> role.<br><strong>*Overnight Travel in this role is expected, 50%. <\/strong><br>Responsibilities may include the following and other duties may be assigned:<br><b><u>Technical Support<\/u><\/b><br>. Coordinate, support, and collaborate with NRCs and other Surgicial Synergy team members for on-site installations with our customers<br>. Represents Medtronic during technology-enabled procedures to provide technical assistance.<br>. Maintain system hardware and software to maximize system performance.<br>. Installs software and hardware upgrades.<br>. Performs system preventative maintenance.<br>. Provides telephone clinical support to customers.<br>. Uses UNIX\/LINUX commands to modify operating files.<br>. Fulfills Software and Service Contract obligations.<br><b><u>Customer Support<\/u><\/b><br>. Acts as the primary Medtronic customer liaison for repair and technical support issues.<br>. Provides timely information to the district team regarding customer concerns, issues and market opportunities.<br>. Provide service to customers per their individual needs.<br>. Maintains familiarity with status of calls and issues at customer sites.<br>. Reports necessary complaints and partners with CSM\/NRC to ensure full resolution<br>. Files weekly site visit and customer contact reports for service improvement purposes<br><strong><u>Educational Support<\/u><\/strong><br>. Educates and trains physicians and hospital personnel - OR, Radiology, Central Sterile Processing, Biomedical and Information Technologies - on<br>technical matters relating to our technology-enabled procedures.<br>. Provides a clinical resource for surgeons, clinicians and others being trained.<br>. Updates customers on tips, shortcuts and suggestions, as appropriate.<br>. Participates in in-house sponsored customer training at designated sites for both internal and external partners<br>. Provides training and resources for hospital staff to enable them to conduct training for their personnel (train the trainer).<br>. Continually train members of the Surgical Synergy Clinical Support team to increase their knowledge of the latest technology-enabled procedures.<br><strong><u>Sales Support<\/u><\/strong><br>. Work and collaborate with NRCs, Spinal Sales, and NS Reps to identify prospective new users for both Navigation and Robotics for applicable<br>technology-enabled procedures<br>. Attend and participate in sales meetings, training programs, conventions, and trade shows as directed.<br>. Submit reports and provide information as directed.<br>. Cooperate with all personnel on the execution of Company programs.<br>. Supports more complex, new image-guided products and applications to physicians and hospital staff.<br>. Works as a team member with the Surgical Synergy Region Manager and CSM to prioritize customer technical support and service expectation goals.<br>. Provide input on new product development based on in-field experience.<br>. Responsible for documentation at new or existing installations<br><strong><u>Miscellaneous<\/u><\/strong><br>. Adhere to company policies and conduct all business in an ethical manner<br>We seek out and hire a diverse workforce at every level: We need fresh ideas and inclusive insights to continue to be an innovative industry leader -that's why we make it a point to seek out, attract and develop employees who are patient-centric, passionate, and who represent the same wide variety of life experiences as our patients.<br>To learn more about Inclusion & Diversity at Medtronic<br><strong>Must Have: Minimum Requirements<\/strong><br>To be considered for this role, please ensure the minimum requirements are evident on your resume.<br>. A High School Diploma or GED with a minimum 8 years of clinical or medical sales experience or<br>. An Associate's Degree with a minimum 6 years of clinical or medical sales experienceor<br>. A Bachelor's Degree with a minimum of 4 years of clinical or medical sales experience.<br><strong>Nice to Have: <\/strong><br>. RT and\/or MRI certification<br>. Prior experience with Image Guided Systems<br>. Prior experience with MRI<br>. Operating room experience<br><strong>Physical Job Requirements:<\/strong><br>While performing the duties of this job, the employee is regularly required to stand, sit, walk, talk, hear and reach with hands and arms. The employee frequently is required to use hands to finger, handle, or feel objects, tools, or controls. Specific vision abilities required by this job include normal vision.<br>**Must have a valid driver's license and active vehicle insurance policy. In addition, your driving record will be reviewed and will be considered as part of your application.<br>The physical demands described within the Day in the Life section of this job de ion are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><strong>DISCLAIMER:<\/strong><br>The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position.\"}"
}