{
    "id":"Kaggle::techmap::6155a8c338cdb97c28e0e126::seek_nz::10",
    "label_age":true,
    "analysis_age":"The constant mentioning of needing a recent graduate may inadvertently discriminate against more experienced individuals who might be interested in applying but feel excluded due to the emphasis on recent graduates. ",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement for candidates to be \"graduate members of the NZ Institute of Landscape Architects\" could potentially exclude qualified international candidates who may not have membership but are otherwise eligible.",
    "verified":true,
    "synthetic":false,
    "text":"We have two exciting opportunities for enthusiastic and motivated graduates to join our team of passionate designers in Tāmaki Makaurau\/Auckland. We are looking for a graduate to work in all stages of the design process, as well as a graduate who is wanting to specialise in the Te Ao Māori\/cultural design space. As a Landscape Architect you’ll work within our multi-disciplinary team to deliver a wide range of industry leading, transformational projects throughout New Zealand. We will help you grow in confidence. Refine the skills you need and build your networks to help you accelerate your personal and professional development. From the outset, you’ll be actively contributing ideas to projects that help shape our communities and adding to our unique and fun Auckland Team culture. The successful candidates will be recent graduates or have up to two years’ professional experience, along with the following skills and attributes: A Bachelor’s Degree (Hons) or Master’s Degree in Landscape Architecture. Excellent graphic skills with experience in the use of a range of digital tools and techniques, including Adobe Creative Cloud, AutoCAD and Sketch. Up, as well as hand drawing. An eye for detail and an ability to think both spatially and laterally. A passion for design and forging stronger connection between people and environments. Experience in the use of AutoCAD, Sketch. Up, Adobe Creative-Suite, and draughting and detailing to develop documentation of landscape projects. Experience and good understanding of how to take a design from concept through to construction documentation. Strong problem-solving skills and an ability to work collaboratively. Pro-active approach to workload management with the ability to meet deadlines. An enquiring mind, be hungry to learn and willing to put in the hard yards when things get busy. Clear and well-articulated written and pro-active communication skills. Are a graduate member of the NZ Institute of Landscape Architects and have an interest in achieving NZILA registration. Boffa Miskell is a leading New Zealand professional services consultancy, which is focused on better outcomes for our environment. We are entirely employee-owned and growing, with an increasingly diverse portfolio of clients and projects. We offer a supportive and collaborative environment, and our mahi kōkēi initiative enables our team to have greater flexibility around working remotely. We value having an inclusive and diverse workplace and offer ongoing opportunities for professional and personal development to ensure our people can excel and grow.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155a8c338cdb97c28e0e126::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Boffa Miskell\", \"position\": \"Graduate Landscape Architect\", \"notes\": \"\", \"original\": \"<p>We have <strong>two\\u00a0<\/strong>exciting opportunities for enthusiastic and motivated graduates to join our team of passionate designers\\u00a0in T\\u0101maki Makaurau\/Auckland. We are looking for a graduate to work in all stages of the design process, as well as a graduate who is wanting to specialise in the Te Ao M\\u0101ori\/cultural design space.\\u00a0<\/p><p>As a Landscape Architect you\\u2019ll work within our multi-disciplinary team to deliver a wide range of industry leading, transformational projects throughout New Zealand. We will help you grow in confidence; refine the skills you need and build your networks to help you accelerate your personal and professional development. From the outset, you\\u2019ll be actively contributing ideas to projects that help shape our communities and adding to our unique and fun Auckland Team culture.<\/p><p>The successful candidates will be recent graduates or have up to two years\\u2019 professional experience, along with the following skills and attributes:\\u00a0<\/p><ul><li>A Bachelor\\u2019s Degree (Hons) or Master\\u2019s Degree in Landscape Architecture.<\/li><li>Excellent graphic skills with experience in the use of a range of digital tools and techniques, including Adobe Creative Cloud, AutoCAD and SketchUp, as well as hand drawing.\\u00a0<\/li><li>An eye for detail and an ability to think both spatially and laterally.\\u00a0<\/li><li>A passion for design and forging stronger connection between people and environments.\\u00a0<\/li><li>Experience in the use of AutoCAD, SketchUp, Adobe Creative-Suite, and draughting and detailing to develop documentation of landscape projects. Some knowledge of CAD would also be desirable, but is not essential.\\u00a0<\/li><li>Experience and good understanding of how to take a design from concept through to construction documentation.<\/li><li>Strong problem-solving skills and an ability to work collaboratively.\\u00a0<\/li><li>Pro-active approach to workload management with the ability to meet deadlines.\\u00a0<\/li><li>An enquiring mind, be hungry to learn and willing to put in the hard yards when things get busy.\\u00a0<\/li><li>Clear and well-articulated written and pro-active communication skills.\\u00a0<\/li><li>Are a graduate member of the NZ Institute of Landscape Architects and have an interest in achieving NZILA registration.<\/li><\/ul><p>Boffa Miskell is a leading New Zealand professional services consultancy, which is focused on better outcomes for our environment. We are entirely employee-owned and growing, with an increasingly diverse portfolio of clients and projects. We offer a supportive and collaborative environment, and our mahi k\\u014dk\\u0113i initiative enables our team to have greater flexibility around working remotely. We value having an inclusive and diverse workplace and offer ongoing opportunities for professional and personal development to ensure our people can excel and grow.<\/p><p>Check out some of the projects and activities we\\u2019re involved in by visiting our website or LinkedIn page.\\u00a0<\/p><p>If this sounds like your next career move, we\\u2019re looking forward to hearing from you.<\/p><p><strong>How to Apply\\u00a0<\/strong><\/p><p>Please send your CV, portfolio and cover letter to: joinus@boffamiskell.co.nz before <strong>Monday, 18 October 2021.\\u00a0<\/strong><\/p><p>Please note, we will only accept applications sent to this email address.\\u00a0We like to consider applications as they are received, so encourage you to get in touch with us as soon as possible.\\u00a0<\/p><p>If you have any questions about this role, please contact Katherine on 03 364 4778.\\u00a0<\/p>\"}"
}