{
    "id":"Kaggle::techmap::613fd6a37bee830aadbcfc75::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Athletics Coaches. For the 2021\/2022 season. Nga Tawa Diocesan School is a high-performing secondary school with a reputation for excellence. We aim to provide the best quality coaches to ensure our girls are given every opportunity to excel in their chosen sports. We are currently recruiting for Athletics coaches across three disciplines. sprinting, jumping and throwing. Athletics is a high participatory sport of choice at Nga Tawa. Successful coaches will work with our Director of Sport to help students reach their potential at a local and regional level, as well as help to maintain high levels of participation in the sport. From October to April coaches are required to attend weekly afterschool trainings and attend events on allocated weeknights. The time commitment will amount to approximately six hours per week. Payment will be per hour and will be dependent on coaching experience and qualifications. Nga Tawa will provide generous support, resources and very competitive terms and conditions to encourage coaches to reach their highest professional standards. Coaches will enjoy the use of excellent facilities and become involved in the Nga Tawa culture. If you would relish the opportunity to further Nga Tawas sporting success, then please apply by sending a covering letter, a copy of your C. V and a completed application form to our Director of Sport, Claire Horner, at ngatawa. school. An application form is available on our website, www. ngatawa. school. nz\/vacancies [link removed]. Applications for these positions close on Sunday 19 September 2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::613fd6a37bee830aadbcfc75::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Nga Tawa Diocesan School\", \"position\": \"Athletics Coaches\", \"notes\": \"\", \"original\": \"<p><strong>Athletics Coaches<\/strong><\/p><p>For the 2021\/2022 season<\/p><p>Nga Tawa Diocesan School is a high-performing secondary school with a reputation for excellence. We aim to provide the best quality coaches to ensure our girls are given every opportunity to excel in their chosen sports.<\/p><p>We are currently recruiting for Athletics coaches across three disciplines - sprinting, jumping and throwing.<\/p><p>Athletics is a high participatory sport of choice at Nga Tawa. Successful coaches will work with our Director of Sport to help students reach their potential at a local and regional level, as well as help to maintain high levels of participation in the sport.<\/p><p>From October to April coaches are required to attend weekly afterschool trainings and attend events on allocated weeknights. The time commitment will amount to approximately six hours per week. Payment will be per hour and will be dependent on coaching experience and qualifications.<\/p><p>Nga Tawa will provide generous support, resources and very competitive terms and conditions to encourage coaches to reach their highest professional standards.\\u00a0Coaches will enjoy the use of excellent facilities and become involved in the Nga Tawa culture.\\u00a0<\/p><p>If you would relish the opportunity to further Nga Tawa\\u2019s sporting success, then please apply by sending a covering letter, a copy of your C.V and a completed application form to our Director of Sport, Claire Horner, at employment@ngatawa.school.nz. An application form is available on \\u00a0our website,\\u00a0www.ngatawa.school.nz\/vacancies [link removed].<\/p><p>Applications for these positions close on Sunday 19 September 2021.<\/p>\"}"
}