{
    "id":"Kaggle::techmap::61403fd4a393863406877a3a::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" About the opportunity: This is a great time to join Girl. Guiding New Zealand and support us to be successful in our strategic, national and operational goals in relation to our membership growth and retention. The main responsibilities of this role are to assist with the recruitment of volunteers and recruit girls to participate in Guiding in the Upper North Area. By closely monitoring membership numbers, trends, waitlists, and any changes you will ensure a proactive targeted approach contributing to growth. We want more good people to come and do great things with us. Join our passionate and supportive team in a well-established, long-standing organisation with growth potential. We love what we do which is why we work so hard to ensure that we provide great programmes for our girls and wrap. around support for our leaders. Reporting to the Area Manager you will work with an enthusiastic staff and volunteer team who are fully focused on these same operational goals. This position is part-time (30 hours per week) and based at our Mount Eden office in Auckland (with possible flexible working arrangement options for the right candidate). About you: If yes is your answer to the following, we would love to hear from you! some experience in recruitment administration. the ability to support recruitment initiatives and practices. excellent communication skills and the ability to engage people effectively. attention to detail. proven experience using your initiative and problem-solving skills. proficient in the use of MS Office. the availability to work some flexible hours from time to time. Preferably, the successful applicant will also have an understanding of not-for-profit organisations. What we offer: In return for your skills, we offer an opportunity to grow your talents and experience within a friendly, supportive environment. About Girl. Guiding NZ: Supporting girls and young women to reach their potential is at the heart of the Girl. Guiding NZ philosophy. At any time, there are over 7, 000 Kiwi girls enjoying the opportunities that Guiding offers to push their boundaries, challenge themselves, and build their confidence within a supportive, safe network. How to apply: For further details about us, visit our website at httpsgirlguidingnz. org. nz\/. Apply online by viewing the position description and then clicking the 'Apply Now' button. Applications close on Tuesday 28 September 2021 5pm NZT.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61403fd4a393863406877a3a::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"GirlGuiding New Zealand\", \"position\": \"Recruitment Co-ordinator\", \"notes\": \"\", \"original\": \"<p><strong>About the opportunity:<\/strong><\/p><p>This is a great time to join GirlGuiding New Zealand and support us to be successful in our strategic, national and operational goals in relation to our membership growth and retention.\\u00a0The main responsibilities of this role are to assist with the recruitment of volunteers and recruit girls to participate in Guiding in the Upper North Area. By\\u00a0closely monitoring membership numbers, trends, waitlists, and any changes you will ensure a proactive targeted approach contributing to growth.\\u00a0<\/p><p>We want more good people to come and do great things with us. Join our passionate and supportive team in a well-established, long-standing organisation with growth potential. We love what we do which is why we work so hard to ensure that we provide great programmes for our girls and wrap- around support for our leaders.\\u00a0<\/p><p>Reporting to the Area Manager you will work with an enthusiastic staff and volunteer team who are fully focused on these same operational goals. \\u00a0<\/p><p>This\\u00a0position is\\u00a0part-time (30 hours per week)\\u00a0and\\u00a0based at our Mount Eden office in Auckland (with possible flexible working arrangement options for the right candidate).\\u00a0<\/p><p><strong>About you:<\/strong><\/p><p>If \\u2018yes\\u2019 is your answer to the following, we would love to hear from you!<\/p><ul><li>some experience in recruitment administration<\/li><li>the ability to support recruitment initiatives and practices<\/li><li>excellent communication skills and the ability to engage people effectively<\/li><li>attention to detail<\/li><li>proven experience using your initiative and problem-solving skills<\/li><li>proficient in the use of MS Office<\/li><li>the availability to work some flexible hours from time to time<\/li><\/ul><p>Preferably, the successful applicant will also have an understanding of not-for-profit organisations.<\/p><p><strong>What we offer:<\/strong><\/p><p>In return for your skills, we offer an opportunity to grow your talents and experience within a friendly, supportive environment.\\u00a0<\/p><p><strong>About GirlGuiding NZ:<\/strong><\/p><p>Supporting girls and young women to reach their potential is at the heart of the GirlGuiding NZ philosophy. At any time, there are over 7,000 Kiwi girls enjoying the opportunities that Guiding offers to push their boundaries, challenge themselves, and build their confidence within a supportive, safe network.<\/p><p><strong>How to apply:<\/strong><\/p><p>For further details about us, visit our website at https:\/\/girlguidingnz.org.nz\/\\u00a0<\/p><p>Apply online by viewing the position description and then clicking the 'Apply Now' button.<\/p><p><strong>Applications close on Tuesday 28 September 2021 5pm NZT<\/strong><\/p><p><em>Please Note: We encourage early application for this role as we will be reviewing and shortlisting applications as they are received.<\/em><\/p><p><em>GirlGuiding New Zealand is committed to a diverse workforce that represents the communities we serve, and to creating an inclusive workplace culture. We offer a range of flexible working options depending on the needs of the role and its work context.<\/em><\/p><p><em>Under the provisions of the Privacy Act 2020, you have the right to request access to and the correction of information held by us concerning you.\\u00a0 We will retain all information for future vacancies (permanent or contract).\\u00a0 Should you wish GirlGuiding New Zealand to delete this information from our database we require written notice from you subject to any legal obligations that require us to retain such information.<\/em><\/p>\"}"
}