{
    "id":"Kaggle::techmap::6148a02664fc986123d79fab::linkedin_ng::1",
    "label_age":true,
    "analysis_age":"The requirement for \"10 years experience\" and \"5 years experience in a supervisory or managerial role\" can introduce age bias by favouring older candidates who are more likely to have accumulated this level of experience, potentially disadvantaging younger but equally capable candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 10 years experience in marketing and\/or advertising. 5 years experience in a supervisory or managerial role. Strong leadership and project development skills. Excellent communication skills. Familiarity with strategic marketing campaigns. An interest or understanding of global changing broadcast marketing dynamics. All qualified applicants will receive consideration for employment irrespective of race. Religion. Nationality. Sex. Age. Disability. Sexual orientation. Gender identity or expression. Group8 Limited is an equal opportunity employer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148a02664fc986123d79fab::linkedin_ng\", \"source\": \"linkedin_ng\", \"country\": \"NG\", \"company\": \"Group8 Africa\", \"position\": \"Chief Marketing Officer\", \"notes\": \"\", \"original\": \"ROLE: CHIEF MARKETING OFFICER <br>JOB DESCRPITION<br>As a CMO, you will work as part of a team of marketing managers and executives, helping in the creation and expansion of sales from strategy to execution. <br>You will report directly to the CEO<br>Professional skills and responsibilities for this management level include but are not limited to the following:<br>\\u2022 Creating a clear marketing strategy that encompasses all marketing segments.<br>\\u2022 Developing the company\\u2019s mid to long term strategic and annual business plans. <br>\\u2022 Streamlining marketing process to realize cost savings across the department.<br>\\u2022 Analyzing current marketing strategies and implementing changes.<br>\\u2022 Measuring the success of marketing and creative campaigns across the business.<br>\\u2022 Selection of marketing agency partners and reviewing their activities.<br>\\u2022 Overseeing all marketing activities across the full marketing mix.<br>\\u2022 Maximising opportunities for online revenue generation through multiple channels.<br>\\u2022 Assessing new marketing opportunities for generating business.<br>\\u2022 Keeping up to date with industry and technological changes that impact the business.<br>\\u2022 Setting KPI\\u2019s for marketing activities across the business.<br>\\u2022 Overhauling the marketing department organisational structure.<br>\\u2022 Working closely with other members of the board on company plans. <br>\\u2022 Set and achieve strategic goals related to social media metrics, television advertising and marketing campaign initiatives<br>\\u2022 Design and improve upon marketing campaigns for each aspect of our company<br>\\u2022 Negotiate compensation and project details for outside contractors related to marketing and promotions<br>\\u2022 Create and propagate an enthusiastic brand message that<br>\\u2022 will resonate with our target demographic<br>\\u2022 Follow up with franchisees on daily revenue reports, social media strategies and other components of the marketing program<br>\\u2022 Listen\\u201d to the trends of the market and direct the market research efforts of the company<br>\\u2022 Liaise with other departments to guide a unified approach to customer service, distribution etc. that meets market demands.<br>\\u2022 Develop a feasible marketing plan for the department and oversee its day-to-day implementation<br>\\u2022 Plan and organize marketing functions and operations (product development, branding, communications etc.), and ensure they project the company\\u2019s unique \\u201cvoice\\u201d<br>\\u2022 Design and coordinate promotional campaigns, PR and other marketing efforts across channels (digital, press etc.)<br>\\u2022 Build a highly efficient team of marketing professionals<br>\\u2022 Create a solid network of strategic partnerships<br><br><br><br>QUALIFICATION\/SKILLS REQUIREMENT<br><br>\\u2022 Minimum of Bachelors degree in any related field<br>\\u2022 MBA\/Msc. Preferred <br>\\u2022 Advanced analytical and problem-solving skills.<br>\\u2022 Experience at operating at Board level within similar organisations.<br>\\u2022 Highly strategic outlook and marketing ability.<br>\\u2022 Well connected at a senior level within the industry.<br>\\u2022 10+ years\\u2019 experience in marketing and\/or advertising<br>\\u2022 5+ years\\u2019 experience in a supervisory or managerial role<br>\\u2022 Strong leadership and project development skills<br>\\u2022 Excellent communication skills<br>\\u2022 Familiarity with strategic marketing campaigns<br>.An interest or understanding of global changing broadcast marketing dynamics.<br><br><br>All qualified applicants will receive consideration for employment irrespective of race; religion; nationality; sex; age; disability; sexual orientation; gender identity or expression. <br><br>Group8 Limited is an equal opportunity employer.\"}"
}