{
    "id":"Kaggle::techmap::61428c763f4067230bc066c1::seek_nz::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Are you looking for a job that allows you to give back to the community, and the environment? This position could be the role for you! Youll be the key contact for dropping of recycling and greenwaste to the Awapuni Resource Recovery Centre. In this role, youll be helping many members of the community, so you need to be great at communicating with a wide range of people. Your enthusiasm to participate fully in training provided by Council will help you to grow and develop in your role. Youll also need to be self-motivated and honest, as youll have sole charge of the station at times. Organisation and attention to detail are crucial, as duties include recording weights and taking bookings. You will be a team player, working constructively with others and be flexible to work outside of normal hours when required. A current full drivers licence, computer skills and EFTPOS knowledge are desirable. This role is 13.5 hours per week. Saturdays, 7.15am - 4.45pm, and Sundays 11.45am - 4.15pm. If this sounds like you, then apply today! Applications close: 11.00 pm, Thursday 30 September 2021. We are an Equal Employment Opportunity Employer and welcome applications from all those suitably qualified for this position. Job Profile Please click here to download and view this additional information.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61428c763f4067230bc066c1::seek_nz\", \"source\": \"seek_nz\", \"country\": \"NZ\", \"company\": \"Palmerston North City Council\", \"position\": \"Weighbridge Operator\", \"notes\": \"\", \"original\": \"<p>Are you looking for a job that allows you to give back to the community, and the environment? This position could be\\u00a0the role for you!<\/p> <p>You\\u2019ll be the key contact for dropping of recycling and greenwaste to the Awapuni Resource Recovery Centre.\\u00a0 In this role, you\\u2019ll be helping many members of the community, so you need to be great at communicating with a wide range of people. \\u00a0Your enthusiasm to participate fully in training provided by Council will help you to grow and develop in your role. You\\u2019ll also need to be self-motivated and honest, as you\\u2019ll have sole charge of the station at times.\\u00a0 Organisation and attention to detail are crucial, as duties include recording weights and taking bookings.<\/p> <p>You will be a team player, working constructively with others and be flexible to work outside of normal hours when required. A current full driver\\u2019s licence, computer skills and EFTPOS knowledge are desirable.<\/p> <p>This role is 13.5 hours per week; Saturdays, 7.15am - 4.45pm, and Sundays 11.45am - 4.15pm.<\/p> <p>If this sounds like you, then apply today!<\/p> <p><strong>Applications close: 11.00 pm,\\u00a0Thursday 30 September 2021<\/strong><\/p> <p>We are an Equal Employment Opportunity Employer and welcome applications from all those suitably qualified for this position.\\u00a0<\/p> <div><strong>Job Profile<\/strong><\/div> <div>Please click <a href=\\\"https:\/\/applynow.net.au\/jobs\/PNCC780\/assets\/16424632\\\" target=\\\"_blank\\\">here<\/a>\\u00a0to download and view this additional information.<\/div>\"}"
}