{
    "id":"Kaggle::techmap::614dff0bed8bd241501ebd5c::monster2_nl::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" As soon as our guests stay at the park and use our facilities, they want to experience that nice and clean feeling. This is your challenge! Jouw functie in het kort. Cleaner, cleaning lady or gentleman, housekeeping, housekeeper? It's all the same! Do you want to make sure that our guests get a great first impression together with a cozy club of ladies and gentlemen? Then apply immediately! Wat ga je doen? As a cleaner you are familiar with working hard and you will enjoy this challenge at our very first holiday park at Zeeland. At the beginning of your workday you take your trolley, which is full of cleaning products, and you start with the toilet blocks. After a few hours of cleaning, your workday is already done! Your task list is completed and before youre going home with a satisfied feeling, youre going to enjoy a cup of coffee with your manager Elles. Wat vragen wij van jou? You work approximately 32 hours, divided over 4 or 5 days. You know how to work fast, accurate and efficient under pressure. You know how to clean, but you don't have to be a professional! Wat krijg je daarvoor terug? An hourly wage of €11, 15 gross. Travel allowance as of 10 km Diversity of nice colleagues to work with25 vacation days and 8% vacation allowance. Personnel card with nice benefits (discounts and\/or free use of facilities such as swimming pool, bowling and wellness)Roompot Spirit. Roompot is a typical Dutch company. Down-to-earth and ambitious. At our parks, there is an amicable, pleasant working atmosphere. Our goal is to let our guests enjoy their vacation without worries. Hospitality and commitment to our guests and colleagues are the number one priority. Enjoy together! Are you the new colleague we are looking for?",
    "metadata":"{\"document_id\": \"Kaggle::techmap::614dff0bed8bd241501ebd5c::monster2_nl\", \"source\": \"monster2_nl\", \"country\": \"NL\", \"company\": \"Roompot\", \"position\": \"Housekeeping\", \"notes\": \"\", \"original\": \"As soon as our guests stay at the park and use our facilities, they want to experience that nice and clean feeling. This is your challenge!Jouw functie in het kortCleaner, cleaning lady or gentleman, housekeeping, housekeeper? It's all the same! Do you want to make sure that our guests get a great first impression&nbsp;together with a cozy club of ladies and gentlemen? Then apply immediately!Wat ga je doen?As a cleaner you are familiar with working hard&nbsp;and you will enjoy this challenge at our very first holiday park at Zeeland. At the beginning of your workday you take your trolley, which is full of cleaning products, and you start with the toilet blocks.&nbsp;After a few hours of cleaning, your workday is already done!&nbsp;Your task list is completed and before you\\u2019re going home with a satisfied feeling, you\\u2019re going to enjoy a cup of coffee with your manager Elles.Wat vragen wij van jou?You work approximately 32 hours, divided over 4 or 5 daysYou know how to work fast, accurate and efficient under pressureYou know how to clean, but you don't have&nbsp;to be a professional!Wat krijg je daarvoor terug?An hourly wage of \\u20ac11,15 grossTravel allowance as of&nbsp;10 km&nbsp;Diversity of nice colleagues to work with25 vacation days&nbsp;and 8% vacation allowancePersonnel card with nice benefits (discounts and\/or free use of facilities such as swimming pool, bowling and wellness)Roompot SpiritRoompot is a typical Dutch company; down-to-earth and ambitious. At our parks, there is an amicable, pleasant working atmosphere. Our goal is to let our guests enjoy their vacation without worries. Hospitality and commitment to our guests and colleagues are the number one priority; enjoy together!Are you the new colleague we are looking for?\"}"
}