{
    "id":"Kaggle::techmap::6134e48a645e721abe2ade38::monsterasia_ph::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":"The requirement to stand and sit for sustained periods of time is a job necessity and does not inherently introduce bias, as long as reasonable accommodations are offered for candidates with disabilities.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 1-5 years extensive experience in the support of Cisco Networking Technologies. Strong technical, analytical, and interpersonal skills required. Current CCNA certification. Practical Technical knowledge on CISCO Networking Technologies. ITIL Ver. 3.0 or Ver. 4.0 preferred. Ability to communicate in an understandable, polite and friendly manner, both written and verbal to both technical and non-technical audiences. Strong organizational skills and ability to multitask in a fast-past working environment. High level technology problem solving skills. Standing and sitting for sustained periods of time, at least 25%. Ability to travel up to 25% of the time. About Us. We are a collective of highly capable humans, who understand how to deploy technology and data to best serve your purpose. From Digital CX to Content Security, A. I Operations, Consulting, and anything in between, we consider ourselves responsible for protecting our partners interests and supporting their long term success through innovation and technology -powered by ridiculously smart people. Task. Us partners with the worlds most innovative and disruptive brands to protect what matters most and to thrive in an ever-changing world. Task. Us currently has over 23, 000 employees around the world with offices across the United States, the Philippines, India, Taiwan, Mexico, Greece, and Ireland. Task. Us is an equal opportunity employer.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6134e48a645e721abe2ade38::monsterasia_ph\", \"source\": \"monsterasia_ph\", \"country\": \"PH\", \"company\": \"TaskUs\", \"position\": \"Network Operations Engineer\", \"notes\": \"\", \"original\": \"<br>Description<br>Want to be part of a company that is changing the game for some of the worlds most notable brands and disruptive companies? At TaskUs we look for individuals who are constantly striving for excellence in both their personal and professional lives. Our rapid growth demands high performance, and we're proud to say that we have a talented and motivated team along for the ride. If youre looking for a new challenge or just want to be a part of something historic, join us. Lets change the way the world works!<br>The Network Operations Engineers role is to provide operational support for the global TaskUs Network environment. The Network Operations Engineer will provide proactive and reactive support for all network hardware, software, and communication links. The position of Network Operations Engineer reports to the Senior Manager of Network Operations.<br><b>PRIMARY DUTIES AND RESPONSIBILITIES<\/b><br>The Network Operations Engineers primary job function is to ensure the operation and performance of the Global Network environment. This is achieved through the monitoring of network management systems for trends and alerts, responding to ticket requests and incident notifications, and resolving issues within Service Level Agreements.<br>In addition, the position is responsible for the following operational activities:<ul><li>Provide Tier II escalation support for the Network Operations Center, providing resolution for complex networking issues<\/li><li>Complete Preventative Maintenance activities, such as code updates & equipment updates<\/li><li>Incident Management, Problem Management, Change Management & Capacity Management<\/li><li>Manage assigned projects and program components to deliver services in accordance with established objectives.<\/li><li>Respond to inquiries from staff, administrators, service providers, site personnel and outside vendors and etc. to provide technical assistance and support<\/li><li>Security & Audit compliance<\/li><li>Operational-related Moves, Adds, Changes, and Deletes (MACD)<\/li><li>Adherence to Operational Standards<\/li><li>Compliance with Engineering Design Standards and established operational processes<\/li><li>Participate in the Development & Maintenance of operational documentation, to include updating Engineering documentation changes due to operational changes, escalation procedures & vendor contracts.<\/li><li>Provide Root Cause Analysis for Network Events<\/li><li>Other duties as assigned by management<\/li><\/ul><br>Technical Skills<br>The Network Support Engineer is required to have a basic understanding of the following technologies:<ul><li>Networking Technologies: DNS, DHCP, VPN, Network Security, IP Routing Protocols<\/li><li>Cisco Networking Technologies: Routing & Switching, routing protocols (BGP, OSPF)<\/li><li>Cisco Wireless<\/li><li>Meraki Wireless<\/li><li>Palo Alto Firewalls<\/li><\/ul><br>Job Qualifications<ul><li>Bachelors degree in Computer Science, Information Technology, or related field.<\/li><li>1-5 years extensive experience in the support of Cisco Networking Technologies<\/li><li>Strong technical, analytical, and interpersonal skills required<\/li><li>Current CCNA certification<\/li><li>Practical Technical knowledge on CISCO Networking Technologies<\/li><li>ITIL Ver. 3.0 or Ver. 4.0 preferred<\/li><li>Ability to communicate in an understandable, polite and friendly manner, both written and verbal to both technical and non-technical audiences<\/li><li>Strong organizational skills and ability to multitask in a fast-past working environment<\/li><li>High level technology problem solving skills<\/li><li>Standing and sitting for sustained periods of time, at least 25%<\/li><li>Ability to travel up to 25% of the time<\/li><\/ul><br><b>About Us<\/b><br>We are a collective of highly capable humans, who understand how to deploy technology and data to best serve your purpose. From Digital CX to Content Security, AI Operations, Consulting, and anything in between, we consider ourselves responsible for protecting our partners interests and supporting their long term success through innovation and technology -powered by ridiculously smart people.<br>TaskUs partners with the worlds most innovative and disruptive brands to protect what matters most and to thrive in an ever-changing world.<br>TaskUs currently has over 23,000 employees around the world with offices across the United States, the Philippines, India, Taiwan, Mexico, Greece, and Ireland.<br>TaskUs is an equal opportunity employer.\"}"
}