{
    "id":"Kaggle::techmap::615789aa26618f5c9839535b::linkedin_gy::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The requirement for the candidate to \"own or have access to a reliable motor vehicle\" might disadvantage individuals from lower socio-economic backgrounds who cannot afford a vehicle.",
    "verified":true,
    "synthetic":false,
    "text":" Supreme Ventures Enterprise Incorporated is seeking to identify a suitable candidate to fill the role of Business Development Officer. The ideal candidate possesses at least two (2) years in Sales\/Account Management, has a winning attitude and is an excellent team player. If you believe you have what is required to be a part of TeamSupreme submit an application by the latest October 6, 2021. You must reside and be able to legally work in Guyana. Must own or have access to a reliable motor vehicle. KEY FUNCTIONS: Identify\/Recruit suitable Retailers. Maximize the revenue potential of SVEI Retailers assigned to you or within an assigned region. Foster a supportive relationship with SVEI Retailers encouraging adherence to the companys. minimum standards at the locations, maintaining the companys strong image. Responsible for monitoring activities daily for assigned retailers \/ region and make recommendations. for improvement to Manager. Monitor sales trends and payment history for Retailers. Track competitor marketing, sales and promotional activity by keeping abreast of market changes and the marketing mix used by our competitors. Responsible for ensuring that customer queries\/issues received are processed within the quality standards set by SVG. Provide support to the Finance Department though calls and\/or visits to suppressed or challenging Retailers. Assist with on the ground training of Retailers\/Operators when necessary. Prepare monthly reports with information acquired from field. Information should include but is not limited to updates, highlights, challenges, new trends etc. Scheduled visits to Retailers as planned by Manager. Keep promotional material ready by tracking marketing \/ promotional items inventory stock. Assist with execution and management of marketing \/ promotional activities. KNOWLEDGE, EXPERIENCE & SKILLS REQUIRED: Bachelors Degree in Business Administration \/ Marketing or related field. Minimum of 2 years of experience in Business Development, Sales, Customer Service or Marketing. Knowledge of and experience in the gaming\/lottery industry are an asset. Handles confidential matters with discretion and judgement. Excellent oral and written communication skills. Great organizational and coordinating skills. Excellent communication and interpersonal skills. Highly self-motivated and able to multitask efficiently. Ability to work independently. Takes initiative. Problem solving abilities. SPECIAL CONSIDERATIONS:. Required to work outside of normal business hours, weekend and public holidays at times. The role requires extensive travelling to regions assigned. Required to own and operate a reliable motor vehicle.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::615789aa26618f5c9839535b::linkedin_gy\", \"source\": \"linkedin_gy\", \"country\": \"GY\", \"company\": \"Supreme Ventures Ltd.\", \"position\": \"Business Development Officer (Guyana)\", \"notes\": \"\", \"original\": \"<p>Supreme Ventures Enterprise Incorporated is seeking to identify a suitable candidate to fill the role of Business Development Officer. The ideal candidate possesses at least two (2) years\\u2019 in Sales\/Account Management, has a winning attitude and is an excellent team player. If you believe you have what is required to be a part of #TeamSupreme submit an application by the latest <strong>October 6, 2021. <\/strong><\/p><p><br><\/p><p><strong><em>You must reside and be able to legally work in Guyana<\/em><\/strong><\/p><p><strong><em>Must own or have access to a reliable motor vehicle<\/em><\/strong><\/p><p><strong>&nbsp;<\/strong><\/p><p><strong>KEY FUNCTIONS:<\/strong><\/p><p><strong>&nbsp;<\/strong><\/p><ul><li>Identify\/Recruit suitable Retailers<\/li><li>Maximize the revenue potential of SVEI Retailers assigned to you or within an assigned region<\/li><li>Foster a supportive relationship with SVEI Retailers encouraging adherence to the company\\u2019s<\/li><li>minimum standards at the locations, maintaining the company\\u2019s strong image<\/li><li>Responsible for monitoring activities daily for assigned retailers \/ region and make recommendations<\/li><li>for improvement to Manager<\/li><li>Monitor sales trends and payment history for Retailers<\/li><li>Track competitor marketing, sales and promotional activity by keeping abreast of market changes and the marketing mix used by our competitors<\/li><li>Responsible for ensuring that customer queries\/issues received are processed within the quality standards set by SVG<\/li><li>Provide support to the Finance Department though calls and\/or visits to suppressed or challenging Retailers<\/li><li>Assist with \\u2018on the ground\\u2019 training of Retailers\/Operators when necessary<\/li><li>Prepare monthly reports with information acquired from field. Information should include but is not limited to updates, highlights, challenges, new trends etc<\/li><li>Scheduled visits to Retailers as planned by Manager<\/li><li>Keep promotional material ready by tracking marketing \/ promotional items inventory stock<\/li><li>Assist with execution and management of marketing \/ promotional activities<\/li><\/ul><p><strong>&nbsp;<\/strong><\/p><p><strong>&nbsp;<\/strong><\/p><p><strong>KNOWLEDGE, EXPERIENCE &amp; SKILLS REQUIRED:<\/strong><\/p><p><strong>&nbsp;<\/strong><\/p><ul><li>Bachelor\\u2019s Degree in Business Administration \/ Marketing or related field<\/li><li>Minimum of 2 years of experience in Business Development, Sales, Customer Service or Marketing<\/li><li>Knowledge of and experience in the gaming\/lottery industry are an asset<\/li><li>Handles confidential matters with discretion and judgement<\/li><li>Excellent oral and written communication skills<\/li><li>Great organizational and coordinating skills<\/li><li>Excellent communication and interpersonal skills<\/li><li>Highly self-motivated and able to multitask efficiently<\/li><li>Ability to work independently<\/li><li>Takes initiative<\/li><li>Problem solving abilities<\/li><\/ul><p><br><\/p><p><strong>SPECIAL CONSIDERATIONS:<\/strong><\/p><p><br><\/p><ul><li>Required to work outside of normal business hours, weekend and public holidays at times.<\/li><li>The role requires extensive travelling to regions assigned<\/li><li>Required to own and operate a reliable motor vehicle<\/li><\/ul>\"}"
}