{
    "id":"Kaggle::techmap::6155ac95f0765305b474efa0::linkedin_gr::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":"I presume the \"female only\" stipulation is for cultural reasons of the clients and therefore not biased.",
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Job title: Sorani interpreter (for legal and protection appointments). Starting date: Immediately. Hours of work: 3 hours per day, 5 days per week. Location: Thessaloniki, Venizelou 59 (centre). Salary: 300€ (net salary). Office Hours: 10:00-13:00. Application deadline: Wednesday, 13 October 2021. Due to the nature of the work, only women are eligible. The interpreter must be able to successfully interpret conversations on a broad range of subject matter at a normal rate of speech and with a high degree of accuracy. It is also expected to be respectful of the community members and show maturity when dealing with difficult topics. You should be able to garner the trust of the community members and be highly receptive to feedback. Job Description. Acting as Interpreter between a wide range of people with diverse voices, accents, speaking tempos, and personalities. Converting concepts in the source language to equivalent concepts in the target language. Acting as Interpreter for protection and legal appointments. Providing parties with clear and exact translations of written materials, and interpretations of verbal communication. Translating for registrations of new members, and other team members when needed. Accompanying beneficiaries to medical and legal appointments outside of Irida when needed. Assisting the team on how to be culturally sensitive and act as a cultural mediator. Required Qualifications. Fluent in Sorani. Advanced knowledge in English and\/or Greek. As you will mostly be interpreting for our legal officer and protection officer, you will need to be able to translate confidently about complicated topics. In line with the core values of Irida. Irida aims to create a safe and empowering environment for all women, regardless of nationality, ethnicity, religion, or cultural background. Excellent oral and written Greek and English communication skills. Advanced knowledge of Microsoft Office. High level of financial acumen. Demonstrated strong analytical and detail-oriented skills. Cultural sensitivity, trustworthiness, and professionalism. Tolerant, versatile, adaptable, and open-minded. Desired Attributes. Experience as an interpreter or in a related role within an NGO. Knowledge of other Kurdish languages (Behdini, Kurmanji). To apply, please send your CV and to iridacenter. org (put Sorani Interpreter Application in the subject line). Due to the urgency of this position, applications will be shortlisted on a regular basis, and we may offer the post before the closing date. Only short-listed candidates will be contacted. The interview will be conducted in English\/Greek.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6155ac95f0765305b474efa0::linkedin_gr\", \"source\": \"linkedin_gr\", \"country\": \"GR\", \"company\": \"Irida Women's Center\", \"position\": \"Sorani Interpreter\", \"notes\": \"\", \"original\": \"<p>Job title: Sorani interpreter (for legal and protection appointments)<\/p><p>Starting date: Immediately<\/p><p>Hours of work: 3 hours per day, 5 days per week<\/p><p>Location: Thessaloniki, Venizelou 59 (centre)<\/p><p>Salary:&nbsp;300\\u20ac (net salary)<\/p><p>Office Hours: 10:00-13:00<\/p><p>Application deadline: Wednesday, 13 October 2021<\/p><p><em>Due to the nature of the work, only women are eligible.<\/em><\/p><p><br><\/p><p>The interpreter must be able to successfully interpret conversations on a broad range of subject matter at a normal rate of speech and with a high degree of accuracy.<\/p><p><br><\/p><p>It is also expected to be respectful of the community members and show maturity when dealing with difficult topics. You should be able to garner the trust of the community members and be highly receptive to feedback.<\/p><p><br><\/p><p>Job Description<\/p><ul><li>Acting as Interpreter between a wide range of people with diverse voices, accents, speaking tempos, and personalities.<\/li><li>Converting concepts in the source language to equivalent concepts in the target language.<\/li><li>Acting as Interpreter for protection and legal appointments.<\/li><li>Providing parties with clear and exact translations of written materials, and interpretations of verbal communication.<\/li><li>Translating for registrations of new members, and other team members when needed.<\/li><li>Accompanying beneficiaries to medical and legal appointments outside of Irida when needed.<\/li><li>Assisting the team on how to be culturally sensitive and act as a cultural mediator.<\/li><\/ul><p><br><\/p><p>Required Qualifications<\/p><ul><li>Fluent in Sorani.<\/li><li>Advanced knowledge in English and\/or Greek. As you will mostly be interpreting for our legal officer and protection officer, you will need to be able to translate confidently about complicated topics.<\/li><li>In line with the core values of Irida. Irida aims to create a safe and empowering environment for all women, regardless of nationality, ethnicity, religion, or cultural background.<\/li><li>Excellent oral and written Greek and English communication skills.<\/li><li>Advanced knowledge of Microsoft Office.<\/li><li>High level of financial acumen.<\/li><li>Demonstrated strong analytical and detail-oriented skills.<\/li><li>Cultural sensitivity, trustworthiness, and professionalism.<\/li><li>Tolerant, versatile, adaptable, and open-minded.<\/li><\/ul><p><br><\/p><p>Desired Attributes<\/p><ul><li>Experience as an interpreter or in a related role within an NGO.<\/li><li>Knowledge of other Kurdish languages (Behdini, Kurmanji).<\/li><\/ul><p><br><\/p><p>To apply, please send your CV and to&nbsp;hr@iridacenter.org&nbsp;(put \\u201cSorani Interpreter Application\\u201d in the subject line).<\/p><p><br><\/p><p>Due to the urgency of this position, applications will be shortlisted on a regular basis, and we may offer the post before the closing date.<\/p><p>Only short-listed candidates will be contacted. The interview will be conducted in English\/Greek.<\/p>\"}"
}