{
    "id":"Kaggle::techmap::6137b1637d4ffc16c87fb952::careerbuilder_us::13",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job Description. Customer Care and Aftersales. Warehouse Operator. Full Time. Warehouse Team Members are hardworking and ambitious workers who are responsible for picking, packaging, staging, and shipping parts from a General Motors LLC warehouse containing automotive parts. Team members are also loading, unloading, stocking, and maintaining the warehouse inventory. Each team member operates within a warehouse team environment where Global Manufacturing System (GMS) principles are highly integrated. Starting wage is $17. 00 per hour. Eligible for holiday pay, vacation, opportunity for performance bonus, and excellent healthcare. Work Requirements: Must be able to perform each duty and responsibility satisfactorily. The requirements listed below represent the essential knowledge, skill, ability and\/or physical demands required. Additional or different requirements may exist in this role. Understand, support and execute all work in safe manner and contribute to a culture that promotes safety as its overriding priority. Use and operate warehouse equipment such as order selector, sit down\/stand up forklifts in connection with the receipt, storage, and shipping of parts. These vehicles could operate at heights of up to 35 feet. Perform a variety of duties, including: Package finished product for shipping (shrink wrapping, boxing, and labeling). Stage parts of loading. Load finished products onto truck and\/or railcar. Move parts to warehouse for storage. Sort and place materials or items on racks, shelves, or in bins according to predetermined sequence. Read, comprehend, and follow written, standardized work instructions and trained procedures. Learn new tasks and adapt to frequent job duty changes as required by business and manpower demands. Complete tasks within designated timeframes to meet operational expectations. Work in a dynamic and fast-paced warehousing plant environment. Regularly report for work on time to support startup and throughput goals. Possess good physical stamina and coordination. Specific physical requirements of the position include the ability to: Walk and stand for prolonged periods of time. Read standardized work instructions, operate machines, equipment, and tools, and perform quality checks. Promptly detect and respond to safety instructions, alarms, and signals. Wear personal protective equipment, for example: safety glasses, gloves, ear plugs, and appropriate shoes. Work in a loud warehousing environment. Frequently and repetitively: Bend, twist, kneel, crouch and reach to perform work. Lift or carry materials weighing up to 15 pounds and periodically carry or lift materials weighing up to 40 lbs.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6137b1637d4ffc16c87fb952::careerbuilder_us\", \"source\": \"careerbuilder_us\", \"country\": \"US\", \"company\": \"General Motors LLC\", \"position\": \"Production Associate\", \"notes\": \"\", \"original\": \"<b>Job Description<\/b><br \/><br \/><b>Customer Care and Aftersales - Warehouse Operator - Full Time <\/b><br \/><br \/>Warehouse Team Members are hardworking and ambitious workers who are responsible for picking, packaging, staging, and shipping parts from a General Motors LLC warehouse containing automotive parts. Team members are also loading, unloading, stocking, and maintaining the warehouse inventory. Each team member operates within a warehouse team environment where Global Manufacturing System (GMS) principles are highly integrated.<br \/><br \/><ul><li>Starting wage is $17.00 per hour. Eligible for holiday pay, vacation, opportunity for performance bonus, and excellent healthcare.<\/li><\/ul><br \/><b>Work Requirements:<\/b><br \/><br \/>Must be able to perform each duty and responsibility satisfactorily. The requirements listed below represent the essential knowledge, skill, ability and\/or physical demands required. Additional or different requirements may exist in this role.<br \/><br \/><ul><li>Understand, support and execute all work in safe manner and contribute to a culture that promotes safety as its overriding priority.<\/li><li>Use and operate warehouse equipment such as order selector, sit down\/stand up forklifts in connection with the receipt, storage, and shipping of parts. These vehicles could operate at heights of up to 35 feet.<\/li><li>Perform a variety of duties, including:<ul><li>Package finished product for shipping (shrink wrapping, boxing, and labeling).<\/li><li>Stage parts of loading.<\/li><li>Load finished products onto truck and\/or railcar.<\/li><li>Move parts to warehouse for storage.<\/li><li>Sort and place materials or items on racks, shelves, or in bins according to predetermined sequence.<\/li><\/ul><\/li><li>Read, comprehend, and follow written, standardized work instructions and trained procedures.<\/li><li>Work cooperatively with others in a team environment.<\/li><li>Learn new tasks and adapt to frequent job duty changes as required by business and manpower demands.<\/li><li>Complete tasks within designated timeframes to meet operational expectations.<\/li><li>Work in a dynamic and fast-paced warehousing plant environment.<\/li><li>Regularly report for work on time to support startup and throughput goals.<\/li><li>Possess good physical stamina and coordination. Specific physical requirements of the position include the ability to:<ul><li>Walk and stand for prolonged periods of time.<\/li><li>Read standardized work instructions, operate machines, equipment, and tools, and perform quality checks.<\/li><li>Promptly detect and respond to safety instructions, alarms, and signals.<\/li><li>Wear personal protective equipment, for example: safety glasses, gloves, ear plugs, and appropriate shoes.<\/li><li>Work in a loud warehousing environment.<\/li><\/ul><\/li><li>Frequently and repetitively:<ul><li>Bend, twist, kneel, crouch and reach to perform work.<\/li><li>Lift or carry materials weighing up to 15 pounds and periodically carry or lift materials weighing up to 40 lbs.<\/li><\/ul><\/li><li>Occasionally sit, climb stairs, and drive vehicles and equipment.<\/li><\/ul><br \/><b>Additional Job Description<\/b><br \/><br \/><ul><li>These are permanent positions working as a direct employee of General Motors LLC<\/li><li>Candidates must be willing to work any shift<\/li><li>Overtime hours on those shifts are common and may be available with little notice.<\/li><li>Weekend and holiday shifts are regularly expected, but not continuously<\/li><\/ul><br \/><b>Interested individuals must meet the following minimum qualifications<\/b>:<br \/><ul><li>Must be able to satisfactorily complete the General Motors hiring process requirements which includehair drug testing and a background check<\/li><li>At least 18 years of age<\/li><li>Eligible to work in the United States<\/li><\/ul><ul><li>Good English proficiency to listen, read, and follow work and safety instructions<\/li><li>Must be willing to work flexible shift hours and day, afternoon, or night shift as well as overtime hours on those shifts with little notice<\/li><\/ul><ul><\/ul><br \/><b>Diversity Information<\/b><br \/><br \/>General Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities. GM is proud to be an equal opportunity employer.<br \/><br \/>We encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.<br \/><br \/><b>Equal Employment Opportunity Statements<\/b><br \/><br \/>The policy of General Motors is to extend opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity\/expression or veteran status. Additionally, General Motors is committed to being an Equal Employment Opportunity (EEO) Employer and offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us [Email available when viewing the job]. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.&nbsp;\"}"
}