{
    "id":"Kaggle::techmap::61380f7f73e38d7c6c155f65::monster2_nl::0",
    "label_age":true,
    "analysis_age":"The terms \"young, energetic, and ambitious\" are youthful attributes that can imply the company's culture favors younger candidates.",
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" 2021-06-10iSenseDeveloper  Python  Azure  Financial Organisation Do you have experience as an IT Developer? Do you want to learn all there is to know about SAS? And do you like to work in an innovative and international environment? Then read on, because we're looking for you! ISDI45920SalarisindicatieDepending on relevant work experience and or certification, you can expect a salary between €3.500,. and €5.500,. gross per month based on a 40-hour workweek. Aanvullende informatie opdrachti. Sense is a young, energetic and ambitious specialist in ICT employment mediation. i. Sense helps you find a job on operation, business consultancy and (project \/ line) management level. A job in which you can be successful and especially happy. Working with i. Sense means for you: Personal guidance before, during and after your application. Good insight into your personal skills through various reports. Get ready for your job interview. Always be aware of your application process. Monthly personal contact with the Field Coach. Participate in the Personal Development Workshops for free every quarter. Regularly on your way to your i. Sense colleagues in the region (ihavefun). LocatieAmsterdamOp aanvraagPublicatiedatum10.06. 2021Publicatie eindigt24.12. 2021.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61380f7f73e38d7c6c155f65::monster2_nl\", \"source\": \"monster2_nl\", \"country\": \"NL\", \"company\": \"iSense\", \"position\": \"Developer \/ Python \/ Azure \/ Financial Organisation @ Amsterdam\", \"notes\": \"\", \"original\": \"2021-06-10iSenseDeveloper | Python | Azure | Financial Organisation Do you have experience as an IT Developer? Do you want to learn all there is to know about SAS? And do you like to work in an innovative and international environment? Then read on, because we're looking for you! ISDI45920SalarisindicatieDepending on relevant work experience and or certification, you can expect a salary between \\u20ac3.500,- and \\u20ac5.500,- gross per month based on a 40-hour workweek.Aanvullende informatie opdrachtiSense is a young, energetic and ambitious specialist in ICT employment mediation. iSense helps you find a job on operation, business consultancy and (project \/ line) management level. A job in which you can be successful and especially happy. Working with iSense means for you: Personal guidance before, during and after your applicationGood insight into your personal skills through various reports;Get ready for your job interviewAlways be aware of your application process;Monthly personal contact with the Field Coach;Participate in the Personal Development Workshops for free every quarterRegularly on your way to your iSense colleagues in the region (ihavefun).LocatieAmsterdamOp aanvraagPublicatiedatum10.06.2021Publicatie eindigt24.12.2021\"}"
}