{
    "id":"Kaggle::techmap::61495dcf4ca8eb4d9076cf84::seek_au::0",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":" Do you think you can make a difference in an older persons life? Do you wear your heart on your sleeve? If so, we urge you to apply with or without a Certificate III in Aged Care. Award \/ Classification: BVI Aged Care Employees Enterprise Agreement 2019. OBJECTIVES OF POSITION. To be a spontaneous, warm loving person who can connect with people and change the moment for them. To work in a house and together with your team, make it a home for the House Members you are supporting. To enable your family of House Members to be comfortable, be themselves and celebrate the highs and lows of life together. To care for your House Members emotional, social and physical care needs. BENEFITS WORKING AT BARUNGA VILLAGE. Short term, free accommodation available. Long term overnight accommodation for shift workers. Flexible\/family friendly working hours. Employee Assistance Program. Salary sacrifice. (Salary packaging allows you to pay for certain expenses such as your mortgage, rent and other everyday living expenses before income tax is calculated. So you pay less tax and have more money to spend. Access Pay). Local chemist discount. Bulk billing at local medical clinic. REPORTING \/ WORKING RELATIONSHIPS. Directly reports to the House Leader and in the absence of the House Leader this role reports to the Team Leader. Accountable to the Director of Nursing and Care Services. KEY RESPONSIBILITIES. Supporting House Members. A major part of your role will be to actively involve your House Members in everyday domestic living in a relaxed unfolding minute by minute manner. The normal jobs of the day are to ensure personal hygiene is attended, that environments are clean and pleasant to be in and are completed at a time that suits the people living here. To focus on a person centred approach whilst maintaining the organisations policies and procedures. To respect privacy, dignity and to promote confidentiality within a warm homely setting. To be able to work within a team whilst recognising the skills and abilities of others as we are all individual. To maintain open communication at all levels. To administer medications as per medi map. To record all care, you give. To use the task lists for remembering specific duties. To remove pre-conceived ideas that limit participation in daily living. To be able to use your imagination to engage others. To be able to make others smile.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61495dcf4ca8eb4d9076cf84::seek_au\", \"source\": \"seek_au\", \"country\": \"AU\", \"company\": \"Barunga Village\", \"position\": \"House Carers\", \"notes\": \"\", \"original\": \"<p><strong>Do you think you can make a difference in an older persons life?<\/strong><\/p>  <p><strong>Do you wear your heart on your sleeve?<\/strong><\/p>  <p><em><strong>If so, we urge you to apply with or without a Certificate III in Aged Care.<\/strong><\/em><\/p>  <p><strong>Award \/ Classification:\\u00a0<\/strong>BVI Aged Care Employees Enterprise Agreement 2019<\/p>  <p><strong>OBJECTIVES OF POSITION<\/strong><\/p>  <p>To be a spontaneous, warm loving person who can connect with people and change the moment for them.<\/p>  <p>To work in a house and together with your team, make it a home for the House Members you are supporting.\\u00a0<\/p>  <p>To enable \\u2018your\\u2019 family of House Members to be comfortable, be themselves and celebrate the highs and lows of life together.<\/p>  <p>To care for your House Members emotional, social and physical care needs.<\/p>  <p><strong>BENEFITS WORKING AT BARUNGA VILLAGE<\/strong><\/p> <ul> <li>Short term, free accommodation available.<\/li> <li>Long term overnight accommodation for shift workers.<\/li> <li>Flexible\/family friendly working hours.<\/li> <li>Employee\\u00a0Assistance Program.<\/li> <li>Salary sacrifice.<br \/> (Salary packaging allows you to pay for certain expenses such as your mortgage, rent and other everyday living expenses before income tax is calculated. So you pay less tax and have more money to spend.\\u00a0- Access Pay)<\/li> <li>Local chemist discount.<\/li> <li>Bulk billing at local medical clinic.<\/li><\/ul> <p><strong>REPORTING \/ WORKING RELATIONSHIPS<\/strong><\/p>  <p>Directly reports to the House Leader and in the absence of the House Leader this role reports to the Team Leader.\\u00a0Accountable to the Director of Nursing and Care Services.<\/p>  <p><strong>KEY RESPONSIBILITIES<\/strong><\/p>  <p><strong>1. Supporting House Members<\/strong><\/p>  <p><strong>\\u00a0<\/strong>A major part of your role will be to actively involve your House Members in everyday domestic living in a relaxed unfolding minute by minute manner. The normal \\u2018jobs\\u2019 of the day are to ensure personal hygiene is attended, that environments are clean and pleasant to be in and are completed at a time that suits the people living here.<\/p> <ul> <li>To focus on a person centred approach whilst maintaining the organisations policies and procedures.<\/li> <li>To respect privacy, dignity and to promote confidentiality within a warm homely setting.<\/li> <li>To be able to work within a team whilst recognising the skills and abilities of others as we are all individual.<\/li> <li>To maintain open communication at all levels.<\/li> <li>To administer medications as per medi map<\/li> <li>To record all care, you give.<\/li> <li>To use the task lists for remembering specific duties<\/li> <li>To remove pre-conceived ideas that limit participation in daily living.<\/li> <li>To be able to use your imagination to engage others.<\/li> <li>To be able to make others smile.<\/li> <li>To be able to work from the heart.<\/li> <li>To be able to make the most of the time you have to provide positive social interactions.<\/li> <li>To be non-judgemental towards others.<\/li> <li>To be able to listen and respect others points of view even if you disagree.<\/li> <li>To be able to us the skills mix of the team to it best potential to enhance the well-being of individuals.<\/li><\/ul> <p><strong>2. Quality Improvement<\/strong><\/p> <ul> <li>Recognise the need and participate in quality activity programs relevant to work area.<\/li> <li>Be familiar with and strive to achieve the Aged Care Quality Standards.<\/li> <li>Be prepared to identify areas for improvement<\/li><\/ul> <p><strong>3. Equal Employment Opportunity<\/strong><\/p> <ul> <li>Understanding of implications and adherence to Equal Opportunities and Disability Discrimination legislation to ensure a workplace free from discrimination.<\/li> <li>Conversant with and comply with organisational policies.<\/li><\/ul> <p><strong>4. Work, Health and Safety<\/strong><\/p> <ul> <li>Adhere to defined work health and safety policies and procedures related to the work being undertaken in order to ensure own safety and that of others in the workplace.<\/li> <li>To undertake specific knowledge of the whistle-blower policy<\/li> <li>Reporting of any possible hazards in the workplace<\/li> <li>Reporting of any \\u2018near misses\\u2019 and participation in Incident\/Accident investigations as necessary<\/li> <li>Comply with all policies and procedures required of employees<\/li> <li>Participate in all mandatory training programs such as Emergency Response and Manual Handling education as directed.<\/li><\/ul> <p><strong>5. Other<\/strong><\/p> <ul> <li>Undertake further education as appropriate and participate in in-service education as provided by Barunga Village.<\/li> <li>Complete all on-line learning modules as directed<\/li> <li>Takes part in performance appraisals on an annual basis.<\/li> <li>Assist in the promotion of the purpose, values and priorities of Barunga Village.<\/li> <li>Any other duties commensurate with the employee\\u2019s skills and experience as directed by the Director of Nursing and Care Services.<\/li><\/ul> <p><strong>PERSONAL SPECIFICATIONS \/ DESIRABLE REQUIREMENTS<\/strong><\/p>  <p>There are no mandatory education requirements for this position although a Certificate III in Aged Care Services will be highly regarded, along with previous experience in an aged care facility or similar environment.<\/p>  <p>Onsite training available for the right people who fit our culture of feelings based care.<\/p>  <p>We will provide any necessary training onsite, and value staff who meet the following criteria:<\/p>  <p><strong>Self -\\u00a0<\/strong>Being comfortable being oneself at work, being self-aware and open.\\u00a0<\/p>  <p><strong>Feeling -\\u00a0<\/strong>Being able to be emotionally warm, offering closeness to each individual.\\u00a0<\/p>  <p><strong>Together -\\u00a0<\/strong>Being a friend to individual\\u2019s, with no them and us.<\/p>  <p><strong>Inspiring - <\/strong>Being positive and passionate, being able to make a connection with people that makes a difference.\\u00a0<\/p>  <p><strong>Nurturing - <\/strong>Being able to provide comfort, security and a sense of belonging.\\u00a0<\/p>  <p><strong>Respectful - <\/strong>Being able to understand the value of life histories and using it to enhance individual well-being.\\u00a0<\/p>  <p><strong>Accepting - <\/strong>Being positive about individual\\u2019s reality and accepting of others, to understand that feelings can be displayed as action or words.\\u00a0<\/p>  <p><strong>Flexible - <\/strong>Being focused on individuals and not routine, to have the ability to adapt to daily differences and just \\u201cgo with the flow\\u201d.\\u00a0<\/p>  <p><strong>Spontaneous - <\/strong>Being able to create opportunities that will occupy individuals in a meaningful way.\\u00a0<\/p>  <p><strong>Enabling - <\/strong>Being able to create well-being and not ill-being.\\u00a0<\/p>  <p><strong>Supportive - <\/strong>Being comfortable to express your own emotions and support others with theirs.<\/p>  <p><strong>Growing -\\u00a0<\/strong>Being open to learn and reflect on oneself and skills.<\/p>  <p><strong>SPECIAL CONDITIONS<\/strong><\/p>  <p>Must provide a NDIS worker screening check that is dated no more than three years old to enable the assessment of whether the employee is suitable to provide care under the Aged Care Act.<\/p>  <p>Must sign a statutory declaration to identify serious criminal activity committed outside of Australia.<\/p>  <p>Must pass a pre-capacity health assessment to ensure physical fitness level is appropriate for duties.<\/p>  <p>Must be able to perform shift work as per roster.<\/p>  <p><em><strong>Duties and responsibilities for this position should not be considered definitive. Duties may be added, deleted or modified, in consultation with staff, as necessary.\\u00a0 Position Descriptions and staff performance will be reviewed regularly.<\/strong><\/em><\/p>  <p><strong>Applications close: <\/strong>Thursday 14 October 2021 at 12:00pm<\/p>  <p><strong>Interviews: <\/strong>Monday 18 October 2021<\/p>\"}"
}