{
    "id":"Kaggle::techmap::6148b665766eba3bd2b5a626::linkedin_cn::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Who We Are Looking For. This managerial position is within the Asia Pacific Global Delivery (GD) Business unit located in Hangzhou servicing clients in Austrian cross Mutual fund, asset management business, ETF product to generate the NAV\/UP and disseminate to clients. Why this role is important to us. The Regulatory and Tax Services Senior Associate role within Global Services is responsible for preparing various Australian tax reporting packages in accordance with established procedures. The role involves interaction with various units locally and overseas. The Senior Associate should possess excellent interpersonal and communication skills and demonstrate the ability to work in a team environment. Accuracy, timeliness and delivery of client service are imperative in this position with increased focus towards quality controls, documentation and process improvements. What You Will Be Responsible For. As you will. Lead the team to produce daily, weekly, monthly, quarterly and annual tax reports (e. g. taxable\/distributable income calculations, income tax returns, monthly tax provisioning) with high quality. Ensure that allocated client reporting is completed and submitted for review on a timely basis. Understand the client requirements and guide the team towards efficiently managing its deliverables. Maintain records on the taxation systems and acting as senior system supporter. Answer and handle complex issues and queries and escalate as needed. Acting with a sense of urgency to meet required deliverables. Liaising with internal clients to obtain information where required. Identify risk issues, breaches and act in accordance with the 'risk' escalation chain and operating procedures. Understand the end to end process and be able to seek support to clear out inter process upstream \/ downstream dependencies, suggest process improvements and be able to seek support to drive projects to create efficiencies \/ enhance controls. Coach and assist less experienced staff. Conduct performance planning and reviews. Identify training and development needs for direct staff members. Work closely with the Manager and senior management to drive solutions. Challenge the norm and support a culture of creativity\/productivity. Collaborates with business stakeholders to identify and implement new opportunities while also troubleshooting issues and helping to drive understanding of the process. Assist with the implementation\/identification of the Re-Engineering, Standardization, Automation opportunities. Improve operating model results across existing functions. Advance to 100% dissemination ready\/direct and oversight models for APAC. What We Value. Good understanding of managed investment funds, relevant tax laws and applicability. Good understanding of financial services and investment products.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148b665766eba3bd2b5a626::linkedin_cn\", \"source\": \"linkedin_cn\", \"country\": \"CN\", \"company\": \"\\u7f8e\\u56fd\\u9053\\u5bcc\\u94f6\\u884c\", \"position\": \"Financial Reporting Manager, AVP\", \"notes\": \"\", \"original\": \"<strong><u>Who We Are Looking For<br><br><\/u><\/strong>This managerial position is within the Asia Pacific Global Delivery (GD) Business unit located in Hangzhou servicing clients in Austrian cross Mutual fund, asset management business, ETF product to generate the NAV\/UP and disseminate to clients.<br><br><strong>Why this role is important to us<br><br><\/strong>The Regulatory and Tax Services Senior Associate role within Global Services is responsible for preparing various Australian tax reporting packages in accordance with established procedures. The role involves interaction with various units locally and overseas. The Senior Associate should possess excellent interpersonal and communication skills and demonstrate the ability to work in a team environment. Accuracy, timeliness and delivery of client service are imperative in this position with increased focus towards quality controls, documentation and process improvements.<br><br><strong><u>What You Will Be Responsible For<br><br><\/u><\/strong>As you will<br><ul><li> Lead the team to produce daily, weekly, monthly, quarterly and annual tax reports (e.g.taxable\/distributable income calculations, income tax returns,monthly tax provisioning) with high quality.<\/li><li> Ensure that allocated client reporting is completed and submitted for review on a timely basis<\/li><li> Understand the client requirements and guide the team towards efficiently managing its deliverables<\/li><li> Maintain records on the taxation systems and acting as senior system supporter<\/li><li> Answer and handle complex issues and queries and escalate as needed; acting with a sense of urgency to meet required deliverables<\/li><li> Liaising with internal clients to obtain information where required<\/li><li> Identify risk issues, breaches and act in accordance with the 'risk' escalation chain and operating procedures<\/li><li> Documentation \\u2013 Be able to review and correct the process documentation such as process flows, Standard Operating procedures (SOPs) and coach the team<\/li><li> Understand the end to end process and be able to seek support to clear out inter process upstream \/ downstream dependencies, suggest process improvements and be able to seek support to drive projects to create efficiencies \/ enhance controls<\/li><li> Coach and assist less experienced staff; Conduct performance planning and reviews; Identify training and development needs for direct staff members.<\/li><li> Work closely with the Manager and senior management to drive solutions<\/li><li> Challenge the norm and support a culture of creativity\/productivity<\/li><li> Collaborates with business stakeholders to identify and implement new opportunities while also troubleshooting issues and helping to drive understanding of the process<\/li><li> Assist with the implementation\/identification of the Re-Engineering, Standardization, Automation opportunities.<\/li><li> Improve operating model results across existing functions. Advance to 100% dissemination ready\/direct and oversight models for APAC<br><\/li><\/ul><strong><u>What We Value<br><\/u><\/strong><ul><li>Good understanding of managed investment funds, relevant tax laws and applicability<\/li><li>Good understanding of financial services and investment products<\/li><li>Detailed oriented individual capable of performing in a high pace environment<\/li><li>Demonstrated ability to meet deadlines and possess strong problem solving and resolution skills<\/li><li>Intermediate knowledge of Internal Systems, MS office (excel, word)<\/li><li>Data &amp; Analysis - Posesses strong attention to detail. Demonstrate good analytical skills in resolving the team issues and facilitates decision making<\/li><li>Strong attention to detail and a focus on service<\/li><li>Strong written and verbal communication skills<\/li><li>Ability to prioritize multiple responsibilities to meet internal and industry deadlines<\/li><li>Strong problem solving skills<br><\/li><\/ul><strong><u>Education &amp; Preferred Qualifications<br><\/u><\/strong><ul><li>Post Graduates (CA\/CPA\/CFA qulified or studying towards) preferably or Bachelor degree with Big 4 or mid-tier accounting firm relevant experience<\/li><li>Minimum 5 years of experience in a Tax reporting or financial services environment (Australia managed funds industry experience a bonus)<\/li><li>Solid experience in tax, specifically in relation to managed investment fund structures<\/li><li>Good leadership, negotiation and analytical skills, proven track record of efficiency creation, staff development and people management skills<br><\/li><\/ul><strong><u>Additional Requirements<br><\/u><\/strong><ul><li>N\/A<br><\/li><\/ul><strong><u>About State Street<br><br><\/u><\/strong><strong>What we do.<\/strong> State Street is one of the largest custodian banks, asset managers and asset intelligence companies in the world. From technology to product innovation we\\u2019re making our mark on the financial services industry. For more than two centuries, we\\u2019ve been helping our clients safeguard and steward the investments of millions of people. We provide investment servicing, data &amp; analytics, investment research &amp; trading and investment management to institutional clients.<br><br><strong>Work, Live and Grow.<\/strong> We make all efforts to create a great work environment. Our benefits packages are competitive and comprehensive. Details vary in locations, but you may expect generous medical care, insurance and savings plans among other perks. You\\u2019ll have access to flexible Work Program to help you match your needs. And our wealth of development programs and educational support will help you reach your full potential.<br><br><strong>Inclusion, Diversity and Social Responsibility. <\/strong>We truly believe our employees\\u2019 diverse backgrounds, experiences and perspective are a powerful contributor to creating an inclusive environment where everyone can thrive and reach their maximum potential while adding value to both our organization and our clients. We warmly welcome the candidates of diverse origin, background, ability, age, sexual orientation, gender identity and personality. Another fundamental value at State Street is active engagement with our communities around the world, both as a partner and a leader. You will have tools to help balance your professional and personal life, paid volunteer days, matching gift program and access to employee networks that help you stay connected to what matters to you.<br><br>State Street is an equal opportunity and affirmative action employer.<br><br>Discover more at StateStreet.com\/careers<br><br>Job ID: R-673569-2\"}"
}