{
    "id":"Kaggle::techmap::61489874e48deb575b2a608a::reed_uk::8",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Part-time Branch Administrator. Oxford. The company. Our leading and award-winning company within the automotive trade has an opportunity for a part time Branch Administrator in their Oxford branch to work 30 hours per week. You will be required to work 5 days per week 09. 00 am - 3. 00 pm (flexibility on hours is possible if required). The role is a great move if you are looking to work for a very stable, secure yet growing company. The position is based in Oxford, with the added benefit of free onsite parking. The salary on offer for this role is £19, 760 per annum pro rata (£9. 50 per hour) rising to £20, 800 (£10. 00 per hour) after probation. Holidays entitlement is 21 days per annum plus 8 bank holidays. Please note this role is being dealt with by the Bristol Pertemps office on please call and ask for Lucy to discuss the role in more detail. Duties:. Answering branch telephone sales enquiries and liaise with walk-in customers in order to book and schedule work on the system. Assist branch manager in the resolution of customer complaints. Assist the branch manager in the procurement of stock from both internal and external local sources. Assist in the stock checking of branch stocks as and when appropriate. Answer calls from engineers to complete invoice and stock transactions. Liaise with neighbouring branches to coordinate stock where appropriate. The Person. We are looking for a candidate who has a strong background in customer service, and administration ideally within the automotive industry. You will also need to be happy to do some manual handling. You will need to have excellent communication skills and have a confident and hardworking approach. If you would like to apply for this role then please click on 'apply'. We will endeavour to be in touch as soon as possible. If you are not successful on this occasion, we will keep your CV on file and be in touch when other suitable positions become available.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::61489874e48deb575b2a608a::reed_uk\", \"source\": \"reed_uk\", \"country\": \"UK\", \"company\": \"Pertemps Bristol Commercial\", \"position\": \"Branch Administrator\", \"notes\": \"\", \"original\": \"Part-time Branch Administrator - Oxford<br><br>The company<br>Our leading and award-winning company within the automotive trade has an opportunity for a part time Branch Administrator in their Oxford branch to work 30 hours per week. You will be required to work 5 days per week 09.00 am - 3.00 pm (flexibility on hours is possible if required). The role is a great move if you are looking to work for a very stable, secure yet growing company.<br><br>The position is based in Oxford, with the added benefit of free onsite parking.<br>The salary on offer for this role is \\u00a319,760 per annum pro rata (\\u00a39.50 per hour) rising to \\u00a320,800 (\\u00a310.00 per hour) after probation.<br>Holidays entitlement is 21 days per annum plus 8 bank holidays.<br><br>Please note this role is being dealt with by the Bristol Pertemps office on please call and ask for Lucy to discuss the role in more detail.<br><br>Duties:<br>- Answering branch telephone sales enquiries and liaise with walk-in customers in order to book and schedule work on the system<br>- Assist branch manager in the resolution of customer complaints<br>- Assist the branch manager in the procurement of stock from both internal and external local sources<br>- Assist in the stock checking of branch stocks as and when appropriate<br>- Answer calls from engineers to complete invoice and stock transactions<br>- Liaise with neighbouring branches to coordinate stock where appropriate<br>- Assist branch manager in general branch personnel administration (i.e., holidays, o\/t call out etc.) as well as banking procedures<br><br>The Person<br>We are looking for a candidate who has a strong background in customer service, and administration ideally within the automotive industry. You will also need to be happy to do some manual handling.<br>You will need to have excellent communication skills and have a confident and hardworking approach.<br><br>If you would like to apply for this role then please click on 'apply'.<br>We will endeavour to be in touch as soon as possible. If you are not successful on this occasion, we will keep your CV on file and be in touch when other suitable positions become available.<br>\"}"
}