{
    "id":"Kaggle::techmap::6148a442b1c8204a1b3b881b::monster_cz::4",
    "label_age":false,
    "analysis_age":null,
    "label_disability":true,
    "analysis_disability":"The phrase \"willingness to talk a lot\" could deter not only applicants who are not extroverted or prefer not to engage in lengthy conversations, but it could also implicitly exclude those with certain disabilities that affect speech or communication styles. A more inclusive phrasing could be: \"The role requires strong communication skills to effectively address customer queries and provide solutions.\" This version emphasises the need for clear communication without specifying the amount of talking involved, thus broadening the potential applicant pool.",
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":true,
    "analysis_general":"The phrases \"willingness to talk a lot\" and \"always want to resolve the situation\" could deter candidates who may perceive these as requiring extroverted or aggressive traits. Rephrasing to \"A strong drive for problem-solving and a focus on effective resolutions\" is more inclusive and objective. This wording values problem-solving skills while accommodating different styles and approaches. It reduces bias towards specific personality types or behaviours that are not necessarily indicative of job competence.",
    "verified":true,
    "synthetic":false,
    "text":"If communication with people is what you want to do, this job is the right one for you! Popis pozice You would mainly provide support to the customers of our clients by phone. Became the kind of detective who needs to find out the right solution for the presented problem! Profil kandidáta Interest in technologies is a must as the support is mainly technical. Fluent English and Danish are necessary as you would communicate in both these languages all the time. Communication skills on a very good level and willingness to talk a lot. Passion in problem-solving so you always want to resolve the situation. Nabízíme Language courses and further training. so you can improve further and further 5 weeks of vacation. so you can travel or just rest Contribution to meals. to support your energy regeneration Multisport card. so you can burn the calories gained via the meal vouchers Relocation support. two weeks of accommodation when relocating from outside the Czech Republic Performance bonus. so you are appraised for a good job Informace konzultanta Michaela Rojíková Brno Perm Office ***@manpower. cz +420 734 173 421",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6148a442b1c8204a1b3b881b::monster_cz\", \"source\": \"monster_cz\", \"country\": \"CZ\", \"company\": \"ManpowerGroup s.r.o.\", \"position\": \"Danish speakers\", \"notes\": \"\", \"original\": \"If communication with people is what you want to do, this job is the right one for you! Popis pozice You would mainly provide support to the customers of our clients by phone. Became the kind of detective who needs to find out the right solution for the presented problem! Profil kandid\\u00e1ta Interest in technologies is a must as the support is mainly technical. Fluent English and Danish are necessary as you would communicate in both these languages all the time. Communication skills on a very good level and willingness to talk a lot. Passion in problem-solving so you always want to resolve the situation. Nab\\u00edz\\u00edme Language courses and further training - so you can improve further and further 5 weeks of vacation - so you can travel or just rest Contribution to meals - to support your energy regeneration Multisport card - so you can burn the calories gained via the meal vouchers Relocation support - two weeks of accommodation when relocating from outside the Czech Republic Performance bonus - so you are appraised for a good job Informace konzultanta Michaela Roj\\u00edkov\\u00e1 Brno Perm Office michaela.rojikova@manpower.cz +420 734 173 421\"}"
}