{
    "id":"Kaggle::techmap::6157094ff148941e20a10b7a::aarp_us::1",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Join our team at The Cascades and make a difference! Greenville's premier Retirement Community is seeking a Full-Time Painter responsible for the completion of all assigned refurbishment and painting projects under the supervision of the Director of Facility Services. Must be available to work 8:00am-4:30pm and have experience that includes wall repair, finish and painting. May require nights and weekends. 21 days of PTO your first year + PTO Payout Program. use your PTO as CASH! Benefits include: Medical, Dental, Vision, Short Term Disability, Life Insurance, Education Reimbursement and 401k with match Experience and Skills A. Education. High school graduation or GED desired. B. Direct Previous Experience. Two years of professional painting experience required. C. Skills: Ability to work with minimal supervision. Must conduct all business with a professional manner and with a high level of confidentiality. Ability to use hand tools, automatic \/ electrical equipment, carts, and dollies. Must have a valid driver's license and satisfactory driving record as specified by the Company and by the Company's automobile insurance carrier. D. Abilities: Work outdoors and indoors during the work day (fluorescent lights, HVAC system, various flooring, normal office and loud shop noise levels). Travel for lengthy extended periods by automobile and by aircraft (if needed) with overnight stays sometimes being required. Climb up to two flights of stairs. Stand, crouch of bend for extended periods of time.. Lift objects of 25 pounds or less over the head. Move objects of 100 pounds or more. Ability to work under time-sensitive or stressful situations.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6157094ff148941e20a10b7a::aarp_us\", \"source\": \"aarp_us\", \"country\": \"US\", \"company\": \"Senior Living Communities\", \"position\": \"Painter\", \"notes\": \"\", \"original\": \"Join our team at The Cascades and make a difference! Greenville's premier Retirement Community is seeking a Full-Time Painter responsible for the completion of all assigned refurbishment and painting projects under the supervision of the Director of Facility Services. Must be available to work 8:00am-4:30pm and have experience that includes wall repair, finish and painting. May require nights and weekends. 21 days of PTO your first year + PTO Payout Program - use your PTO as CASH! Benefits include: Medical, Dental, Vision, Short Term Disability, Life Insurance, Education Reimbursement and 401k with match Experience and Skills A. Education - High school graduation or GED desired. B. Direct Previous Experience - Two years of professional painting experience required. C. Skills: - Ability to work with minimal supervision. - Must conduct all business with a professional manner and with a high level of confidentiality. - Ability to use hand tools, automatic \/ electrical equipment, carts, and dollies. - Must have a valid driver's license and satisfactory driving record as specified by the Company and by the Company's automobile insurance carrier. D. Abilities: - Work outdoors and indoors during the work day (fluorescent lights, HVAC system, various flooring, normal office and loud shop noise levels). - Travel for lengthy extended periods by automobile and by aircraft (if needed) with overnight stays sometimes being required. - Climb up to two flights of stairs. - Stand, crouch of bend for extended periods of time. - Ability to climb extension ladder up to and above roof height. - Lift objects of 25 pounds or less over the head. - Move objects of 100 pounds or more. - Ability to work under time-sensitive or stressful situations.<br \/>\"}"
}