{
    "id":"Kaggle::techmap::6153ea3020d60016901e9b33::dice_us::14",
    "label_age":false,
    "analysis_age":null,
    "label_disability":false,
    "analysis_disability":null,
    "label_masculine":false,
    "analysis_masculine":null,
    "label_feminine":false,
    "analysis_feminine":null,
    "label_racial":false,
    "analysis_racial":null,
    "label_sexuality":false,
    "analysis_sexuality":null,
    "label_general":false,
    "analysis_general":null,
    "verified":true,
    "synthetic":false,
    "text":"Job summary: Administer PDM's and other engineering systems and improve them to be best in class and able to easily adapt to a growing and changing global company. The position requires a background in the PTC Windchill product data management system from the administration and support perspectives. Familiarity with PTC Creo Parametric mechanical CAD software is preferred. The successful candidate is driven to improve processes and technology and must be able to resolve problems independently, communicate proactively, and manage projects effectively. Skills and Competencies. Extensive administrative & configuration knowledge of PTC engineering software. Windchill and Creo. Working knowledge of Oracle is desired. Excellent organizational, written, oral and professional skills. Experience in languages such as Java, XML, VBA, WinSCP, SQL Developer. Demonstrated mature creative ability and exemplary business decision-making skills. Ability to manage multiple concurrent projects independently in a team environment. Must be willing to travel to global sites to understand their challenges, provide appropriate solutions and train the users. Competencies: Decision Making, Innovation, Collaboration, Customer Focus, Continuous Improvement, Effective Communication, Engage and Inspire. Education Requirements: Bachelor of Science degree in Engineering, Computer Science, or Information Systems. Experience Requirements: 3-5 years in similar role with education requirements. 7 years in similar role without education requirements. Certification Requirements: N\/A. Physical Demands. Employee is able to work in front of a personal computer and telephone for long periods of time. Employee will have to be able to walk\/climb to a variety of primary work locations, including traveling by air\/auto to remote sites. Employee may have to lift documents\/work materials up to 30 pounds in weight. Work Environment. Primary work environment is temperature-controlled office setting but may also be visiting different manufacturing facilities where following appropriate safety protocols at the location would be required. The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions. Direct Reports. None. location: MENOMONEE FALLS, Wisconsin. job type: Permanent. salary: $85, 000 - 110, 000 per year. work hours: 8am to 5pm. education: Bachelors. responsibilities: Job Duties and Responsibilities.",
    "metadata":"{\"document_id\": \"Kaggle::techmap::6153ea3020d60016901e9b33::dice_us\", \"source\": \"dice_us\", \"country\": \"US\", \"company\": \"Randstad Technologies\", \"position\": \"Windchill PDM\", \"notes\": \"\", \"original\": \"job summary:<br \/><br \/><p>Administer PDM's and other engineering systems and improve them to be best in class and able to easily adapt to a growing and changing global company. The position requires a background in the PTC Windchill product data management system from the administration and support perspectives. Familiarity with PTC Creo Parametric mechanical CAD software is preferred. The successful candidate is driven to improve processes and technology and must be able to resolve problems independently, communicate proactively, and manage projects effectively.<\/p><br \/><br \/><p><strong>Skills and Competencies<\/strong><\/p><br \/><br \/><p>Extensive administrative & configuration knowledge of PTC engineering software - Windchill and Creo. Working knowledge of Oracle is desired. Excellent organizational, written, oral and professional skills. Experience in languages such as Java, XML, VBA, WinSCP, SQL Developer. Demonstrated mature creative ability and exemplary business decision-making skills. Ability to manage multiple concurrent projects independently in a team environment. Must be willing to travel to global sites to understand their challenges, provide appropriate solutions and train the users.<\/p><br \/><br \/><p><strong>Competencies:<\/strong> Decision Making, Innovation, Collaboration, Customer Focus, Continuous Improvement, Effective Communication, Engage and Inspire<\/p><br \/><br \/><p><strong>Education Requirements<\/strong>: Bachelor of Science degree in Engineering, Computer Science, or Information Systems<\/p><br \/><br \/><p><strong>Experience Requirements<\/strong>: 3-5 years in similar role with education requirements. 7 years in similar role without education requirements<\/p><br \/><br \/><p><strong>Certification Requirements<\/strong>: N\/A<\/p><br \/><br \/><p><strong>Physical Demands<\/strong><\/p><br \/><br \/><p>Employee is able to work in front of a personal computer and telephone for long periods of time. Employee will need to listen, understand, and speak with team members in person, telephonically, and electronically at all levels within a diverse workforce and with supported organizations. Employee will have to be able to walk\/climb to a variety of primary work locations, including traveling by air\/auto to remote sites. Employee may have to lift documents\/work materials up to 30 pounds in weight.<\/p><br \/><br \/><p><strong>Work Environment<\/strong><\/p><br \/><br \/><p>Primary work environment is temperature-controlled office setting but may also be visiting different manufacturing facilities where following appropriate safety protocols at the location would be required.<\/p><br \/><br \/><p>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions.<\/p><br \/><br \/><p><strong>Direct Reports<\/strong><\/p><br \/><br \/><p>None<\/p><br \/><p> &nbsp;<br \/><br \/>location: MENOMONEE FALLS, Wisconsin<br \/><br \/>job type: Permanent<br \/><br \/>salary: $85,000 - 110,000 per year<br \/><br \/>work hours: 8am to 5pm<br \/><br \/>education: Bachelors<br \/><br \/>&nbsp;<br \/><br \/>responsibilities:<br \/><br \/><p><strong>Job Duties and Responsibilities<\/strong><\/p><br \/><br \/><p> Administer PDM\/PLM systems. Manage interface between PDM\/PLM systems and MRP\/ERP system. Administer other engineering systems\/software as needed (CAD, Analysis software, etc.) Manage licensing and support software contract discussions. Create, implement, and manage Microsoft SharePoint sites. Perform data queries and dashboards using multiple data systems. Work with the Lead Systems Analyst to develop global engineering standards and guidelines for acceptable use of the system and train employees globally to those standards. Create, implement, and maintain workflows in the systems for standardized processes. Help oversee data migrations and process migrations into the PDM\/PLM systems to ensure consistency. Develop and maintain software solutions and customized tools and processes for the engineering department. Deploy and configuration changes of software at the system level. Maintain system administration documentation and architecture map Working with application users to provide support and troubleshoot issues. Help drive the System roadmap and develop the installed configurations of the systems.<\/p><br \/><br \/><br \/><br \/>&nbsp;<br \/><br \/>qualifications:<br \/><br \/><ul><br \/><li>Experience level: Experienced<\/li><li>Minimum 3 years of experience<\/li><li>Education: Bachelors (required)<\/li><\/ul>&nbsp;<br \/><br \/>skills: <ul><li>Business Analysis<\/li><li>Oracle Applications<\/li><li>Java Script<\/li><li>Creo<\/li><li>XML<\/li><li>SQL Database developer<\/li><\/ul><br \/><br \/><br \/><p>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<\/p>\"}"
}